       Identification Division.
       Program-Id.                                 piic5101           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    iic                 *
      *                                Settore:    mod                 *
      *                                   Fase:    iic510              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 19/01/93    *
      *                       Ultima revisione:    NdK del 27/07/23    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione per il programma piic5100 :      *
      *                                                                *
      *                    Stampa modello INTRA - 1 BIS                *
      *                                                                *
      *                    - Riepilogo delle cessioni intracomunitarie *
      *                      di beni                                   *
      *                                                                *
      *                    - Sezione 1. Cessioni registrate nel perio- *
      *                      do                                        *
      *                                                                *
      *                    ------------------------------------------- *
      *                                                                *
      *                    File esp. : /abd/asc/UTENTE/exp/iic510.TXT  *
      *                                                                *
      *                    Adeguamento a Intr@Web Stand-Alone 5.0.4    *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     d-K-b-Snc-PD .
       Object-Computer.     d-K-b-Snc-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Subchiave 1 : Per controllo di rottura            *
      *            *---------------------------------------------------*
               10  srt-k01.
      *                *-----------------------------------------------*
      *                * Codice ISO stato CEE operatore comunitario    *
      *                *-----------------------------------------------*
                   15  srt-k01-iso-opc    pic  x(03)                  .
      *                *-----------------------------------------------*
      *                * Codice IVA dell'operatore comunitario         *
      *                *-----------------------------------------------*
                   15  srt-k01-cdi-opi    pic  x(16)                  .
      *                *-----------------------------------------------*
      *                * Codice della natura della transazione         *
      *                *-----------------------------------------------*
                   15  srt-k01-cdn-dtr    pic  9(01)                  .
      *                *-----------------------------------------------*
      *                * Codice della nomenclatura combinata           *
      *                *-----------------------------------------------*
                   15  srt-k01-cdn-cdm    pic  9(08)                  .
      *                *-----------------------------------------------*
      *                * Condizioni di consegna                        *
      *                *-----------------------------------------------*
                   15  srt-k01-cod-cdc    pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Codice del modo di trasporto                  *
      *                *-----------------------------------------------*
                   15  srt-k01-cod-mdt    pic  9(01)                  .
      *                *-----------------------------------------------*
      *                * Codice ISO dello Stato membro CEE di prove-   *
      *                * nienza o di destinazione delle merci          *
      *                *-----------------------------------------------*
                   15  srt-k01-iso-pod    pic  x(03)                  .
      *                *-----------------------------------------------*
      *                * Codice della provincia italiana di provenien- *
      *                * za o di destinazione delle merci              *
      *                *-----------------------------------------------*
                   15  srt-k01-pvc-ood    pic  x(03)                  .
      *                *-----------------------------------------------*
      *                * Codice ISO dello Stato di origine delle merci *
      *                *-----------------------------------------------*
                   15  srt-k01-iso-org    pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Subchiave 2 : Per progressivita'                  * 
      *            *---------------------------------------------------*
               10  srt-k02.
      *                *-----------------------------------------------*
      *                * Numero progressivo record letto               *
      *                *-----------------------------------------------*
                   15  srt-k02-num-rec    pic  9(09)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Codice ISO stato CEE operatore comunitario        *
      *            *---------------------------------------------------*
               10  srt-iit-iso-opc        pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Codice IVA dell'operatore comunitario             *
      *            *---------------------------------------------------*
               10  srt-iit-cdi-opi        pic  x(16)                  .
      *            *---------------------------------------------------*
      *            * Ammontare delle operazioni in valuta base         *
      *            *---------------------------------------------------*
               10  srt-iir-aml-ope        pic  9(13)                  .
      *            *---------------------------------------------------*
      *            * Codice della natura della transazione             *
      *            *---------------------------------------------------*
               10  srt-iit-cdn-dtr        pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Codice della nomenclatura combinata               *
      *            *---------------------------------------------------*
               10  srt-iir-cdn-cdm        pic  9(08)                  .
      *            *---------------------------------------------------*
      *            * Massa netta in chilogrammi                        *
      *            *---------------------------------------------------*
               10  srt-iir-mas-net        pic  9(10)                  .
      *            *---------------------------------------------------*
      *            * Quantita' espressa in unita' di misura supple-    *
      *            * mentare                                           *
      *            *---------------------------------------------------*
               10  srt-iir-qen-ums        pic  9(10)                  .
      *            *---------------------------------------------------*
      *            * Valore statistico                                 *
      *            *---------------------------------------------------*
               10  srt-iir-vls-iml        pic  9(13)                  .
      *            *---------------------------------------------------*
      *            * Condizioni di consegna                            *
      *            *---------------------------------------------------*
               10  srt-iit-cod-cdc        pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice del modo di trasporto                      *
      *            *---------------------------------------------------*
               10  srt-iit-cod-mdt        pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Codice ISO dello Stato membro CEE di provenienza  *
      *            * o di destinazione delle merci                     *
      *            *---------------------------------------------------*
               10  srt-iit-iso-pod        pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Codice della provincia italiana di provenienza    *
      *            * o di destinazione delle merci                     *
      *            *---------------------------------------------------*
               10  srt-iit-pvc-ood        pic  x(03)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "iic"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "mod"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "iic510"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "piic5101"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "      STAMPA MODELLO INTRA - 1 BIS      "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output su files *
      *    * di tipo line sequential                                   *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/g"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [ada]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/azi/fls/rec/rfada"                          .
      *        *-------------------------------------------------------*
      *        * [gxc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/geo/fls/rec/rfgxc"                          .
      *        *-------------------------------------------------------*
      *        * [iit]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/iic/fls/rec/rfiit"                          .
      *        *-------------------------------------------------------*
      *        * [iir]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/iic/fls/rec/rfiir"                          .

      *    *===========================================================*
      *    * Work-area richieste per interrogazione                    *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Tipo di riepilogo                                     *
      *        *  - 01 : Mensile                                       *
      *        *  - 02 : Trimestrale                                   *
      *        *  - 03 : Annuale                                       *
      *        *-------------------------------------------------------*
           05  rr-tip-rie                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Anno, in formato s.aa                                 *
      *        *-------------------------------------------------------*
           05  rr-ann-rie                 pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Mese                                                  *
      *        *-------------------------------------------------------*
           05  rr-mes-rie                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Trimestre                                             *
      *        *-------------------------------------------------------*
           05  rr-tri-rie                 pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Partita iva del dichiarante                           *
      *        *-------------------------------------------------------*
           05  rr-piv-dic                 pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Tipo operazione                                       *
      *        *  - 01 : Stampa frontespizio                           *
      *        *  - 02 : Stampa righe                                  *
      *        *  - 03 : Emissione sequenziale                         *
      *        *-------------------------------------------------------*
           05  rr-tip-ope                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Data stampa                                           *
      *        *-------------------------------------------------------*
           05  rr-dat-stp                 pic  9(07)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [gxc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-gxc.
               10  w-let-arc-gxc-flg      pic  x(01)                  .
               10  w-let-arc-gxc-tip      pic  x(01)                  .
               10  w-let-arc-gxc-cmn      pic  9(05)                  .
               10  w-let-arc-gxc-fzn      pic  9(03)                  .
               10  w-let-arc-gxc-lct      pic  9(03)                  .
               10  w-let-arc-gxc-des      pic  x(30)                  .
               10  w-let-arc-gxc-prv      pic  x(02)                  .
               10  w-let-arc-gxc-cap      pic  x(05)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det pathname file sequenziale in output      *
      *        *-------------------------------------------------------*
           05  w-det-pth-fso.
               10  w-det-pth-fso-pth      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Per Fine riga                                         *
      *        *-------------------------------------------------------*
           05  w-det-fin-rig.
      *            *---------------------------------------------------*
      *            * Separatore 'CR'                                   *
      *            *---------------------------------------------------*
               10  w-det-fin-rig-chr      pic  x(01)   value H"0D"    .
      *            *---------------------------------------------------*
      *            * Separatore 'TAB'                                  *
      *            *---------------------------------------------------*
               10  w-det-fin-rig-tab      pic  x(01)   value H"09"    .

      *    *===========================================================*
      *    * Work area per la definizione dei record per generazione   *
      *    * archivio sequenziale - INSTAT - IDEP         [CESSIONI]   *
      *    *-----------------------------------------------------------*
       01  w-rgs.
      *        *-------------------------------------------------------*
      *        * Record dettaglio                                      *
      *        *-------------------------------------------------------*
           05  w-rdt.
      *            *---------------------------------------------------*
      *            * Codice nomenclatura combinata                     *
      *            *---------------------------------------------------*
               10  w-rdt-cdn-cdm          pic  9(08)                  .
               10  w-rdt-sep-001          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Natura della transazione                          *
      *            *---------------------------------------------------*
               10  w-rdt-cdn-dtr          pic  9(01)                  .
               10  w-rdt-sep-002          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Condizioni di consegna                            *
      *            *---------------------------------------------------*
               10  w-rdt-cod-cdc          pic  x(01)                  .
               10  w-rdt-sep-003          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag statistico / fiscale                         *
      *            *---------------------------------------------------*
               10  w-rdt-flg-stf          pic  x(01)                  .
               10  w-rdt-sep-004          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Paese di destinazione                             *
      *            *---------------------------------------------------*
               10  w-rdt-iso-pod          pic  x(02)                  .
               10  w-rdt-sep-005          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Paese di origine (IT)                             *
      *            *---------------------------------------------------*
               10  w-rdt-iso-poo          pic  x(02)                  .
               10  w-rdt-sep-006          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Provincia paese di origine (IT)                   *
      *            *---------------------------------------------------*
               10  w-rdt-pvc-ood          pic  x(02)                  .
               10  w-rdt-sep-007          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Massa netta                                       *
      *            *---------------------------------------------------*
               10  w-rdt-tot-mas          pic  x(12)                  .
               10  w-rdt-sep-008          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Unita' supplementare                              *
      *            *---------------------------------------------------*
               10  w-rdt-tot-spl          pic  x(13)                  .
               10  w-rdt-sep-009          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice fiscale partner                            *
      *            *---------------------------------------------------*
               10  w-rdt-cod-fis          pic  x(20)                  .
               10  w-rdt-sep-010          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Modalita' di trasporto                            *
      *            *---------------------------------------------------*
               10  w-rdt-cod-mdt          pic  9(01)                  .
               10  w-rdt-sep-011          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Ammontare operazioni                              *
      *            *---------------------------------------------------*
               10  w-rdt-aml-ope          pic  x(13)                  .
               10  w-rdt-sep-012          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Valore statistico                                 *
      *            *---------------------------------------------------*
               10  w-rdt-vls-iml          pic  x(13)                  .
               10  w-rdt-sep-013          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Riferimento interno                               *
      *            *                                                   *
      *            * Formato : 99/99/99999999                          *
      *            *---------------------------------------------------*
               10  w-rdt-rif-int          pic  x(14)                  .
               10  w-rdt-sep-014          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Importo in valuta                                 *
      *            *---------------------------------------------------*
               10  w-rdt-imp-vlt          pic  x(10)                  .
               10  w-rdt-sep-015          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice valuta                                     *
      *            *---------------------------------------------------*
               10  w-rdt-cod-vlt          pic  x(03)                  .
               10  w-rdt-sep-016          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Nome formula                                      *
      *            *---------------------------------------------------*
               10  w-rdt-nom-fml          pic  x(20)                  .
               10  w-rdt-sep-017          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Indicatore di valuta                              *
      *            *---------------------------------------------------*
               10  w-rdt-ind-vlt          pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Carattere di fine record                          *
      *            *---------------------------------------------------*
               10  w-rdt-chr-end          pic  x(01)                  .

      *    *===========================================================*
      *    * Work per scrittura records in file sequenziale di appog-  *
      *    * gio                                                       *
      *    *-----------------------------------------------------------*
       01  w-scr-fso.
      *        *-------------------------------------------------------*
      *        * Carattere di fine riga                                *
      *        *-------------------------------------------------------*
           05  w-scr-fso-cfr              pic  x(01)   value H"0D"    .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione data                           *
      *        *-------------------------------------------------------*
           05  w-scr-fso-dat              pic  x(06)                  .
           05  w-scr-fso-dat-r redefines
               w-scr-fso-dat.
               10  w-scr-fso-gio          pic  9(02)                  .
               10  w-scr-fso-mes          pic  9(02)                  .
               10  w-scr-fso-ann          pic  9(02)                  .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
      *            *---------------------------------------------------*
      *            * Area per subchiave 1 del sort record              *
      *            *---------------------------------------------------*
               10  w-rot-l01-k01.
      *                *-----------------------------------------------*
      *                * Codice ISO stato CEE operatore comunitario    *
      *                *-----------------------------------------------*
                   15  w-rot-l01-iso-opc  pic  x(03)                  .
      *                *-----------------------------------------------*
      *                * Codice IVA dell'operatore comunitario         *
      *                *-----------------------------------------------*
                   15  w-rot-l01-cdi-opi  pic  x(16)                  .
      *                *-----------------------------------------------*
      *                * Codice della natura della transazione         *
      *                *-----------------------------------------------*
                   15  w-rot-l01-cdn-dtr  pic  9(01)                  .
      *                *-----------------------------------------------*
      *                * Codice della nomenclatura combinata           *
      *                *-----------------------------------------------*
                   15  w-rot-l01-cdn-cdm  pic  9(08)                  .
      *                *-----------------------------------------------*
      *                * Condizioni di consegna                        *
      *                *-----------------------------------------------*
                   15  w-rot-l01-cod-cdc  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Codice del modo di trasporto                  *
      *                *-----------------------------------------------*
                   15  w-rot-l01-cod-mdt  pic  9(01)                  .
      *                *-----------------------------------------------*
      *                * Codice ISO dello Stato membro CEE di prove-   *
      *                * nienza o di destinazione delle merci          *
      *                *-----------------------------------------------*
                   15  w-rot-l01-iso-pod  pic  x(03)                  .
      *                *-----------------------------------------------*
      *                * Codice della provincia italiana di provenien- *
      *                * za o di destinazione delle merci              *
      *                *-----------------------------------------------*
                   15  w-rot-l01-pvc-ood  pic  x(03)                  .
      *                *-----------------------------------------------*
      *                * Codice ISO dello Stato di origine delle merci *
      *                *-----------------------------------------------*
                   15  w-rot-l01-iso-org  pic  x(03)                  .

      *    *===========================================================*
      *    * Work area per esecuzione stampa                           *
      *    *-----------------------------------------------------------*
       01  w-stp.
      *        *-------------------------------------------------------*
      *        * Sub-work per valori totali                            *
      *        *-------------------------------------------------------*
           05  w-stp-ttl.
      *            *---------------------------------------------------*
      *            * Data registrazione minima                         *
      *            *---------------------------------------------------*
               10  w-stp-ttl-dat-min      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data registrazione minima                         *
      *            *---------------------------------------------------*
               10  w-stp-ttl-dat-max      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Flag di tipo lettura da eseguire                  *
      *            *  - T : Testate da [iit]                           *
      *            *  - R : Righe   da [iir]                           *
      *            *---------------------------------------------------*
               10  w-stp-ttl-flg-tle      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero di record letti e trattati                 *
      *            *---------------------------------------------------*
               10  w-stp-ttl-num-rec      pic  9(09)                  .
      *            *---------------------------------------------------*
      *            * Numero totale di pagine stampate                  *
      *            *---------------------------------------------------*
               10  w-stp-ttl-num-pag      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di pagina nell'ambito del modello          *
      *            *                                                   *
      *            *  - '1' : Frontespizio                             *
      *            *  - '2' : Pagina 1, 1-bis                          *
      *            *  - '3' : Pagina 2, 1-bis                          *
      *            *  - '4' : Pagina 1, 1-ter                          *
      *            *---------------------------------------------------*
               10  w-stp-ttl-ndp-adm      pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Numero totale di righe stampate                   *
      *            *---------------------------------------------------*
               10  w-stp-ttl-num-rig      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Valore di riporto dalla pagina precedente         *
      *            *---------------------------------------------------*
               10  w-stp-ttl-val-rpp      pic  9(13)                  .
      *            *---------------------------------------------------*
      *            * Valore totale                                     *
      *            *---------------------------------------------------*
               10  w-stp-ttl-val-tot      pic  9(13)                  .
      *        *-------------------------------------------------------*
      *        * Sub-work per valori pagina                            *
      *        *-------------------------------------------------------*
           05  w-stp-pgn.
      *            *---------------------------------------------------*
      *            * Numero pagina in corso di stampa                  *
      *            *---------------------------------------------------*
               10  w-stp-pgn-num-pag      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero riga in corso di stampa                    *
      *            *---------------------------------------------------*
               10  w-stp-pgn-num-rig      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Sub-work per valori riga                              *
      *        *-------------------------------------------------------*
           05  w-stp-rig.
      *            *---------------------------------------------------*
      *            * Totale delle operazioni in valuta base            *
      *            *---------------------------------------------------*
               10  w-stp-rig-tot-aml      pic  9(13)                  .
      *            *---------------------------------------------------*
      *            * Totale della massa netta in chilogrammi           *
      *            *---------------------------------------------------*
               10  w-stp-rig-tot-mas      pic  9(10)                  .
      *            *---------------------------------------------------*
      *            * Totale quantita' in unita' di misura supplementa- *
      *            * re                                                *
      *            *---------------------------------------------------*
               10  w-stp-rig-tot-spl      pic  9(10)                  .
      *            *---------------------------------------------------*
      *            * Totale del valore statistico                      *
      *            *---------------------------------------------------*
               10  w-stp-rig-tot-vls      pic  9(13)                  .
      *            *---------------------------------------------------*
      *            * Linee fisse frontespizio                          *
      *            *---------------------------------------------------*
               10  w-stp-rig-lfs-l01      pic  9(03)       value 011  .
               10  w-stp-rig-lfs-l02      pic  9(03)       value 013  .
               10  w-stp-rig-lfs-l03      pic  9(03)       value 019  .
               10  w-stp-rig-lfs-l04      pic  9(03)       value 030  .
               10  w-stp-rig-lfs-l05      pic  9(03)       value 033  .
               10  w-stp-rig-lfs-l06      pic  9(03)       value 052  .
               10  w-stp-rig-lfs-l07      pic  9(03)       value 055  .
      *            *---------------------------------------------------*
      *            * Linee fisse righe                                 *
      *            *---------------------------------------------------*
               10  w-stp-rig-lin-per      pic  9(03)       value 033  .
               10  w-stp-rig-lin-rig      pic  9(03)       value 040  .
               10  w-stp-rig-lin-rip      pic  9(03)       value 060  .
               10  w-stp-rig-lin-tot      pic  9(03)       value 062  .
      *            *---------------------------------------------------*
      *            * Posizione colonne                                 *
      *            *---------------------------------------------------*
               10  w-stp-rig-pos-c01      pic  9(03)       value 012  .
               10  w-stp-rig-pos-c02      pic  9(03)       value 017  .
               10  w-stp-rig-pos-c03      pic  9(03)       value 021  .
               10  w-stp-rig-pos-c04      pic  9(03)       value 034  .
               10  w-stp-rig-pos-c05      pic  9(03)       value 046  .
               10  w-stp-rig-pos-c06      pic  9(03)       value 049  .
               10  w-stp-rig-pos-c07      pic  9(03)       value 059  .
               10  w-stp-rig-pos-c08      pic  9(03)       value 070  .
               10  w-stp-rig-pos-c09      pic  9(03)       value 080  .
               10  w-stp-rig-pos-c10      pic  9(03)       value 092  .
               10  w-stp-rig-pos-c11      pic  9(03)       value 095  .
               10  w-stp-rig-pos-c12      pic  9(03)       value 098  .
               10  w-stp-rig-pos-c13      pic  9(03)       value 102  .
               10  w-stp-rig-pos-c14      pic  9(03)       value 106  .

      *    *===========================================================*
      *    * Work area per ridefinizioni valuta base senza centesimi   *
      *    *-----------------------------------------------------------*
       01  w-rdf.
      *        *-------------------------------------------------------*
      *        * Sub-work per ammontare in valuta base                 *
      *        *-------------------------------------------------------*
           05  w-rdf-avb-ope.
      *            *---------------------------------------------------*
      *            * Valore in valuta base                             *
      *            *---------------------------------------------------*
               10  w-rdf-avb-ope-vlb      pic  9(13)                  .
               10  w-rdf-avb-ope-r00 redefines
                   w-rdf-avb-ope-vlb.
                   15  w-rdf-avb-ope-int  pic  9(11)                  .
                   15  w-rdf-avb-ope-dec  pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Sub-work per ammontare in valuta base precedente      *
      *        *-------------------------------------------------------*
           05  w-rdf-avb-pre.
      *            *---------------------------------------------------*
      *            * Valore in valuta base                             *
      *            *---------------------------------------------------*
               10  w-rdf-avb-pre-vlb      pic  9(13)                  .
               10  w-rdf-avb-pre-r00 redefines
                   w-rdf-avb-pre-vlb.
                   15  w-rdf-avb-pre-int  pic  9(11)                  .
                   15  w-rdf-avb-pre-dec  pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Sub-work per valore statistico                        *
      *        *-------------------------------------------------------*
           05  w-rdf-vls-ope.
      *            *---------------------------------------------------*
      *            * Valore in valuta base                             *
      *            *---------------------------------------------------*
               10  w-rdf-vls-ope-vlb      pic  9(13)                  .
               10  w-rdf-vls-ope-r00 redefines
                   w-rdf-vls-ope-vlb.
                   15  w-rdf-vls-ope-int  pic  9(11)                  .
                   15  w-rdf-vls-ope-dec  pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Sub-work per valore statistico precedente             *
      *        *-------------------------------------------------------*
           05  w-rdf-vls-pre.
      *            *---------------------------------------------------*
      *            * Valore in valuta base                             *
      *            *---------------------------------------------------*
               10  w-rdf-vls-pre-vlb      pic  9(13)                  .
               10  w-rdf-vls-pre-r00 redefines
                   w-rdf-vls-pre-vlb.
                   15  w-rdf-vls-pre-int  pic  9(11)                  .
                   15  w-rdf-vls-pre-dec  pic  9(02)                  .

      *    *===========================================================*
      *    * Work area per editing                                     *
      *    *-----------------------------------------------------------*
       01  w-edt.
      *        *-------------------------------------------------------*
      *        * Sub-work per mese riepilogo                           *
      *        *-------------------------------------------------------*
           05  w-edt-mes-rie.
      *            *---------------------------------------------------*
      *            * Comodo per rappresentazione numerica ridefinita   *
      *            *---------------------------------------------------*
               10  w-edt-mes-rie-num      pic  9(02)                  .
               10  w-edt-mes-rie-r00 redefines
                   w-edt-mes-rie-num.
                   15  w-edt-mes-rie-r01  pic  x(01)                  .
                   15  w-edt-mes-rie-r02  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Sub-work per trimestre riepilogo                      *
      *        *-------------------------------------------------------*
           05  w-edt-tri-rie.
      *            *---------------------------------------------------*
      *            * Comodo per rappresentazione numerica ridefinita   *
      *            *---------------------------------------------------*
               10  w-edt-tri-rie-num      pic  9(01)                  .
               10  w-edt-tri-rie-r00 redefines
                   w-edt-tri-rie-num.
                   15  w-edt-tri-rie-r01  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Sub-work per anno riepilogo                           *
      *        *-------------------------------------------------------*
           05  w-edt-ann-rie.
      *            *---------------------------------------------------*
      *            * Comodo per rappresentazione numerica ridefinita   *
      *            *---------------------------------------------------*
               10  w-edt-ann-rie-num      pic  9(03)                  .
               10  w-edt-ann-rie-r00 redefines
                   w-edt-ann-rie-num.
                   15  w-edt-ann-rie-r01  pic  x(01)                  .
                   15  w-edt-ann-rie-r02  pic  x(01)                  .
                   15  w-edt-ann-rie-r03  pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Eventuale aggiustamento flag di Si/No stampa in *
      *              * funzione del tipo operazione richiesta          *
      *              *-------------------------------------------------*
           if        rr-tip-ope           =    03
                     move  "N"            to   w-cnt-fun-snx-stp      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Elaborazioni preliminari su aree titolo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area nome azienda  *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-cnt-tit-des-azi      .
           move      40                   to   w-cnt-tit-ctr-azi      .
       int-pag-std-100.
           if        w-cnt-tit-chr-azi
                    (w-cnt-tit-ctr-azi)   =    spaces
                     if     w-cnt-tit-ctr-azi
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-azi
                            go to     int-pag-std-100.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza titolo stampato    *
      *                  *---------------------------------------------*
           move      80                   to   w-cnt-tit-ctr-tit      .
       int-pag-std-200.
           if        w-cnt-tit-chr-tit
                    (w-cnt-tit-ctr-tit)   =    spaces
                     if     w-cnt-tit-ctr-tit
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-tit
                            go to     int-pag-std-200.
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale titolo    *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-tit      .
           subtract  w-cnt-tit-ctr-tit    from w-cnt-tit-pos-tit      .
           divide    2                    into w-cnt-tit-pos-tit      .
           add       1                    to   w-cnt-tit-pos-tit      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area data e pagina *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-pag    =    zero
                     move  4              to   w-cnt-tit-ctr-wrk
                     go to int-pag-std-300.
           move      zero                 to   w-cnt-tit-ctr-wrk      .
           inspect   w-cnt-tit-num-pag
                                      tallying w-cnt-tit-ctr-wrk
                                   for leading "0"                    .
       int-pag-std-300.
           subtract  w-cnt-tit-ctr-wrk    from 27
                                        giving w-cnt-tit-ctr-dep      .
           subtract  w-cnt-tit-ctr-wrk    from 5
                                        giving w-cnt-tit-ctr-cif      .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale data e p. *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-dep      .
           subtract  w-cnt-tit-ctr-dep    from w-cnt-tit-pos-dep      .
           add       1                    to   w-cnt-tit-pos-dep      .
      *                  *---------------------------------------------*
      *                  * Determinazione se titolo su una o due linee *
      *                  *---------------------------------------------*
           move      w-cnt-tit-ctr-azi    to   w-cnt-tit-ctr-wrk      .
           add       2                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-tit
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      w-cnt-tit-pos-tit    to   w-cnt-tit-ctr-wrk      .
           add       w-cnt-tit-ctr-tit    to   w-cnt-tit-ctr-wrk      .
           add       1                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-dep
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      1                    to   w-cnt-tit-num-lin      .
       int-pag-std-500.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome azienda                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-azi    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-cnt-tit-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-lin    =    2
                     go to int-pag-std-600.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-600.
      *                  *---------------------------------------------*
      *                  * Literal per Data                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           move      "Data :"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       7                    to   p-pos                  .
           move      w-cnt-tit-dat-stp    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal per Pag.                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       17                   to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      w-cnt-tit-ctr-cif    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       22                   to   p-pos                  .
           move      w-cnt-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea titolo                            *
      *              *-------------------------------------------------*
           if        w-cnt-tit-num-lin    not  = 2
                     go to int-pag-std-900.
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-900.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [ada]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *              *-------------------------------------------------*
      *              * [gxc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *              *-------------------------------------------------*
      *              * [iit]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/iic/fls/ioc/obj/iofiit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-iit                 .
      *              *-------------------------------------------------*
      *              * [iir]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/iic/fls/ioc/obj/iofiir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-iir                 .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [ada]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *              *-------------------------------------------------*
      *              * [gxc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *              *-------------------------------------------------*
      *              * [iit]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/iic/fls/ioc/obj/iofiit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-iit                 .
      *              *-------------------------------------------------*
      *              * [iir]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/iic/fls/ioc/obj/iofiir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-iir                 .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : Si'                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-exe-rou-srt      .
      *              *-------------------------------------------------*
      *              * Esecuzione sort                                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   prn-rou-pri-000
                                          thru prn-rou-pri-999        .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Determinazione data minima e massima da consi-  *
      *              * derare                                          *
      *              *-------------------------------------------------*
       stp-srt-inp-050.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo di riepilogo  *
      *                  *---------------------------------------------*
           if        rr-tip-rie           =    01
                     go to stp-srt-inp-060
           else if   rr-tip-rie           =    02
                     go to stp-srt-inp-070
           else if   rr-tip-rie           =    03
                     go to stp-srt-inp-080.
       stp-srt-inp-060.
      *                  *---------------------------------------------*
      *                  * Se tipo di riepilogo : mensile              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione data minima                *
      *                      *-----------------------------------------*
           move      rr-ann-rie           to   s-saa                  .
           move      rr-mes-rie           to   s-mes                  .
           move      01                   to   s-gio                  .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione data minima             *
      *                      *-----------------------------------------*
           move      s-dat                to   w-stp-ttl-dat-min      .
      *                      *-----------------------------------------*
      *                      * Preparazione data massima               *
      *                      *-----------------------------------------*
           move      rr-ann-rie           to   s-saa                  .
           move      rr-mes-rie           to   s-mes                  .
           move      31                   to   s-gio                  .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione data massima            *
      *                      *-----------------------------------------*
           move      s-dat                to   w-stp-ttl-dat-max      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-100.
       stp-srt-inp-070.
      *                  *---------------------------------------------*
      *                  * Se tipo di riepilogo : trimestrale          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione data minima                *
      *                      *-----------------------------------------*
           move      rr-ann-rie           to   s-saa                  .
           move      rr-tri-rie           to   s-mes                  .
           multiply  3                    by   s-mes                  .
           subtract  2                    from s-mes                  .
           move      01                   to   s-gio                  .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione data minima             *
      *                      *-----------------------------------------*
           move      s-dat                to   w-stp-ttl-dat-min      .
      *                      *-----------------------------------------*
      *                      * Preparazione data massima               *
      *                      *-----------------------------------------*
           move      rr-ann-rie           to   s-saa                  .
           move      rr-tri-rie           to   s-mes                  .
           multiply  3                    by   s-mes                  .
           move      31                   to   s-gio                  .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione data massima            *
      *                      *-----------------------------------------*
           move      s-dat                to   w-stp-ttl-dat-max      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-100.
       stp-srt-inp-080.
      *                  *---------------------------------------------*
      *                  * Se tipo di riepilogo : annuale              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione data minima                *
      *                      *-----------------------------------------*
           move      rr-ann-rie           to   s-saa                  .
           move      01                   to   s-mes                  .
           move      01                   to   s-gio                  .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione data minima             *
      *                      *-----------------------------------------*
           move      s-dat                to   w-stp-ttl-dat-min      .
      *                      *-----------------------------------------*
      *                      * Preparazione data massima               *
      *                      *-----------------------------------------*
           move      rr-ann-rie           to   s-saa                  .
           move      12                   to   s-mes                  .
           move      31                   to   s-gio                  .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione data massima            *
      *                      *-----------------------------------------*
           move      s-dat                to   w-stp-ttl-dat-max      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-100.
       stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Normalizzazione preliminare valori totali       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero progressivo record letto             *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-ttl-num-rec      .
      *                  *---------------------------------------------*
      *                  * Numero totale di pagine stampate            *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-ttl-num-pag      .
      *                  *---------------------------------------------*
      *                  * Numero pagina nell'ambito del modello       *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-ttl-ndp-adm      .
      *                  *---------------------------------------------*
      *                  * Numero totale di righe stampate             *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-ttl-num-rig      .
      *                  *---------------------------------------------*
      *                  * Valore di riporto dalla pagina precedente   *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-ttl-val-rpp      .
      *                  *---------------------------------------------*
      *                  * Valore totale                               *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-ttl-val-tot      .
       stp-srt-inp-150.
      *              *-------------------------------------------------*
      *              * Normalizzazione preliminare valori pagina       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero pagina in corso di stampa            *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-pgn-num-pag      .
      *                  *---------------------------------------------*
      *                  * Numero riga in corso di stampa              *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-pgn-num-rig      .
       stp-srt-inp-200.
      *              *-------------------------------------------------*
      *              * Start su [iit] per data                         *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "DATREG    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-stp-ttl-dat-min    to   rf-iit-dat-reg         .
           move      zero                 to   rf-iit-num-prt         .
           move      "pgm/iic/fls/ioc/obj/iofiit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-iit                 .
      *              *-------------------------------------------------*
      *              * Se start errata : uscita                        *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-999.
       stp-srt-inp-250.
      *              *-------------------------------------------------*
      *              * Next su [iit] per data                          *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/iic/fls/ioc/obj/iofiit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-iit                 .
      *              *-------------------------------------------------*
      *              * Se fine file : uscita                           *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-999.
       stp-srt-inp-300.
      *              *-------------------------------------------------*
      *              * Test max su [iit], se non superato : uscita     *
      *              *-------------------------------------------------*
           if        rf-iit-dat-reg       >    w-stp-ttl-dat-max
                     go to stp-srt-inp-999.
       stp-srt-inp-350.
      *              *-------------------------------------------------*
      *              * Selezione su [iit], se non superata : riciclo   *
      *              * a lettura [iit] successivi                      *
      *              *-------------------------------------------------*
           if        rf-iit-top-iic       not  = 0002
                     go to stp-srt-inp-250.
       stp-srt-inp-400.
      *              *-------------------------------------------------*
      *              * Start su [iir]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "DATREG    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      rf-iit-dat-reg       to   rf-iir-dat-reg         .
           move      rf-iit-num-prt       to   rf-iir-num-prt         .
           move      zero                 to   rf-iir-num-prg         .
           move      "pgm/iic/fls/ioc/obj/iofiir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-iir                 .
      *              *-------------------------------------------------*
      *              * Se start errata : riciclo a lettura [iit] suc-  *
      *              * cessivo                                         *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-250.
       stp-srt-inp-450.
      *              *-------------------------------------------------*
      *              * Next su [iir]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/iic/fls/ioc/obj/iofiir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-iir                 .
      *              *-------------------------------------------------*
      *              * Se fine file : riciclo a lettura [iit] succes-  *
      *              * sivo                                            *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-250.
       stp-srt-inp-500.
      *              *-------------------------------------------------*
      *              * Test max su [iir], se non superato : riciclo a  *
      *              * lettura [iit] successivo                        *
      *              *-------------------------------------------------*
           if        rf-iir-dat-reg       not  = rf-iit-dat-reg or
                     rf-iir-num-prt       not  = rf-iit-num-prt
                     go to stp-srt-inp-250.
       stp-srt-inp-550.
      *              *-------------------------------------------------*
      *              * Composizione record di sort                     *
      *              *-------------------------------------------------*
       stp-srt-inp-560.
      *                  *---------------------------------------------*
      *                  * Normalizzazione preliminare totale          *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
       stp-srt-inp-570.
      *                  *---------------------------------------------*
      *                  * Subchiave 1                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice ISO stato CEE operatore comuni-  *
      *                      * tario                                   *
      *                      *-----------------------------------------*
           move      rf-iit-iso-opc       to   srt-k01-iso-opc        .
      *                      *-----------------------------------------*
      *                      * Codice IVA dell'operatore comunitario   *
      *                      *-----------------------------------------*
           move      rf-iit-cdi-opi       to   srt-k01-cdi-opi        .
      *                      *-----------------------------------------*
      *                      * Codice della natura della transazione   *
      *                      *-----------------------------------------*
           move      rf-iit-cdn-dtr       to   srt-k01-cdn-dtr        .
      *                      *-----------------------------------------*
      *                      * Codice della nomenclatura combinata     *
      *                      *-----------------------------------------*
           move      rf-iir-cdn-cdm       to   srt-k01-cdn-cdm        .
      *                      *-----------------------------------------*
      *                      * Condizioni di consegna                  *
      *                      *-----------------------------------------*
           if        rr-tip-rie           =    01
                     move  rf-iit-cod-cdc to   srt-k01-cod-cdc
           else      move  zero           to   srt-k01-cod-cdc        .
      *                      *-----------------------------------------*
      *                      * Codice del modo di trasporto            *
      *                      *-----------------------------------------*
           if        rr-tip-rie           =    01
                     move  rf-iit-cod-mdt to   srt-k01-cod-mdt
           else      move  zero           to   srt-k01-cod-mdt        .
      *                      *-----------------------------------------*
      *                      * Codice ISO dello Stato membro CEE di    *
      *                      * provenienza o di destinazione delle     *
      *                      * merci                                   *
      *                      *-----------------------------------------*
           if        rr-tip-rie           =    01
                     move  rf-iit-iso-pod to   srt-k01-iso-pod
           else      move  spaces         to   srt-k01-iso-pod        .
      *                      *-----------------------------------------*
      *                      * Codice della provincia italiana di pro- *
      *                      * venienza o di destinazione delle merci  *
      *                      *-----------------------------------------*
           if        rr-tip-rie           =    01
                     move  rf-iit-pvc-ood to   srt-k01-pvc-ood
           else      move  spaces         to   srt-k01-pvc-ood        .
      *                      *-----------------------------------------*
      *                      * Codice ISO dello Stato di origine delle *
      *                      * merci                                   *
      *                      *-----------------------------------------*
           if        rr-tip-rie           =    01
                     move  rf-iir-iso-org to   srt-k01-iso-org
           else      move  spaces         to   srt-k01-iso-org        .
       stp-srt-inp-580.
      *                  *---------------------------------------------*
      *                  * Subchiave 2                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Numero progressivo record letto         *
      *                      *-----------------------------------------*
           add       1                    to   w-stp-ttl-num-rec      .
           move      w-stp-ttl-num-rec    to   srt-k02-num-rec        .
       stp-srt-inp-590.
      *                  *---------------------------------------------*
      *                  * Dati                                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice ISO stato CEE operatore comuni-  *
      *                      * tario                                   *
      *                      *-----------------------------------------*
           move      rf-iit-iso-opc       to   srt-iit-iso-opc        .
      *                      *-----------------------------------------*
      *                      * Codice IVA dell'operatore comunitario   *
      *                      *-----------------------------------------*
           move      rf-iit-cdi-opi       to   srt-iit-cdi-opi        .
      *                      *-----------------------------------------*
      *                      * Ammontare delle operazioni in valuta    *
      *                      * base                                    *
      *                      *-----------------------------------------*
           move      rf-iir-aml-ope       to   srt-iir-aml-ope        .
      *                      *-----------------------------------------*
      *                      * Codice della natura della transazione   *
      *                      *-----------------------------------------*
           move      rf-iit-cdn-dtr       to   srt-iit-cdn-dtr        .
      *                      *-----------------------------------------*
      *                      * Codice della nomenclatura combinata     *
      *                      *-----------------------------------------*
           move      rf-iir-cdn-cdm       to   srt-iir-cdn-cdm        .
      *                      *-----------------------------------------*
      *                      * Massa netta in chilogrammi              *
      *                      *-----------------------------------------*
           move      rf-iir-mas-net       to   srt-iir-mas-net        .
      *                      *-----------------------------------------*
      *                      * Quantita' espressa in unita' di misura  *
      *                      * supplementare                           *
      *                      *-----------------------------------------*
           move      rf-iir-qen-ums       to   srt-iir-qen-ums        .
      *                      *-----------------------------------------*
      *                      * Valore statistico                       *
      *                      *-----------------------------------------*
           move      rf-iir-vls-iml       to   srt-iir-vls-iml        .
      *                      *-----------------------------------------*
      *                      * Condizioni di consegna                  *
      *                      *-----------------------------------------*
           move      rf-iit-cod-cdc       to   srt-iit-cod-cdc        .
      *                      *-----------------------------------------*
      *                      * Codice del modo di trasporto            *
      *                      *-----------------------------------------*
           move      rf-iit-cod-mdt       to   srt-iit-cod-mdt        .
      *                      *-----------------------------------------*
      *                      * Codice ISO dello Stato membro CEE di    *
      *                      * provenienza o di destinazione delle     *
      *                      * merci                                   *
      *                      *-----------------------------------------*
           move      rf-iit-iso-pod       to   srt-iit-iso-pod        .
      *                      *-----------------------------------------*
      *                      * Codice della provincia italiana di pro- *
      *                      * venienza o di destinazione delle merci  *
      *                      *-----------------------------------------*
           move      rf-iit-pvc-ood       to   srt-iit-pvc-ood        .
       stp-srt-inp-600.
      *              *-------------------------------------------------*
      *              * Rilascio del record al sort                     *
      *              *-------------------------------------------------*
           release   srt-rec                                          .
       stp-srt-inp-650.
      *              *-------------------------------------------------*
      *              * Riciclo alla lettura [iir] successivo           *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-450.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessun movimento Iva intracomunitaria entro i limi
      -              "ti assegnati ! "    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
           return    srt    at end
                            move  "#"     to   w-cnt-prn-flg-sub
                            go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
      *              *-------------------------------------------------*
      *              * Codice ISO stato CEE operatore comunitario      *
      *              *-------------------------------------------------*
           move      srt-k01-iso-opc      to   w-rot-l01-iso-opc      .
      *              *-------------------------------------------------*
      *              * Codice IVA dell'operatore comunitario           *
      *              *-------------------------------------------------*
           move      srt-k01-cdi-opi      to   w-rot-l01-cdi-opi      .
      *              *-------------------------------------------------*
      *              * Codice della natura della transazione           *
      *              *-------------------------------------------------*
           move      srt-k01-cdn-dtr      to   w-rot-l01-cdn-dtr      .
      *              *-------------------------------------------------*
      *              * Codice della nomenclatura combinata             *
      *              *-------------------------------------------------*
           move      srt-k01-cdn-cdm      to   w-rot-l01-cdn-cdm      .
      *              *-------------------------------------------------*
      *              * Condizioni di consegna                          *
      *              *-------------------------------------------------*
           move      srt-k01-cod-cdc      to   w-rot-l01-cod-cdc      .
      *              *-------------------------------------------------*
      *              * Codice del modo di trasporto                    *
      *              *-------------------------------------------------*
           move      srt-k01-cod-mdt      to   w-rot-l01-cod-mdt      .
      *              *-------------------------------------------------*
      *              * Codice ISO dello Stato membro CEE di provenien- *
      *              * za o di destinazione delle merci                *
      *              *-------------------------------------------------*
           move      srt-k01-iso-pod      to   w-rot-l01-iso-pod      .
      *              *-------------------------------------------------*
      *              * Codice della provincia italiana di provenienza  *
      *              * o di destinazione delle merci                   *
      *              *-------------------------------------------------*
           move      srt-k01-pvc-ood      to   w-rot-l01-pvc-ood      .
      *              *-------------------------------------------------*
      *              * Codice ISO dello Stato di origine delle merci   *
      *              *-------------------------------------------------*
           move      srt-k01-iso-org      to   w-rot-l01-iso-org      .
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo operazione      *
      *              *-------------------------------------------------*
           if        rr-tip-ope           =    01
                     go to prn-ini-cic-100
           else if   rr-tip-ope           =    02
                     go to prn-ini-cic-200
           else if   rr-tip-ope           =    03
                     go to prn-ini-cic-300.
       prn-ini-cic-100.
      *              *-------------------------------------------------*
      *              * Tipo operazione : Stampa frontespizio           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-cic-999.
       prn-ini-cic-200.
      *              *-------------------------------------------------*
      *              * Tipo operazione : Stampa righe                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-cic-999.
       prn-ini-cic-300.
      *              *-------------------------------------------------*
      *              * Tipo operazione : Emissione sequenziale         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione pathname file sequenziale in *
      *                  * output                                      *
      *                  *---------------------------------------------*
           perform   det-pth-fso-000      thru det-pth-fso-999        .
      *                  *---------------------------------------------*
      *                  * Apertura del file in output                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      w-det-pth-fso-pth    to   g-pat                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-cic-999.
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo operazione      *
      *              *-------------------------------------------------*
           if        rr-tip-ope           =    01
                     go to prn-fin-cic-100
           else if   rr-tip-ope           =    02
                     go to prn-fin-cic-200
           else if   rr-tip-ope           =    03
                     go to prn-fin-cic-300.
       prn-fin-cic-100.
      *              *-------------------------------------------------*
      *              * Tipo operazione : Stampa frontespizio           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Stampa frontespizio                         *
      *                  *---------------------------------------------*
           perform   stp-frn-spz-000      thru stp-frn-spz-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-fin-cic-999.
       prn-fin-cic-200.
      *              *-------------------------------------------------*
      *              * Tipo operazione : Stampa righe                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-fin-cic-999.
       prn-fin-cic-300.
      *              *-------------------------------------------------*
      *              * Tipo operazione : Emissione sequenziale         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura del file in output                 *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo utilizzato             *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mcvout"                         .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-fin-cic-999.
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr1-100.
      *              *-------------------------------------------------*
      *              * Inizializzazioni di inizio livello              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Totale delle operazioni in valuta base      *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-rig-tot-aml      .
      *                  *---------------------------------------------*
      *                  * Totale della massa netta in chilogrammi     *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-rig-tot-mas      .
      *                  *---------------------------------------------*
      *                  * Totale quantita' in unita' di misura sup-   *
      *                  * plementare                                  *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-rig-tot-spl      .
      *                  *---------------------------------------------*
      *                  * Totale del valore statistico                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-rig-tot-vls      .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo operazione      *
      *              *-------------------------------------------------*
           if        rr-tip-ope           =    01
                     go to prn-fin-lr1-100
           else if   rr-tip-ope           =    02
                     go to prn-fin-lr1-200
           else if   rr-tip-ope           =    03
                     go to prn-fin-lr1-300.
       prn-fin-lr1-100.
      *              *-------------------------------------------------*
      *              * Tipo operazione : Stampa frontespizio           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Stampa riga di dettaglio                    *
      *                  *---------------------------------------------*
           perform   stp-det-rig-000      thru stp-det-rig-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-fin-lr1-999.
       prn-fin-lr1-200.
      *              *-------------------------------------------------*
      *              * Tipo operazione : Stampa righe                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Stampa riga di dettaglio                    *
      *                  *---------------------------------------------*
           perform   stp-det-rig-000      thru stp-det-rig-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-fin-lr1-999.
       prn-fin-lr1-300.
      *              *-------------------------------------------------*
      *              * Tipo operazione : Emissione sequenziale         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Emissione riga di dettaglio                 *
      *                  *---------------------------------------------*
           perform   emi-det-rig-000      thru emi-det-rig-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-fin-lr1-999.
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-liv-det-100.
      *              *-------------------------------------------------*
      *              * Aggiornamento totali per valori riga            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Totale delle operazioni in valuta base      *
      *                  *---------------------------------------------*
           add       srt-iir-aml-ope      to   w-stp-rig-tot-aml      .
      *                  *---------------------------------------------*
      *                  * Totale della massa netta in chilogrammi     *
      *                  *---------------------------------------------*
           add       srt-iir-mas-net      to   w-stp-rig-tot-mas      .
      *                  *---------------------------------------------*
      *                  * Totale quantita' in unita' di misura sup-   *
      *                  * plementare                                  *
      *                  *---------------------------------------------*
           add       srt-iir-qen-ums      to   w-stp-rig-tot-spl      .
      *                  *---------------------------------------------*
      *                  * Totale del valore statistico                *
      *                  *---------------------------------------------*
           add       srt-iir-vls-iml      to   w-stp-rig-tot-vls      .
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Stampa frontespizio                                       *
      *    *-----------------------------------------------------------*
       stp-frn-spz-000.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Intestazione                                *
      *                  *---------------------------------------------*
           perform   stp-int-pag-000      thru stp-int-pag-999        .
      *                  *---------------------------------------------*
      *                  * Controllo                                   *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to stp-frn-spz-999.
       stp-frn-spz-010.
      *              *-------------------------------------------------*
      *              * Dati periodo                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Stampa mese riepilogo                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se riepilogo non mensile : no stampa    *
      *                      *-----------------------------------------*
           if        rr-tip-rie           not  = 01
                     go to stp-frn-spz-140.
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lfs-l01    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Mese in comodo di ridefinizione         *
      *                      *-----------------------------------------*
           move      rr-mes-rie           to   w-edt-mes-rie-num      .
      *                      *-----------------------------------------*
      *                      * Decine                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      042                  to   p-pos                  .
           move      w-edt-mes-rie-r01    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Unita'                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      044                  to   p-pos                  .
           move      w-edt-mes-rie-r02    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-frn-spz-140.
      *                  *---------------------------------------------*
      *                  * Stampa trimestre riepilogo                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se riepilogo non trimestrale : no stam- *
      *                      * pa                                      *
      *                      *-----------------------------------------*
           if        rr-tip-rie           not  = 02
                     go to stp-frn-spz-150.
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lfs-l01    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Trimestre in comodo di ridefinizione    *
      *                      *-----------------------------------------*
           move      rr-tri-rie           to   w-edt-tri-rie-num      .
      *                      *-----------------------------------------*
      *                      * Unita'                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      055                  to   p-pos                  .
           move      w-edt-tri-rie-r01    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-frn-spz-150.
      *                  *---------------------------------------------*
      *                  * Stampa anno riepilogo                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lfs-l01    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Anno in comodo di ridefinizione         *
      *                      *-----------------------------------------*
           move      rr-ann-rie           to   w-edt-ann-rie-num      .
      *                      *-----------------------------------------*
      *                      * Decine                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      065                  to   p-pos                  .
           move      w-edt-ann-rie-r02    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Unita'                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      067                  to   p-pos                  .
           move      w-edt-ann-rie-r03    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-frn-spz-160.
      *                  *---------------------------------------------*
      *                  * Tipo di riepilogo                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lfs-l02    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      042                  to   p-pos                  .
      *
           if        rr-tip-rie           =    01
                     move  "M"            to   p-alf
           else if   rr-tip-rie           =    02
                     move  "T"            to   p-alf
           else      move  "A"            to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-frn-spz-200.
      *              *-------------------------------------------------*
      *              * Dati dichiarante                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Dati anagrafici azienda                     *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione [ada]                       *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                  *---------------------------------------------*
      *                  * Lettura [ada] dati anagrafici Azienda       *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODDPZ    "         to   f-key                  .
           move      zero                 to   rf-ada-cod-dpz         .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
       stp-frn-spz-210.
      *                  *---------------------------------------------*
      *                  * Stampa codice fiscale del dichiarante       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lfs-l03    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      16                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      008                  to   p-pos                  .
           move      rf-ada-cod-fis       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-frn-spz-220.
      *                  *---------------------------------------------*
      *                  * Stampa partita iva del dichiarante          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Sigla 'IT'                              *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      055                  to   p-pos                  .
           move      "IT"                 to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9B"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      057                  to   p-pos                  .
           move      rr-piv-dic           to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-frn-spz-240.
      *                  *---------------------------------------------*
      *                  * Ragione sociale dichiarante                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lfs-l04    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      08                   to   p-pos                  .
           move      s-asx                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-frn-spz-260.
      *                  *---------------------------------------------*
      *                  * Telefono dichiarante                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      65                   to   p-pos                  .
           move      rf-ada-num-tel       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-frn-spz-300.
      *                  *---------------------------------------------*
      *                  *  Indirizzo dichiarante                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lfs-l05    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      34                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      08                   to   p-pos                  .
           move      rf-ada-via-azi       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-frn-spz-320.
      *                  *---------------------------------------------*
      *                  *  CAP dichiarante                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura del codice provincia            *
      *                      *-----------------------------------------*
           move      "C"                  to   w-let-arc-gxc-tip      .
           move      rf-ada-cod-cmn       to   w-let-arc-gxc-cmn      .
           move      zero                 to   w-let-arc-gxc-fzn      .
           move      zero                 to   w-let-arc-gxc-lct      .
           perform   let-arc-gxc-000      thru let-arc-gxc-999        .
       stp-frn-spz-330.
      *                      *-----------------------------------------*
      *                      * Stampa CAP                              *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      43                   to   p-pos                  .
           move      w-let-arc-gxc-cap
                    (01 : 01)             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      45                   to   p-pos                  .
           move      w-let-arc-gxc-cap
                    (02 : 01)             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      47                   to   p-pos                  .
           move      w-let-arc-gxc-cap
                    (03 : 01)             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      49                   to   p-pos                  .
           move      w-let-arc-gxc-cap
                    (04 : 01)             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      51                   to   p-pos                  .
           move      w-let-arc-gxc-cap
                    (05 : 01)             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa localita'                        *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      19                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      53                   to   p-pos                  .
           move      w-let-arc-gxc-des    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa provincia                        *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      73                   to   p-pos                  .
           move      w-let-arc-gxc-prv
                    (01 : 01)             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      75                   to   p-pos                  .
           move      w-let-arc-gxc-prv
                    (02 : 01)             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-frn-spz-700.
      *              *-------------------------------------------------*
      *              * Stampa totali sezione 1                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale preliminare        *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lfs-l06    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagine totale                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      012                  to   p-pos                  .
           move      w-stp-ttl-num-pag    to   p-num                  .
           subtract  1                    from p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero righe totale                         *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      019                  to   p-pos                  .
           move      w-stp-ttl-num-rig    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa totale ammontare in valuta base      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      12                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      028                  to   p-pos                  .
           move      w-stp-ttl-val-tot    to   p-num                  .
           multiply  100                  by   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-frn-spz-800.
      *              *-------------------------------------------------*
      *              * Stampa data                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale preliminare        *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lfs-l07    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data stampa                                 *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      "S"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      012                  to   p-pos                  .
           move      rr-dat-stp           to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-frn-spz-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-frn-spz-999.
       stp-frn-spz-999.
           exit.

      *    *===========================================================*
      *    * Stampa dettaglio per la riga                              *
      *    *-----------------------------------------------------------*
       stp-det-rig-000.
      *              *-------------------------------------------------*
      *              * Se numero totale di pagine stampate a zero : a  *
      *              * nuova pagina                                    *
      *              *-------------------------------------------------*
           if        w-stp-ttl-num-pag    =    zero
                     go to stp-det-rig-100.
      *              *-------------------------------------------------*
      *              * Se gia' stampato il massimo numero di righe per *
      *              * pagina : a nuova pagina                         *
      *              *-------------------------------------------------*
           if        w-stp-pgn-num-rig    =    10
                     go to stp-det-rig-100.
       stp-det-rig-080.
      *              *-------------------------------------------------*
      *              * Altrimenti : ad esecuzione stampa riga corpo    *
      *              *-------------------------------------------------*
           go to     stp-det-rig-400.
       stp-det-rig-100.
      *              *-------------------------------------------------*
      *              * Nuova pagina                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se in stampa frontespizio                   *
      *                  *---------------------------------------------*
           if        rr-tip-ope           =    01
                     go to stp-det-rig-120.
       stp-det-rig-110.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   stp-int-pag-000      thru stp-int-pag-999        .
      *                  *---------------------------------------------*
      *                  * Controllo                                   *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to stp-det-rig-999.
       stp-det-rig-120.
      *                  *---------------------------------------------*
      *                  * Incremento numero totale di pagine stampate *
      *                  *---------------------------------------------*
           add       1                    to   w-stp-ttl-num-pag      .
      *                  *---------------------------------------------*
      *                  * Incremento numero pagina nell'ambito del    *
      *                  * modello                                     *
      *                  *---------------------------------------------*
           add       1                    to   w-stp-ttl-ndp-adm      .
           if        w-stp-ttl-ndp-adm    >    4
                     move  1              to   w-stp-ttl-ndp-adm      .
      *                  *---------------------------------------------*
      *                  * Valore di riporto dalla pagina precedente   *
      *                  * pari al valore totale attuale               *
      *                  *---------------------------------------------*
           move      w-stp-ttl-val-tot    to   w-stp-ttl-val-rpp      .
      *                  *---------------------------------------------*
      *                  * Numero pagina in corso di stampa pari al    *
      *                  * numero totale di pagine stampate            *
      *                  *---------------------------------------------*
           move      w-stp-ttl-num-pag    to   w-stp-pgn-num-pag      .
      *                  *---------------------------------------------*
      *                  * Numero riga in corso di stampa a zero       *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-pgn-num-rig      .
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del numero pagina    *
      *                  * nell'ambito del modello                     *
      *                  *---------------------------------------------*
           if        w-stp-ttl-ndp-adm    =    1
                     go to stp-det-rig-120
           else if   w-stp-ttl-ndp-adm    =    2
                     go to stp-det-rig-130
           else if   w-stp-ttl-ndp-adm    =    3
                     go to stp-det-rig-130
           else if   w-stp-ttl-ndp-adm    =    4
                     go to stp-det-rig-800.
       stp-det-rig-130.
      *                  *---------------------------------------------*
      *                  * Stampa mese riepilogo                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se in stampa frontespizio               *
      *                      *-----------------------------------------*
           if        rr-tip-ope           =    01
                     go to stp-det-rig-400.
      *                      *-----------------------------------------*
      *                      * Se riepilogo non mensile : no stampa    *
      *                      *-----------------------------------------*
           if        rr-tip-rie           not  = 01
                     go to stp-det-rig-140.
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lin-per    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Mese in comodo di ridefinizione         *
      *                      *-----------------------------------------*
           move      rr-mes-rie           to   w-edt-mes-rie-num      .
      *                      *-----------------------------------------*
      *                      * Decine                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      040                  to   p-pos                  .
           move      w-edt-mes-rie-r01    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Unita'                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      042                  to   p-pos                  .
           move      w-edt-mes-rie-r02    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-140.
      *                  *---------------------------------------------*
      *                  * Stampa trimestre riepilogo                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se riepilogo non trimestrale : no stam- *
      *                      * pa                                      *
      *                      *-----------------------------------------*
           if        rr-tip-rie           not  = 02
                     go to stp-det-rig-150.
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lin-per    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Trimestre in comodo di ridefinizione    *
      *                      *-----------------------------------------*
           move      rr-tri-rie           to   w-edt-tri-rie-num      .
      *                      *-----------------------------------------*
      *                      * Unita'                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      053                  to   p-pos                  .
           move      w-edt-tri-rie-r01    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-150.
      *                  *---------------------------------------------*
      *                  * Stampa anno riepilogo                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lin-per    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Anno in comodo di ridefinizione         *
      *                      *-----------------------------------------*
           move      rr-ann-rie           to   w-edt-ann-rie-num      .
      *                      *-----------------------------------------*
      *                      * Decine                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      063                  to   p-pos                  .
           move      w-edt-ann-rie-r02    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Unita'                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      065                  to   p-pos                  .
           move      w-edt-ann-rie-r03    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-160.
      *                  *---------------------------------------------*
      *                  * Stampa partita iva del dichiarante          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lin-per    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Sigla 'IT'                              *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      077                  to   p-pos                  .
           move      "IT"                 to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9B"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      079                  to   p-pos                  .
           move      rr-piv-dic           to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-170.
      *                  *---------------------------------------------*
      *                  * Stampa riporto dalla pagina precedente      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lin-rip    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c04    to   p-pos                  .
           move      w-stp-ttl-val-rpp    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-180.
      *                  *---------------------------------------------*
      *                  * Stampa numero pagina                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lin-tot    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      100                  to   p-pos                  .
           move      w-stp-pgn-num-pag    to   p-num                  .
           subtract  1                    from p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-190.
      *                  *---------------------------------------------*
      *                  * Ad esecuzione stampa riga corpo             *
      *                  *---------------------------------------------*
           go to     stp-det-rig-400.
       stp-det-rig-400.
      *              *-------------------------------------------------*
      *              * Esecuzione stampa riga corpo                    *
      *              *-------------------------------------------------*
       stp-det-rig-410.
      *                  *---------------------------------------------*
      *                  * Preparazione ammontare in valuta base       *
      *                  *---------------------------------------------*
           move      w-stp-rig-tot-aml    to   w-rdf-avb-ope-vlb      .
           if        w-rdf-avb-ope-dec    >    50
                     add   1              to   w-rdf-avb-ope-int      .
      *                  *---------------------------------------------*
      *                  * Preparazione valore statistico in valuta    *
      *                  * base                                        *
      *                  *---------------------------------------------*
           move      w-stp-rig-tot-vls    to   w-rdf-vls-ope-vlb      .
           if        w-rdf-vls-ope-dec    >    50 
                     add   1              to   w-rdf-vls-ope-int      .
      *                  *---------------------------------------------*
      *                  * Incremento numero totale di righe stampate  *
      *                  *---------------------------------------------*
           add       1                    to   w-stp-ttl-num-rig      .
      *                  *---------------------------------------------*
      *                  * Incremento valore totale in migliaia di li- *
      *                  * re                                          *
      *                  *---------------------------------------------*
           add       w-rdf-avb-ope-int    to   w-stp-ttl-val-tot      .
      *                  *---------------------------------------------*
      *                  * Incremento numero riga in corso di stampa   *
      *                  *---------------------------------------------*
           add       1                    to   w-stp-pgn-num-rig      .
      *                  *---------------------------------------------*
      *                  * Se in stampa frontespizio                   *
      *                  *---------------------------------------------*
           if        rr-tip-ope           =    01
                     go to stp-det-rig-999.
       stp-det-rig-420.
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale preliminare        *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-pgn-num-rig    to   p-lin                  .
           subtract  1                    from p-lin                  .
           multiply  2                    by   p-lin                  .
           add       w-stp-rig-lin-rig    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-430.
      *                  *---------------------------------------------*
      *                  * Stampa numero progressivo                   *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c01    to   p-pos                  .
           move      w-stp-ttl-num-rig    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-440.
      *                  *---------------------------------------------*
      *                  * Stampa codice ISO dello stato CEE cui l'o-  *
      *                  * peratore comunitario appartiene             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c02    to   p-pos                  .
           move      w-rot-l01-iso-opc    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-450.
      *                  *---------------------------------------------*
      *                  * Stampa codice iva dell'operatore comunita-  *
      *                  * rio                                         *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      13                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c03    to   p-pos                  .
           move      w-rot-l01-cdi-opi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-460.
      *                  *---------------------------------------------*
      *                  * Stampa ammontare delle operazioni in valuta *
      *                  * base                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c04    to   p-pos                  .
           move      w-rdf-avb-ope-int    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-470.
      *                  *---------------------------------------------*
      *                  * Stampa codice natura transazione            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c05    to   p-pos                  .
           move      w-rot-l01-cdn-dtr    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-480.
      *                  *---------------------------------------------*
      *                  * Stampa nomenclatura combinata               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9B"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c06    to   p-pos                  .
           move      w-rot-l01-cdn-cdm    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-490.
      *                  *---------------------------------------------*
      *                  * Se riepilogo non mensile : non si stampano  *
      *                  * ulteriori dati per la riga                  *
      *                  *---------------------------------------------*
           if        rr-tip-rie           not  = 01
                     go to stp-det-rig-570.
       stp-det-rig-500.
      *                  *---------------------------------------------*
      *                  * Stampa massa netta in chilogrammi           *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c07    to   p-pos                  .
           move      w-stp-rig-tot-mas    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-510.
      *                  *---------------------------------------------*
      *                  * Stampa quantita' espressa nell'unita' di    *
      *                  * misura supplementare                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c08    to   p-pos                  .
           move      w-stp-rig-tot-spl    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-520.
      *                  *---------------------------------------------*
      *                  * Stampa valore statistico in migliaia di li- *
      *                  * re                                          *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c09    to   p-pos                  .
           move      w-rdf-vls-ope-int    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-530.
      *                  *---------------------------------------------*
      *                  * Stampa Condizioni di consegna               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c10    to   p-pos                  .
      *
           if        w-rot-l01-cod-cdc    =    01
                     move  "E"            to   p-alf
           else if   w-rot-l01-cod-cdc    =    11
                     move  "F"            to   p-alf
           else if   w-rot-l01-cod-cdc    =    12
                     move  "F"            to   p-alf
           else if   w-rot-l01-cod-cdc    =    13
                     move  "F"            to   p-alf
           else if   w-rot-l01-cod-cdc    =    21
                     move  "C"            to   p-alf
           else if   w-rot-l01-cod-cdc    =    22
                     move  "C"            to   p-alf
           else if   w-rot-l01-cod-cdc    =    23
                     move  "C"            to   p-alf
           else if   w-rot-l01-cod-cdc    =    24
                     move  "C"            to   p-alf
           else if   w-rot-l01-cod-cdc    =    31
                     move  "D"            to   p-alf
           else if   w-rot-l01-cod-cdc    =    32
                     move  "D"            to   p-alf
           else if   w-rot-l01-cod-cdc    =    33
                     move  "D"            to   p-alf
           else if   w-rot-l01-cod-cdc    =    34
                     move  "D"            to   p-alf
           else if   w-rot-l01-cod-cdc    =    35
                     move  "D"            to   p-alf
           else      move  spaces         to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-540.
      *                  *---------------------------------------------*
      *                  * Stampa codice modo del trasporto            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c11    to   p-pos                  .
           move      w-rot-l01-cod-mdt    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-550.
      *                  *---------------------------------------------*
      *                  * Stampa codice ISO del paese di destinazione *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c12    to   p-pos                  .
           move      w-rot-l01-iso-pod    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-560.
      *                  *---------------------------------------------*
      *                  * Stampa codice provincia di origine          *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c13    to   p-pos                  .
           move      w-rot-l01-pvc-ood    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-570.
      *                  *---------------------------------------------*
      *                  * Stampa codice stato di origine merce        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c14    to   p-pos                  .
           move      w-rot-l01-iso-org    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-590.
      *                  *---------------------------------------------*
      *                  * Ad esecuzione stampa totale riepilogo       *
      *                  *---------------------------------------------*
           go to     stp-det-rig-700.
       stp-det-rig-700.
      *              *-------------------------------------------------*
      *              * Esecuzione stampa totale riepilogo              *
      *              *-------------------------------------------------*
       stp-det-rig-710.
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale preliminare        *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-stp-rig-lin-tot    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-720.
      *                  *---------------------------------------------*
      *                  * Stampa totale riepilogo in valuta base      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-rig-pos-c04    to   p-pos                  .
           move      w-stp-ttl-val-tot    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-730.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     stp-det-rig-999.
       stp-det-rig-800.
      *                  *---------------------------------------------*
      *                  * Se in stampa frontespizio                   *
      *                  *---------------------------------------------*
           if        rr-tip-ope           =    01
                     go to stp-det-rig-820.
      *                  *---------------------------------------------*
      *                  * Stampa di un puntino per foglio bianco      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      01                   to   p-lin                  .
           move      01                   to   p-pos                  .
           move      "."                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-det-rig-820.
      *                  *---------------------------------------------*
      *                  * Ad intestazione                             *
      *                  *---------------------------------------------*
           go to     stp-det-rig-100.
       stp-det-rig-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-det-rig-999.
       stp-det-rig-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Emissione riga di dettaglio        *
      *    *-----------------------------------------------------------*
       emi-det-rig-000.
      *              *-------------------------------------------------*
      *              * Preparazione record                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione ammontare in valuta base       *
      *                  * presumendo che abbia 2 decimali e che i     *
      *                  * valori da esporre sia senza decimali        *
      *                  *---------------------------------------------*
           move      w-stp-rig-tot-aml    to   w-rdf-avb-ope-vlb      .
           if        w-rdf-avb-ope-dec    >    50 
                     add   1              to   w-rdf-avb-ope-int      .
      *                  *---------------------------------------------*
      *                  * Preparazione valore statistico in valuta    *
      *                  * base                                        *
      *                  *---------------------------------------------*
           move      w-stp-rig-tot-vls    to   w-rdf-vls-ope-vlb      .
           if        w-rdf-vls-ope-dec    >    50 
                     add   1              to   w-rdf-vls-ope-int      .
       emi-det-rig-100.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Separatori                                  *
      *                  *---------------------------------------------*
           move      w-det-fin-rig-tab    to   w-rdt-sep-001
                                               w-rdt-sep-002
                                               w-rdt-sep-003
                                               w-rdt-sep-004
                                               w-rdt-sep-005
                                               w-rdt-sep-006
                                               w-rdt-sep-007
                                               w-rdt-sep-008
                                               w-rdt-sep-009
                                               w-rdt-sep-010
                                               w-rdt-sep-011
                                               w-rdt-sep-012
                                               w-rdt-sep-013
                                               w-rdt-sep-014
                                               w-rdt-sep-015
                                               w-rdt-sep-016
                                               w-rdt-sep-017          .
      *                  *---------------------------------------------*
      *                  * Codice nomenclatura combinata               *
      *                  *---------------------------------------------*
           move      w-rot-l01-cdn-cdm    to   w-rdt-cdn-cdm          .
      *                  *---------------------------------------------*
      *                  * Natura della transazione                    *
      *                  *---------------------------------------------*
           move      w-rot-l01-cdn-dtr    to   w-rdt-cdn-dtr          .
      *                  *---------------------------------------------*
      *                  * Condizioni di consegna                      *
      *                  *---------------------------------------------*
           if        w-rot-l01-cod-cdc    =    01
                     move  "E"            to   w-rdt-cod-cdc
           else if   w-rot-l01-cod-cdc    =    11
                     move  "F"            to   w-rdt-cod-cdc
           else if   w-rot-l01-cod-cdc    =    12
                     move  "F"            to   w-rdt-cod-cdc
           else if   w-rot-l01-cod-cdc    =    13
                     move  "F"            to   w-rdt-cod-cdc
           else if   w-rot-l01-cod-cdc    =    21
                     move  "C"            to   w-rdt-cod-cdc
           else if   w-rot-l01-cod-cdc    =    22
                     move  "C"            to   w-rdt-cod-cdc
           else if   w-rot-l01-cod-cdc    =    23
                     move  "C"            to   w-rdt-cod-cdc
           else if   w-rot-l01-cod-cdc    =    24
                     move  "C"            to   w-rdt-cod-cdc
           else if   w-rot-l01-cod-cdc    =    31
                     move  "D"            to   w-rdt-cod-cdc
           else if   w-rot-l01-cod-cdc    =    32
                     move  "D"            to   w-rdt-cod-cdc
           else if   w-rot-l01-cod-cdc    =    33
                     move  "D"            to   w-rdt-cod-cdc
           else if   w-rot-l01-cod-cdc    =    34
                     move  "D"            to   w-rdt-cod-cdc
           else if   w-rot-l01-cod-cdc    =    35
                     move  "D"            to   w-rdt-cod-cdc
           else      move  spaces         to   w-rdt-cod-cdc          .
      *                  *---------------------------------------------*
      *                  * Flag statistico / fiscale                   *
      *                  *---------------------------------------------*
           move      "F"                  to   w-rdt-flg-stf          .
      *                  *---------------------------------------------*
      *                  * Paese di destinazione                       *
      *                  *---------------------------------------------*
           move      w-rot-l01-iso-opc    to   w-rdt-iso-pod          .
      *                  *---------------------------------------------*
      *                  * Paese di origine                            *
      *                  *---------------------------------------------*
           move      "IT"                 to   w-rdt-iso-poo          .
      *                  *---------------------------------------------*
      *                  * Provincia paese di origine                  *
      *                  *---------------------------------------------*
           move      w-rot-l01-pvc-ood    to   w-rdt-pvc-ood          .
      *                  *---------------------------------------------*
      *                  * Massa netta                                 *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      12                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-stp-rig-tot-mas    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-rdt-tot-mas          .
      *                  *---------------------------------------------*
      *                  * Unita' supplementare                        *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      13                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-stp-rig-tot-spl    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-rdt-tot-spl          .
      *                  *---------------------------------------------*
      *                  * Codice fiscale partner                      *
      *                  *---------------------------------------------*
           move      w-rot-l01-cdi-opi    to   w-rdt-cod-fis          .
      *                  *---------------------------------------------*
      *                  * Modalita' di trasporto                      *
      *                  *---------------------------------------------*
           move      w-rot-l01-cod-mdt    to   w-rdt-cod-mdt          .
      *                  *---------------------------------------------*
      *                  * Ammontare operazioni                        *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      13                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-rdf-avb-ope-int    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-rdt-aml-ope          .
      *                  *---------------------------------------------*
      *                  * Valore statistico                           *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      13                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-rdf-vls-ope-int    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-rdt-vls-iml          .
       emi-det-rig-300.
      *                  *---------------------------------------------*
      *                  * Riferimento interno                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing anno                            *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      rr-ann-rie           to   p-num                  .
           add       1900                 to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione del tipo di      *
      *                      * riepilogo                               *
      *                      *-----------------------------------------*
           if        rr-tip-rie           =    01
                     go to emi-det-rig-310
           else if   rr-tip-rie           =    02
                     go to emi-det-rig-320
           else      go to emi-det-rig-330.
       emi-det-rig-310.
      *                      *-----------------------------------------*
      *                      * Mensile                                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Mese in comodo di ridefinizione     *
      *                          *-------------------------------------*
           move      rr-mes-rie           to   w-edt-mes-rie-num      .
      *                          *-------------------------------------*
      *                          * Composizione riferimento            *
      *                          *-------------------------------------*
           move      14                   to   w-all-str-lun          .
           move      06                   to   w-all-str-num          .
           move      "M"                  to   w-all-str-cat (1)      .
           move      w-edt-mes-rie-r01    to   w-all-str-cat (2)      .
           move      w-edt-mes-rie-r02    to   w-all-str-cat (3)      .
           move      "-"                  to   w-all-str-cat (4)      .
           move      p-edt                to   w-all-str-cat (5)      .
           move      "-CES"               to   w-all-str-cat (6)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-rdt-rif-int          .
      *                          *-------------------------------------*
      *                          * Oltre                               *
      *                          *-------------------------------------*
           go to     emi-det-rig-400.
       emi-det-rig-320.
      *                      *-----------------------------------------*
      *                      * Trimestrale                             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Trimestre in comodo di ridefinizione*
      *                          *-------------------------------------*
           move      rr-tri-rie           to   w-edt-tri-rie-num      .
      *                          *-------------------------------------*
      *                          * Composizione riferimento            *
      *                          *-------------------------------------*
           move      14                   to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
           move      "T"                  to   w-all-str-cat (1)      .
           move      w-edt-tri-rie-r01    to   w-all-str-cat (2)      .
           move      "-"                  to   w-all-str-cat (3)      .
           move      p-edt                to   w-all-str-cat (4)      .
           move      "-CES"               to   w-all-str-cat (5)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-rdt-rif-int          .
      *                          *-------------------------------------*
      *                          * Oltre                               *
      *                          *-------------------------------------*
           go to     emi-det-rig-400.
       emi-det-rig-330.
      *                      *-----------------------------------------*
      *                      * Annuale                                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Trimestre in comodo di ridefinizione*
      *                          *-------------------------------------*
           move      rr-tri-rie           to   w-edt-tri-rie-num      .
      *                          *-------------------------------------*
      *                          * Composizione riferimento            *
      *                          *-------------------------------------*
           move      14                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "A"                  to   w-all-str-cat (1)      .
           move      p-edt                to   w-all-str-cat (2)      .
           move      "-CES"               to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-rdt-rif-int          .
      *                          *-------------------------------------*
      *                          * Oltre                               *
      *                          *-------------------------------------*
           go to     emi-det-rig-400.
       emi-det-rig-400.
      *                  *---------------------------------------------*
      *                  * Importo in valuta                           *
      *                  *---------------------------------------------*
           move      "0000000000"         to   w-rdt-imp-vlt          .
      *                  *---------------------------------------------*
      *                  * Codice valuta                               *
      *                  *---------------------------------------------*
           move      spaces               to   w-rdt-cod-vlt          .
      *                  *---------------------------------------------*
      *                  * Nome formula                                *
      *                  *---------------------------------------------*
           move      spaces               to   w-rdt-nom-fml          .
      *                  *---------------------------------------------*
      *                  * Indicatore di valuta                        *
      *                  *---------------------------------------------*
           move      spaces               to   w-rdt-ind-vlt          .
      *                  *---------------------------------------------*
      *                  * Composizione carattere di fine record       *
      *                  *---------------------------------------------*
           move      w-scr-fso-cfr        to   w-rdt-chr-end          .
       emi-det-rig-600.
      *              *-------------------------------------------------*
      *              * Scrittura record                                *
      *              *-------------------------------------------------*
           move      w-rdt                to   g-rec                  .
           move      "PN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       emi-det-rig-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-det-rig-999.
       emi-det-rig-999.
           exit.

      *    *===========================================================*
      *    * Subroutine per l'intestazione della pagina                *
      *    *-----------------------------------------------------------*
       stp-int-pag-000.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Se errore grave di i-o su stampa si pone in On  *
      *              * il flag di interruzione forzata e si esce imme- *
      *              * diatamente                                      *
      *              *-------------------------------------------------*
           if        p-rsc                not  = spaces
                     move  "#"            to   w-cnt-prn-flg-int
                     go to stp-int-pag-999.
       stp-int-pag-999.
           exit.

      *    *===========================================================*
      *    * Determinazione pathname completo per il file di appoggio  *
      *    * in output                                                 *
      *    *-----------------------------------------------------------*
       det-pth-fso-000.
      *              *-------------------------------------------------*
      *              * Preparazione nome file completo                 *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-pth-fso-pth      .
      *              *-------------------------------------------------*
      *              * Pathname da segreteria                          *
      *              *-------------------------------------------------*
           move      "UE"                 to   s-ope                  .
           move      "TXT "               to   s-nam                  .
           move      spaces               to   s-tip                  .
           call      "swd/mod/prg/obj/msegrt"
                                          using s                     .
      *              *-------------------------------------------------*
      *              * Pathname determinati                            *
      *              *-------------------------------------------------*
           move      s-pat                to   w-det-pth-fso-pth      .
       det-pth-fso-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [gxc]                         *
      *    *-----------------------------------------------------------*
       let-arc-gxc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-gxc-flg      .
      *              *-------------------------------------------------*
      *              * Deviazione secondo il tipo elemento             *
      *              *-------------------------------------------------*
           if        w-let-arc-gxc-tip    =    "C"
                     go to let-arc-gxc-100
           else if   w-let-arc-gxc-tip    =    "F"
                     go to let-arc-gxc-200
           else if   w-let-arc-gxc-tip    =    "L"
                     go to let-arc-gxc-300.
       let-arc-gxc-100.
      *              *-------------------------------------------------*
      *              * Se tipo elemento : Comune                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se codice a zero                       *
      *                  *---------------------------------------------*
           if        w-let-arc-gxc-cmn    =    zero
                     go to let-arc-gxc-400.
      *                  *---------------------------------------------*
      *                  * Lettura Comune                              *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      w-let-arc-gxc-cmn    to   rf-gxc-cod-cmn         .
           move      zero                 to   rf-gxc-cod-fzn         .
           move      zero                 to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se record esistente    *
      *                  * oppure no                                   *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to let-arc-gxc-600
           else      go to let-arc-gxc-500.
       let-arc-gxc-200.
      *              *-------------------------------------------------*
      *              * Se tipo elemento : Frazione                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se codice a zero                       *
      *                  *---------------------------------------------*
           if        w-let-arc-gxc-cmn    =    zero or
                     w-let-arc-gxc-fzn    =    zero
                     go to let-arc-gxc-400.
      *                  *---------------------------------------------*
      *                  * Lettura Frazione                            *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      w-let-arc-gxc-cmn    to   rf-gxc-cod-cmn         .
           move      w-let-arc-gxc-fzn    to   rf-gxc-cod-fzn         .
           move      zero                 to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se record esistente    *
      *                  * oppure no                                   *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to let-arc-gxc-600
           else      go to let-arc-gxc-500.
       let-arc-gxc-300.
      *              *-------------------------------------------------*
      *              * Se tipo elemento : Localita'                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se codice a zero                       *
      *                  *---------------------------------------------*
           if        w-let-arc-gxc-cmn    =    zero or
                     w-let-arc-gxc-lct    =    zero
                     go to let-arc-gxc-400.
      *                  *---------------------------------------------*
      *                  * Lettura Localita'                           *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      w-let-arc-gxc-cmn    to   rf-gxc-cod-cmn         .
           move      w-let-arc-gxc-fzn    to   rf-gxc-cod-fzn         .
           move      w-let-arc-gxc-lct    to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se record esistente    *
      *                  * oppure no                                   *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to let-arc-gxc-600
           else      go to let-arc-gxc-500.
       let-arc-gxc-400.
      *              *-------------------------------------------------*
      *              * Se codice elemento a zero                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione work area                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-arc-gxc-des      .
           move      spaces               to   w-let-arc-gxc-prv      .
           move      spaces               to   w-let-arc-gxc-cap      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-gxc-999.
       let-arc-gxc-500.
      *              *-------------------------------------------------*
      *              * Se codice elemento non esistente                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione work area                   *
      *                  *---------------------------------------------*
           move      all   "."            to   w-let-arc-gxc-des      .
           move      spaces               to   w-let-arc-gxc-prv      .
           move      spaces               to   w-let-arc-gxc-cap      .
      *                  *---------------------------------------------*
      *                  * Flag di uscita a non trovato                *
      *                  *---------------------------------------------*
           move      "#"                  to   w-let-arc-gxc-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-gxc-999.
       let-arc-gxc-600.
      *              *-------------------------------------------------*
      *              * Se codice elemento esistente                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione in work area                *
      *                  *---------------------------------------------*
           move      rf-gxc-des-cfl       to   w-let-arc-gxc-des      .
           move      rf-gxc-cod-prv       to   w-let-arc-gxc-prv      .
           move      rf-gxc-cap-avp       to   w-let-arc-gxc-cap      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-gxc-999.
       let-arc-gxc-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

