       Identification division.
       Program-Id.                                 pcge7601           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    cge                 *
      *                                Settore:    iva                 *
      *                                   Fase:    cge760              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 27/12/18    *
      *                       Ultima revisione:    NdK del 03/01/22    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      *                    *****************************************   *
      *                    *****************************************   *
      *                    *****************************************   *
      *                        UTILIZZATO 'alx-exp' di [mgi] !!!       *
      *                      Per evitare doppioni tra 'scf420' ed      *
      *                                  Esterometro                   *
      *                    *****************************************   *
      *                    *****************************************   *
      *                    *****************************************   *
      *                                                                *
      * Descrizione pgm:   Esecuzione stampa per il programma cge7600  *
      *                                                                *
      *                    Emissione elenchi Clienti e Fornitori       *
      *                    estero (Esterometro)                        *
      *                                                                *
      *                    N.B.: In vigore da 1 gennaio 2021 fino a    *
      *                          dicembre 2021                         *
      *                                                                *
      *                    Versione AdE 1.2 febbraio 2018              *
      *                                                                *
      *                    MANCA INVERSIONE SEGNO 'NA' IN FILES DI     *
      *                    CONTROLLO                                   *
      *                                                                *
      *                    *****************************************   *
      *                    UTILIZZATO PER DOCUMENTI FINO AL 31/12/21   *
      *                    *****************************************   *
      * -------------------------------------------------------------- *
      *                                                                *
      * 2 file di esportazione XML, per Agenzia delle Entrate :        *
      *                                                                *
      * '/abd/asc/cbi/IT99999999999_DF_E99X9.xml'    Clienti           *
      * '/abd/asc/cbi/IT99999999999_DF_R99X9.xml'    Fornitori         *
      *                                                                *
      * 2 file di esportazione CSV, per controlli uso interno :        *
      *                                                                *
      * '/abd/asc/cbi/IT99999999999_DF_E99X9.CSV'    Clienti           *
      * '/abd/asc/cbi/IT99999999999_DF_R99X9.CSV'    Fornitori         *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      *    *===========================================================*
      *    * File Control [kk0]                                        *
      *    *-----------------------------------------------------------*
           select  optional  kk0   assign to disk           f-kk0-pat
                             organization is indexed
                             access mode  is dynamic
                             record key   is kk0-key
                             file status  is                f-kk0-sts .

      *    *===========================================================*
      *    * File Control [kk1]                                        *
      *    *-----------------------------------------------------------*
           select  optional  kk1   assign to disk           f-kk1-pat
                             organization is indexed
                             access mode  is dynamic
                             record key   is kk1-key
                             file status  is                f-kk1-sts .

      *    *===========================================================*
      *    * File Control [kk2]                                        *
      *    *-----------------------------------------------------------*
           select  optional  kk2   assign to disk           f-kk2-pat
                             organization is indexed
                             access mode  is dynamic
                             record key   is kk2-key
                             file status  is                f-kk2-sts .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Tipo archivio                                     *
      *            *---------------------------------------------------*
               10  srt-tip-arc            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale in chiave                         *
      *            *---------------------------------------------------*
               10  srt-rag-key            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice archivio in chiave                         *
      *            *---------------------------------------------------*
               10  srt-cod-key            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data registrazione                                *
      *            *---------------------------------------------------*
               10  srt-dat-reg            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero documento in chiave                        *
      *            *---------------------------------------------------*
               10  srt-num-key            pic  x(12)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Protocollo                                        *
      *            *---------------------------------------------------*
               10  srt-num-prt            pic  9(09)                  .
      *            *---------------------------------------------------*
      *            * Codice archivio                                   *
      *            *---------------------------------------------------*
               10  srt-cod-arc            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice Fornitore reale - solo Bolle Doganali      *
      *            *---------------------------------------------------*
               10  srt-cod-bdg            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Ragione Sociale                                   *
      *            *---------------------------------------------------*
               10  srt-rag-soc            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Indirizzo                                         *
      *            *---------------------------------------------------*
               10  srt-via-arc            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Localita'                                         *
      *            *---------------------------------------------------*
               10  srt-loc-arc            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice comune                                     *
      *            *---------------------------------------------------*
               10  srt-cmn-arc            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice nazione                                    *
      *            *---------------------------------------------------*
               10  srt-naz-arc            pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Partita IVA                                       *
      *            *---------------------------------------------------*
               10  srt-prt-iva            pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Codice fiscale                                    *
      *            *---------------------------------------------------*
               10  srt-cod-fis            pic  x(16)                  .
      *            *---------------------------------------------------*
      *            * Data documento                                    *
      *            *---------------------------------------------------*
               10  srt-dat-doc            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero documento                                  *
      *            *---------------------------------------------------*
               10  srt-num-doc            pic  x(13)                  .
      *            *---------------------------------------------------*
      *            * Codice numerazione                                *
      *            *---------------------------------------------------*
               10  srt-cod-num            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Protocollo iva per stampa su giornale             *
      *            *---------------------------------------------------*
               10  srt-prt-gio            pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Tipo movimento iva                                *
      *            *                                                   *
      *            * - 1 : Dare cliente Italia o Estero non CEE        *
      *            * - 2 : Avere cliente Italia o Estero non CEE       *
      *            * - 3 : Corrispettivi Italia o Estero non CEE       *
      *            *                                                   *
      *            * - 4 : Dare fornitore Italia o Estero non CEE      *
      *            * - 5 : Avere fornitore Italia o Estero non CEE     *
      *            * - 6 : Bolla doganale Estero non CEE               *
      *            *                                                   *
      *            * - A : Dare cliente Estero CEE                     *
      *            * - B : Avere cliente Estero CEE                    *
      *            *                                                   *
      *            * - D : Dare fornitore Estero CEE                   *
      *            * - E : Avere fornitore Estero CEE                  *
      *            *---------------------------------------------------*
               10  srt-tip-iva            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo documento                                    *
      *            *                                                   *
      *            * - F : Fattura                                     *
      *            * - M : Fattura CEE merce                           *
      *            * - S : Fattura CEE servizi                         *
      *            * - D : Nota di debito                              *
      *            * - C : Nota di credito                             *
      *            *---------------------------------------------------*
               10  srt-tip-doc            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Castelletto iva                                   *
      *            *---------------------------------------------------*
               10  srt-cst-iva   occurs 6.
      *                *-----------------------------------------------*
      *                * Imponibile                                    *
      *                *-----------------------------------------------*
                   15  srt-ibl-iva        pic s9(11)       sign is
                                                           trailing
                                                           separate
                                                           character  .
      *                *-----------------------------------------------*
      *                * Aliquota iva                                  *
      *                *-----------------------------------------------*
                   15  srt-cod-iva        pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Importo iva                                   *
      *                *-----------------------------------------------*
                   15  srt-imp-iva        pic s9(11)       sign is
                                                           trailing
                                                           separate
                                                           character  .
      *                *-----------------------------------------------*
      *                * Si/no in liquidazione periodica               *
      *                *-----------------------------------------------*
                   15  srt-snx-lqp        pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Natura dell'operazione                        *
      *                *-----------------------------------------------*
                   15  srt-cod-nop        pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Totale documento                                  *
      *            *---------------------------------------------------*
               10  srt-tot-doc            pic s9(11)       sign is
                                                           trailing
                                                           separate
                                                           character  .
      *            *---------------------------------------------------*
      *            * Anno corrente o precedente                        *
      *            *                                                   *
      *            * spaces : Anno corrente                            *
      *            * 'P'    : Anno precedente                          *
      *            *---------------------------------------------------*
               10  srt-flg-cop            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di regime fiscale particolare                *
      *            *                                                   *
      *            * - Spaces o N : Normale regime fiscale             *
      *            * - S          : Regime di Scissione Pagamenti      *
      *            * - R          : Regime di Reverse Charge           *
      *            * - E          : Esclusione da dichiarazione an.    *
      *            *---------------------------------------------------*
               10  srt-flg-rfp            pic  x(01)                  .

      *    *===========================================================*
      *    * File Description [kk0]                                    *
      *    *-----------------------------------------------------------*
       fd  kk0       label record standard                            .

      *    *===========================================================*
      *    * Record file di appoggio [kk0]                             *
      *    *-----------------------------------------------------------*
       01  kk0-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  kk0-key.
      *            *---------------------------------------------------*
      *            * Data documento                                    *
      *            *---------------------------------------------------*
               10  kk0-dat-doc            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Protocollo contabile                              *
      *            *---------------------------------------------------*
               10  kk0-num-prt            pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  kk0-dat.
      *            *---------------------------------------------------*
      *            * Sigla numerazione                                 *
      *            *---------------------------------------------------*
               10  kk0-sgl-num            pic  x(03)                  .

      *    *===========================================================*
      *    * File Description [kk1]                                    *
      *    *-----------------------------------------------------------*
       fd  kk1       label record standard                            .

      *    *===========================================================*
      *    * Record file di appoggio [kk1]                             *
      *    *-----------------------------------------------------------*
       01  kk1-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  kk1-key.
      *            *---------------------------------------------------*
      *            * Contatore progressivo                             *
      *            *---------------------------------------------------*
               10  kk1-ctr-prg            pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  kk1-dat.
      *            *---------------------------------------------------*
      *            * Stringa di errore                                 *
      *            *---------------------------------------------------*
               10  kk1-str-err            pic  x(80)                  .

      *    *===========================================================*
      *    * File Description [kk2]                                    *
      *    *-----------------------------------------------------------*
       fd  kk2       label record standard                            .

      *    *===========================================================*
      *    * Record file di appoggio [kk2]                             *
      *    *-----------------------------------------------------------*
       01  kk2-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  kk2-key.
      *            *---------------------------------------------------*
      *            * Contatore progressivo                             *
      *            *---------------------------------------------------*
               10  kk2-ctr-prg            pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  kk2-dat.
      *            *---------------------------------------------------*
      *            * Tipo record                                       *
      *            *---------------------------------------------------*
               10  kk2-tip-rec            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Intero record di sort                             *
      *            *---------------------------------------------------*
               10  kk2-srt-rec.
                   15  filler occurs 1024 pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * File area per [kk0]                                       *
      *    *-----------------------------------------------------------*
       01  f-kk0.
           05  f-kk0-nam                  pic  x(04)                  .
           05  f-kk0-pat                  pic  x(40)                  .
           05  f-kk0-sts                  pic  x(02)                  .

      *    *===========================================================*
      *    * File area per [kk1]                                       *
      *    *-----------------------------------------------------------*
       01  f-kk1.
           05  f-kk1-nam                  pic  x(04)                  .
           05  f-kk1-pat                  pic  x(40)                  .
           05  f-kk1-sts                  pic  x(02)                  .

      *    *===========================================================*
      *    * File area per [kk2]                                       *
      *    *-----------------------------------------------------------*
       01  f-kk2.
           05  f-kk2-nam                  pic  x(04)                  .
           05  f-kk2-pat                  pic  x(40)                  .
           05  f-kk2-sts                  pic  x(02)                  .

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "cge"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "iva"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "cge760"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pcge7601"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "ELENCO FATTURE ESTERO EMESSE E RICEVUTE "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output su files *
      *    * di tipo line sequential                                   *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/g"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [ada]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/azi/fls/rec/rfada"                          .
      *        *-------------------------------------------------------*
      *        * [gxc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/geo/fls/rec/rfgxc"                          .
      *        *-------------------------------------------------------*
      *        * [fit]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/fat/fls/rec/rffit"                          .
      *        *-------------------------------------------------------*
      *        * [mgi]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfmgi"                          .
      *        *-------------------------------------------------------*
      *        * [mgt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfmgt"                          .
      *        *-------------------------------------------------------*
      *        * [zci]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfzci"                          .
      *        *-------------------------------------------------------*
      *        * [zcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfzcc"                          .
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .

      *    *===========================================================*
      *    * Record per le richieste                                   *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Data inziale                                          *
      *        *-------------------------------------------------------*
           05  rr-dat-ini                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Data finale                                           *
      *        *-------------------------------------------------------*
           05  rr-dat-fin                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Periodo di riferimento, tipo range ed indice          *
      *        *                                                       *
      *        *  - M.01..12 : n. Mese                                 *
      *        *-------------------------------------------------------*
           05  rr-prd-tpr.
               10  rr-prd-tpr-rng         pic  x(01)                  .
               10  rr-prd-tpr-inx         pic  9(02)                  .
           05  rr-prd-tpr-lit             pic  x(16)                  .

      *    *===========================================================*
      *    * Work-area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Tipo di sequenziale da preparare                      *
      *        *-------------------------------------------------------*
           05  w-prs-tip-seq.
               10  w-prs-tip-seq-tip      pic  x(01)                  .

      *    *===========================================================*
      *    * Area per controllo formale su partita i.v.a.              *
      *    *-----------------------------------------------------------*
       01  w-cnt-piv.
           05  w-cnt-piv-piv              pic  9(11)                  .
           05  w-cnt-piv-pir redefines
               w-cnt-piv-piv.
               10  w-cnt-piv-chr occurs 11
                                          pic  9(01)                  .
           05  w-cnt-piv-flg              pic  x(01)                  .
           05  w-cnt-piv-ctr              pic  9(02)                  .
           05  w-cnt-piv-sum              pic  9(03)                  .
           05  w-cnt-piv-w20              pic  9(02)                  .
           05  w-cnt-piv-w2r redefines
               w-cnt-piv-w20                                          .
               10  w-cnt-piv-w21          pic  9(01)                  .
               10  w-cnt-piv-w22          pic  9(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su tabella [zcc]                         *
      *        *-------------------------------------------------------*
           05  w-let-arc-zcc.
               10  w-let-arc-zcc-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [gxc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-gxc.
               10  w-let-arc-gxc-flg      pic  x(01)                  .
               10  w-let-arc-gxc-tip      pic  x(01)                  .
               10  w-let-arc-gxc-cmn      pic  9(05)                  .
               10  w-let-arc-gxc-fzn      pic  9(03)                  .
               10  w-let-arc-gxc-lct      pic  9(03)                  .
               10  w-let-arc-gxc-des      pic  x(30)                  .
               10  w-let-arc-gxc-prv      pic  x(02)                  .
               10  w-let-arc-gxc-cap      pic  x(05)                  .

      *    *===========================================================*
      *    * Work-area totali                                          *
      *    *-----------------------------------------------------------*
       01  w-tot.
      *        *-------------------------------------------------------*
      *        * Totali generali                                       *
      *        *-------------------------------------------------------*
           05  w-tot-gen.
      *            *---------------------------------------------------*
      *            * Totali contatori                                  *
      *            *---------------------------------------------------*
               10  w-tot-gen-ctr.
                   15  w-tot-gen-ctr-ele  pic  9(09)                  .
                   15  w-tot-gen-ctr-doc  pic  9(09)                  .
      *        *-------------------------------------------------------*
      *        * Totali IVA                                            *
      *        *-------------------------------------------------------*
           05  w-tot-iva.
      *            *---------------------------------------------------*
      *            * Totali mensili                                    *
      *            *---------------------------------------------------*
               10  w-tot-iva-ele-sax      pic  9(03)                  .
               10  w-tot-iva-ele-mex      pic  9(02)                  .
               10  w-tot-iva-ele-mmi      pic  9(02)                  .
               10  w-tot-iva-ele-mma      pic  9(02)                  .
               10  w-tot-iva-ele-ctr      pic  9(02)                  .
               10  w-tot-iva-ele-ele occurs   12
                                 indexed  by   w-tot-iva-ele-inx      .
                   15  w-tot-iva-ele-saa  pic  9(03)                  .
                   15  w-tot-iva-ele-mes  pic  9(02)                  .
                   15  w-tot-iva-ele-ibv  pic s9(13)                  .
                   15  w-tot-iva-ele-imv  pic s9(13)                  .
                   15  w-tot-iva-ele-iba  pic s9(13)                  .
                   15  w-tot-iva-ele-ima  pic s9(13)                  .
      *        *-------------------------------------------------------*
      *        * Totali per castelletto iva                            *
      *        *-------------------------------------------------------*
           05  w-tot-ibl-fat              pic s9(13)                  .
           05  w-tot-imp-fat              pic s9(13)                  .
           05  w-tot-ibl-acq              pic s9(13)                  .
           05  w-tot-imp-acq              pic s9(13)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det pathname file sequenziale in output      *
      *        *-------------------------------------------------------*
           05  w-det-pth-fso.
               10  w-det-pth-fso-nam      pic  x(30)                  .
               10  w-det-pth-fso-ute      pic  x(08)                  .
               10  w-det-pth-fso-pat      pic  x(40)                  .
               10  w-det-pth-fso-pth      pic  x(40)                  .
               10  w-det-pth-fso-ext      pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det date di scansione                        *
      *        *-------------------------------------------------------*
           05  w-det-dat-srt.
               10  w-det-dat-srt-min      pic  9(07)                  .
               10  w-det-dat-srt-max      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per editing                                      *
      *        *-------------------------------------------------------*
           05  w-det-edt-val.
               10  w-det-edt-val-mes      pic  x(02)                  .
               10  w-det-edt-val-ann      pic  x(02)                  .
               10  w-det-edt-val-ide      pic  x(05)                  .
               10  w-det-edt-val-nat      pic  x(04)                  .
               10  w-det-edt-val-gio      pic  x(01)                  .
               10  w-det-edt-cod-fis      pic  x(16)                  .
               10  w-det-edt-cod-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det castelletto Iva                          *
      *        *-------------------------------------------------------*
           05  w-det-cst-iva.
               10  w-det-cst-iva-ctr      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per fornitore bolla doganale                     *
      *        *-------------------------------------------------------*
           05  w-det-fnt-bdg.
               10  w-det-fnt-bdg-cod      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Per Fine riga                                         *
      *        *-------------------------------------------------------*
           05  w-det-fin-rig.
      *            *---------------------------------------------------*
      *            * Separatore 'CR'                                   *
      *            *---------------------------------------------------*
               10  w-det-fin-rig-chr      pic  x(01)   value H"0D"    .
      *            *---------------------------------------------------*
      *            * Separatori                                        *
      *            *---------------------------------------------------*
               10  w-det-fin-rig-tab      pic  x(01)   value H"09"    .
               10  w-det-fin-rig-pvg      pic  x(01)   value ";"      .
      *        *-------------------------------------------------------*
      *        * Work per trattamento elemento Iva                     *
      *        *-------------------------------------------------------*
           05  w-det-trt-iva.
               10  w-det-trt-iva-ibl      pic s9(11)                  .
               10  w-det-trt-iva-cod      pic  9(02)                  .
               10  w-det-trt-iva-imp      pic s9(11)                  .
               10  w-det-trt-iva-w01      pic s9(11)                  .

      *    *===========================================================*
      *    * Work per subroutines di editing codice iva                *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/wedtzci0.wkl"                   .

      *    *===========================================================*
      *    * Work-area per routine stp-srt-inp-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-stp-srt-inp.
      *        *-------------------------------------------------------*
      *        * Comodi                                                *
      *        *-------------------------------------------------------*
           05  w-stp-srt-tip              pic  x(01)                  .
           05  w-stp-srt-sgl              pic  x(03)                  .
           05  w-stp-srt-ctr              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Elementi esclusi                                      *
      *        *-------------------------------------------------------*
           05  w-stp-arc-esc.
               10  w-stp-arc-esc-ctr      pic  9(05)                  .
               10  w-stp-arc-esc-ele occurs    999
                                 indexed  by   w-stp-arc-esc-inx      .
                   15  w-stp-arc-esc-tip  pic  x(01)                  .
                   15  w-stp-arc-esc-cod  pic  9(07)                  .

      *    *===========================================================*
      *    * Work area per bufferizzazione                             *
      *    *-----------------------------------------------------------*
       01  w-buf.
      *        *-------------------------------------------------------*
      *        * Bufferizzazione anagrafica archivio                   *
      *        *-------------------------------------------------------*
           05  w-buf-arc.
               10  w-buf-arc-cod          pic  9(07)                  .
               10  w-buf-arc-rag          pic  x(40)                  .
               10  w-buf-arc-via          pic  x(40)                  .
               10  w-buf-arc-loc          pic  x(40)                  .
               10  w-buf-arc-piv          pic  9(11)                  .
               10  w-buf-arc-cfi          pic  x(16)                  .
               10  w-buf-arc-pid          pic  x(01)                  .

      *    *===========================================================*
      *    * Work per scrittura records in file sequenziale di appog-  *
      *    * gio                                                       *
      *    *-----------------------------------------------------------*
       01  w-scr-fso.
      *        *-------------------------------------------------------*
      *        * Carattere di fine riga                                *
      *        *-------------------------------------------------------*
           05  w-scr-fso-cfr              pic  x(01)   value H"0D"    .

      *    *===========================================================*
      *    * Work area per esecuzione stampa                           *
      *    *-----------------------------------------------------------*
       01  w-stp.
      *        *-------------------------------------------------------*
      *        * Sub-work per livello dettaglio stampa                 *
      *        *-------------------------------------------------------*
           05  w-stp-det.
      *            *---------------------------------------------------*
      *            * Area di stampa completa per il dettaglio          *
      *            *---------------------------------------------------*
               10  w-stp-det-cpl.
      *                *-----------------------------------------------*
      *                * Singole righe che compongono l'area di stampa *
      *                * del dettaglio                                 *
      *                *-----------------------------------------------*
                   15  w-stp-det-rig occurs 30.
      *                    *-------------------------------------------*
      *                    * Colonna 1                                 *
      *                    *-------------------------------------------*
                       20  w-stp-det-col-001
                                          pic  x(05)                  .
      *                    *-------------------------------------------*
      *                    * Colonna 2                                 *
      *                    *-------------------------------------------*
                       20  w-stp-det-col-002
                                          pic  x(07)                  .
      *                    *-------------------------------------------*
      *                    * Colonna 3                                 *
      *                    *-------------------------------------------*
                       20  w-stp-det-col-003
                                          pic  x(38)                  .
      *                    *-------------------------------------------*
      *                    * Colonna 4                                 *
      *                    *-------------------------------------------*
                       20  w-stp-det-col-004
                                          pic  x(03)                  .
      *                    *-------------------------------------------*
      *                    * Colonna 5                                 *
      *                    *-------------------------------------------*
                       20  w-stp-det-col-005
                                          pic  x(14)                  .
      *                    *-------------------------------------------*
      *                    * Colonna 6                                 *
      *                    *-------------------------------------------*
                       20  w-stp-det-col-006
                                          pic  x(14)                  .
      *                    *-------------------------------------------*
      *                    * Colonna 7                                 *
      *                    *-------------------------------------------*
                       20  w-stp-det-col-007
                                          pic  x(14)                  .
      *                    *-------------------------------------------*
      *                    * Colonna 8                                 *
      *                    *-------------------------------------------*
                       20  w-stp-det-col-008
                                          pic  x(14)                  .
      *                    *-------------------------------------------*
      *                    * Colonna 9                                 *
      *                    *-------------------------------------------*
                       20  w-stp-det-col-009
                                          pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Contatori relativi alle colonne, uno per colonna  *
      *            *---------------------------------------------------*
               10  w-stp-det-cco.
                   15  w-stp-det-cco-001   pic  9(02)                 .
                   15  w-stp-det-cco-002   pic  9(02)                 .
                   15  w-stp-det-cco-003   pic  9(02)                 .
                   15  w-stp-det-cco-004   pic  9(02)                 .
                   15  w-stp-det-cco-005   pic  9(02)                 .
                   15  w-stp-det-cco-006   pic  9(02)                 .
                   15  w-stp-det-cco-007   pic  9(02)                 .
                   15  w-stp-det-cco-008   pic  9(02)                 .
                   15  w-stp-det-cco-009   pic  9(02)                 .
      *            *---------------------------------------------------*
      *            * Indici e contatori per la scansione e la stampa   *
      *            * delle colonne                                     *
      *            *---------------------------------------------------*
               10  w-stp-det-iec.
      *                *-----------------------------------------------*
      *                * Contatore delle linee effettive da stampare   *
      *                *-----------------------------------------------*
                   15  w-stp-det-ctr-lin  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Indice di scansione                           *
      *                *-----------------------------------------------*
                   15  w-stp-det-inx-lin  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Comodo per linee residue                      *
      *                *-----------------------------------------------*
                   15  w-stp-det-ctr-res  pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work area di appoggio per la stampa dei valori        *
      *        *-------------------------------------------------------*
           05  w-stp-num-val.
      *            *---------------------------------------------------*
      *            * Posizione per la stampa                           *
      *            *---------------------------------------------------*
               10  w-stp-num-val-pos      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Valore per la stampa                              *
      *            *---------------------------------------------------*
               10  w-stp-num-val-val      pic s9(13)                  .

      *    *===========================================================*
      *    * Work-area per routine di riempimento sezione              *
      *    *-----------------------------------------------------------*
       01  w-sez-rec-det.
      *        *-------------------------------------------------------*
      *        * Sezione per riempimento di un record                  *
      *        *-------------------------------------------------------*
           05  w-sez-rec-det-sez.
               10  w-sez-rec-det-ele  occurs 70.
                   15  w-sez-rec-det-key.
                       20  w-sez-rec-det-tip
                                          pic  x(02)                  .
                       20  w-sez-rec-det-cod
                                          pic  x(06)                  .
                   15  w-sez-rec-det-val  pic  x(16)                  .
      *        *-------------------------------------------------------*
      *        * Comodi                                                *
      *        *-------------------------------------------------------*
           05  w-sez-rec-det-inc          pic  x(06)                  .
           05  w-sez-rec-det-inv          pic  x(16)                  .
           05  w-sez-rec-det-ecf          pic  x(02)                  .
           05  w-sez-rec-det-prg          pic  9(08)                  .
           05  w-sez-rec-det-inx          pic  9(04)                  .
           05  w-sez-rec-det-max          pic  9(03)                  .

      *    *===========================================================*
      *    * Work area per la definizione dei record per generazione   *
      *    * archivio sequenziale                                      *
      *    *-----------------------------------------------------------*
       01  w-out.
      *        *-------------------------------------------------------*
      *        * Comodi per emissione sequenziale                      *
      *        *-------------------------------------------------------*
           05  w-out-gen.
      *            *---------------------------------------------------*
      *            * Tipo operazione                                   *
      *            *                                                   *
      *            * 'IN' = Inizializzazione generale                  *
      *            * 'ID' = Inizializzazione dettaglio                 *
      *            * 'DE' = Dettaglio                                  *
      *            * 'CD' = Chiusura dettaglio                         *
      *            * 'CL' = Chiusura                                   *
      *            *---------------------------------------------------*
               10  w-out-gen-tip-ope      pic  x(02)                  .
      *        *-------------------------------------------------------*
      *        * Output documento                                      *
      *        *-------------------------------------------------------*
           05  w-out-doc.
      *            *---------------------------------------------------*
      *            * Tipo archivio                                     *
      *            *---------------------------------------------------*
               10  w-out-doc-tip-arc      pic  x(01)                  .
               10  w-out-doc-sep-001      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice archivio                                   *
      *            *---------------------------------------------------*
               10  w-out-doc-cod-arc      pic  x(07)                  .
               10  w-out-doc-sep-002      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale archivio                          *
      *            *---------------------------------------------------*
               10  w-out-doc-rag-soc      pic  x(40)                  .
               10  w-out-doc-sep-003      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Indirizzo archivio                                *
      *            *---------------------------------------------------*
               10  w-out-doc-via-arc      pic  x(40)                  .
               10  w-out-doc-sep-004      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Localita' archivio                                *
      *            *---------------------------------------------------*
               10  w-out-doc-loc-arc      pic  x(40)                  .
               10  w-out-doc-sep-005      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice nazione                                    *
      *            *---------------------------------------------------*
               10  w-out-doc-naz-arc      pic  x(03)                  .
               10  w-out-doc-sep-006      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice fiscale                                    *
      *            *---------------------------------------------------*
               10  w-out-doc-cod-fis      pic  x(16)                  .
               10  w-out-doc-sep-007      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Partita IVA                                       *
      *            *---------------------------------------------------*
               10  w-out-doc-prt-iva      pic  x(11)                  .
               10  w-out-doc-sep-008      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Data documento                                    *
      *            *---------------------------------------------------*
               10  w-out-doc-dat-doc      pic  x(08)                  .
               10  w-out-doc-sep-009      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero documento                                  *
      *            *---------------------------------------------------*
               10  w-out-doc-num-doc      pic  x(10)                  .
               10  w-out-doc-sep-010      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice numerazione                                *
      *            *---------------------------------------------------*
               10  w-out-doc-cod-num      pic  x(02)                  .
               10  w-out-doc-sep-011      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Protocollo iva per stampa su giornale             *
      *            *---------------------------------------------------*
               10  w-out-doc-prt-gio      pic  x(11)                  .
               10  w-out-doc-sep-012      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo documento                                    *
      *            *---------------------------------------------------*
               10  w-out-doc-tip-doc      pic  x(07)                  .
               10  w-out-doc-sep-013      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Castelletto Iva - 6 elementi                      *
      *            *---------------------------------------------------*
      *            * Imponibile 1                                      *
      *            *---------------------------------------------------*
               10  w-out-doc-ibl-001      pic  x(15)                  .
               10  w-out-doc-sep-014      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Iva 1                                             *
      *            *---------------------------------------------------*
               10  w-out-doc-iva-001      pic  x(05)                  .
               10  w-out-doc-sep-015      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Imposta 1                                         *
      *            *---------------------------------------------------*
               10  w-out-doc-imp-001      pic  x(15)                  .
               10  w-out-doc-sep-016      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Elenco 1                                          *
      *            *---------------------------------------------------*
               10  w-out-doc-nop-001      pic  x(04)                  .
               10  w-out-doc-sep-017      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Imponibile 2                                      *
      *            *---------------------------------------------------*
               10  w-out-doc-ibl-002      pic  x(15)                  .
               10  w-out-doc-sep-018      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Iva 2                                             *
      *            *---------------------------------------------------*
               10  w-out-doc-iva-002      pic  x(05)                  .
               10  w-out-doc-sep-019      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Imposta 2                                         *
      *            *---------------------------------------------------*
               10  w-out-doc-imp-002      pic  x(15)                  .
               10  w-out-doc-sep-020      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Elenco 2                                          *
      *            *---------------------------------------------------*
               10  w-out-doc-nop-002      pic  x(04)                  .
               10  w-out-doc-sep-021      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Imponibile 3                                      *
      *            *---------------------------------------------------*
               10  w-out-doc-ibl-003      pic  x(15)                  .
               10  w-out-doc-sep-022      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Iva 3                                             *
      *            *---------------------------------------------------*
               10  w-out-doc-iva-003      pic  x(05)                  .
               10  w-out-doc-sep-023      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Imposta 3                                         *
      *            *---------------------------------------------------*
               10  w-out-doc-imp-003      pic  x(15)                  .
               10  w-out-doc-sep-024      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Elenco 3                                          *
      *            *---------------------------------------------------*
               10  w-out-doc-nop-003      pic  x(04)                  .
               10  w-out-doc-sep-025      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Imponibile 4                                      *
      *            *---------------------------------------------------*
               10  w-out-doc-ibl-004      pic  x(15)                  .
               10  w-out-doc-sep-026      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Iva 4                                             *
      *            *---------------------------------------------------*
               10  w-out-doc-iva-004      pic  x(05)                  .
               10  w-out-doc-sep-027      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Imposta 4                                         *
      *            *---------------------------------------------------*
               10  w-out-doc-imp-004      pic  x(15)                  .
               10  w-out-doc-sep-028      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Elenco 4                                          *
      *            *---------------------------------------------------*
               10  w-out-doc-nop-004      pic  x(04)                  .
               10  w-out-doc-sep-029      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Imponibile 5                                      *
      *            *---------------------------------------------------*
               10  w-out-doc-ibl-005      pic  x(15)                  .
               10  w-out-doc-sep-030      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Iva 5                                             *
      *            *---------------------------------------------------*
               10  w-out-doc-iva-005      pic  x(05)                  .
               10  w-out-doc-sep-031      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Imposta 5                                         *
      *            *---------------------------------------------------*
               10  w-out-doc-imp-005      pic  x(15)                  .
               10  w-out-doc-sep-032      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Elenco 5                                          *
      *            *---------------------------------------------------*
               10  w-out-doc-nop-005      pic  x(04)                  .
               10  w-out-doc-sep-033      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Imponibile 6                                      *
      *            *---------------------------------------------------*
               10  w-out-doc-ibl-006      pic  x(15)                  .
               10  w-out-doc-sep-034      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Iva 6                                             *
      *            *---------------------------------------------------*
               10  w-out-doc-iva-006      pic  x(05)                  .
               10  w-out-doc-sep-035      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Imposta 6                                         *
      *            *---------------------------------------------------*
               10  w-out-doc-imp-006      pic  x(15)                  .
               10  w-out-doc-sep-036      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Elenco 6                                          *
      *            *---------------------------------------------------*
               10  w-out-doc-nop-006      pic  x(04)                  .
               10  w-out-doc-sep-037      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Totale documento                                  *
      *            *---------------------------------------------------*
               10  w-out-doc-tot-doc      pic  x(15)                  .
               10  w-out-doc-sep-038      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Regime fiscale                                    *
      *            *---------------------------------------------------*
               10  w-out-doc-flg-rfp      pic  x(02)                  .
      *            *---------------------------------------------------*
      *            * Carattere di fine riga                            *
      *            *---------------------------------------------------*
               10  w-out-doc-fin-rig      pic  x(01)                  .

      *    *===========================================================*
      *    * Work area per stampa in formato 'xml'                     *
      *    *-----------------------------------------------------------*
       01  w-sta-emi.
      *        *-------------------------------------------------------*
      *        * Comodo per emissione TAG xml                          *
      *        *-------------------------------------------------------*
           05  w-sta-emi-xml.
      *            *---------------------------------------------------*
      *            * Tipo operazione                                   *
      *            *---------------------------------------------------*
               10  w-sta-emi-xml-ope      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Indentazione                                      *
      *            *---------------------------------------------------*
               10  w-sta-emi-xml-ind      pic  x(01)                  .
               10  w-sta-emi-xml-tab      pic  9(02)       value 02   .
               10  w-sta-emi-xml-inx      pic  9(02)                  .
               10  w-sta-emi-xml-inw      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Prompt                                            *
      *            *---------------------------------------------------*
               10  w-sta-emi-xml-pmt      pic  x(40)                  .
               10  w-sta-emi-xml-pma      pic  x(40)                  .
               10  w-sta-emi-xml-pmc      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Valore                                            *
      *            *---------------------------------------------------*
               10  w-sta-emi-xml-val      pic  x(240)                 .
      *            *---------------------------------------------------*
      *            * Stringa assemblata                                *
      *            *---------------------------------------------------*
               10  w-sta-emi-xml-str      pic  x(240)                 .
      *            *---------------------------------------------------*
      *            * Lunghezza stringa assemblata                      *
      *            *---------------------------------------------------*
               10  w-sta-emi-xml-lun      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Comodo per trattamento date                       *
      *            *---------------------------------------------------*
               10  w-sta-emi-xml-dat      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per emissione CSV                              *
      *        *-------------------------------------------------------*
           05  w-sta-emi-csv.
      *            *---------------------------------------------------*
      *            * Tipo operazione                                   *
      *            *---------------------------------------------------*
               10  w-sta-emi-csv-ope      pic  x(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo archivio                                     *
      *            *---------------------------------------------------*
               10  w-sta-emi-csv-tip      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Contatori elementi                                *
      *            *---------------------------------------------------*
               10  w-sta-emi-csv-ctr      pic  9(07)                  .
               10  w-sta-emi-csv-ctw      pic  9(07)                  .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Errori su anagrafiche                        *
      *        *-------------------------------------------------------*
           05  w-err-ana-cof.
               10  w-err-ana-cof-ctr      pic  9(07)                  .
               10  w-err-ana-cof-tip      pic  x(01)                  .
               10  w-err-ana-cof-cod      pic  9(07)                  .
               10  w-err-ana-cof-rag      pic  x(40)                  .
               10  w-err-ana-cof-err      pic  x(30)                  .
               10  w-err-ana-cof-txt      pic  x(80)                  .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
      *            *---------------------------------------------------*
      *            * Tipo archivio                                     *
      *            *---------------------------------------------------*
               10  w-rot-l02-tip-arc      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
      *            *---------------------------------------------------*
      *            * Codice archivio                                   *
      *            *---------------------------------------------------*
               10  w-rot-l01-cod-arc      pic  9(07)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Elaborazioni preliminari su aree titolo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area nome azienda  *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-cnt-tit-des-azi      .
           move      40                   to   w-cnt-tit-ctr-azi      .
       int-pag-std-100.
           if        w-cnt-tit-chr-azi
                    (w-cnt-tit-ctr-azi)   =    spaces
                     if     w-cnt-tit-ctr-azi
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-azi
                            go to     int-pag-std-100.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza titolo stampato    *
      *                  *---------------------------------------------*
           move      80                   to   w-cnt-tit-ctr-tit      .
       int-pag-std-200.
           if        w-cnt-tit-chr-tit
                    (w-cnt-tit-ctr-tit)   =    spaces
                     if     w-cnt-tit-ctr-tit
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-tit
                            go to     int-pag-std-200.
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale titolo    *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-tit      .
           subtract  w-cnt-tit-ctr-tit    from w-cnt-tit-pos-tit      .
           divide    2                    into w-cnt-tit-pos-tit      .
           add       1                    to   w-cnt-tit-pos-tit      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area data e pagina *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-pag    =    zero
                     move  4              to   w-cnt-tit-ctr-wrk
                     go to int-pag-std-300.
           move      zero                 to   w-cnt-tit-ctr-wrk      .
           inspect   w-cnt-tit-num-pag
                                      tallying w-cnt-tit-ctr-wrk
                                   for leading "0"                    .
       int-pag-std-300.
           subtract  w-cnt-tit-ctr-wrk    from 27
                                        giving w-cnt-tit-ctr-dep      .
           subtract  w-cnt-tit-ctr-wrk    from 5
                                        giving w-cnt-tit-ctr-cif      .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale data e p. *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-dep      .
           subtract  w-cnt-tit-ctr-dep    from w-cnt-tit-pos-dep      .
           add       1                    to   w-cnt-tit-pos-dep      .
      *                  *---------------------------------------------*
      *                  * Determinazione se titolo su una o due linee *
      *                  *---------------------------------------------*
           move      w-cnt-tit-ctr-azi    to   w-cnt-tit-ctr-wrk      .
           add       2                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-tit
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      w-cnt-tit-pos-tit    to   w-cnt-tit-ctr-wrk      .
           add       w-cnt-tit-ctr-tit    to   w-cnt-tit-ctr-wrk      .
           add       1                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-dep
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      1                    to   w-cnt-tit-num-lin      .
       int-pag-std-500.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome azienda                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-azi    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-cnt-tit-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-lin    =    2
                     go to int-pag-std-600.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-600.
      *                  *---------------------------------------------*
      *                  * Literal per Data                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           move      "Data :"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       7                    to   p-pos                  .
           move      w-cnt-tit-dat-stp    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal per Pag.                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       17                   to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      w-cnt-tit-ctr-cif    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       22                   to   p-pos                  .
           move      w-cnt-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea titolo                            *
      *              *-------------------------------------------------*
           if        w-cnt-tit-num-lin    not  = 2
                     go to int-pag-std-900.
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-900.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione relativa al tipo di   *
      *              * sequenziale da preparare                        *
      *              *-------------------------------------------------*
           perform   prs-tip-seq-000      thru prs-tip-seq-999        .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura delle personalizzazioni relativa al tipo di       *
      *    * sequenziale da preparare                                  *
      *    *-----------------------------------------------------------*
       prs-tip-seq-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/cge/iva/cge760[tip-seq]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-tip-seq-tip
           else      move  spaces         to   w-prs-tip-seq-tip      .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-tip-seq-tip    not  = "P" and
                     w-prs-tip-seq-tip    not  = "M"
                     move  "N"            to   w-prs-tip-seq-tip      .
       prs-tip-seq-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [ada]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *              *-------------------------------------------------*
      *              * [gxc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *              *-------------------------------------------------*
      *              * [fit]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *              *-------------------------------------------------*
      *              * [mgi]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofmgi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mgi                 .
      *              *-------------------------------------------------*
      *              * [mgt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofmgt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mgt                 .
      *              *-------------------------------------------------*
      *              * [zci]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *              *-------------------------------------------------*
      *              * [zcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zcc                 .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [kk0]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiesta di un pathname unico alla segre-  *
      *                  * teria                                       *
      *                  *---------------------------------------------*
           move      "UP"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-pat                to   f-kk0-pat              .
      *                  *---------------------------------------------*
      *                  * Open file                                   *
      *                  *---------------------------------------------*
           open      i-o    kk0                                       .
      *              *-------------------------------------------------*
      *              * [kk1]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiesta di un pathname unico alla segre-  *
      *                  * teria                                       *
      *                  *---------------------------------------------*
           move      "UP"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-pat                to   f-kk1-pat              .
      *                  *---------------------------------------------*
      *                  * Open file                                   *
      *                  *---------------------------------------------*
           open      i-o    kk1                                       .
      *              *-------------------------------------------------*
      *              * [kk2]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiesta di un pathname unico alla segre-  *
      *                  * teria                                       *
      *                  *---------------------------------------------*
           move      "UP"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-pat                to   f-kk2-pat              .
      *                  *---------------------------------------------*
      *                  * Open file                                   *
      *                  *---------------------------------------------*
           open      i-o    kk2                                       .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [ada]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *              *-------------------------------------------------*
      *              * [gxc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *              *-------------------------------------------------*
      *              * [fit]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *              *-------------------------------------------------*
      *              * [mgi]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofmgi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mgi                 .
      *              *-------------------------------------------------*
      *              * [mgt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofmgt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mgt                 .
      *              *-------------------------------------------------*
      *              * [zci]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *              *-------------------------------------------------*
      *              * [zcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zcc                 .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [kk0]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close file                                  *
      *                  *---------------------------------------------*
           close     kk0                                              .
      *                  *---------------------------------------------*
      *                  * Richiesta di delete di un pathname alla se- *
      *                  * greteria                                    *
      *                  *---------------------------------------------*
           move      "PD"                 to   s-ope                  .
           move      f-kk0-pat            to   s-pat                  .
           move      "K"                  to   s-sts                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * [kk1]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close file                                  *
      *                  *---------------------------------------------*
           close     kk1                                              .
      *                  *---------------------------------------------*
      *                  * Richiesta di delete di un pathname alla se- *
      *                  * greteria                                    *
      *                  *---------------------------------------------*
           move      "PD"                 to   s-ope                  .
           move      f-kk1-pat            to   s-pat                  .
           move      "K"                  to   s-sts                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * [kk2]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close file                                  *
      *                  *---------------------------------------------*
           close     kk2                                              .
      *                  *---------------------------------------------*
      *                  * Richiesta di delete di un pathname alla se- *
      *                  * greteria                                    *
      *                  *---------------------------------------------*
           move      "PD"                 to   s-ope                  .
           move      f-kk2-pat            to   s-pat                  .
           move      "K"                  to   s-sts                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : Si'                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-exe-rou-srt      .
      *              *-------------------------------------------------*
      *              * Esecuzione sort                                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   prn-rou-pri-000
                                          thru prn-rou-pri-999        .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Preparazione del tipo archivio in base alle     *
      *              * richieste                                       *
      *              *-------------------------------------------------*
           move      "C"                  to   w-stp-srt-tip          .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore archivi esclusi       *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-arc-esc-ctr      .
       stp-srt-inp-010.
      *              *-------------------------------------------------*
      *              * Preparazione delle date per la scansione        *
      *              *-------------------------------------------------*
           move      rr-dat-ini           to   w-det-dat-srt-min      .
           move      rr-dat-fin           to   w-det-dat-srt-max      .
      *              *-------------------------------------------------*
      *              * Preparazione file di appoggio per le sigle      *
      *              * numerazione fatture di vendita                  *
      *              *                                                 *
      *              * N.B.: resa necessaria dalla mancanza della      *
      *              *       sigla numerazione nel file [mgi]          *
      *              *-------------------------------------------------*
           perform   stp-srt-inp-sgl-000  thru stp-srt-inp-sgl-999    .
       stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Start su file [mgi]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "DATDOC    "         to   f-key                  .
           move      w-stp-srt-tip        to   rf-mgi-tip-rec         .
           move      w-det-dat-srt-min    to   rf-mgi-dat-reg         .
           move      zero                 to   rf-mgi-cod-num         .
           move      zero                 to   rf-mgi-prt-iva         .
           move      zero                 to   rf-mgi-num-prt         .
           move      "pgm/cge/fls/ioc/obj/iofmgi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mgi                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata                             *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-900.
       stp-srt-inp-200.
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale record [mgi]                *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofmgi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mgi                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-900.
       stp-srt-inp-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-mgi-tip-rec       not  = w-stp-srt-tip   or
                     rf-mgi-dat-reg       >    w-det-dat-srt-max
                     go to stp-srt-inp-900.
       stp-srt-inp-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se movimento gia' inviato a SDI        *
      *                  *                                             *
      *                  * Si utilizza il secondo carattere di         *
      *                  * 'alx-exp' scritto eventualmente da          *
      *                  * 'pscf420d' o 'pscf420z'                     *
      *                  *---------------------------------------------*
           if        rf-mgi-alx-exp
                    (02 : 01)             =    "#"
                     go to stp-srt-inp-200.
      *                  *---------------------------------------------*
      *                  * Test su tipo movimento iva                  *
      *                  *                                             *
      *                  * Attualmente considerati                     *
      *                  * -----------------------                     *
      *                  *                                             *
      *                  * Tutti, ad esclusione dei Corrispettivi      *
      *                  *---------------------------------------------*
           if        rf-mgi-tip-iva       =    "3"
                     go to stp-srt-inp-200.
      *                  *---------------------------------------------*
      *                  * Test su flag di regime fiscale particolare  *
      *                  *---------------------------------------------*
           if        rf-mgi-flg-rfp       =    "E"
                     go to stp-srt-inp-200.
      *                  *---------------------------------------------*
      *                  * Test su bolle doganali                      *
      *                  *---------------------------------------------*
           if        rf-mgi-tip-iva       =    "6"
                     go to stp-srt-inp-200.
       stp-srt-inp-500.
      *              *-------------------------------------------------*
      *              * Letture archivi                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo archivio    *
      *                  *---------------------------------------------*
           if        w-stp-srt-tip        =    "C"
                     go to stp-srt-inp-520
           else if   w-stp-srt-tip        =    "F"
                     go to stp-srt-inp-540.
       stp-srt-inp-520.
      *                  *---------------------------------------------*
      *                  * Lettura record [cli]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-mgi-cod-arc       to   rf-cli-cod-cli         .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
           if        f-sts                not  = e-not-err
                     move  all "."        to   rf-cli-rag-soc
                     move  spaces         to   rf-cli-rag-key         .
      *                  *---------------------------------------------*
      *                  * Oltre                                       *
      *                  *---------------------------------------------*
           go to     stp-srt-inp-560.
       stp-srt-inp-540.
      *                  *---------------------------------------------*
      *                  * Test se Bolle Doganali                      *
      *                  *---------------------------------------------*
           if        rf-mgi-tip-iva       not  = "6"
                     move  zero           to   w-det-fnt-bdg-cod
                     go to stp-srt-inp-542.
      *                  *---------------------------------------------*
      *                  * Eventuale fornitore reale Bolle Doganali    *
      *                  *---------------------------------------------*
           if        rf-mgi-cod-fbd       not  numeric
                     move  zero           to   w-det-fnt-bdg-cod
           else      move  rf-mgi-cod-fbd to   w-det-fnt-bdg-cod      .
       stp-srt-inp-542.
      *                  *---------------------------------------------*
      *                  * Lettura record [fnt]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
      *
           if        w-det-fnt-bdg-cod    not  = zero
                     move  w-det-fnt-bdg-cod
                                          to   rf-fnt-cod-fnt
           else      move  rf-mgi-cod-arc to   rf-fnt-cod-fnt         .
      *
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
           if        f-sts                not  = e-not-err
                     move  all "."        to   rf-fnt-rag-soc
                     move  spaces         to   rf-fnt-rag-key         .
      *                  *---------------------------------------------*
      *                  * Oltre                                       *
      *                  *---------------------------------------------*
           go to     stp-srt-inp-560.
       stp-srt-inp-560.
      *                  *---------------------------------------------*
      *                  * Selezioni su anagrafiche lette              *
      *                  *---------------------------------------------*
           if        w-stp-srt-tip        =    "C"
                     go to stp-srt-inp-570
           else      go to stp-srt-inp-580.
       stp-srt-inp-570.
      *                  *---------------------------------------------*
      *                  * Clienti                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su codice nazione                  *
      *                      *-----------------------------------------*
           if        rf-cli-cod-naz       =    "IT "
                     go to stp-srt-inp-200.
      *                      *-----------------------------------------*
      *                      * Test su Si/no in elenco                 *
      *                      *-----------------------------------------*
           if        rf-cli-snx-a13       not  = "N"
                     go to stp-srt-inp-600.
      *                      *-----------------------------------------*
      *                      * Test se codice destinatario 'XXXXXXX'   *
      *                      * che significa che la fattura e' gia'    *
      *                      * stata inviata tramite SDI               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione record [dcc]        *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                          *-------------------------------------*
      *                          * Lettura record [dcc]                *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-mgi-cod-arc       to   rf-dcc-cod-cli         .
           move      spaces               to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                          *-------------------------------------*
      *                          * Test su codice SDI                  *
      *                          *-------------------------------------*
           if        rf-dcc-idn-em2       =    "XXXXXXX"
                     go to stp-srt-inp-200.
      *                      *-----------------------------------------*
      *                      * Test se codice archivio gia' trattato   *
      *                      *-----------------------------------------*
           set       w-stp-arc-esc-inx    to   1                      .
           search    w-stp-arc-esc-ele
                     when    w-stp-arc-esc-tip
                            (w-stp-arc-esc-inx)
                                          =    w-stp-srt-tip and
                             w-stp-arc-esc-cod
                            (w-stp-arc-esc-inx)
                                          =    rf-mgi-cod-arc
                     go to   stp-srt-inp-200.
      *                      *-----------------------------------------*
      *                      * Aggiornamento tabella                   *
      *                      *-----------------------------------------*
           add       1                    to   w-stp-arc-esc-ctr      .
           move      w-stp-srt-tip        to   w-stp-arc-esc-tip
                                              (w-stp-arc-esc-ctr)     .
           move      rf-mgi-cod-arc       to   w-stp-arc-esc-cod
                                              (w-stp-arc-esc-ctr)     .
      *                      *-----------------------------------------*
      *                      * Editing codice archivio                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      rf-mgi-cod-arc       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (2)      .
      *                      *-----------------------------------------*
      *                      * Messaggio di avviso                     *
      *                      *-----------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "Il Cliente :"       to   w-all-str-cat (1)      .
           move      " - risulta escluso" to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * Scrittura in rullino messaggi           *
      *                      *-----------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-all-str-alf        to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-200.
       stp-srt-inp-580.
      *                  *---------------------------------------------*
      *                  * Fornitori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su codice nazione                  *
      *                      *-----------------------------------------*
           if        rf-fnt-cod-naz       =    "IT "
                     go to stp-srt-inp-200.
      *                      *-----------------------------------------*
      *                      * Test su Si/no in elenco                 *
      *                      *-----------------------------------------*
           if        rf-fnt-snx-a13       not  = "N"
                     go to stp-srt-inp-600.
      *                      *-----------------------------------------*
      *                      * Test se codice archivio gia' trattato   *
      *                      *-----------------------------------------*
           set       w-stp-arc-esc-inx    to   1                      .
           search    w-stp-arc-esc-ele
                     when    w-stp-arc-esc-tip
                            (w-stp-arc-esc-inx)
                                          =    w-stp-srt-tip and
                             w-stp-arc-esc-cod
                            (w-stp-arc-esc-inx)
                                          =    rf-mgi-cod-arc
                     go to   stp-srt-inp-200.
      *                      *-----------------------------------------*
      *                      * Aggiornamento tabella                   *
      *                      *-----------------------------------------*
           add       1                    to   w-stp-arc-esc-ctr      .
           move      w-stp-srt-tip        to   w-stp-arc-esc-tip
                                              (w-stp-arc-esc-ctr)     .
           move      rf-mgi-cod-arc       to   w-stp-arc-esc-cod
                                              (w-stp-arc-esc-ctr)     .
      *                      *-----------------------------------------*
      *                      * Editing codice archivio                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      rf-mgi-cod-arc       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (2)      .
      *                      *-----------------------------------------*
      *                      * Messaggio di avviso                     *
      *                      *-----------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "Il Fornitore :"     to   w-all-str-cat (1)      .
           move      " - risulta escluso" to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * Scrittura in rullino messaggi           *
      *                      *-----------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-all-str-alf        to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-200.
       stp-srt-inp-600.
      *              *-------------------------------------------------*
      *              * Composizione record di sort                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione preliminare                 *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
      *                  *---------------------------------------------*
      *                  * Campi chiave                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo archivio                           *
      *                      *-----------------------------------------*
           move      w-stp-srt-tip        to   srt-tip-arc            .
      *                      *-----------------------------------------*
      *                      * Ragione sociale archivio in chiave      *
      *                      *-----------------------------------------*
           if        w-stp-srt-tip        =    "C"
                     move  rf-cli-rag-soc to   srt-rag-key
           else      move  rf-fnt-rag-soc to   srt-rag-key            .
      *                      *-----------------------------------------*
      *                      * Codice archivio in chiave               *
      *                      *-----------------------------------------*
           move      rf-mgi-cod-arc       to   srt-cod-key            .
      *                          *-------------------------------------*
      *                          * Eccezione bolle doganali            *
      *                          *-------------------------------------*
           if        rf-mgi-tip-iva       not  = "6"
                     go to stp-srt-inp-605.
      *                          *-------------------------------------*
      *                          * Eventuale fornitore reale merce     *
      *                          *-------------------------------------*
           move      rf-fnt-cod-fnt       to   srt-cod-key            .
       stp-srt-inp-605.
      *                      *-----------------------------------------*
      *                      * Data registrazione                      *
      *                      *-----------------------------------------*
           move      rf-mgi-dat-reg       to   srt-dat-reg            .
      *                      *-----------------------------------------*
      *                      * Test se congruente con data documento   *
      *                      *-----------------------------------------*
           if        rf-mgi-dat-doc       not  > rf-mgi-dat-reg
                     go to stp-srt-inp-608.
      *                      *-----------------------------------------*
      *                      * Editing protocollo                      *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      rf-mgi-num-prt       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (2)      .
      *                      *-----------------------------------------*
      *                      * Editing data registrazione              *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      rf-mgi-dat-reg       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (4)      .
      *                      *-----------------------------------------*
      *                      * Messaggio di avviso                     *
      *                      *-----------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
           move      "Protocollo 'cge' :" to   w-all-str-cat (1)      .
           move      "del"                to   w-all-str-cat (3)      .
           move      " - con incongruenza tra date"
                                          to   w-all-str-cat (5)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * Scrittura in rullino messaggi           *
      *                      *-----------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-all-str-alf        to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       stp-srt-inp-608.
      *                      *-----------------------------------------*
      *                      * Numero documento in chiave              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Editing giornale Iva                *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      rf-mgi-cod-num       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Allineamento a destra               *
      *                          *-------------------------------------*
           move      10                   to   w-all-str-lun          .
           move      rf-mgi-num-doc       to   w-all-str-alf          .
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                          *-------------------------------------*
      *                          * Riempimento con zeri                *
      *                          *-------------------------------------*
           inspect   w-all-str-alf
                                replacing all  " "
                                          by   "0"                    .
      *                          *-------------------------------------*
      *                          * In campo di destinazione            *
      *                          *-------------------------------------*
           move      p-edt                to   srt-num-key (01 : 02)  .
           move      w-all-str-alf        to   srt-num-key (03 : 10)  .
       stp-srt-inp-610.
      *                  *---------------------------------------------*
      *                  * Campi dati                                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Protocollo                              *
      *                      *-----------------------------------------*
           move      rf-mgi-num-prt       to   srt-num-prt            .
      *                      *-----------------------------------------*
      *                      * Codice archivio                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se cliente                          *
      *                          *-------------------------------------*
           move      rf-mgi-cod-arc       to   srt-cod-arc            .
           if        w-stp-srt-tip        =    "C"
                     move  zero           to   srt-cod-bdg
                     go to stp-srt-inp-615.
      *                          *-------------------------------------*
      *                          * Se Fornitore                        *
      *                          *-------------------------------------*
           move      w-det-fnt-bdg-cod    to   srt-cod-bdg            .
       stp-srt-inp-615.
      *                      *-----------------------------------------*
      *                      * Tipo IVA                                *
      *                      *-----------------------------------------*
           move      rf-mgi-tip-iva       to   srt-tip-iva            .
      *                      *-----------------------------------------*
      *                      * Tipo documento da causale               *
      *                      *-----------------------------------------*
           perform   let-tbl-cau-000      thru let-tbl-cau-999        .
           move      rf-zcc-tip-doc       to   srt-tip-doc            .
      *                      *-----------------------------------------*
      *                      * Castelletto Iva                         *
      *                      *-----------------------------------------*
           move      zero                 to   w-stp-srt-ctr          .
       stp-srt-inp-620.
           add       1                    to   w-stp-srt-ctr          .
           if        w-stp-srt-ctr        >    6
                     go to stp-srt-inp-680.
      *                      *-----------------------------------------*
      *                      * Codice IVA                              *
      *                      *-----------------------------------------*
           move      rf-mgi-cod-iva
                    (w-stp-srt-ctr)       to   srt-cod-iva
                                              (w-stp-srt-ctr)         .
      *                      *-----------------------------------------*
      *                      * Imponibile documento                    *
      *                      *-----------------------------------------*
           move      rf-mgi-ibl-iva
                    (w-stp-srt-ctr)       to   srt-ibl-iva
                                              (w-stp-srt-ctr)         .
      *                      *-----------------------------------------*
      *                      * Imposta totale documenti                *
      *                      *-----------------------------------------*
           move      rf-mgi-imp-iva
                    (w-stp-srt-ctr)       to   srt-imp-iva
                                              (w-stp-srt-ctr)         .
      *                      *-----------------------------------------*
      *                      * Flag di posizionamento in elenco        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione [zci]               *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *                          *-------------------------------------*
      *                          * Lettura [zci]                       *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODIVA    "         to   f-key                  .
           move      rf-mgi-cod-iva
                    (w-stp-srt-ctr)       to   rf-zci-cod-iva         .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *                          *-------------------------------------*
      *                          * Memorizzazioni                      *
      *                          *-------------------------------------*
           move      rf-zci-snx-lqp       to   srt-snx-lqp
                                              (w-stp-srt-ctr)         .
           move      rf-zci-cod-nop       to   srt-cod-nop
                                              (w-stp-srt-ctr)         .
      *                      *-----------------------------------------*
      *                      * Riciclo su castelletto Iva              *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-620.
       stp-srt-inp-680.
      *                      *-----------------------------------------*
      *                      * Ragione sociale                         *
      *                      *-----------------------------------------*
           if        w-stp-srt-tip        =    "C"
                     move  rf-cli-rag-soc to   srt-rag-soc
                     move  rf-cli-via-cli to   srt-via-arc
                     move  rf-cli-loc-cli to   srt-loc-arc
                     move  rf-cli-cod-naz to   srt-naz-arc
                     move  rf-cli-cod-cmn to   srt-cmn-arc
                     move  rf-cli-prt-iva to   srt-prt-iva
                     move  rf-cli-cod-fis to   srt-cod-fis
           else if   w-stp-srt-tip        =    "F"
                     move  rf-fnt-rag-soc to   srt-rag-soc
                     move  rf-fnt-via-fnt to   srt-via-arc
                     move  rf-fnt-loc-fnt to   srt-loc-arc
                     move  rf-fnt-cod-cmn to   srt-cmn-arc
                     move  rf-fnt-cod-naz to   srt-naz-arc
                     move  rf-fnt-prt-iva to   srt-prt-iva
                     move  rf-fnt-cod-fis to   srt-cod-fis            .
      *
           if        srt-naz-arc          =    "IT "
                     go to stp-srt-inp-683.
      *
           if        w-stp-srt-tip        =    "C"
                     move  rf-cli-num-fax to   srt-cod-fis
           else if   w-stp-srt-tip        =    "F"
                     move  rf-fnt-num-fax to   srt-cod-fis            .
       stp-srt-inp-683.
      *                      *-----------------------------------------*
      *                      * Data documento                          *
      *                      *-----------------------------------------*
           move      rf-mgi-dat-doc       to   srt-dat-doc            .
      *                      *-----------------------------------------*
      *                      * Numero documento                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se acquisti                    *
      *                          *-------------------------------------*
           if        w-stp-srt-tip        =    "F"
                     move  rf-mgi-num-doc to   srt-num-doc
                     go to stp-srt-inp-690.
      *                          *-------------------------------------*
      *                          * Ricerca eventuale sigla numerazione *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Normalizzazioni preliminari     *
      *                              *---------------------------------*
           move      spaces               to   w-stp-srt-sgl          .
           move      spaces               to   kk0-sgl-num            .
      *                              *---------------------------------*
      *                              * Preparazione chiave [kk0]       *
      *                              *---------------------------------*
           move      rf-mgi-dat-reg       to   kk0-dat-doc            .
           move      rf-mgi-num-prt       to   kk0-num-prt            .
      *                              *---------------------------------*
      *                              * Lettura                         *
      *                              *---------------------------------*
           read      kk0    key is  kk0-key
                            invalid key
                            go to stp-srt-inp-685.
      *                              *---------------------------------*
      *                              * Sigla determinata               *
      *                              *---------------------------------*
           move      kk0-sgl-num          to   w-stp-srt-sgl          .
       stp-srt-inp-685.
      *                          *-------------------------------------*
      *                          * Editing giornale Iva                *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      rf-mgi-cod-num       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-det-edt-val-gio      .
      *                          *-------------------------------------*
      *                          * Allineamento a sinistra numero      *
      *                          *-------------------------------------*
           move      10                   to   w-all-str-lun          .
           move      rf-mgi-num-doc       to   w-all-str-alf          .
           perform   all-str-asx-000      thru all-str-asx-999        .
      *                          *-------------------------------------*
      *                          * Assemblaggio Formato: SGL-GI.NNNNNN *
      *                          *-------------------------------------*
           move      13                   to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
           move      w-stp-srt-sgl        to   w-all-str-cat (1)      .
      *
           if        w-stp-srt-sgl        =    spaces
                     move  spaces         to   w-all-str-cat (1)
                     move  spaces         to   w-all-str-cat (2)
           else      move  "-"            to   w-all-str-cat (2)      .
      *
           move      w-det-edt-val-gio    to   w-all-str-cat (3)      .
      *
           if        rf-mgi-cod-num       =    00
                     move  spaces         to   w-all-str-cat (3)
                     move  spaces         to   w-all-str-cat (4)
           else      move  "."            to   w-all-str-cat (4)      .
      *
           move      rf-mgi-num-doc       to   w-all-str-cat (5)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                          *-------------------------------------*
      *                          * In campo di destinazione            *
      *                          *-------------------------------------*
           move      w-all-str-alf        to   srt-num-doc            .
      *                          *-------------------------------------*
      *                          * Allineamento a sinistra numero      *
      *                          *-------------------------------------*
           move      13                   to   w-all-str-lun          .
           move      srt-num-doc          to   w-all-str-alf          .
           perform   all-str-asx-000      thru all-str-asx-999        .
           move      w-all-str-alf        to   srt-num-doc            .
       stp-srt-inp-690.
      *                      *-----------------------------------------*
      *                      * Numerazione                             *
      *                      *-----------------------------------------*
           move      rf-mgi-cod-num       to   srt-cod-num            .
      *                      *-----------------------------------------*
      *                      * Protocollo iva                          *
      *                      *-----------------------------------------*
           move      rf-mgi-prt-iva       to   srt-prt-gio            .
      *                      *-----------------------------------------*
      *                      * Totale documento                        *
      *                      *-----------------------------------------*
           move      rf-mgi-tot-doc       to   srt-tot-doc            .
      *                      *-----------------------------------------*
      *                      * Anno in corso o precedente              *
      *                      *-----------------------------------------*
           move      rf-mgi-flg-cop       to   srt-flg-cop            .
      *                      *-----------------------------------------*
      *                      * Regime fiscale particolare              *
      *                      *-----------------------------------------*
           move      rf-mgi-flg-rfp       to   srt-flg-rfp            .
       stp-srt-inp-700.
      *              *-------------------------------------------------*
      *              * Rilascio del record al Sort                     *
      *              *-------------------------------------------------*
           release   srt-rec                                          .
       stp-srt-inp-800.
      *              *-------------------------------------------------*
      *              * N.B.: ACQUISTI CEE = inserire qui eventuale     *
      *              *                      seconda registrazione      *
      *              *-------------------------------------------------*
       stp-srt-inp-890.
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale [mgi]            *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-200.
       stp-srt-inp-900.
      *              *-------------------------------------------------*
      *              * Eventuale riciclo                               *
      *              *-------------------------------------------------*
           if        w-stp-srt-tip        =    "C"
                     move  "F"            to   w-stp-srt-tip
                     go to stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-999.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *                                                           *
      *    * Subroutine di preparazione file di appoggio per le sigle  *
      *    * numerazione                                               *
      *    *-----------------------------------------------------------*
       stp-srt-inp-sgl-000.
      *              *-------------------------------------------------*
      *              * Test se da eseguire                             *
      *              *-------------------------------------------------*
           if        w-stp-srt-tip        not  = "C"
                     go to stp-srt-inp-sgl-900.
       stp-srt-inp-sgl-100.
      *              *-------------------------------------------------*
      *              * Start su archivio [fit] per data registrazione  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "IDEDOC    "         to   f-key                  .
           move      w-det-dat-srt-min    to   rf-fit-dat-doc         .
           move      zero                 to   rf-fit-cod-dpz         .
           move      zero                 to   rf-fit-num-doc         .
           move      spaces               to   rf-fit-cod-tmo         .
           move      zero                 to   rf-fit-num-prt         .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-sgl-900.
       stp-srt-inp-sgl-200.
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Read-next su archivio [fit]                     *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *                  *---------------------------------------------*
      *                  * Se at end : uscita                          *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-sgl-900.
       stp-srt-inp-sgl-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-fit-dat-doc       >    w-det-dat-srt-max
                     go to stp-srt-inp-sgl-900.
       stp-srt-inp-sgl-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
           if        rf-fit-prt-mgd       =    zero
                     go to stp-srt-inp-sgl-200.
       stp-srt-inp-sgl-500.
      *              *-------------------------------------------------*
      *              * Scrittura record di appoggio                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione record [kk0]                   *
      *                  *---------------------------------------------*
           move      rf-fit-dat-doc       to   kk0-dat-doc            .
           move      rf-fit-prt-mgd       to   kk0-num-prt            .
           move      rf-fit-sgl-num       to   kk0-sgl-num            .
      *                  *---------------------------------------------*
      *                  * Scrittura file [kk0]                        *
      *                  *---------------------------------------------*
           write     kk0-rec                                          .
       stp-srt-inp-sgl-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-sgl-200.
       stp-srt-inp-sgl-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-sgl-999.
       stp-srt-inp-sgl-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessuna registrazione da elaborare !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
           return    srt    at end
                            move  "#"     to   w-cnt-prn-flg-sub
                            go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
      *              *-------------------------------------------------*
      *              * Livello '02' : tipo archivio                    *
      *              *-------------------------------------------------*
           move      srt-tip-arc          to   w-rot-l02-tip-arc      .
      *              *-------------------------------------------------*
      *              * Livello '01' : codice archivio                  *
      *              *-------------------------------------------------*
           move      srt-cod-key          to   w-rot-l01-cod-arc      .
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore errori                *
      *              *-------------------------------------------------*
           move      zero                 to   w-err-ana-cof-ctr      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore per file CSV          *
      *              *-------------------------------------------------*
           move      zero                 to   w-sta-emi-csv-ctr      .
      *              *-------------------------------------------------*
      *              * Normalizzazione totali mensili                  *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-iva-ele-ctr      .
       prn-ini-cic-200.
           add       1                    to   w-tot-iva-ele-ctr      .
           if        w-tot-iva-ele-ctr    >    6
                     go to prn-ini-cic-999.
           move      all zero             to   w-tot-iva-ele-ele
                                              (w-tot-iva-ele-ctr)     .
           go to     prn-ini-cic-200.
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Stampa totali di riepilogo                      *
      *              *-------------------------------------------------*
           perform   prn-fin-cic-rie-000  thru prn-fin-cic-rie-999    .
      *              *-------------------------------------------------*
      *              * Titolo esportazione                             *
      *              *-------------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      "PERIODO :"          to   w-all-str-cat (1)      .
           move      rr-prd-tpr-lit       to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *              *-------------------------------------------------*
      *              * Messaggio per contatore elementi                *
      *              *-------------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-all-str-alf        to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *              *-------------------------------------------------*
      *              * Eventuali errori                                *
      *              *-------------------------------------------------*
           perform   emi-fil-xml-erm-000  thru emi-fil-xml-erm-999    .
      *              *-------------------------------------------------*
      *              * Emissione file di appoggio CSV                  *
      *              *-------------------------------------------------*
           move      "EM"                 to   w-sta-emi-csv-ope      .
           perform   emi-fil-csv-000      thru emi-fil-csv-999        .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *                                                           *
      *    * Subroutine di stampa riepilogo totali mensili             *
      *    *-----------------------------------------------------------*
       prn-fin-cic-rie-000.
      *              *-------------------------------------------------*
      *              * Preparazione parametri intestazione standard    *
      *              *-------------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "ELENCO DOCUMENTI EMESSI E RICEVUTI -"
                                          to   w-all-str-cat (1)      .
           move      rr-prd-tpr-lit       to   w-all-str-cat (2)      .
           move      "- TOTALI DI RIEPILOGO"
                                          to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-cnt-tit-des-tit      .
      *
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-cnt-tit-dat-stp      .
           move      p-pag                to   w-cnt-tit-num-pag      .
           add       1                    to   w-cnt-tit-num-pag      .
      *              *-------------------------------------------------*
      *              * Intestazione standard                           *
      *              *-------------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per interruzione forzata          *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  prn-fin-cic-rie-999.
       prn-fin-cic-rie-050.
      *              *-------------------------------------------------*
      *              * Interlinea subordinata                          *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       02
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * 1. linea di fincatura                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "+-----------------+-------------------------------
      -              "----------+---------------------------------------
      -              "--+"                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * 2. linea di fincatura                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "|   Mese e anno   |                 VENDITE       
      -              "          |                ACQUISTI               
      -              "  |"                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * 3. linea di fincatura                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "|                 |     Imponibile            Impo
      -              "sta       |     Imponibile            Imposta     
      -              "  |"                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * 4. linea di fincatura                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "+-----------------+--------------------+----------
      -              "----------+--------------------+------------------
      -              "--+"                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-fin-cic-rie-100.
      *              *-------------------------------------------------*
      *              * Ciclo in funzione del periodo richiesto         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione mese iniziale e finale       *
      *                  *---------------------------------------------*
           move      w-det-dat-srt-min    to   s-dat                  .
           move      s-mes                to   w-tot-iva-ele-mmi      .
           move      w-det-dat-srt-max    to   s-dat                  .
           move      s-mes                to   w-tot-iva-ele-mma      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore                   *
      *                  *---------------------------------------------*
           move      w-tot-iva-ele-mmi    to   w-tot-iva-ele-ctr      .
           subtract  1                    from w-tot-iva-ele-ctr      .
       prn-fin-cic-rie-200.
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-tot-iva-ele-ctr      .
      *                  *---------------------------------------------*
      *                  * Test sul contatore                          *
      *                  *---------------------------------------------*
           if        w-tot-iva-ele-ctr    >    w-tot-iva-ele-mma
                     go to prn-fin-cic-rie-900.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Griglia vuota                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "|                 |                    |          
      -              "          |                    |                  
      -              "  |"                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Test su totali memorizzati                  *
      *                  *---------------------------------------------*
           if        w-tot-iva-ele-ibv
                    (w-tot-iva-ele-ctr)   =    zero and
                     w-tot-iva-ele-imv
                    (w-tot-iva-ele-ctr)   =    zero and
                     w-tot-iva-ele-iba
                    (w-tot-iva-ele-ctr)   =    zero and
                     w-tot-iva-ele-ima
                    (w-tot-iva-ele-ctr)   =    zero
                     go to prn-fin-cic-rie-800.
      *                  *---------------------------------------------*
      *                  * Mese                                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "LM"                 to   s-ope                  .
           move      "E"                  to   s-tip                  .
           move      w-tot-iva-ele-mes
                    (w-tot-iva-ele-ctr)   to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      003                  to   p-pos                  .
           move      s-alf                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Anno                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      014                  to   p-pos                  .
           move      w-tot-iva-ele-saa
                    (w-tot-iva-ele-ctr)   to   p-num                  .
           add       1900                 to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Imponibile vendite                          *
      *                  *---------------------------------------------*
           move      21                   to   w-stp-num-val-pos      .
           move      w-tot-iva-ele-ibv
                    (w-tot-iva-ele-ctr)   to   w-stp-num-val-val      .
           perform   stp-num-val-000      thru stp-num-val-999        .
      *                  *---------------------------------------------*
      *                  * Imposta vendite                             *
      *                  *---------------------------------------------*
           move      42                   to   w-stp-num-val-pos      .
           move      w-tot-iva-ele-imv
                    (w-tot-iva-ele-ctr)   to   w-stp-num-val-val      .
           perform   stp-num-val-000      thru stp-num-val-999        .
      *                  *---------------------------------------------*
      *                  * Imponibile acquisti                         *
      *                  *---------------------------------------------*
           move      63                   to   w-stp-num-val-pos      .
           move      w-tot-iva-ele-iba
                    (w-tot-iva-ele-ctr)   to   w-stp-num-val-val      .
           perform   stp-num-val-000      thru stp-num-val-999        .
      *                  *---------------------------------------------*
      *                  * Imposta vendite                             *
      *                  *---------------------------------------------*
           move      84                   to   w-stp-num-val-pos      .
           move      w-tot-iva-ele-ima
                    (w-tot-iva-ele-ctr)   to   w-stp-num-val-val      .
           perform   stp-num-val-000      thru stp-num-val-999        .
       prn-fin-cic-rie-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     prn-fin-cic-rie-200.
       prn-fin-cic-rie-900.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * 4. linea di fincatura                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "+-----------------+--------------------+----------
      -              "----------+--------------------+------------------
      -              "--+"                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-fin-cic-rie-999.
       prn-fin-cic-rie-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Intestazione foglio                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatori elementi              *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-gen-ctr-ele      .
           move      zero                 to   w-tot-gen-ctr-doc      .
      *              *-------------------------------------------------*
      *              * Inizializzazione per emissione sequenziale      *
      *              *-------------------------------------------------*
           move      "IN"                 to   w-out-gen-tip-ope      .
           perform   emi-fil-xml-000      thru emi-fil-xml-999        .
      *              *-------------------------------------------------*
      *              * Inizializzazione dettaglio per sequenziale XML  *
      *              *-------------------------------------------------*
           move      "ID"                 to   w-out-gen-tip-ope      .
           perform   emi-fil-xml-000      thru emi-fil-xml-999        .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *                                                           *
      *    * Subroutine di apertura file di appoggio                   *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-opn-000.
       prn-ini-lr2-opn-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Chiusura dettaglio per sequenziale              *
      *              *-------------------------------------------------*
           move      "CD"                 to   w-out-gen-tip-ope      .
           perform   emi-fil-xml-000      thru emi-fil-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusure per emissione sequenziale              *
      *              *-------------------------------------------------*
           move      "CL"                 to   w-out-gen-tip-ope      .
           perform   emi-fil-xml-000      thru emi-fil-xml-999        .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Incremento contatori elementi                   *
      *              *-------------------------------------------------*
           add       1                    to   w-tot-gen-ctr-ele      .
      *              *-------------------------------------------------*
      *              * Apertura archivio                               *
      *              *-------------------------------------------------*
           move      "AA"                 to   w-out-gen-tip-ope      .
           perform   emi-fil-xml-000      thru emi-fil-xml-999        .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Chiusura archivio                               *
      *              *-------------------------------------------------*
           move      "CA"                 to   w-out-gen-tip-ope      .
           perform   emi-fil-xml-000      thru emi-fil-xml-999        .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Incremento contatori documenti                  *
      *              *-------------------------------------------------*
           add       1                    to   w-tot-gen-ctr-doc      .
      *              *-------------------------------------------------*
      *              * Aggiornamento totali mensili                    *
      *              *-------------------------------------------------*
           perform   prn-liv-det-agg-000  thru prn-liv-det-agg-999    .
       prn-liv-det-100.
      *              *-------------------------------------------------*
      *              * Stampa linea di dettaglio                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    3
                     go to prn-liv-det-200.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
       prn-liv-det-200.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Griglia vuota per il dettaglio              *
      *                  *---------------------------------------------*
           perform   gri-vuo-det-000      thru gri-vuo-det-999        .
      *                  *---------------------------------------------*
      *                  * Progressivo documenti                       *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      01                   to   p-pos                  .
           move      w-tot-gen-ctr-doc    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data registrazione                          *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      07                   to   p-pos                  .
           move      srt-dat-reg          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data documento                              *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      17                   to   p-pos                  .
           move      srt-dat-doc          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Codice archivio                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      30                   to   p-pos                  .
           move      srt-cod-arc          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ragione sociale archivio                    *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      39                   to   p-pos                  .
           move      srt-rag-soc          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Imponibile, codice iva, imposta prima riga  *
      *                  *---------------------------------------------*
           move      1                    to   w-det-cst-iva-ctr      .
      *
           if        srt-cod-iva
                    (w-det-cst-iva-ctr)   =    zero
                     go to  prn-liv-det-300.
      *
           perform   ibl-cod-imp-000      thru ibl-cod-imp-999        .
       prn-liv-det-300.
      *                  *---------------------------------------------*
      *                  * Totale documento                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "GB"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      118                  to   p-pos                  .
           move      srt-tot-doc          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-400.
      *              *-------------------------------------------------*
      *              * Seconda riga di dettaglio                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Griglia vuota per il dettaglio              *
      *                  *---------------------------------------------*
           perform   gri-vuo-det-000      thru gri-vuo-det-999        .
      *                  *---------------------------------------------*
      *                  * Numero documento                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      13                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      07                   to   p-pos                  .
           move      srt-num-doc          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Partita iva                                 *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9B"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      27                   to   p-pos                  .
           move      srt-prt-iva          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Codice fiscale                              *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      16                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      39                   to   p-pos                  .
           move      srt-cod-fis          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Tipo documento da causale contabile         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [mgt]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofmgt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mgt                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [mgt]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "DATREG"             to   f-key                  .
           move      srt-dat-reg          to   rf-mgt-dat-reg         .
           move      srt-num-prt          to   rf-mgt-num-prt         .
           move      "pgm/cge/fls/ioc/obj/iofmgt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mgt                 .
      *                      *-----------------------------------------*
      *                      * Test su esito lettura                   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     move  spaces         to   rf-mgt-des-cau         .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      59                   to   p-pos                  .
           move      rf-mgt-des-cau       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Imponibile, codice iva, imposta             *
      *                  *---------------------------------------------*
           move      2                    to   w-det-cst-iva-ctr      .
      *
           if        srt-cod-iva
                    (w-det-cst-iva-ctr)   =    zero
                     go to  prn-liv-det-500.
      *
           perform   ibl-cod-imp-000      thru ibl-cod-imp-999        .
       prn-liv-det-500.
      *              *-------------------------------------------------*
      *              * Successive eventuali righe di dettaglio         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo 3..6                                  *
      *                  *---------------------------------------------*
           move      2                    to   w-det-cst-iva-ctr      .
       prn-liv-det-520.
           add       1                    to   w-det-cst-iva-ctr      .
           if        w-det-cst-iva-ctr    >    6
                     go to prn-liv-det-800.
      *                  *---------------------------------------------*
      *                  * Test su codice Iva                          *
      *                  *---------------------------------------------*
           if        srt-cod-iva
                    (w-det-cst-iva-ctr)   =    zero
                     go to  prn-liv-det-520.
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    2
                     go to  prn-liv-det-540.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  prn-liv-det-999.
       prn-liv-det-540.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Griglia vuota per il dettaglio              *
      *                  *---------------------------------------------*
           perform   gri-vuo-det-000      thru gri-vuo-det-999        .
      *                  *---------------------------------------------*
      *                  * Imponibile, codice iva, imposta             *
      *                  *---------------------------------------------*
           perform   ibl-cod-imp-000      thru ibl-cod-imp-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     prn-liv-det-520.
       prn-liv-det-800.
      *              *-------------------------------------------------*
      *              * Dettaglio per emissione sequenziale XML         *
      *              *-------------------------------------------------*
           move      "DE"                 to   w-out-gen-tip-ope      .
           perform   emi-fil-xml-000      thru emi-fil-xml-999        .
      *              *-------------------------------------------------*
      *              * Dettaglio per emissione sequenziale CSV         *
      *              *-------------------------------------------------*
           move      "DE"                 to   w-sta-emi-csv-ope      .
           perform   emi-fil-csv-000      thru emi-fil-csv-999        .
      *              *-------------------------------------------------*
      *              * Aggiornamento file [mgi]                        *
      *              *-------------------------------------------------*
           perform   agg-fil-mgi-000      thru agg-fil-mgi-999        .
       prn-liv-det-900.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Linea di fincatura                              *
      *              *-------------------------------------------------*
           perform   int-lin-sep-000      thru int-lin-sep-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Subroutine di aggiornamento totali mensili                *
      *    *-----------------------------------------------------------*
       prn-liv-det-agg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione preliminare totali              *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-ibl-fat          .
           move      zero                 to   w-tot-imp-fat          .
           move      zero                 to   w-tot-ibl-acq          .
           move      zero                 to   w-tot-imp-acq          .
       prn-liv-det-agg-100.
      *              *-------------------------------------------------*
      *              * Ciclo 1..6                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-tot-iva-ele-ctr      .
       prn-liv-det-agg-200.
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-tot-iva-ele-ctr      .
      *                  *---------------------------------------------*
      *                  * Test sul contatore                          *
      *                  *---------------------------------------------*
           if        w-tot-iva-ele-ctr    >    6
                     go to prn-liv-det-agg-900.
      *                  *---------------------------------------------*
      *                  * Se codice iva a zero : riciclo castelletto  *
      *                  *---------------------------------------------*
           if        srt-cod-iva
                    (w-tot-iva-ele-ctr)   =    zero
                     go to prn-liv-det-agg-200.
      *                  *---------------------------------------------*
      *                  * Esclusione Fuori campo Iva                  *
      *                  *---------------------------------------------*
           move      srt-cod-iva
                    (w-tot-iva-ele-ctr)   to   w-edt-iva-cod          .
      *
           if        w-edt-iva-cod-003    =    6
                     go to prn-liv-det-agg-200.
      *                  *---------------------------------------------*
      *                  * Esclusione art.15                           *
      *                  *---------------------------------------------*
           if        srt-cod-iva
                    (w-tot-iva-ele-ctr)   =    00515
                     go to prn-liv-det-agg-200.
       prn-liv-det-agg-300.
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo record      *
      *                  *---------------------------------------------*
           if        w-rot-l02-tip-arc    =    "C"
                     go to prn-liv-det-agg-400
           else if   w-rot-l02-tip-arc    =    "F"
                     go to prn-liv-det-agg-600
           else      go to prn-liv-det-agg-900.
       prn-liv-det-agg-400.
      *              *-------------------------------------------------*
      *              * Tipo record : Cliente                           *
      *              *-------------------------------------------------*
       prn-liv-det-agg-410.
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo iva         *
      *                  *---------------------------------------------*
           if        srt-tip-iva          =    "1" or
                     srt-tip-iva          =    "A"
                     go to prn-liv-det-agg-420
           else if   srt-tip-iva          =    "2" or
                     srt-tip-iva          =    "B"
                     go to prn-liv-det-agg-440
           else      go to prn-liv-det-agg-800.
       prn-liv-det-agg-420.
      *                  *=============================================*
      *                  * Tipo iva : Dare clienti                     *
      *                  *---------------------------------------------*
           add       srt-ibl-iva
                    (w-tot-iva-ele-ctr)   to   w-tot-ibl-fat          .
      *                  *---------------------------------------------*
      *                  * Test su flag di regime particolare per      *
      *                  * Split Payement                              *
      *                  *---------------------------------------------*
           if        srt-flg-rfp          =    "S"
                     go to prn-liv-det-agg-430.
           add       srt-imp-iva
                    (w-tot-iva-ele-ctr)   to   w-tot-imp-fat          .
       prn-liv-det-agg-430.
      *                  *---------------------------------------------*
      *                  * A riciclo su castelletto Iva                *
      *                  *---------------------------------------------*
           go to     prn-liv-det-agg-800.
       prn-liv-det-agg-440.
      *                  *=============================================*
      *                  * Tipo iva : Avere clienti                    *
      *                  *---------------------------------------------*
           subtract  srt-ibl-iva
                    (w-tot-iva-ele-ctr)   from w-tot-ibl-fat          .
      *                  *---------------------------------------------*
      *                  * Test su flag di regime particolare per      *
      *                  * Split Payement                              *
      *                  *---------------------------------------------*
           if        srt-flg-rfp          =    "S"
                     go to prn-liv-det-agg-450.
           subtract  srt-imp-iva
                    (w-tot-iva-ele-ctr)   from w-tot-imp-fat          .
       prn-liv-det-agg-450.
      *                  *---------------------------------------------*
      *                  * A riciclo su castelletto Iva                *
      *                  *---------------------------------------------*
           go to     prn-liv-det-agg-800.
       prn-liv-det-agg-600.
      *              *-------------------------------------------------*
      *              * Tipo record : Fornitore                         *
      *              *-------------------------------------------------*
       prn-liv-det-agg-610.
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo iva         *
      *                  *---------------------------------------------*
           if        srt-tip-iva          =    "5" or
                     srt-tip-iva          =    "6"
                     go to prn-liv-det-agg-620
           else if   srt-tip-iva          =    "4"
                     go to prn-liv-det-agg-640
           else if   srt-tip-iva          =    "E"
                     go to prn-liv-det-agg-660
           else if   srt-tip-iva          =    "D"
                     go to prn-liv-det-agg-680
           else      go to prn-liv-det-agg-800.
       prn-liv-det-agg-620.
      *                  *=============================================*
      *                  * Tipo iva : Avere fornitori Italia           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Aggiornamento imponibile                *
      *                      *-----------------------------------------*
           add       srt-ibl-iva
                    (w-tot-iva-ele-ctr)   to   w-tot-ibl-acq          .
      *                      *-----------------------------------------*
      *                      * Se Iva indetraibile                     *
      *                      *-----------------------------------------*
           move      srt-cod-iva
                    (w-tot-iva-ele-ctr)   to   w-edt-iva-cod          .
      *
           if        w-edt-iva-cod-003    =    7
                     go to prn-liv-det-agg-624.
      *                      *-----------------------------------------*
      *                      * Aggiornamento Imposta                   *
      *                      *-----------------------------------------*
           add       srt-imp-iva
                    (w-tot-iva-ele-ctr)   to   w-tot-imp-acq          .
       prn-liv-det-agg-624.
      *                      *-----------------------------------------*
      *                      * Se Reverse Charge : decremento totali   *
      *                      *                     vendite             *
      *                      *                                         *
      *                      * N.B.: non si esegue, in quanto le auto- *
      *                      *       fatture vengono gia' escluse tra- *
      *                      *       mite l'inibizione del Cliente     *
      *                      *       relativo                          *
      *                      *-----------------------------------------*
           go to     prn-liv-det-agg-628.
      *
           if        srt-flg-rfp          not  = "R"
                     go to prn-liv-det-agg-628.
           subtract  srt-ibl-iva
                    (w-tot-iva-ele-ctr)   from w-tot-ibl-fat          .
           subtract  srt-imp-iva
                    (w-tot-iva-ele-ctr)   from w-tot-imp-fat          .
       prn-liv-det-agg-628.
      *                  *---------------------------------------------*
      *                  * A riciclo su castelletto Iva                *
      *                  *---------------------------------------------*
           go to     prn-liv-det-agg-800.
       prn-liv-det-agg-640.
      *                  *=============================================*
      *                  * Tipo iva : Dare fornitori Italia            *
      *                  *---------------------------------------------*
           subtract  srt-ibl-iva
                    (w-tot-iva-ele-ctr)   from w-tot-ibl-acq          .
           subtract  srt-imp-iva
                    (w-tot-iva-ele-ctr)   from w-tot-imp-acq          .
      *                  *---------------------------------------------*
      *                  * Se Reverse Charge : incremento totali       *
      *                  * vendite                                     *
      *                  *                                             *
      *                  * N.B.: non si esegue, in quanto le autofat-  *
      *                  *       ture vengono gia' escluse tramite     *
      *                  *       l'inibizione del Cliente Autofatture  *
      *                  *---------------------------------------------*
           if        srt-flg-rfp          not  = "R"
                     go to prn-liv-det-agg-648.
           go to     prn-liv-det-agg-648.
      *
           add       srt-ibl-iva
                    (w-tot-iva-ele-ctr)   to   w-tot-ibl-fat          .
           add       srt-imp-iva
                    (w-tot-iva-ele-ctr)   to   w-tot-imp-fat          .
       prn-liv-det-agg-648.
      *                  *---------------------------------------------*
      *                  * A riciclo su castelletto Iva                *
      *                  *---------------------------------------------*
           go to     prn-liv-det-agg-800.
       prn-liv-det-agg-660.
      *                  *=============================================*
      *                  * Tipo iva : Avere fornitori CEE              *
      *                  *---------------------------------------------*
           add       srt-ibl-iva
                    (w-tot-iva-ele-ctr)   to   w-tot-ibl-acq          .
           add       srt-imp-iva
                    (w-tot-iva-ele-ctr)   to   w-tot-imp-acq          .
      *                  *---------------------------------------------*
      *                  * A riciclo su castelletto Iva                *
      *                  *---------------------------------------------*
           go to     prn-liv-det-agg-800.
       prn-liv-det-agg-680.
      *                  *=============================================*
      *                  * Tipo iva : Dare fornitori CEE               *
      *                  *---------------------------------------------*
           subtract  srt-ibl-iva
                    (w-tot-iva-ele-ctr)   from w-tot-ibl-acq          .
           subtract  srt-imp-iva
                    (w-tot-iva-ele-ctr)   from w-tot-imp-acq          .
      *                  *---------------------------------------------*
      *                  * A riciclo su castelletto Iva                *
      *                  *---------------------------------------------*
           go to     prn-liv-det-agg-800.
       prn-liv-det-agg-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     prn-liv-det-agg-200.
       prn-liv-det-agg-900.
      *              *-------------------------------------------------*
      *              * Estrazione anno e mese di esercizio dalla data  *
      *              * di registrazione                                *
      *              *-------------------------------------------------*
           move      srt-dat-reg          to   s-dat                  .
           move      s-saa                to   w-tot-iva-ele-sax      .
           move      s-mes                to   w-tot-iva-ele-mex      .
      *              *-------------------------------------------------*
      *              * Ricerca del singolo elemento per aggiornare     *
      *              *-------------------------------------------------*
           set       w-tot-iva-ele-inx    to   1                      .
           search    w-tot-iva-ele-ele
                     when    w-tot-iva-ele-saa
                            (w-tot-iva-ele-inx)
                                          =    w-tot-iva-ele-sax and
                             w-tot-iva-ele-mes
                            (w-tot-iva-ele-inx)
                                          =    w-tot-iva-ele-mex
                     go to   prn-liv-det-agg-920.
       prn-liv-det-agg-910.
      *                  *---------------------------------------------*
      *                  * Se elemento non trovato                     *
      *                  *---------------------------------------------*
           move      w-tot-iva-ele-sax    to   w-tot-iva-ele-saa
                                              (w-tot-iva-ele-mex)     .
           move      w-tot-iva-ele-mex    to   w-tot-iva-ele-mes
                                              (w-tot-iva-ele-mex)     .
           move      w-tot-ibl-fat        to   w-tot-iva-ele-ibv
                                              (w-tot-iva-ele-mex)     .
           move      w-tot-imp-fat        to   w-tot-iva-ele-imv
                                              (w-tot-iva-ele-mex)     .
           move      w-tot-ibl-acq        to   w-tot-iva-ele-iba
                                              (w-tot-iva-ele-mex)     .
           move      w-tot-imp-acq        to   w-tot-iva-ele-ima
                                              (w-tot-iva-ele-mex)     .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-agg-990.    
       prn-liv-det-agg-920.
      *                  *---------------------------------------------*
      *                  * Se elemento trovato                         *
      *                  *---------------------------------------------*
           add       w-tot-ibl-fat        to   w-tot-iva-ele-ibv
                                              (w-tot-iva-ele-mex)     .
           add       w-tot-imp-fat        to   w-tot-iva-ele-imv
                                              (w-tot-iva-ele-mex)     .
           add       w-tot-ibl-acq        to   w-tot-iva-ele-iba
                                              (w-tot-iva-ele-mex)     .
           add       w-tot-imp-acq        to   w-tot-iva-ele-ima
                                              (w-tot-iva-ele-mex)     .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-liv-det-agg-990.    
       prn-liv-det-agg-990.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-agg-999.
       prn-liv-det-agg-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio                                       *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Preparazione parametri intestazione standard    *
      *              *-------------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "ELENCO DOCUMENTI -" to   w-all-str-cat (1)      .
           move      rr-prd-tpr-lit       to   w-all-str-cat (2)      .
      *
           if        w-rot-l02-tip-arc    =    "C"
                     move  "- FATTURE EMESSE"
                                          to   w-all-str-cat (3)
           else      move  "- FATTURE RICEVUTE"
                                          to   w-all-str-cat (3)      .
      *
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-cnt-tit-des-tit      .
       int-pag-sta-300.
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-cnt-tit-dat-stp      .
           move      p-pag                to   w-cnt-tit-num-pag      .
           add       1                    to   w-cnt-tit-num-pag      .
      *              *-------------------------------------------------*
      *              * Intestazione standard                           *
      *              *-------------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per interruzione forzata          *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  int-pag-sta-999.
      *              *-------------------------------------------------*
      *              * Fincatura per dettaglio                         *
      *              *-------------------------------------------------*
           perform   fin-liv-det-000      thru fin-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Posizionamento fisso per lasciare una inter-    *
      *              * linea di separazione                            *
      *              *-------------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       1
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Fincatura per il livello di dettaglio                     *
      *    *-----------------------------------------------------------*
       fin-liv-det-000.
      *              *-------------------------------------------------*
      *              * Interlinea subordinata                          *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       02
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * 1. linea di fincatura                           *
      *              *-------------------------------------------------*
           perform   int-lin-sep-000      thru int-lin-sep-999        .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * 2. linea di fincatura                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "     |Data reg Data docum|  Codice   |            
      -              "Ragione sociale             |  Imponibile  |  Iva 
      -              " |   Imposta    |Tot. documento|"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * 3. linea di fincatura                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "     | Num. documumento  |Partita iva| Codice Fisc
      -              "ale     Tipo documento      |              |      
      -              " |              |              |"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * 4. linea di fincatura                           *
      *              *-------------------------------------------------*
           perform   int-lin-sep-000      thru int-lin-sep-999        .
       fin-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Griglia vuota per il livello di dettaglio                 *
      *    *-----------------------------------------------------------*
       gri-vuo-det-000.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "     |                   |           |            
      -              "                            |              |      
      -              " |              |              |"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       gri-vuo-det-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio - linea di separazione                *
      *    *-----------------------------------------------------------*
       int-lin-sep-000.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "     +-------------------+-----------+------------
      -              "----------------------------+--------------+------
      -              "-+--------------+--------------+"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-lin-sep-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione per il livello di dettaglio di imponibile, co- *
      *    * dice iva e imposta iva                                    *
      *    *-----------------------------------------------------------*
       ibl-cod-imp-000.
      *              *-------------------------------------------------*
      *              * Imponibile                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "BG"                 to   p-edm                  .
           move      srt-ibl-iva
                    (w-det-cst-iva-ctr)   to   p-num                  .           
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Allineamento a destra                       *
      *                  *---------------------------------------------*
           move      14                   to   w-all-str-lun          .
           move      p-edt                to   w-all-str-alf          .
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      80                   to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Codice iva                                      *
      *              *-------------------------------------------------*
           move      srt-cod-iva
                    (w-det-cst-iva-ctr)   to   w-edt-iva-cod          .
           perform   edt-cod-iva-000      thru edt-cod-iva-999        .
      *
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "BD"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      96                   to   p-pos                  .
           move      w-edt-iva-cie        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Imposta iva o titolo esenzione prima riga       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Caso imposta iva                            *
      *                  *---------------------------------------------*
           if        srt-imp-iva
                    (w-det-cst-iva-ctr)   =    zero
                     go to  ibl-cod-imp-100.
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "BG"                 to   p-edm                  .
           move      srt-imp-iva
                    (w-det-cst-iva-ctr)   to   p-num                  .           
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Allineamento a destra                       *
      *                  *---------------------------------------------*
           move      14                   to   w-all-str-lun          .
           move      p-edt                to   w-all-str-alf          .
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      103                  to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ibl-cod-imp-999.
       ibl-cod-imp-100.
      *                  *---------------------------------------------*
      *                  * Caso titolo di esenzione                    *
      *                  *---------------------------------------------*
       ibl-cod-imp-999.
           exit.

      *    *===========================================================*
      *    * Subroutine di stampa importo                              *
      *    *-----------------------------------------------------------*
       stp-num-val-000.
      *              *-------------------------------------------------*
      *              * Test sul campo in input                         *
      *              *-------------------------------------------------*
           if        w-stp-num-val-val    >    99999999999 or
                     w-stp-num-val-val    <    -9999999999
                     go to stp-num-val-200.
       stp-num-val-100.
      *              *-------------------------------------------------*
      *              * Valore fino a 99999999999                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      "BG"                 to   p-edm                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-num-val-pos    to   p-pos                  .
           move      w-stp-num-val-val    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     stp-num-val-900.
       stp-num-val-200.
      *              *-------------------------------------------------*
      *              * Valore oltre a 99999999999                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      12                   to   p-car                  .
           move      "B"                  to   p-edm                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-stp-num-val-pos    to   p-pos                  .
           move      w-stp-num-val-val    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     stp-num-val-900.
       stp-num-val-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-num-val-999.
       stp-num-val-999.
           exit.

      *    *===========================================================*
      *    * Controllo formale su partita i.v.a.                       *
      *    *                                                           *
      *    * Input  : w-cnt-piv-piv = partita i.v.a. da controllare    *
      *    *                                                           *
      *    * Output : w-cnt-piv-flg = - spaces : p.i. corretta         *
      *    *                          - #      : p.i. errata           *
      *    *-----------------------------------------------------------*
       cnt-prt-iva-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-piv-flg          .
      *              *-------------------------------------------------*
      *              * Se p.i. a zero si esce per OK                   *
      *              *-------------------------------------------------*
           if        w-cnt-piv-piv        =    zero
                     go to cnt-prt-iva-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione contatore caratteri e sommato- *
      *              * ria dei primi dieci caratteri                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-piv-ctr
                                               w-cnt-piv-sum          .
       cnt-prt-iva-100.
      *              *-------------------------------------------------*
      *              * Incremento contatore caratteri                  *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-piv-ctr          .
      *              *-------------------------------------------------*
      *              * Se entro i primi dieci caratteri                *
      *              *-------------------------------------------------*
           if        w-cnt-piv-ctr        >    10
                     go to cnt-prt-iva-500.
      *                  *---------------------------------------------*
      *                  * Se 1. o 3. o 5. o 7. o 9. carattere         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Somma del carattere nella sommatoria    *
      *                      *-----------------------------------------*
           add       w-cnt-piv-chr
                    (w-cnt-piv-ctr)       to   w-cnt-piv-sum          .
      *                  *---------------------------------------------*
      *                  * Se 2. o 4. o 6. o 8. o 10. carattere        *
      *                  *---------------------------------------------*
           add       1                    to   w-cnt-piv-ctr          .
      *                      *-----------------------------------------*
      *                      * Moltiplica il carattere per due         *
      *                      *-----------------------------------------*
           multiply  2                    by   w-cnt-piv-chr
                                              (w-cnt-piv-ctr)
                                        giving w-cnt-piv-w20          .
      *                      *-----------------------------------------*
      *                      * Somma nella sommatoria il carattere si- *
      *                      * nistro e il carattere destro del risul- *
      *                      * tato della moltiplicazione              *
      *                      *-----------------------------------------*
           add       w-cnt-piv-w21        to   w-cnt-piv-sum          .
           add       w-cnt-piv-w22        to   w-cnt-piv-sum          .
      *                  *---------------------------------------------*
      *                  * Ricicla su prossimo carattere               *
      *                  *---------------------------------------------*
           go to     cnt-prt-iva-100.
       cnt-prt-iva-500.
      *              *-------------------------------------------------*
      *              * Se undicesimo carattere                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Calcolo della differenza tra 100 e la som-  *
      *                  * matoria calcolata                           *
      *                  *---------------------------------------------*
           subtract  w-cnt-piv-sum        from 100
                                        giving w-cnt-piv-w20          .
      *                  *---------------------------------------------*
      *                  * Confronto tra la cifra di destra della dif- *
      *                  * ferenza e l'undicesimo carattere : se  non  *
      *                  * sono uguali c'e' un errore formale          *
      *                  *---------------------------------------------*
           if        w-cnt-piv-w22        not  = w-cnt-piv-chr
                                                (w-cnt-piv-ctr)
                     move  "#"            to   w-cnt-piv-flg          .
       cnt-prt-iva-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *-----------------------------------------------------------*
       emi-fil-xml-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo operazione      *
      *              *-------------------------------------------------*
           if        w-out-gen-tip-ope    =    "IN"
                     go to emi-fil-xml-100
           else if   w-out-gen-tip-ope    =    "ID"
                     go to emi-fil-xml-200
           else if   w-out-gen-tip-ope    =    "DE"
                     go to emi-fil-xml-300
           else if   w-out-gen-tip-ope    =    "CD"
                     go to emi-fil-xml-400
           else if   w-out-gen-tip-ope    =    "AA"
                     go to emi-fil-xml-500
           else if   w-out-gen-tip-ope    =    "CA"
                     go to emi-fil-xml-600
           else if   w-out-gen-tip-ope    =    "CL"
                     go to emi-fil-xml-800
           else      go to emi-fil-xml-900.
       emi-fil-xml-100.
      *              *=================================================*
      *              * Inizializzazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione [ada]                       *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                  *---------------------------------------------*
      *                  * Lettura [ada] Sede                          *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODDPZ    "         to   f-key                  .
           move      zero                 to   rf-ada-cod-dpz         .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                  *---------------------------------------------*
      *                  * Progressivo univoco                         *
      *                  *                                             *
      *                  * Il progressivo univoco del file e' rappre-  *
      *                  * sentato da una stringa alfanumerica di lun- *
      *                  * ghezza massima di 5 caratteri e con valori  *
      *                  * ammessi [a-z], [A-Z], [0-9]                 *
      *                  *                                             *
      *                  * Attualmente e' composta da:                 *
      *                  *                                             *
      *                  * - Tipo di fatture          : E o R          *
      *                  * - Semestre o trimestre     : 9              *
      *                  * - Indicatore               : S o T          *
      *                  * - Anno dichiarazione       : 99             *
      *                  *                                             *
      *                  * Esempio: E1S17 = Fatture Emesse 1' semestre *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing periodo dichiarazione           *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      rr-prd-tpr-inx       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-det-edt-val-mes      .
      *                      *-----------------------------------------*
      *                      * Editing anno dichiarazione              *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      rr-dat-ini
                    (02 : 02)             to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-det-edt-val-ann      .
      *                  *---------------------------------------------*
      *                  * Composizione identificatore univoco         *
      *                  *---------------------------------------------*
           move      05                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
      *
           if        w-rot-l02-tip-arc    =    "C"
                     move  "E"            to   w-all-str-cat (1)
           else      move  "R"            to   w-all-str-cat (1)      .
      *
           move      w-det-edt-val-mes    to   w-all-str-cat (2)      .
           move      w-det-edt-val-ann    to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-det-edt-val-ide      .
      *                  *---------------------------------------------*
      *                  * Composizione nome file                      *
      *                  *---------------------------------------------*
           move      30                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      "IT"                 to   w-all-str-cat (1)      .
           move      rf-ada-cod-fis       to   w-all-str-cat (2)      .
           move      "_DF_"               to   w-all-str-cat (3)      .
           move      w-det-edt-val-ide    to   w-all-str-cat (4)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                  *---------------------------------------------*
      *                  * Apertura del file in output                 *
      *                  *---------------------------------------------*
           move      w-all-str-alf        to   w-det-pth-fso-nam      .
           move      "xml"                to   w-det-pth-fso-ext      .
           perform   det-pth-fso-000      thru det-pth-fso-999        .
      *                  *---------------------------------------------*
      *                  * Apertura del file in output                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      w-det-pth-fso-pth    to   g-pat                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       emi-fil-xml-150.
      *                  *---------------------------------------------*
      *                  * Pulizia preliminare record sequenziale      *
      *                  *---------------------------------------------*
           move      spaces               to   g-rec                  .
      *                  *---------------------------------------------*
      *                  * Header                                      *
      *                  *---------------------------------------------*
           perform   emi-fil-xml-hea-000  thru emi-fil-xml-hea-999    .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-900.
       emi-fil-xml-200.
      *              *=================================================*
      *              * Inizializzazione Dettaglio                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine inizializzazione Dettaglio       *
      *                  *---------------------------------------------*
           perform   emi-fil-xml-din-000  thru emi-fil-xml-din-999    .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-900.
       emi-fil-xml-300.
      *              *=================================================*
      *              * Dettaglio                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo archivio in   *
      *                  * corso di trattamento                        *
      *                  *---------------------------------------------*
           if        w-rot-l02-tip-arc    =    "C"
                     perform   emi-fil-xml-dic-000
                                          thru emi-fil-xml-dic-999
           else      perform   emi-fil-xml-dif-000
                                          thru emi-fil-xml-dif-999    .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-900.
       emi-fil-xml-400.
      *              *=================================================*
      *              * Chiusura dettaglio                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura tag 'DTE' o 'DTR'                  *
      *                  *---------------------------------------------*
           if        w-rot-l02-tip-arc    =    "C"
                     move  "DTE"          to   w-sta-emi-xml-pmt
           else      move  "DTR"          to   w-sta-emi-xml-pmt      .
      *
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *                  *---------------------------------------------*
      *                  * Chiusura tag 'DatiFattura'                  *
      *                  *---------------------------------------------*
           move      "ns2:DatiFattura"    to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-900.
       emi-fil-xml-500.
      *              *=================================================*
      *              * Apertura archivio                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo archivio in   *
      *                  * corso di trattamento                        *
      *                  *---------------------------------------------*
           if        w-rot-l02-tip-arc    =    "C"
                     perform   emi-fil-xml-apc-000
                                          thru emi-fil-xml-apc-999
           else      perform   emi-fil-xml-apf-000
                                          thru emi-fil-xml-apf-999    .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-900.
       emi-fil-xml-600.
      *              *=================================================*
      *              * Chiusura archivio                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo archivio in   *
      *                  * corso di trattamento                        *
      *                  *---------------------------------------------*
           if        w-rot-l02-tip-arc    =    "C"
                     perform   emi-fil-xml-clc-000
                                          thru emi-fil-xml-clc-999
           else      perform   emi-fil-xml-clf-000
                                          thru emi-fil-xml-clf-999    .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-900.
       emi-fil-xml-800.
      *              *=================================================*
      *              * Chiusura                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura del file in output                 *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo utilizzato             *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mcvout"                         .
       emi-fil-xml-820.
      *                  *---------------------------------------------*
      *                  * Eventuale messaggio di dati elaborati       *
      *                  *---------------------------------------------*
           if        w-tot-gen-ctr-ele    not  > zero
                     go to emi-fil-xml-900.
      *                  *---------------------------------------------*
      *                  * Separatore                                  *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      all "-"              to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Messaggio per nome file                     *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "Preparato archivio" to   w-all-str-cat (1)      .
      *
           if        w-rot-l02-tip-arc    =    "C"
                     move  "{DTE}"        to   w-all-str-cat (2)
           else      move  "{DTR}"        to   w-all-str-cat (2)      .
      *
           move      ": [cbi/"            to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      w-det-pth-fso-nam    to   w-all-str-cat (2)      .
           move      ".xml]"              to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *
           move      "WR"                 to   m-ope                  .
           move      w-all-str-alf        to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Editing contatore archivi                   *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<BG"                to   p-edm                  .
           move      w-tot-gen-ctr-ele    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (2)      .
      *                  *---------------------------------------------*
      *                  * Editing contatore documenti                 *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<BG"                to   p-edm                  .
           move      w-tot-gen-ctr-doc    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (5)      .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      06                   to   w-all-str-num          .
           move      "Estratti nr."       to   w-all-str-cat (1)      .
      *
           if        w-rot-l02-tip-arc    =    "C"
                     move  "Clienti"      to   w-all-str-cat (3)
           else      move  "Fornitori"    to   w-all-str-cat (3)      .
      *
           move      "per un totale di "  to   w-all-str-cat (4)      .
           move      "documenti"          to   w-all-str-cat (6)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                  *---------------------------------------------*
      *                  * Messaggio per contatore elementi            *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-all-str-alf        to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Separatore                                  *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      all "-"              to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-900.
       emi-fil-xml-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-999.
       emi-fil-xml-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * 'Header'                                                  *
      *    *-----------------------------------------------------------*
       emi-fil-xml-hea-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione indice di indentazione xml      *
      *              *-------------------------------------------------*
           move      zero                 to   w-sta-emi-xml-inx      .
       emi-fil-xml-hea-100.
      *              *-------------------------------------------------*
      *              * Apertura file PA - direttiva xml                *
      *              *-------------------------------------------------*
           move      "<?xml version=""1.0"" encoding=""UTF-8"" standalon
      -              "e=""yes""?>"        to   g-rec                  .
      *                  *---------------------------------------------*
      *                  * Scrittura record                            *
      *                  *---------------------------------------------*
           perform   put-nxt-out-000      thru put-nxt-out-999        .
       emi-fil-xml-hea-200.
      *              *-------------------------------------------------*
      *              * Foglio di stile - direttiva xml                 *
      *              *-------------------------------------------------*
           move      "<ns2:DatiFattura versione=""DAT20"" xmlns:ns2=""ht
      -              "tp://ivaservizi.agenziaentrate.gov.it/docs/xsd/fat
      -              "ture/v2.0"">"       to   g-rec                  .
      *                  *---------------------------------------------*
      *                  * Scrittura record                            *
      *                  *---------------------------------------------*
           perform   put-nxt-out-000      thru put-nxt-out-999        .
       emi-fil-xml-hea-400.
      *              *-------------------------------------------------*
      *              * Apertura tag 'DatiFatturaHeader'                *
      *              *-------------------------------------------------*
           move      "DatiFatturaHeader"  to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'ProgressivoInvio'                *
      *              *-------------------------------------------------*
           move      "ProgressivoInvio"   to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-det-edt-val-ide    to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'IdSistema'                       *
      *              *                                                 *
      *              * Elemento da NON valorizzare                     *
      *              *-------------------------------------------------*
      *              *-------------------------------------------------*
      *              * Chiusura tag 'DatiFatturaHeader'                *
      *              *-------------------------------------------------*
           move      "DatiFatturaHeader"  to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-hea-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-hea-999.
       emi-fil-xml-hea-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Inizializzazione Dettaglio                                *
      *    *-----------------------------------------------------------*
       emi-fil-xml-din-000.
      *              *-------------------------------------------------*
      *              * Apertura tag 'DTE' o 'DTR'                      *
      *              *-------------------------------------------------*
           if        w-rot-l02-tip-arc    =    "C"
                     move  "DTE"          to   w-sta-emi-xml-pmt
           else      move  "DTR"          to   w-sta-emi-xml-pmt      .
      *
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-din-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-din-999.
       emi-fil-xml-din-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Dati azienda                                              *
      *    *-----------------------------------------------------------*
       emi-fil-xml-azi-000.
      *              *-------------------------------------------------*
      *              * Apertura tag 'IdentificativiFiscali'            *
      *              *-------------------------------------------------*
           move      "IdentificativiFiscali"
                                          to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'IdFiscaleIVA'                     *
      *              *-------------------------------------------------*
           move      "IdFiscaleIVA"       to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'IdPaese'                         *
      *              *                                                 *
      *              * N.B.: Codice della nazione espresso secondo lo  *
      *              *       standard ISO 3166-1 alpha-2 code          *
      *              *-------------------------------------------------*
           move      "IdPaese"            to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "IT"                 to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'IdCodice'                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing Partita Iva                         *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      rf-ada-prt-iva       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione tag                               *
      *                  *---------------------------------------------*
           move      "IdCodice"           to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      p-edt                to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'IdFiscaleIVA'                     *
      *              *-------------------------------------------------*
           move      "IdFiscaleIVA"       to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'CodiceFiscale'                   *
      *              *                                                 *
      *              * N.B.: Tag Facoltativo                           *
      *              *-------------------------------------------------*
      *              *-------------------------------------------------*
      *              * Chiusura tag 'IdentificativiFiscali'            *
      *              *-------------------------------------------------*
           move      "IdentificativiFiscali"
                                          to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'AltriDatiIdentificativi'          *
      *              *-------------------------------------------------*
           move      "AltriDatiIdentificativi"
                                          to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'Denominazione'                   *
      *              *-------------------------------------------------*
           move      "Denominazione"      to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      rf-ada-rag-soc       to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Sede'                             *
      *              *-------------------------------------------------*
           move      "Sede"               to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'Indirizzo'                       *
      *              *-------------------------------------------------*
           move      "Indirizzo"          to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      rf-ada-via-azi       to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Lettura file [gxc]                              *
      *              *-------------------------------------------------*
           move      "C"                  to   w-let-arc-gxc-tip      .
           move      rf-ada-cod-cmn       to   w-let-arc-gxc-cmn      .
           move      zero                 to   w-let-arc-gxc-fzn      .
           move      zero                 to   w-let-arc-gxc-lct      .
           perform   let-arc-gxc-000      thru let-arc-gxc-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'CAP'                             *
      *              *-------------------------------------------------*
           move      "CAP"                to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-let-arc-gxc-cap    to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'Comune'                          *
      *              *-------------------------------------------------*
           move      "Comune"             to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-let-arc-gxc-des    to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'Provincia'                       *
      *              *-------------------------------------------------*
           move      "Provincia"          to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-let-arc-gxc-prv    to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'Nazione'                         *
      *              *-------------------------------------------------*
           move      "Nazione"            to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "IT"                 to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'Sede'                             *
      *              *-------------------------------------------------*
           move      "Sede"               to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'AltriDatiIdentificativi'          *
      *              *-------------------------------------------------*
           move      "AltriDatiIdentificativi"
                                          to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-azi-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-azi-999.
       emi-fil-xml-azi-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Apertura archivio                                         *
      *    *                                                           *
      *    * Clienti                                                   *
      *    *-----------------------------------------------------------*
       emi-fil-xml-apc-000.
      *              *-------------------------------------------------*
      *              * Tag 'CedentePrestatoreDTE' solo se primo record *
      *              *-------------------------------------------------*
           if        w-tot-gen-ctr-ele    >    1
           go to     emi-fil-xml-apc-200.
      *              *-------------------------------------------------*
      *              * Apertura tag 'CedentePrestatoreDTE'             *
      *              *-------------------------------------------------*
           move      "CedentePrestatoreDTE"
                                          to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione dati azienda                          *
      *              *-------------------------------------------------*
           perform   emi-fil-xml-azi-000  thru emi-fil-xml-azi-999    .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'CedentePrestatoreDTE'             *
      *              *-------------------------------------------------*
           move      "CedentePrestatoreDTE"
                                          to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-apc-200.
      *              *-------------------------------------------------*
      *              * Apertura tag 'CessionarioCommittenteDTE'        *
      *              *-------------------------------------------------*
           move      "CessionarioCommittenteDTE"
                                          to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Subroutine per 'IdentificativiFiscali'          *
      *              *-------------------------------------------------*
           perform   emi-fil-xml-idf-000  thru emi-fil-xml-idf-999    .
      *              *-------------------------------------------------*
      *              * Subroutine per 'AltriDatiIdentificativi'        *
      *              *-------------------------------------------------*
           perform   emi-fil-xml-adi-000  thru emi-fil-xml-adi-999    .
       emi-fil-xml-apc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-apc-999.
       emi-fil-xml-apc-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Chiusura archivio                                         *
      *    *                                                           *
      *    * Clienti                                                   *
      *    *-----------------------------------------------------------*
       emi-fil-xml-clc-000.
      *              *-------------------------------------------------*
      *              * Chiusura tag 'CessionarioCommittenteDTE'        *
      *              *-------------------------------------------------*
           move      "CessionarioCommittenteDTE"
                                          to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-clc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-clc-999.
       emi-fil-xml-clc-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Inizializzazione Dettaglio                                *
      *    *                                                           *
      *    * Clienti                                                   *
      *    *-----------------------------------------------------------*
       emi-fil-xml-dic-000.
      *              *-------------------------------------------------*
      *              * Apertura tag 'DatiFatturaBodyDTE'               *
      *              *-------------------------------------------------*
           move      "DatiFatturaBodyDTE" to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'DatiGenerali'                     *
      *              *-------------------------------------------------*
           move      "DatiGenerali"       to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-dic-400.
      *              *-------------------------------------------------*
      *              * Emissione tag 'TipoDocumento'           Clienti *
      *              *                                                 *
      *              * 'TD01' : Fattura                           (*)  *
      *              * 'TD04' : Nota di credito                   (*)  *
      *              * 'TD05' : Nota di debito                    (*)  *
      *              * 'TD07' : Fattura semplificata                   *
      *              * 'TD08' : Nota di credito semplificata           *
      *              *                                                 *
      *              * N.B. : Attualmente gestiti solo quelli con (*)  *
      *              *                                                 *
      *              * ___ SISTEMARE ___                               *
      *              *-------------------------------------------------*
           move      "TipoDocumento"      to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
      *
           if        srt-tip-doc          =    "F"
                     move  "TD01"         to   w-sta-emi-xml-val
           else if   srt-tip-doc          =    "C"
                     move  "TD04"         to   w-sta-emi-xml-val
           else if   srt-tip-doc          =    "D"
                     move  "TD05"         to   w-sta-emi-xml-val
           else      move  "TD01"         to   w-sta-emi-xml-val      .
      *
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-dic-420.
      *              *-------------------------------------------------*
      *              * Emissione tag 'Data'                            *
      *              *-------------------------------------------------*
           move      srt-dat-doc          to   w-sta-emi-xml-dat      .
           move      "Data"               to   w-sta-emi-xml-pmt      .
           perform   emi-fil-xml-dat-000  thru emi-fil-xml-dat-999    .
       emi-fil-xml-dic-440.
      *              *-------------------------------------------------*
      *              * Emissione tag 'Numero'                          *
      *              *-------------------------------------------------*
           move      "Numero"             to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      srt-num-doc          to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'DatiGenerali'                     *
      *              *-------------------------------------------------*
           move      "DatiGenerali"       to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-dic-500.
      *              *-------------------------------------------------*
      *              * Castelletto IVA                                 *
      *              *-------------------------------------------------*
           perform   emi-fil-xml-rie-000  thru emi-fil-xml-rie-999    .
       emi-fil-xml-dic-800.
      *              *-------------------------------------------------*
      *              * Chiusura tag 'DatiFatturaBodyDTE'               *
      *              *-------------------------------------------------*
           move      "DatiFatturaBodyDTE" to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-dic-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-dic-999.
       emi-fil-xml-dic-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Apertura archivio                                         *
      *    *                                                           *
      *    * Fornitori                                                 *
      *    *-----------------------------------------------------------*
       emi-fil-xml-apf-000.
      *              *-------------------------------------------------*
      *              * Tag 'CessionarioCommittenteDTR' solo se primo   *
      *              * record                                          *
      *              *-------------------------------------------------*
           if        w-tot-gen-ctr-ele    >    1
           go to     emi-fil-xml-apf-200.
      *              *-------------------------------------------------*
      *              * Apertura tag 'CessionarioCommittenteDTR'        *
      *              *-------------------------------------------------*
           move      "CessionarioCommittenteDTR"
                                          to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
      *
           if        w-tot-gen-ctr-ele    =    1
                     move  "+"            to   w-sta-emi-xml-ind
           else      move  "="            to   w-sta-emi-xml-ind      .
      *
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione dati azienda                          *
      *              *-------------------------------------------------*
           perform   emi-fil-xml-azi-000  thru emi-fil-xml-azi-999    .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'CessionarioCommittenteDTR'        *
      *              *-------------------------------------------------*
           move      "CessionarioCommittenteDTR"
                                          to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-apf-200.
      *              *-------------------------------------------------*
      *              * Apertura tag 'CedentePrestatoreDTR'             *
      *              *-------------------------------------------------*
           move      "CedentePrestatoreDTR"
                                          to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Subroutine per 'IdentificativiFiscali'          *
      *              *-------------------------------------------------*
           perform   emi-fil-xml-idf-000  thru emi-fil-xml-idf-999    .
      *              *-------------------------------------------------*
      *              * Subroutine per 'AltriDatiIdentificativi'        *
      *              *-------------------------------------------------*
           perform   emi-fil-xml-adi-000  thru emi-fil-xml-adi-999    .
       emi-fil-xml-apf-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-apf-999.
       emi-fil-xml-apf-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Chiusura archivio                                         *
      *    *                                                           *
      *    * Fornitori                                                 *
      *    *-----------------------------------------------------------*
       emi-fil-xml-clf-000.
      *              *-------------------------------------------------*
      *              * Chiusura tag 'CedentePrestatoreDTR'             *
      *              *-------------------------------------------------*
           move      "CedentePrestatoreDTR"
                                          to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-clf-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-clf-999.
       emi-fil-xml-clf-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Inizializzazione Dettaglio                                *
      *    *                                                           *
      *    * Fornitori                                                 *
      *    *-----------------------------------------------------------*
       emi-fil-xml-dif-000.
      *              *-------------------------------------------------*
      *              * Apertura tag 'DatiFatturaBodyDTR'               *
      *              *-------------------------------------------------*
           move      "DatiFatturaBodyDTR" to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'DatiGenerali'                     *
      *              *-------------------------------------------------*
           move      "DatiGenerali"       to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-dif-400.
      *              *-------------------------------------------------*
      *              * Emissione tag 'TipoDocumento'         Fornitori *
      *              *                                                 *
      *              * 'TD01' : Fattura                           (*)  *
      *              * 'TD04' : Nota di credito                   (*)  *
      *              * 'TD05' : Nota di debito                    (*)  *
      *              * 'TD07' : Fattura semplificata                   *
      *              * 'TD08' : Nota di credito semplificata           *
      *              * 'TD10' : Fattura acquisto CEE beni         (*)  *
      *              * 'TD11' : Fattura acquisto CEE servizi      (*)  *
      *              * 'TD12' : Fattura riepilogativa                  *
      *              *                                                 *
      *              * N.B. : Attualmente gestiti solo quelli con (*)  *
      *              *-------------------------------------------------*
           move      "TipoDocumento"      to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
      *
           if        srt-tip-doc          =    "F"
                     move  "TD01"         to   w-sta-emi-xml-val
           else if   srt-tip-doc          =    "M"
                     move  "TD10"         to   w-sta-emi-xml-val
           else if   srt-tip-doc          =    "S"
                     move  "TD11"         to   w-sta-emi-xml-val
           else if   srt-tip-doc          =    "C"
                     move  "TD04"         to   w-sta-emi-xml-val
           else if   srt-tip-doc          =    "D"
                     move  "TD05"         to   w-sta-emi-xml-val
           else      move  "TD01"         to   w-sta-emi-xml-val      .
      *
      
______*    Correzione SIRI (28/04/21)
           if        srt-naz-arc          =    "CH "
                     move  "TD01"         to   w-sta-emi-xml-val      .
______*    Correzione SIRI (28/04/21)
      
      
      
______*    if        srt-tip-iva          =    "E" and
______*              srt-tip-doc          =    "F"
______*              move  "TD18"         to   w-sta-emi-xml-val      .
      *
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-dif-420.
      *              *-------------------------------------------------*
      *              * Emissione tag 'Data' documento                  *
      *              *-------------------------------------------------*
           move      srt-dat-doc          to   w-sta-emi-xml-dat      .
           move      "Data"               to   w-sta-emi-xml-pmt      .
           perform   emi-fil-xml-dat-000  thru emi-fil-xml-dat-999    .
       emi-fil-xml-dif-440.
      *              *-------------------------------------------------*
      *              * Emissione tag 'Numero'                          *
      *              *-------------------------------------------------*
           move      "Numero"             to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      srt-num-doc          to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'DataRegistrazione'               *
      *              *-------------------------------------------------*
           move      srt-dat-reg          to   w-sta-emi-xml-dat      .
           move      "DataRegistrazione"  to   w-sta-emi-xml-pmt      .
           perform   emi-fil-xml-dat-000  thru emi-fil-xml-dat-999    .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'DatiGenerali'                     *
      *              *-------------------------------------------------*
           move      "DatiGenerali"       to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-dif-500.
      *              *-------------------------------------------------*
      *              * Castelletto IVA                                 *
      *              *-------------------------------------------------*
           perform   emi-fil-xml-rie-000  thru emi-fil-xml-rie-999    .
       emi-fil-xml-dif-600.
      *              *-------------------------------------------------*
      *              * Chiusura tag 'DatiFatturaBodyDTR'               *
      *              *-------------------------------------------------*
           move      "DatiFatturaBodyDTR" to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-dif-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-dif-999.
       emi-fil-xml-dif-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Emissione generica 'IdentificativiFiscali'                *
      *    *                                                           *
      *    * Campi obbligatori: Indirizzo, Comune, Nazione             *
      *    *                                                           *
      *    * Clienti e Fornitori                                       *
      *    *-----------------------------------------------------------*
       emi-fil-xml-idf-000.
      *              *-------------------------------------------------*
      *              * Apertura tag 'IdentificativiFiscali'            *
      *              *-------------------------------------------------*
           move      "IdentificativiFiscali"
                                          to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Test preliminare se Cliente o Fornitore Italia  *
      *              * senza Partita Iva ma con Codice Fiscale         *
      *              *-------------------------------------------------*
           if        srt-naz-arc          =    "IT "   and
                     srt-prt-iva          =    zero    and
                     srt-cod-fis          not  = spaces    
                     move  srt-cod-fis    to   w-det-edt-cod-fis
                     move  "#"            to   w-det-edt-cod-flg
                     go to emi-fil-xml-idf-400.
       emi-fil-xml-idf-050.
      *              *-------------------------------------------------*
      *              * Apertura tag 'IdFiscaleIVA'                     *
      *              *                                                 *
      *              * N.B.: la valorizzazione di questo blocco e' in  *
      *              *       alternativa non esclusiva a quella del-   *
      *              *       l'elemento CodiceFiscale; in altri ter-   *
      *              *       mini, puo' non essere valorizzato se e'   *
      *              *       valorizzato l'elemento CodiceFiscale;     *
      *              *       consente l'inserimento della partita IVA  *
      *              *       per i soggetti residenti in Italia, ov-   *
      *              *       vero operanti in Italia attraverso Stabi- *
      *              *       le Organizzazione, oppure dell'identifi-  *
      *              *       cativo fiscale assegnato dall'autorita'   *
      *              *       del proprio paese per i soggetti non re-  *
      *              *       sidenti                                   *
      *              *-------------------------------------------------*
           move      "IdFiscaleIVA"       to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'IdPaese'                         *
      *              *                                                 *
      *              * N.B.: Codice della nazione espresso secondo lo  *
      *              *       standard ISO 3166-1 alpha-2 code          *
      *              *-------------------------------------------------*
           move      "IdPaese"            to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
      *                  *---------------------------------------------*
      *                  * Eccezione bolle doganali                    *
      *                  *---------------------------------------------*
           if        srt-tip-iva          =    "6" and
                     srt-cod-bdg          =    zero
                     move  "OO"           to   w-sta-emi-xml-val
           else      move  srt-naz-arc    to   w-sta-emi-xml-val      .
      *
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-idf-100.
      *              *-------------------------------------------------*
      *              * Emissione tag 'IdCodice'                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione preliminare                 *
      *                  *---------------------------------------------*
           move      spaces               to   w-det-edt-cod-fis      .
           move      spaces               to   w-det-edt-cod-flg      .
      *                  *---------------------------------------------*
      *                  * Deviazione se Italiano o Estero             *
      *                  *---------------------------------------------*
           if        srt-naz-arc          not  = "IT "
                     go to emi-fil-xml-idf-150.
       emi-fil-xml-idf-110.
      *                  *---------------------------------------------*
      *                  * Italiano                                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Eccezione bolle doganali                *
      *                      *-----------------------------------------*
           if        srt-tip-iva          =    "6" and
                     srt-cod-bdg          =    zero
                     move  "99999999999"  to   w-det-edt-cod-fis
                     go to emi-fil-xml-idf-300.
      *                      *-----------------------------------------*
      *                      * Test se presente Partita Iva            *
      *                      *-----------------------------------------*
           if        srt-prt-iva          =    zero
                     go to emi-fil-xml-idf-130.
      *                      *-----------------------------------------*
      *                      * Controllo formale partita IVA           *
      *                      *-----------------------------------------*
           move      srt-prt-iva          to   w-cnt-piv-piv          .
           perform   cnt-prt-iva-000      thru cnt-prt-iva-999        .
           if        w-cnt-piv-flg        =    spaces
                     go to emi-fil-xml-idf-120.
      *                      *-----------------------------------------*
      *                      * Segnale di errore in partita IVA        *
      *                      *-----------------------------------------*
           move      w-rot-l02-tip-arc    to   w-err-ana-cof-tip      .
           move      srt-cod-arc          to   w-err-ana-cof-cod      .
           move      srt-rag-soc          to   w-err-ana-cof-rag      .
           move      "Partita Iva Formalmente scorretta!"
                                          to   w-err-ana-cof-err      .
           perform   emi-fil-xml-msg-000  thru emi-fil-xml-msg-999    .
       emi-fil-xml-idf-120.
      *                      *-----------------------------------------*
      *                      * Editing Partita Iva                     *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      srt-prt-iva          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-det-edt-cod-fis      .
      *                      *-----------------------------------------*
      *                      * A emissione TAG                         *
      *                      *-----------------------------------------*
           go to     emi-fil-xml-idf-300.
       emi-fil-xml-idf-130.
      *                      *-----------------------------------------*
      *                      * Se assente Partita Iva                  *
      *                      *-----------------------------------------*
           if        srt-cod-fis          not  = spaces
                     move  srt-cod-fis    to   w-det-edt-cod-fis
                     move  "#"            to   w-det-edt-cod-flg
                     go to emi-fil-xml-idf-300.
      *                      *-----------------------------------------*
      *                      * A errore                                *
      *                      *-----------------------------------------*
           go to     emi-fil-xml-idf-200.
       emi-fil-xml-idf-150.
      *                  *---------------------------------------------*
      *                  * Estero                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se codice fiscale presente         *
      *                      *-----------------------------------------*
           if        srt-cod-fis          =    spaces
                     go to emi-fil-xml-idf-200.
      *                      *-----------------------------------------*
      *                      * Codice fiscale                          *
      *                      *-----------------------------------------*
           move      srt-cod-fis          to   w-det-edt-cod-fis      .                  
      *                      *-----------------------------------------*
      *                      * A emissione TAG                         *
      *                      *-----------------------------------------*
           go to     emi-fil-xml-idf-300.
       emi-fil-xml-idf-200.
      *                  *---------------------------------------------*
      *                  * Segnalazione errore                         *
      *                  *---------------------------------------------*
           move      w-rot-l02-tip-arc    to   w-err-ana-cof-tip      .
           move      srt-cod-arc          to   w-err-ana-cof-cod      .
           move      srt-rag-soc          to   w-err-ana-cof-rag      .
           move      "manca il codice Fiscale!      "
                                          to   w-err-ana-cof-err      .
           perform   emi-fil-xml-msg-000  thru emi-fil-xml-msg-999    .
      *                  *---------------------------------------------*
      *                  * Si prosegue                                 *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-idf-300.
       emi-fil-xml-idf-300.
      *                  *---------------------------------------------*
      *                  * Emissione tag                               *
      *                  *---------------------------------------------*
           move      "IdCodice"           to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-det-edt-cod-fis    to   w-sta-emi-xml-val      .                  
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'IdFiscaleIVA'                     *
      *              *-------------------------------------------------*
           move      "IdFiscaleIVA"       to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-idf-400.
      *              *-------------------------------------------------*
      *              * Emissione tag 'CodiceFiscale'                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da emettere                         *
      *                  *---------------------------------------------*
           if        w-det-edt-cod-fis    =    spaces
                     go to emi-fil-xml-idf-500.
           if        w-det-edt-cod-flg    =    spaces
                     go to emi-fil-xml-idf-500.
      *                  *---------------------------------------------*
      *                  * Emissione tag                               *
      *                  *---------------------------------------------*
           move      "CodiceFiscale"      to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-det-edt-cod-fis    to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-idf-500.
      *              *-------------------------------------------------*
      *              * Chiusura tag 'IdentificativiFiscali'            *
      *              *-------------------------------------------------*
           move      "IdentificativiFiscali"
                                          to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-idf-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-idf-999.
       emi-fil-xml-idf-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Emissione generica 'AltriDatiIdentificativi'              *
      *    *                                                           *
      *    * Campi obbligatori: Indirizzo, Comune, Nazione             *
      *    *                                                           *
      *    * Clienti e Fornitori                                       *
      *    *-----------------------------------------------------------*
       emi-fil-xml-adi-000.
      *              *-------------------------------------------------*
      *              * Apertura tag 'AltriDatiIdentificativi'          *
      *              *-------------------------------------------------*
           move      "AltriDatiIdentificativi"
                                          to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'Denominazione'                   *
      *              *-------------------------------------------------*
           move      "Denominazione"      to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      srt-rag-soc          to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Sede'                             *
      *              *-------------------------------------------------*
           move      "Sede"               to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'Indirizzo'        (OBBLIGATORIO) *
      *              *-------------------------------------------------*
           move      "Indirizzo"          to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      srt-via-arc          to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Test se Italia o Estero                         *
      *              *-------------------------------------------------*
           if        srt-naz-arc          not  = "IT "
                     go to emi-fil-xml-adi-500.
       emi-fil-xml-adi-200.
      *              *-------------------------------------------------*
      *              * Se Italia                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se codice comune presente              *
      *                  *---------------------------------------------*
           if        srt-cmn-arc          not  = zero
                     go to emi-fil-xml-adi-220.
      *                  *---------------------------------------------*
      *                  * Segnalazione errore                         *
      *                  *---------------------------------------------*
           move      w-rot-l02-tip-arc    to   w-err-ana-cof-tip      .
           move      srt-cod-arc          to   w-err-ana-cof-cod      .
           move      srt-rag-soc          to   w-err-ana-cof-rag      .
           move      "manca il codice Comune!       "
                                          to   w-err-ana-cof-err      .
           perform   emi-fil-xml-msg-000  thru emi-fil-xml-msg-999    .
      *                  *---------------------------------------------*
      *                  * Si prosegue                                 *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-adi-220.
       emi-fil-xml-adi-220.
      *                  *---------------------------------------------*
      *                  * Lettura file [gxc]                          *
      *                  *---------------------------------------------*
           move      "C"                  to   w-let-arc-gxc-tip      .
           move      srt-cmn-arc          to   w-let-arc-gxc-cmn      .
           move      zero                 to   w-let-arc-gxc-fzn      .
           move      zero                 to   w-let-arc-gxc-lct      .
           perform   let-arc-gxc-000      thru let-arc-gxc-999        .
      *                  *---------------------------------------------*
      *                  * Emissione tag 'CAP'                         *
      *                  *---------------------------------------------*
           move      "CAP"                to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-let-arc-gxc-cap    to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *                  *---------------------------------------------*
      *                  * Emissione tag 'Comune'       (OBBLIGATORIO) *
      *                  *---------------------------------------------*
           move      "Comune"             to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-let-arc-gxc-des    to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *                  *---------------------------------------------*
      *                  * Emissione tag 'Provincia'                   *
      *                  *---------------------------------------------*
           move      "Provincia"          to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-let-arc-gxc-prv    to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *                  *---------------------------------------------*
      *                  * A 'Nazione'                                 *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-adi-800.
       emi-fil-xml-adi-500.
      *              *-------------------------------------------------*
      *              * Se estero                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Per convenzione si estrae il secondo        *
      *                  * componente dalla localita'                  *
      *                  *---------------------------------------------*
           move      srt-loc-arc          to   w-all-str-alf          .
           move      " "                  to   w-all-str-del          .
           perform   all-str-ext-000      thru all-str-ext-999        .
      *                  *---------------------------------------------*
      *                  * Test se valore estratto                     *
      *                  *---------------------------------------------*
           if        w-all-str-cat (2)    not  = spaces
                     go to emi-fil-xml-adi-600.
      *                  *---------------------------------------------*
      *                  * Segnalazione errore                         *
      *                  *---------------------------------------------*
           move      w-rot-l02-tip-arc    to   w-err-ana-cof-tip      .
           move      srt-cod-arc          to   w-err-ana-cof-cod      .
           move      srt-rag-soc          to   w-err-ana-cof-rag      .
           move      "Localita' non estrapolata!      "
                                          to   w-err-ana-cof-err      .
           perform   emi-fil-xml-msg-000  thru emi-fil-xml-msg-999    .
      *                  *---------------------------------------------*
      *                  * Si prosegue                                 *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-adi-600.
       emi-fil-xml-adi-600.
      *                  *---------------------------------------------*
      *                  * Emissione tag 'Comune'       (OBBLIGATORIO) *
      *                  *---------------------------------------------*
           move      "Comune"             to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-all-str-cat (2)    to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *                  *---------------------------------------------*
      *                  * A 'Nazione'                                 *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-adi-800.
       emi-fil-xml-adi-800.
      *              *-------------------------------------------------*
      *              * Emissione tag 'Nazione'          (OBBLIGATORIO) *
      *              *-------------------------------------------------*
           move      "Nazione"            to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      srt-naz-arc          to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'Sede'                             *
      *              *-------------------------------------------------*
           move      "Sede"               to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'AltriDatiIdentificativi'          *
      *              *-------------------------------------------------*
           move      "AltriDatiIdentificativi"
                                          to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-adi-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-adi-999.
       emi-fil-xml-adi-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Data                                                      *
      *    *-----------------------------------------------------------*
       emi-fil-xml-dat-000.
      *              *-------------------------------------------------*
      *              * Preparazione data formato : AAAA-MM-GG          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Data in comodo di lavoro                    *
      *                  *---------------------------------------------*
           move      w-sta-emi-xml-dat    to   s-dat                  .
      *                  *---------------------------------------------*
      *                  * Editing anno                                *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      s-saa                to   p-num                  .
           add       1900                 to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (1)      .
      *                      *-----------------------------------------*
      *                      * Editing mese                            *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      s-mes                to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (3)      .
      *                      *-----------------------------------------*
      *                      * Editing giorno                          *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      s-gio                to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (5)      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
           move      "-"                  to   w-all-str-cat (2)      .
           move      "-"                  to   w-all-str-cat (4)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-all-str-alf        to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-dat-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-dat-999.
       emi-fil-xml-dat-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Riepilogo - castelletto Iva                               *
      *    *-----------------------------------------------------------*
       emi-fil-xml-rie-000.
      *              *-------------------------------------------------*
      *              * Ciclo di scansione                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-cst-iva-ctr      .
       emi-fil-xml-rie-200.
           add       1                    to   w-det-cst-iva-ctr      .
           if        w-det-cst-iva-ctr    >    6
                     go to emi-fil-xml-rie-900.
           if        srt-cod-iva
                    (w-det-cst-iva-ctr)   =    zero
                     go to emi-fil-xml-rie-200.
      *              *-------------------------------------------------*
      *              * Test se codice Iva da escludere dall'elenco     *
      *              *-------------------------------------------------*
           if        srt-snx-lqp
                    (w-det-cst-iva-ctr)   =    "N"
                     go to emi-fil-xml-rie-200.
       emi-fil-xml-rie-300.
      *              *-------------------------------------------------*
      *              * Apertura tag 'DatiRiepilogo'                    *
      *              *-------------------------------------------------*
           move      "DatiRiepilogo"      to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-rie-400.
      *              *-------------------------------------------------*
      *              * Valore imponibile in campo di trattamento       *
      *              *-------------------------------------------------*
           move      srt-ibl-iva
                    (w-det-cst-iva-ctr)   to   w-det-trt-iva-ibl      .
      *              *-------------------------------------------------*
      *              * Eccezione per Omaggi                            *
      *              *                                                 *
      *              * Si trattano come fatture normali, calcolando al *
      *              * volo l'imponibile tramite la formula:           *
      *              *                                                 *
      *              * Imponibile = (Imposta / Aliquota) * 100         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test sul codice Iva                         *
      *                  *---------------------------------------------*
           move      srt-cod-iva
                    (w-det-cst-iva-ctr)   to   w-edt-iva-cod          .
      *
           if        w-edt-iva-cod-003    not  = 9
                     go to emi-fil-xml-rie-420.
      *                  *---------------------------------------------*
      *                  * Imposta                                     *
      *                  *---------------------------------------------*
           move      srt-imp-iva
                    (w-det-cst-iva-ctr)   to   w-det-trt-iva-imp      .
      *                  *---------------------------------------------*
      *                  * Scorporo aliquota dal codice                *
      *                  *---------------------------------------------*
           subtract  900                  from srt-cod-iva
                                              (w-det-cst-iva-ctr)     .
      *
           move      srt-cod-iva
                    (w-det-cst-iva-ctr)   to   w-edt-iva-cod          .
           perform   edt-cod-iva-000      thru edt-cod-iva-999        .
      *                  *---------------------------------------------*
      *                  * Calcolo Imponibile                          *
      *                  *---------------------------------------------*
           divide    w-edt-iva-cie        into w-det-trt-iva-imp
                                        giving w-det-trt-iva-w01      .
           multiply  100                  by   w-det-trt-iva-w01      .
           move      w-det-trt-iva-w01    to   w-det-trt-iva-ibl      .
       emi-fil-xml-rie-420.
      *              *-------------------------------------------------*
      *              * Emissione tag 'ImponibileImporto'               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-det-trt-iva-ibl    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Preparazione tag                            *
      *                  *---------------------------------------------*
           move      "ImponibileImporto"  to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      p-edt                to   w-sta-emi-xml-val      .
      *                  *---------------------------------------------*
      *                  * Sostituzione virgole con punti              *
      *                  *---------------------------------------------*
           inspect   w-sta-emi-xml-val
                                replacing all  ","
                                          by   "."                    .
      *                  *---------------------------------------------*
      *                  * Se a zero                                   *
      *                  *---------------------------------------------*
           if        w-det-trt-iva-ibl    =    zero
                     move  "0.00"         to   w-sta-emi-xml-val      .
      *                  *---------------------------------------------*
      *                  * Completamento tag                           *
      *                  *---------------------------------------------*
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-rie-500.
      *              *-------------------------------------------------*
      *              * Apertura tag 'DatiIVA'                          *
      *              *-------------------------------------------------*
           move      "DatiIVA"            to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'Imposta'                         *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      srt-imp-iva
                    (w-det-cst-iva-ctr)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *
           move      "Imposta"            to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      p-edt                to   w-sta-emi-xml-val      .
      *
           inspect   w-sta-emi-xml-val
                                replacing all  ","
                                          by   "."                    .
      *
           if        srt-imp-iva
                    (w-det-cst-iva-ctr)   =    zero
                     move  "0.00"         to   w-sta-emi-xml-val      .
      *
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'Aliquota'                        *
      *              *-------------------------------------------------*
           perform   emi-fil-xml-ali-000  thru emi-fil-xml-ali-999    .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'DatiIVA'                          *
      *              *-------------------------------------------------*
           move      "DatiIVA"            to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-rie-520.
      *              *-------------------------------------------------*
      *              * Emissione tag 'Natura'                          *
      *              *                                                 *
      *              * N.B.: vedi tabella contenuta in 'zci'           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Eventuale forzatura fatture CEE fornitori   *
      *                  *                                             *
      *                  * da verificare ___ ??? ___                   *
      *                  *---------------------------------------------*
           if        w-rot-l02-tip-arc    =    "F" and
                     srt-tip-iva          =    "E" and
                     srt-tip-doc          =    "F" and
                     srt-cod-iva
                    (w-det-cst-iva-ctr)   <    99
______*              move  "N6.9"         to   w-det-edt-val-nat
                     move  "N6"           to   w-det-edt-val-nat
                     go to emi-fil-xml-rie-580.      
      *                  *---------------------------------------------*
      *                  * Reverse charge                              *
      *                  *                                             *
      *                  * N.B.: improbabile dal momento che si trat-  *
      *                  *       tano elementi esteri                  *
      *                  *---------------------------------------------*
           if        srt-flg-rfp          =    "R"
                     move  "N6.9"         to   w-det-edt-val-nat
                     go to emi-fil-xml-rie-580.
      *                  *---------------------------------------------*
      *                  * Memorizzazione preliminare                  *
      *                  *---------------------------------------------*
           move      srt-cod-nop
                    (w-det-cst-iva-ctr)   to   w-det-edt-val-nat      .
       emi-fil-xml-rie-580.
      *                  *---------------------------------------------*
      *                  * Test se da emettere                         *
      *                  *---------------------------------------------*
           if        w-det-edt-val-nat    =    spaces
                     go to emi-fil-xml-rie-600.
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "Natura"             to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-det-edt-val-nat    to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-rie-600.
      *              *-------------------------------------------------*
      *              * Emissione tag 'Detraibile'                      *
      *              *                                                 *
      *              * N.B.: gestiti solo indetraibili                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su codice IVA                          *
      *                  *---------------------------------------------*
           move      srt-cod-iva
                    (w-det-cst-iva-ctr)   to   w-edt-iva-cod          .
      *
           if        w-edt-iva-cod-003    not  = 7
                     go to emi-fil-xml-rie-620.
      *                  *---------------------------------------------*
      *                  * Detraibile                                  *
      *                  *---------------------------------------------*
           move      "Detraibile"         to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "0.00"               to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-rie-620.
      *              *-------------------------------------------------*
      *              * Emissione tag 'Deducibile'                      *
      *              *                                                 *
      *              * N.B.: non gestito                               *
      *              *-------------------------------------------------*
       emi-fil-xml-rie-700.
      *              *-------------------------------------------------*
      *              * Emissione tag 'EsigibilitaIVA'                  *
      *              *                                                 *
      *              * N.B.: solo Split Payment                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da emettere                         *
      *                  *---------------------------------------------*
           if        srt-flg-rfp          not  = "S"
                     go to emi-fil-xml-rie-780.
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "EsigibilitaIVA"     to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "S"                  to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-rie-780.
      *              *-------------------------------------------------*
      *              * Chiusura tag 'DatiRiepilogo'                    *
      *              *-------------------------------------------------*
           move      "DatiRiepilogo"      to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-rie-800.
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-rie-200.
       emi-fil-xml-rie-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-rie-999.
       emi-fil-xml-rie-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Riepilogo - castelletto Iva - Aliquota                    *
      *    *-----------------------------------------------------------*
       emi-fil-xml-ali-000.
      *              *-------------------------------------------------*
      *              * Editing codice Iva                              *
      *              *-------------------------------------------------*
           move      srt-cod-iva
                    (w-det-cst-iva-ctr)   to   w-edt-iva-cod          .
           perform   edt-cod-iva-000      thru edt-cod-iva-999        .
       emi-fil-xml-ali-100.
      *              *-------------------------------------------------*
      *              * Se aliquote di esenzione: ad emissione aliquota *
      *              * a zero                                          *
      *              *-------------------------------------------------*
           if        w-edt-iva-spc        =    3 or
                     w-edt-iva-spc        =    4 or
                     w-edt-iva-spc        =    5 or
                     w-edt-iva-spc        =    6
                     go to emi-fil-xml-ali-700.
       emi-fil-xml-ali-200.
      *              *-------------------------------------------------*
      *              * Per le aliquote non detraibili o per gli omaggi *
      *              * si scorpora l'aliquota reale                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        w-edt-iva-spc        not  = 7 and
                     w-edt-iva-spc        not  = 9
                     go to emi-fil-xml-ali-600.
      *                  *---------------------------------------------*
      *                  * Scorporo dell'aliquota                      *
      *                  *---------------------------------------------*
           if        w-edt-iva-spc        =    7
                     subtract 700         from w-edt-iva-cie
           else if   w-edt-iva-spc        =    9
                     subtract 900         from w-edt-iva-cie          .
      *                  *---------------------------------------------*
      *                  * A trattamento aliquota imponibile           *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-ali-600.
       emi-fil-xml-ali-600.
      *              *-------------------------------------------------*
      *              * Aliquota imponibile                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-edt-iva-cie        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * In campo di emissione                       *
      *                  *---------------------------------------------*
           move      p-edt                to   w-all-str-alf          .
      *                  *---------------------------------------------*
      *                  * A emissione                                 *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-ali-800.
       emi-fil-xml-ali-700.
      *              *-------------------------------------------------*
      *              * Aliquota a zero                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Forzatura                                   *
      *                  *---------------------------------------------*
           move      "0.00"               to   w-all-str-alf          .
      *                  *---------------------------------------------*
      *                  * A emissione                                 *
      *                  *---------------------------------------------*
           go to     emi-fil-xml-ali-800.
       emi-fil-xml-ali-800.
      *              *-------------------------------------------------*
      *              * Trattamento virgola                             *
      *              *-------------------------------------------------*
           inspect   w-all-str-alf
                                replacing all  ","
                                          by   "."                    .
      *              *-------------------------------------------------*
      *              * Emissione                                       *
      *              *-------------------------------------------------*
           move      "Aliquota"           to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-all-str-alf        to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-fil-xml-ali-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-ali-999.
       emi-fil-xml-ali-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Subroutine di scrittura rullino messaggi                  *
      *    *-----------------------------------------------------------*
       emi-fil-xml-msg-000.
      *              *-------------------------------------------------*
      *              * Incremento contatore                            *
      *              *-------------------------------------------------*
           add       1                    to   w-err-ana-cof-ctr      .
      *              *-------------------------------------------------*
      *              * Editing codice archivio                         *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-err-ana-cof-cod    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (2)      .
      *              *-------------------------------------------------*
      *              * Assemblaggio                                    *
      *              *-------------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      06                   to   w-all-str-num          .
      *
           if        w-err-ana-cof-tip    =    "C"
                     move  "Cli:"         to   w-all-str-cat (1)
           else      move  "For:"         to   w-all-str-cat (1)      .
      *
           move      "-"                  to   w-all-str-cat (3)      .
           move      w-err-ana-cof-rag    to   w-all-str-cat (4)      .
           move      "***"                to   w-all-str-cat (5)      .
           move      w-err-ana-cof-err    to   w-all-str-cat (6)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-err-ana-cof-txt      .
       emi-fil-xml-msg-400.
      *              *-------------------------------------------------*
      *              * Scrittura record di appoggio                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione record [kk1]                   *
      *                  *---------------------------------------------*
           move      w-err-ana-cof-ctr    to   kk1-ctr-prg            .
           move      w-err-ana-cof-txt    to   kk1-str-err            .
      *                  *---------------------------------------------*
      *                  * Scrittura file [kk1]                        *
      *                  *---------------------------------------------*
           write     kk1-rec                                          .
       emi-fil-xml-msg-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-msg-999.
       emi-fil-xml-msg-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato XML                 *
      *    *                                                           *
      *    * Subroutine di emissione rullino messaggi                  *
      *    *-----------------------------------------------------------*
       emi-fil-xml-erm-000.
      *              *-------------------------------------------------*
      *              * Messaggio per versione                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Release                                     *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      "Versione 22/01/2019 - 10:00"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Separatore                                  *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      all "-"              to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       emi-fil-xml-erm-010.
      *              *-------------------------------------------------*
      *              * Test su contatore errori riscontrati            *
      *              *-------------------------------------------------*
           if        w-err-ana-cof-ctr    >    zero
                     go to emi-fil-xml-erm-050.
       emi-fil-xml-erm-020.
      *              *-------------------------------------------------*
      *              * Scrittura in rullino messaggi                   *
      *              *-------------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      "Nessuna anomalia riscontrata"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *              *-------------------------------------------------*
      *              * Ad uscita                                       *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-erm-900.
       emi-fil-xml-erm-050.
      *              *-------------------------------------------------*
      *              * Editing contatore                               *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-err-ana-cof-ctr    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Intestazione messaggi di errore                 *
      *              *-------------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "Riscontrate nr."    to   w-all-str-cat (1)      .
           move      p-edt                to   w-all-str-cat (2)      .
           move      "anomalie da correggere:"
                                          to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *              *-------------------------------------------------*
      *              * Scrittura in rullino messaggi                   *
      *              *-------------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-all-str-alf        to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *              *-------------------------------------------------*
      *              * Separatore                                      *
      *              *-------------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      all "*"              to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       emi-fil-xml-erm-100.
      *              *-------------------------------------------------*
      *              * Start su file [kk1]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione chiave                         *
      *                  *---------------------------------------------*
           move      zero                 to   kk1-ctr-prg            .
      *                  *---------------------------------------------*
      *                  * Operazione di Start                         *
      *                  *---------------------------------------------*
           start     kk1    key not less
                            kk1-key
                            invalid key
                            go to emi-fil-xml-erm-900.
       emi-fil-xml-erm-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file di appoggio [kk1]      *
      *              *-------------------------------------------------*
           read      kk1    next
                            with no lock
                            at end
                            go to emi-fil-xml-erm-900.
       emi-fil-xml-erm-600.
      *              *-------------------------------------------------*
      *              * Scrittura in rullino messaggi                   *
      *              *-------------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      kk1-str-err          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       emi-fil-xml-erm-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-erm-200.
       emi-fil-xml-erm-900.
      *              *-------------------------------------------------*
      *              * Separatore                                      *
      *              *-------------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      all "*"              to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *              *-------------------------------------------------*
      *              * Chiusura messaggi di errore                     *
      *              *-------------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      "(E' possibile stampare queste informazioni tramite
      -              " il tasto di stampa)"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-xml-erm-999.
       emi-fil-xml-erm-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato CSV                 *
      *    *-----------------------------------------------------------*
       emi-fil-csv-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo operazione      *
      *              *-------------------------------------------------*
           if        w-sta-emi-csv-ope    =    "EM"
                     go to emi-fil-csv-100
           else if   w-sta-emi-csv-ope    =    "DE"
                     go to emi-fil-csv-300
           else      go to emi-fil-csv-900.
       emi-fil-csv-100.
      *              *=================================================*
      *              * Emissione                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo Clienti                               *
      *                  *---------------------------------------------*
           move      "C"                  to   w-sta-emi-csv-tip      .
           perform   emi-fil-csv-arc-000  thru emi-fil-csv-arc-999    .
      *                  *---------------------------------------------*
      *                  * Ciclo Fornitori                             *
      *                  *---------------------------------------------*
           move      "F"                  to   w-sta-emi-csv-tip      .
           perform   emi-fil-csv-arc-000  thru emi-fil-csv-arc-999    .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     emi-fil-csv-900.
       emi-fil-csv-300.
      *              *=================================================*
      *              * Dettaglio                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-sta-emi-csv-ctr      .
      *                  *---------------------------------------------*
      *                  * Preparazione record [kk2]                   *
      *                  *---------------------------------------------*
           move      w-sta-emi-csv-ctr    to   kk2-ctr-prg            .
           move      w-rot-l02-tip-arc    to   kk2-tip-rec            .
           move      srt-rec              to   kk2-srt-rec            .
      *                  *---------------------------------------------*
      *                  * Scrittura file [kk2]                        *
      *                  *---------------------------------------------*
           write     kk2-rec                                          .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     emi-fil-csv-900.
       emi-fil-csv-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-csv-999.
       emi-fil-csv-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato CSV                 *
      *    *                                                           *
      *    * Subroutine di emissione file per tipo archivio            *
      *    *-----------------------------------------------------------*
       emi-fil-csv-arc-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione [ada]                       *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                  *---------------------------------------------*
      *                  * Lettura [ada] Sede                          *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODDPZ    "         to   f-key                  .
           move      zero                 to   rf-ada-cod-dpz         .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                  *---------------------------------------------*
      *                  * Progressivo univoco                         *
      *                  *                                             *
      *                  * Il progressivo univoco del file e' rappre-  *
      *                  * sentato da una stringa alfanumerica di lun- *
      *                  * ghezza massima di 5 caratteri e con valori  *
      *                  * ammessi [a-z], [A-Z], [0-9]                 *
      *                  *                                             *
      *                  * Attualmente e' composta da:                 *
      *                  *                                             *
      *                  * - Tipo di fatture          : E o R          *
      *                  * - Mese dichiarazione       : 99             *
      *                  * - Anno dichiarazione       : 99             *
      *                  *                                             *
      *                  * Esempio: E0119 = Fatt. Emesse gennaio 2019  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing periodo dichiarazione           *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      rr-prd-tpr-inx       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-det-edt-val-mes      .
      *                      *-----------------------------------------*
      *                      * Editing anno dichiarazione              *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      rr-dat-ini
                    (02 : 02)             to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-det-edt-val-ann      .
      *                  *---------------------------------------------*
      *                  * Composizione identificatore univoco         *
      *                  *---------------------------------------------*
           move      05                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
      *
           if        w-sta-emi-csv-tip    =    "C"
                     move  "E"            to   w-all-str-cat (1)
           else      move  "R"            to   w-all-str-cat (1)      .
      *
           move      w-det-edt-val-ann    to   w-all-str-cat (2)      .
           move      rr-prd-tpr-rng       to   w-all-str-cat (3)      .
           move      w-det-edt-val-mes    to   w-all-str-cat (4)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-det-edt-val-ide      .
      *                  *---------------------------------------------*
      *                  * Composizione nome file                      *
      *                  *---------------------------------------------*
           move      30                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      "IT"                 to   w-all-str-cat (1)      .
           move      rf-ada-cod-fis       to   w-all-str-cat (2)      .
           move      "_DF_"               to   w-all-str-cat (3)      .
           move      w-det-edt-val-ide    to   w-all-str-cat (4)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                  *---------------------------------------------*
      *                  * Apertura del file in output                 *
      *                  *---------------------------------------------*
           move      w-all-str-alf        to   w-det-pth-fso-nam      .
           move      "csv"                to   w-det-pth-fso-ext      .
           perform   det-pth-fso-000      thru det-pth-fso-999        .
      *                  *---------------------------------------------*
      *                  * Apertura del file in output                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      w-det-pth-fso-pth    to   g-pat                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       emi-fil-csv-arc-100.
      *              *-------------------------------------------------*
      *              * Start su file [kk2]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore di comodo         *
      *                  *---------------------------------------------*
           move      zero                 to   w-sta-emi-csv-ctw      .
      *                  *---------------------------------------------*
      *                  * Composizione chiave                         *
      *                  *---------------------------------------------*
           move      zero                 to   kk2-ctr-prg            .
      *                  *---------------------------------------------*
      *                  * Operazione di Start                         *
      *                  *---------------------------------------------*
           start     kk2    key not less
                            kk2-key
                            invalid key
                            go to emi-fil-csv-arc-900.
       emi-fil-csv-arc-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file di appoggio [kk2]      *
      *              *-------------------------------------------------*
           read      kk2    next
                            with no lock
                            at end
                            go to emi-fil-csv-arc-900.
       emi-fil-csv-arc-300.
      *              *-------------------------------------------------*
      *              * Selezione su tipo archivio                      *
      *              *-------------------------------------------------*
           if        kk2-tip-rec          not  = w-sta-emi-csv-tip
                     go to emi-fil-csv-arc-200.
      *              *-------------------------------------------------*
      *              * Incremento contatore di comodo                  *
      *              *-------------------------------------------------*
           add       1                    to   w-sta-emi-csv-ctw      .
       emi-fil-csv-arc-400.
      *              *-------------------------------------------------*
      *              * Fincatura iniziale                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da emettere                         *
      *                  *---------------------------------------------*
           if        w-sta-emi-csv-ctw    >    1
                     go to emi-fil-csv-arc-500.
      *                  *---------------------------------------------*
      *                  * Fincatura                                   *
      *                  *---------------------------------------------*
           perform   emi-fil-csv-fin-000  thru emi-fil-csv-fin-999    .
       emi-fil-csv-arc-500.
      *              *-------------------------------------------------*
      *              * Scrittura su file                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Pulizia preliminare                         *
      *                  *---------------------------------------------*
           move      spaces               to   g-rec                  .
      *                  *---------------------------------------------*
      *                  * Recupero record 'srt-rec'                   *
      *                  *---------------------------------------------*
           move      kk2-srt-rec          to   srt-rec                .
      *                  *---------------------------------------------*
      *                  * Composizione record                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Separatori dati fissi                   *
      *                      *-----------------------------------------*
           move      w-det-fin-rig-pvg    to   w-out-doc-sep-001
                                               w-out-doc-sep-002
                                               w-out-doc-sep-003
                                               w-out-doc-sep-004
                                               w-out-doc-sep-005
                                               w-out-doc-sep-006
                                               w-out-doc-sep-007
                                               w-out-doc-sep-008
                                               w-out-doc-sep-009
                                               w-out-doc-sep-010
                                               w-out-doc-sep-011
                                               w-out-doc-sep-012
                                               w-out-doc-sep-013
                                               w-out-doc-sep-014
                                               w-out-doc-sep-015
                                               w-out-doc-sep-016
                                               w-out-doc-sep-017
                                               w-out-doc-sep-018
                                               w-out-doc-sep-019
                                               w-out-doc-sep-020
                                               w-out-doc-sep-021
                                               w-out-doc-sep-022
                                               w-out-doc-sep-023
                                               w-out-doc-sep-024
                                               w-out-doc-sep-025
                                               w-out-doc-sep-026
                                               w-out-doc-sep-027
                                               w-out-doc-sep-028
                                               w-out-doc-sep-029
                                               w-out-doc-sep-030
                                               w-out-doc-sep-031
                                               w-out-doc-sep-032
                                               w-out-doc-sep-033
                                               w-out-doc-sep-034
                                               w-out-doc-sep-035
                                               w-out-doc-sep-036
                                               w-out-doc-sep-037
                                               w-out-doc-sep-038      .
      *                      *-----------------------------------------*
      *                      * Tipo archivio                           *
      *                      *-----------------------------------------*
           move      srt-tip-arc          to   w-out-doc-tip-arc      .
      *                      *-----------------------------------------*
      *                      * Codice archivio                         *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      srt-cod-arc          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-cod-arc      .
      *                      *-----------------------------------------*
      *                      * Ragione sociale archivio                *
      *                      *-----------------------------------------*
           move      srt-rag-soc          to   w-out-doc-rag-soc      .
      *                      *-----------------------------------------*
      *                      * Indirizzo archivio                      *
      *                      *-----------------------------------------*
           move      srt-via-arc          to   w-out-doc-via-arc      .
      *                      *-----------------------------------------*
      *                      * Localita' archivio                      *
      *                      *-----------------------------------------*
           move      srt-loc-arc          to   w-out-doc-loc-arc      .
      *                      *-----------------------------------------*
      *                      * Codice nazione                          *
      *                      *-----------------------------------------*
           move      srt-naz-arc          to   w-out-doc-naz-arc      .
      *                      *-----------------------------------------*
      *                      * Codice fiscale                          *
      *                      *-----------------------------------------*
           move      srt-cod-fis          to   w-out-doc-cod-fis      .
      *                      *-----------------------------------------*
      *                      * Partita IVA                             *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      srt-prt-iva          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-prt-iva      .
      *                      *-----------------------------------------*
      *                      * Data documento                          *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      "<"                  to   p-edm                  .
           move      srt-dat-doc          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-dat-doc      .
      *                      *-----------------------------------------*
      *                      * Numero documento                        *
      *                      *-----------------------------------------*
           move      srt-num-doc          to   w-out-doc-num-doc      .
      *                      *-----------------------------------------*
      *                      * Codice numerazione                      *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      srt-cod-num          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-cod-num      .
      *                      *-----------------------------------------*
      *                      * Protocollo Iva                          *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      srt-prt-gio          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-prt-gio      .
      *                      *-----------------------------------------*
      *                      * Tipo documento                          *
      *                      *-----------------------------------------*
           if        srt-tip-doc          =    "F"
                     move  "Fattura"      to   w-out-doc-tip-doc
           else if   srt-tip-doc          =    "C"
                     move  "Nota Cr"      to   w-out-doc-tip-doc
           else if   srt-tip-doc          =    "D"
                     move  "Nota De"      to   w-out-doc-tip-doc
           else      move  "???"          to   w-out-doc-tip-doc      .
      *                      *-----------------------------------------*
      *                      * Castelletto Iva                         *
      *                      *                                         *
      *                      * ___ MANCA INVERSIONE SEGNO PER N.A. ___ *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Imponibile 1                        *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GB"                to   p-edm                  .
           move      srt-ibl-iva (1)      to   p-num                  .
      *
__NA__*    if        srt-tip-doc          =    "C"
__NA__*              multiply -1          by   p-num                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-ibl-001      .
      *                          *-------------------------------------*
      *                          * Codice Iva 1                        *
      *                          *-------------------------------------*
           move      srt-cod-iva (1)      to   w-edt-iva-cod          .
           perform   edt-cod-iva-000      thru edt-cod-iva-999        .
      *
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<BD"                to   p-edm                  .
           move      w-edt-iva-cie        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-iva-001      .
      *                          *-------------------------------------*
      *                          * Imposta 1                           *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GB"                to   p-edm                  .
           move      srt-imp-iva (1)      to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-imp-001      .
      *                          *-------------------------------------*
      *                          * Elenco 1                            *
      *                          *-------------------------------------*
           move      srt-cod-nop (1)      to   w-out-doc-nop-001      .
      *                          *-------------------------------------*
      *                          * Imponibile 2                        *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GB"                to   p-edm                  .
           move      srt-ibl-iva (2)      to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-ibl-002      .
      *                          *-------------------------------------*
      *                          * Codice Iva 2                        *
      *                          *-------------------------------------*
           move      srt-cod-iva (2)      to   w-edt-iva-cod          .
           perform   edt-cod-iva-000      thru edt-cod-iva-999        .
      *
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<BD"                to   p-edm                  .
           move      w-edt-iva-cie        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-iva-002      .
      *                          *-------------------------------------*
      *                          * Imposta 2                           *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GB"                to   p-edm                  .
           move      srt-imp-iva (2)      to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-imp-002      .
      *                          *-------------------------------------*
      *                          * Elenco 2                            *
      *                          *-------------------------------------*
           move      srt-cod-nop (2)      to   w-out-doc-nop-002      .
      *                          *-------------------------------------*
      *                          * Imponibile 3                        *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GB"                to   p-edm                  .
           move      srt-ibl-iva (3)      to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-ibl-003      .
      *                          *-------------------------------------*
      *                          * Codice Iva 3                        *
      *                          *-------------------------------------*
           move      srt-cod-iva (3)      to   w-edt-iva-cod          .
           perform   edt-cod-iva-000      thru edt-cod-iva-999        .
      *
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<BD"                to   p-edm                  .
           move      w-edt-iva-cie        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-iva-003      .
      *                          *-------------------------------------*
      *                          * Imposta 3                           *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GB"                to   p-edm                  .
           move      srt-imp-iva (3)      to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-imp-003      .
      *                          *-------------------------------------*
      *                          * Elenco 3                            *
      *                          *-------------------------------------*
           move      srt-cod-nop (3)      to   w-out-doc-nop-003      .
      *                          *-------------------------------------*
      *                          * Imponibile 4                        *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GB"                to   p-edm                  .
           move      srt-ibl-iva (4)      to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-ibl-004      .
      *                          *-------------------------------------*
      *                          * Codice Iva 4                        *
      *                          *-------------------------------------*
           move      srt-cod-iva (4)      to   w-edt-iva-cod          .
           perform   edt-cod-iva-000      thru edt-cod-iva-999        .
      *
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<BD"                to   p-edm                  .
           move      w-edt-iva-cie        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-iva-004      .
      *                          *-------------------------------------*
      *                          * Imposta 4                           *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GB"                to   p-edm                  .
           move      srt-imp-iva (4)      to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-imp-004      .
      *                          *-------------------------------------*
      *                          * Elenco 4                            *
      *                          *-------------------------------------*
           move      srt-cod-nop (4)      to   w-out-doc-nop-004      .
      *                          *-------------------------------------*
      *                          * Imponibile 5                        *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GB"                to   p-edm                  .
           move      srt-ibl-iva (5)      to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-ibl-005      .
      *                          *-------------------------------------*
      *                          * Codice Iva 5                        *
      *                          *-------------------------------------*
           move      srt-cod-iva (5)      to   w-edt-iva-cod          .
           perform   edt-cod-iva-000      thru edt-cod-iva-999        .
      *
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<BD"                to   p-edm                  .
           move      w-edt-iva-cie        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-iva-005      .
      *                          *-------------------------------------*
      *                          * Imposta 5                           *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GB"                to   p-edm                  .
           move      srt-imp-iva (5)      to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-imp-005      .
      *                          *-------------------------------------*
      *                          * Elenco 5                            *
      *                          *-------------------------------------*
           move      srt-cod-nop (5)      to   w-out-doc-nop-005      .
      *                          *-------------------------------------*
      *                          * Imponibile 6                        *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GB"                to   p-edm                  .
           move      srt-ibl-iva (6)      to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-ibl-006      .
      *                          *-------------------------------------*
      *                          * Codice Iva 6                        *
      *                          *-------------------------------------*
           move      srt-cod-iva (6)      to   w-edt-iva-cod          .
           perform   edt-cod-iva-000      thru edt-cod-iva-999        .
      *
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<BD"                to   p-edm                  .
           move      w-edt-iva-cie        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-iva-006      .
      *                          *-------------------------------------*
      *                          * Imposta 6                           *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GB"                to   p-edm                  .
           move      srt-imp-iva (6)      to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-imp-006      .
      *                          *-------------------------------------*
      *                          * Elenco 6                            *
      *                          *-------------------------------------*
           move      srt-cod-nop (6)      to   w-out-doc-nop-006      .
      *                      *-----------------------------------------*
      *                      * Totale documento                        *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GB"                to   p-edm                  .
           move      srt-tot-doc          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-out-doc-tot-doc      .
      *                      *-----------------------------------------*
      *                      * Regime fiscale                          *
      *                      *-----------------------------------------*
           move      srt-flg-rfp          to   w-out-doc-flg-rfp      .
      *                      *-----------------------------------------*
      *                      * Carattere di fine riga                  *
      *                      *-----------------------------------------*
           move      w-det-fin-rig-chr    to   w-out-doc-fin-rig      .
      *                      *-----------------------------------------*
      *                      * Scrittura record in output              *
      *                      *-----------------------------------------*
           move      w-out-doc            to   g-rec                  .
           perform   put-nxt-out-000      thru put-nxt-out-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo si [kk2]                            *
      *                  *---------------------------------------------*
           go to     emi-fil-csv-arc-200.
       emi-fil-csv-arc-900.
      *              *-------------------------------------------------*
      *              * Chiusura                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura del file in output                 *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo utilizzato             *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mcvout"                         .
       emi-fil-csv-arc-980.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-csv-arc-999.
       emi-fil-csv-arc-999.
           exit.

      *    *===========================================================*
      *    * Emissione file sequenziale in formato CSV                 *
      *    *                                                           *
      *    * Subroutine di fincatura                                   *
      *    *-----------------------------------------------------------*
       emi-fil-csv-fin-000.
      *              *-------------------------------------------------*
      *              * Scrittura su file                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Pulizia preliminare                         *
      *                  *---------------------------------------------*
           move      spaces               to   g-rec                  .
      *                  *---------------------------------------------*
      *                  * Composizione record                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Separatori dati fissi                   *
      *                      *-----------------------------------------*
           move      w-det-fin-rig-pvg    to   w-out-doc-sep-001
                                               w-out-doc-sep-002
                                               w-out-doc-sep-003
                                               w-out-doc-sep-004
                                               w-out-doc-sep-005
                                               w-out-doc-sep-006
                                               w-out-doc-sep-007
                                               w-out-doc-sep-008
                                               w-out-doc-sep-009
                                               w-out-doc-sep-010
                                               w-out-doc-sep-011
                                               w-out-doc-sep-012
                                               w-out-doc-sep-013
                                               w-out-doc-sep-014
                                               w-out-doc-sep-015
                                               w-out-doc-sep-016
                                               w-out-doc-sep-017
                                               w-out-doc-sep-018
                                               w-out-doc-sep-019
                                               w-out-doc-sep-020
                                               w-out-doc-sep-021
                                               w-out-doc-sep-022
                                               w-out-doc-sep-023
                                               w-out-doc-sep-024
                                               w-out-doc-sep-025
                                               w-out-doc-sep-026
                                               w-out-doc-sep-027
                                               w-out-doc-sep-028
                                               w-out-doc-sep-029
                                               w-out-doc-sep-030
                                               w-out-doc-sep-031
                                               w-out-doc-sep-032
                                               w-out-doc-sep-033
                                               w-out-doc-sep-034
                                               w-out-doc-sep-035
                                               w-out-doc-sep-036
                                               w-out-doc-sep-037
                                               w-out-doc-sep-038      .
      *                      *-----------------------------------------*
      *                      * Tipo archivio                           *
      *                      *-----------------------------------------*
           move      "C/F"                to   w-out-doc-tip-arc      .
      *                      *-----------------------------------------*
      *                      * Codice archivio                         *
      *                      *-----------------------------------------*
           move      "Codice"             to   w-out-doc-cod-arc      .
      *                      *-----------------------------------------*
      *                      * Ragione sociale archivio                *
      *                      *-----------------------------------------*
           move      "Ragione sociale"    to   w-out-doc-rag-soc      .
      *                      *-----------------------------------------*
      *                      * Indirizzo archivio                      *
      *                      *-----------------------------------------*
           move      "Indirizzo"          to   w-out-doc-via-arc      .
      *                      *-----------------------------------------*
      *                      * Localita' archivio                      *
      *                      *-----------------------------------------*
           move      "Localita'"          to   w-out-doc-loc-arc      .
      *                      *-----------------------------------------*
      *                      * Codice nazione                          *
      *                      *-----------------------------------------*
           move      "Naz"                to   w-out-doc-naz-arc      .
      *                      *-----------------------------------------*
      *                      * Codice fiscale                          *
      *                      *-----------------------------------------*
           move      "Cod. Fiscale"       to   w-out-doc-cod-fis      .
      *                      *-----------------------------------------*
      *                      * Partita IVA                             *
      *                      *-----------------------------------------*
           move      "Partita IVA"        to   w-out-doc-prt-iva      .
      *                      *-----------------------------------------*
      *                      * Data documento                          *
      *                      *-----------------------------------------*
           move      "Data doc"           to   w-out-doc-dat-doc      .
      *                      *-----------------------------------------*
      *                      * Numero documento                        *
      *                      *-----------------------------------------*
           move      "Num doc"            to   w-out-doc-num-doc      .
      *                      *-----------------------------------------*
      *                      * Codice numerazione                      *
      *                      *-----------------------------------------*
           move      "GI"                 to   w-out-doc-cod-num      .
      *                      *-----------------------------------------*
      *                      * Protocollo Iva                          *
      *                      *-----------------------------------------*
           move      "Prot. Iva"          to   w-out-doc-prt-gio      .
      *                      *-----------------------------------------*
      *                      * Tipo documento                          *
      *                      *-----------------------------------------*
           move      "Tipo doc"           to   w-out-doc-tip-doc      .
      *                      *-----------------------------------------*
      *                      * Castelletto Iva                         *
      *                      *-----------------------------------------*
           move      "Imponibile"         to   w-out-doc-ibl-001      .
           move      "Iva"                to   w-out-doc-iva-001      .
           move      "Imposta"            to   w-out-doc-imp-001      .
           move      "Nat"                to   w-out-doc-nop-001      .
      *
           move      "Imponibile"         to   w-out-doc-ibl-002      .
           move      "Iva"                to   w-out-doc-iva-002      .
           move      "Imposta"            to   w-out-doc-imp-002      .
           move      "Nat"                to   w-out-doc-nop-002      .
      *
           move      "Imponibile"         to   w-out-doc-ibl-003      .
           move      "Iva"                to   w-out-doc-iva-003      .
           move      "Imposta"            to   w-out-doc-imp-003      .
           move      "Nat"                to   w-out-doc-nop-003      .
      *
           move      "Imponibile"         to   w-out-doc-ibl-004      .
           move      "Iva"                to   w-out-doc-iva-004      .
           move      "Imposta"            to   w-out-doc-imp-004      .
           move      "Nat"                to   w-out-doc-nop-004      .
      *
           move      "Imponibile"         to   w-out-doc-ibl-005      .
           move      "Iva"                to   w-out-doc-iva-005      .
           move      "Imposta"            to   w-out-doc-imp-005      .
           move      "Nat"                to   w-out-doc-nop-005      .
      *
           move      "Imponibile"         to   w-out-doc-ibl-006      .
           move      "Iva"                to   w-out-doc-iva-006      .
           move      "Imposta"            to   w-out-doc-imp-006      .
           move      "Nat"                to   w-out-doc-nop-006      .
      *                      *-----------------------------------------*
      *                      * Totale documento                        *
      *                      *-----------------------------------------*
           move      "Tot. doc."          to   w-out-doc-tot-doc      .
      *                      *-----------------------------------------*
      *                      * Regime fiscale                          *
      *                      *-----------------------------------------*
           move      "RF"                 to   w-out-doc-flg-rfp      .
      *                      *-----------------------------------------*
      *                      * Carattere di fine riga                  *
      *                      *-----------------------------------------*
           move      w-det-fin-rig-chr    to   w-out-doc-fin-rig      .
      *                      *-----------------------------------------*
      *                      * Scrittura record in output              *
      *                      *-----------------------------------------*
           move      w-out-doc            to   g-rec                  .
           perform   put-nxt-out-000      thru put-nxt-out-999        .
       emi-fil-csv-fin-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-fil-csv-fin-999.
       emi-fil-csv-fin-999.
           exit.

      *    *===========================================================*
      *    * Determinazione pathname completo per il file di appoggio  *
      *    * in output                                                 *
      *    *-----------------------------------------------------------*
       det-pth-fso-000.
      *              *-------------------------------------------------*
      *              * Preparazione nome file completo                 *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-pth-fso-pth      .
      *              *-------------------------------------------------*
      *              * Richiesta informazioni generali a segreteria    *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-ute                to   w-det-pth-fso-ute      .
      *              *-------------------------------------------------*
      *              * Pathname di base da segreteria                  *
      *              *-------------------------------------------------*
           move      "PB"                 to   s-ope                  .
           move      "asc "               to   s-nam                  .
           call      "swd/mod/prg/obj/msegrt"
                                          using s                     .
      *              *-------------------------------------------------*
      *              * Preparazione pathname per file completato       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione nome file completo             *
      *                  *---------------------------------------------*
           move      spaces               to   w-det-pth-fso-pth      .
           string    s-pat      delimited by   spaces
                     "/cbi/"    delimited by   size
                     w-det-pth-fso-nam
                                delimited by   spaces
                     "."        delimited by   size
                     w-det-pth-fso-ext
                                delimited by   spaces
                                          into w-det-pth-fso-pth      .
       det-pth-fso-999.
           exit.

      *    *===========================================================*
      *    * Put next generica per output in sequenziale               *
      *    *-----------------------------------------------------------*
       put-nxt-out-000.
      *              *-------------------------------------------------*
      *              * Scrittura su sequenziale                        *
      *              *-------------------------------------------------*
           move      "PN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       put-nxt-out-999.
           exit.

      *    *===========================================================*
      *    * Lettura tabella causali contabili                         *
      *    *-----------------------------------------------------------*
       let-tbl-cau-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zcc-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione record tabella [zcc]            *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zcc                 .
       let-tbl-cau-200.
      *              *-------------------------------------------------*
      *              * Lettura record tabella [zcc]                    *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCAU    "         to   f-key                  .
           move      rf-mgi-cod-cau       to   rf-zcc-cod-cau         .
           move      "pgm/cge/fls/ioc/obj/iofzcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zcc                 .
       let-tbl-cau-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [gxc]                         *
      *    *-----------------------------------------------------------*
       let-arc-gxc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-gxc-flg      .
      *              *-------------------------------------------------*
      *              * Deviazione secondo il tipo elemento             *
      *              *-------------------------------------------------*
           if        w-let-arc-gxc-tip    =    "C"
                     go to let-arc-gxc-100
           else if   w-let-arc-gxc-tip    =    "F"
                     go to let-arc-gxc-200
           else if   w-let-arc-gxc-tip    =    "L"
                     go to let-arc-gxc-300.
       let-arc-gxc-100.
      *              *-------------------------------------------------*
      *              * Se tipo elemento : Comune                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se codice a zero                       *
      *                  *---------------------------------------------*
           if        w-let-arc-gxc-cmn    =    zero
                     go to let-arc-gxc-400.
      *                  *---------------------------------------------*
      *                  * Lettura Comune                              *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      w-let-arc-gxc-cmn    to   rf-gxc-cod-cmn         .
           move      zero                 to   rf-gxc-cod-fzn         .
           move      zero                 to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se record esistente    *
      *                  * oppure no                                   *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to let-arc-gxc-600
           else      go to let-arc-gxc-500.
       let-arc-gxc-200.
      *              *-------------------------------------------------*
      *              * Se tipo elemento : Frazione                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se codice a zero                       *
      *                  *---------------------------------------------*
           if        w-let-arc-gxc-cmn    =    zero or
                     w-let-arc-gxc-fzn    =    zero
                     go to let-arc-gxc-400.
      *                  *---------------------------------------------*
      *                  * Lettura Frazione                            *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      w-let-arc-gxc-cmn    to   rf-gxc-cod-cmn         .
           move      w-let-arc-gxc-fzn    to   rf-gxc-cod-fzn         .
           move      zero                 to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se record esistente    *
      *                  * oppure no                                   *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to let-arc-gxc-600
           else      go to let-arc-gxc-500.
       let-arc-gxc-300.
      *              *-------------------------------------------------*
      *              * Se tipo elemento : Localita'                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se codice a zero                       *
      *                  *---------------------------------------------*
           if        w-let-arc-gxc-cmn    =    zero or
                     w-let-arc-gxc-lct    =    zero
                     go to let-arc-gxc-400.
      *                  *---------------------------------------------*
      *                  * Lettura Localita'                           *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCFL    "         to   f-key                  .
           move      w-let-arc-gxc-cmn    to   rf-gxc-cod-cmn         .
           move      w-let-arc-gxc-fzn    to   rf-gxc-cod-fzn         .
           move      w-let-arc-gxc-lct    to   rf-gxc-cod-lct         .
           move      "pgm/geo/fls/ioc/obj/iofgxc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gxc                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se record esistente    *
      *                  * oppure no                                   *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to let-arc-gxc-600
           else      go to let-arc-gxc-500.
       let-arc-gxc-400.
      *              *-------------------------------------------------*
      *              * Se codice elemento a zero                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione work area                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-arc-gxc-des      .
           move      spaces               to   w-let-arc-gxc-prv      .
           move      spaces               to   w-let-arc-gxc-cap      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-gxc-999.
       let-arc-gxc-500.
      *              *-------------------------------------------------*
      *              * Se codice elemento non esistente                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione work area                   *
      *                  *---------------------------------------------*
           move      all   "."            to   w-let-arc-gxc-des      .
           move      spaces               to   w-let-arc-gxc-prv      .
           move      spaces               to   w-let-arc-gxc-cap      .
      *                  *---------------------------------------------*
      *                  * Flag di uscita a non trovato                *
      *                  *---------------------------------------------*
           move      "#"                  to   w-let-arc-gxc-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-gxc-999.
       let-arc-gxc-600.
      *              *-------------------------------------------------*
      *              * Se codice elemento esistente                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione in work area                *
      *                  *---------------------------------------------*
           move      rf-gxc-des-cfl       to   w-let-arc-gxc-des      .
           move      rf-gxc-cod-prv       to   w-let-arc-gxc-prv      .
           move      rf-gxc-cap-avp       to   w-let-arc-gxc-cap      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-gxc-999.
       let-arc-gxc-999.
           exit.

      *    *===========================================================*
      *    * Emissione tag 'xml'                                       *
      *    *-----------------------------------------------------------*
       emi-tag-xml-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione preliminare prompt              *
      *              *-------------------------------------------------*
           move      w-sta-emi-xml-pmt    to   w-sta-emi-xml-pma      .
           move      w-sta-emi-xml-pmt    to   w-sta-emi-xml-pmc      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo operazione      *
      *              *-------------------------------------------------*
           if        w-sta-emi-xml-ope    =    "A"
                     go to emi-tag-xml-100
           else if   w-sta-emi-xml-ope    =    "E"
                     go to emi-tag-xml-300
           else      go to emi-tag-xml-500.
       emi-tag-xml-100.
      *              *=================================================*
      *              * Composizione tag xml di apertura                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "<"                  to   w-all-str-cat (1)      .
           move      w-sta-emi-xml-pmt    to   w-all-str-cat (2)      .
           move      ">"                  to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-sta-emi-xml-str      .
      *                  *---------------------------------------------*
      *                  * Ad eventuale indentazione                   *
      *                  *---------------------------------------------*
           go to     emi-tag-xml-800.
       emi-tag-xml-300.
      *              *=================================================*
      *              * Composizione tag xml con valore                 *
      *              *                                                 *
      *              * '<prompt> valore </prompt>'                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se valore presente                     *
      *                  *---------------------------------------------*
           if        w-sta-emi-xml-val    =    spaces
                     go to emi-tag-xml-900.
      *                  *---------------------------------------------*
      *                  * Filtraggio per eliminare eventuali carat-   *
      *                  * teri incompatibili con XML                  *
      *                  *---------------------------------------------*
           inspect   w-sta-emi-xml-val
                                replacing all  "&"
                                          by   "e"                    .
      *
           inspect   w-sta-emi-xml-val
                                replacing all  "<"
                                          by   "("                    .
      *
           inspect   w-sta-emi-xml-val
                                replacing all  ">"
                                          by   ")"                    .
      *                  *---------------------------------------------*
      *                  * Test se prompt composito                    *
      *                  *---------------------------------------------*
           move      w-sta-emi-xml-pmt    to   w-all-str-alf          .
           move      " "                  to   w-all-str-del          .
           perform   all-str-ext-000      thru all-str-ext-999        .
           if        w-all-str-num        not  > 1
                     go to emi-tag-xml-320.
      *                  *---------------------------------------------*
      *                  * Scorporo prompt                             *
      *                  *---------------------------------------------*
           move      w-all-str-cat (1)    to   w-sta-emi-xml-pmc      .
       emi-tag-xml-320.
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      220                  to   w-all-str-lun          .
           move      07                   to   w-all-str-num          .
           move      "<"                  to   w-all-str-cat (1)      .
           move      w-sta-emi-xml-pma    to   w-all-str-cat (2)      .
           move      ">"                  to   w-all-str-cat (3)      .
           move      w-sta-emi-xml-val    to   w-all-str-cat (4)      .
           move      "</"                 to   w-all-str-cat (5)      .
           move      w-sta-emi-xml-pmc    to   w-all-str-cat (6)      .
           move      ">"                  to   w-all-str-cat (7)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-sta-emi-xml-str      .
      *                  *---------------------------------------------*
      *                  * Ad eventuale indentazione                   *
      *                  *---------------------------------------------*
           go to     emi-tag-xml-800.
       emi-tag-xml-500.
      *              *=================================================*
      *              * Composizione tag xml di chiusura                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "</"                 to   w-all-str-cat (1)      .
           move      w-sta-emi-xml-pmt    to   w-all-str-cat (2)      .
           move      ">"                  to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-sta-emi-xml-str      .
      *                  *---------------------------------------------*
      *                  * Ad eventuale indentazione                   *
      *                  *---------------------------------------------*
           go to     emi-tag-xml-800.
       emi-tag-xml-800.
      *              *=================================================*
      *              * Eventuale indentazione                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione indice di indentazione       *
      *                  *---------------------------------------------*
           if        w-sta-emi-xml-ind    =    "+"
                     add      w-sta-emi-xml-tab
                                          to   w-sta-emi-xml-inx
           else if   w-sta-emi-xml-ind    =    "-"
                     subtract w-sta-emi-xml-tab
                                          from w-sta-emi-xml-inx      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza stringa            *
      *                  *---------------------------------------------*
           move      w-sta-emi-xml-str    to   w-all-str-alf          .
           perform   all-str-lun-000      thru all-str-lun-999        .
           move      w-all-str-lun        to   w-sta-emi-xml-lun      .
      *                  *---------------------------------------------*
      *                  * Indentazione                                *
      *                  *---------------------------------------------*
           move      spaces               to   w-all-str-alf          .
           move      w-sta-emi-xml-inx    to   w-sta-emi-xml-inw      .
           add       1                    to   w-sta-emi-xml-inw      .
           move      w-sta-emi-xml-str    to   w-all-str-alf
                                              (w-sta-emi-xml-inw :
                                               w-sta-emi-xml-lun)     .
           move      w-all-str-alf        to   w-sta-emi-xml-str      .
       emi-tag-xml-850.
      *              *=================================================*
      *              * Emissione                                       *
      *              *-------------------------------------------------*
           move      w-sta-emi-xml-str    to   g-rec                  .
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           perform   put-nxt-out-000      thru put-nxt-out-999        .
       emi-tag-xml-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-tag-xml-999.
       emi-tag-xml-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento file [mgi]                                  *
      *    *-----------------------------------------------------------*
       agg-fil-mgi-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record [mgi]                    *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofmgi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mgi                 .
      *              *-------------------------------------------------*
      *              * Lettura record [mgi]                            *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "DATPRT"             to   f-key                  .
           move      srt-dat-reg          to   rf-mgi-dat-reg         .
           move      srt-num-prt          to   rf-mgi-num-prt         .
           move      "pgm/cge/fls/ioc/obj/iofmgi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mgi                 .
           if        f-sts                not  = e-not-err
                     go to agg-fil-mgi-999.
       agg-fil-mgi-200.
      *              *-------------------------------------------------*
      *              * Aggiornamento PROVVISORIO di 'alx-exp'          *
      *              * ___ !!! ___                                     *
      *              * Per evitare doppioni tra 'scf420' e Esterometro *
      *              *-------------------------------------------------*
           move      "#"                  to   rf-mgi-alx-exp
                                              (01 : 01)               .
      *              *-------------------------------------------------*
      *              * Aggiornamento record file                       *
      *              *-------------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofmgi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mgi                 .
      *              *-------------------------------------------------*
      *              * Rilascio del record                             *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofmgi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mgi                 .
       agg-fil-mgi-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per editing del codice iva                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/wedtzci0.wks"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

