       Identification Division.
       Program-Id.                                 pods4500           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    sir                 *
      *                        Area gestionale:    ods                 *
      *                                Settore:    gen                 *
      *                                   Fase:    ods450              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 22/06/95    *
      *                       Ultima revisione:    NdK del 06/02/14    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Generazione manuale ordini di spedizione    *
      *                                                                *
      *                    VERSIONE SU MISURA PER AZIENDA SIRI         *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "sir"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "ods"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "gen"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "ods450"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pods4500"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "GENERAZIONE MANUALE ORDINI DI SPEDIZIONE"       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pos-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pos-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-let-reg-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-let-reg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-ins-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-ins      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-mod-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-mod      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-vis-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-vis      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-snx-del      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pos-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pos-snx-del      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-tus.
      *            *---------------------------------------------------*
      *            * Da accettazione campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-nok      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione testata                           *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione corpo                             *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione riga corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione piede                             *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-key-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per controllo se chiave vuota                     *
      *            *---------------------------------------------------*
               10  w-cnt-key-vuo-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-nok-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per tasto Do su riga corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-rig-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su modalita' di funzionamento      *
      *        *-------------------------------------------------------*
           05  w-cnt-mfu.
      *            *---------------------------------------------------*
      *            * Tipo impostazione                                 *
      *            * - K : Impostazione campi chiave                   *
      *            * - T : Impostazione campi testata                  *
      *            * - C : Impostazione primo campo riga corpo         *
      *            * - R : Impostazione altri campi riga corpo         *
      *            * - P : Impostazione campi piede                    *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-imp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo funzione                                     *
      *            * - I : Inserimento                                 *
      *            * - M : Modifica                                    *
      *            * - V : Visualizzazione                             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-fun      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flag di controllo su status visualizzazione titolo    *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis-tit          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione chiave                               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina testata in corso di trattamento     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-npt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Salvataggio per il campo precedente               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-svp      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Si/No pagina testata in corso di trattamento      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-snp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagine componenti la testata               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-mpt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Impostazione testata                              *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione pagine di testata                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-pte.
                   15  w-cnt-sts-imp-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Ingresso in pagine di testata                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-ing-pte.
                   15  w-cnt-sts-ing-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione corpo                                *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione riga corpo                           *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione piede                                *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-pie      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di inibizione manuale tasto Delt             *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-itd      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts chiave                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts testata                   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts pagine di testata         *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-pte.
                   15  w-cnt-sts-pmt-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts corpo                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts riga accettazione corpo   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts piede                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati chiave                       *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati testata                      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati pagine di testata            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-pte.
                   15  w-cnt-sts-vis-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati riga di accettazione corpo   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati piede                        *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per trattamento corpo               *
      *        *-------------------------------------------------------*
           05  w-cnt-cor.
      *            *---------------------------------------------------*
      *            * Numero riga da accettare                          *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrg-dac      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero riga da visualizzare                       *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrg-dav      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Tipo visualizzazione riga                         *
      *            *---------------------------------------------------*
               10  w-cnt-cor-tvi-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina corpo da visualizzare               *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrp-dav      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina corpo visualizzata                  *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrp-vis      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Tipo aggiornamento post-riga (+ o -)              *
      *            *---------------------------------------------------*
               10  w-cnt-cor-tip-agg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per variazioni                      *
      *        *-------------------------------------------------------*
           05  w-cnt-var.
      *            *---------------------------------------------------*
      *            * Flag di variazioni in testata che si ripercuotono *
      *            * su tutte le righe corpo                           *
      *            *---------------------------------------------------*
               10  w-cnt-var-tes-cor      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per Slct da primo campo riga corpo  *
      *        *-------------------------------------------------------*
           05  w-cnt-slc.
      *            *---------------------------------------------------*
      *            * Numero riga di destinazione per Slct              *
      *            *---------------------------------------------------*
               10  w-cnt-slc-num-rig      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Rappresentazione alfa del numero riga             *
      *            *---------------------------------------------------*
               10  w-cnt-slc-rap-alf.
                   15  w-cnt-slc-rap-chr
                               occurs 05  pic  x(01)                  .
               10  w-cnt-slc-rap-a01 redefines
                   w-cnt-slc-rap-alf.
                   15  w-cnt-slc-rap-chn
                               occurs 05  pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Rappresentazione numerica del numero riga         *
      *            *---------------------------------------------------*
               10  w-cnt-slc-rap-num      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per accettazioni singoli campi      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
               10  w-cnt-acc-flg-aum      pic  x(01)                  .
               10  w-cnt-acc-sav-tip      pic  x(01)                  .
               10  w-cnt-acc-sav-car      pic  9(02)                  .
               10  w-cnt-acc-sav-ldt      pic  9(02)                  .
               10  w-cnt-acc-sav-dec      pic  9(01)                  .
               10  w-cnt-acc-sav-sgn      pic  x(01)                  .
               10  w-cnt-acc-sav-edm      pic  x(10)                  .
               10  w-cnt-acc-sav-msk      pic  x(24)                  .
               10  w-cnt-acc-sav-lin      pic  9(02)                  .
               10  w-cnt-acc-sav-pos      pic  9(02)                  .
               10  w-cnt-acc-sav-alf      pic  x(80)                  .
               10  w-cnt-acc-sav-txt.
                   15  filler occurs 400  pic  x(01)                  .
               10  w-cnt-acc-sav-num      pic s9(13)v9(05)  trailing
                                                            separate
                                                            character .
               10  w-cnt-acc-sav-dat      pic  9(07)                  .
               10  w-cnt-acc-sav-ufk      pic  x(80)                  .
               10  w-cnt-acc-sav-mod      pic  x(01)                  .
               10  w-cnt-acc-sav-l23      pic  x(80)                  .
               10  w-cnt-acc-sav-l24      pic  x(80)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita per il tasto 'Exit'                *
      *            *---------------------------------------------------*
               10  w-cnt-acc-flg-exi      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work area                                             *
      *        *-------------------------------------------------------*
           05  w-cnt-wrk.
               10  w-cnt-wrk-ctr-001      pic  9(05)                  .
               10  w-cnt-wrk-ctr-002      pic  9(05)                  .
               10  w-cnt-wrk-ctr-003      pic  9(05)                  .
               10  w-cnt-wrk-ctr-008      pic  9(05)                  .
               10  w-cnt-wrk-ctr-009      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work-area per il controllo del modulo di stampa       *
      *        *-------------------------------------------------------*
           05  w-cnt-mst.
      *            *---------------------------------------------------*
      *            * Selezione stampa effettuata                       *
      *            * - S : Si                                          *
      *            * - N : No                                          *
      *            *---------------------------------------------------*
               10  w-cnt-mst-sel          pic  x(01) value "S"        .
      *            *---------------------------------------------------*
      *            * Flag di documento da stampare                     *
      *            *---------------------------------------------------*
               10  w-cnt-mst-flg          pic  x(01)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [zoc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfzoc"                          .
      *        *-------------------------------------------------------*
      *        * [ocr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfocr"                          .
      *        *-------------------------------------------------------*
      *        * [ocp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfocp"                          .
      *        *-------------------------------------------------------*
      *        * [ocx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfocx"                          .
      *        *-------------------------------------------------------*
      *        * [osr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/ods/fls/rec/rfosr"                          .
      *        *-------------------------------------------------------*
      *        * [zsc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/ods/fls/rec/rfzsc"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [pdx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfpdx"                          .

      *    *===========================================================*
      *    * Work-area per bufferizzazione testata                     *
      *    *-----------------------------------------------------------*
       01  w-tes.
      *        *-------------------------------------------------------*
      *        * Valori chiave                                         *
      *        *-------------------------------------------------------*
           05  w-tes-val-key.
      *            *---------------------------------------------------*
      *            * Codice dipendenza                                 *
      *            *---------------------------------------------------*
               10  w-tes-cod-dpz          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice cliente                                    *
      *            *---------------------------------------------------*
               10  w-tes-cod-cli          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice cliente, ragione sociale                   *
      *            *---------------------------------------------------*
               10  w-tes-cod-cli-rag      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice cliente, indirizzo                         *
      *            *---------------------------------------------------*
               10  w-tes-cod-cli-via      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice cliente, localita'                         *
      *            *---------------------------------------------------*
               10  w-tes-cod-cli-loc      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza del cliente                     *
      *            *---------------------------------------------------*
               10  w-tes-dpz-cli          pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza del cliente, ragione sociale    *
      *            *---------------------------------------------------*
               10  w-tes-dpz-cli-rag      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza del cliente, indirizzo          *
      *            *---------------------------------------------------*
               10  w-tes-dpz-cli-via      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza del cliente, localita'          *
      *            *---------------------------------------------------*
               10  w-tes-dpz-cli-loc      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Data emissione ordini cliente minima              *
      *            *---------------------------------------------------*
               10  w-tes-dem-min          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data emissione ordini cliente massima             *
      *            *---------------------------------------------------*
               10  w-tes-dem-max          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data consegna richiesta minima                    *
      *            *---------------------------------------------------*
               10  w-tes-dcr-min          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data consegna richiesta massima                   *
      *            *---------------------------------------------------*
               10  w-tes-dcr-max          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Tipo movimento ordini clienti                     *
      *            *---------------------------------------------------*
               10  w-tes-tmo-orc          pic  x(05)                  .
               10  w-tes-tmo-orc-des      pic  x(30)                  .
      *            *---------------------------------------------------*
      *            * Tipo movimento ordini di spedizione               *
      *            *---------------------------------------------------*
               10  w-tes-tmo-ods          pic  x(05)                  .
               10  w-tes-tmo-ods-des      pic  x(30)                  .
      *            *---------------------------------------------------*
      *            * Data emissione ordini di spedizione               *
      *            *---------------------------------------------------*
               10  w-tes-dat-emi          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Campo per conferma impostazioni                   *
      *            *---------------------------------------------------*
               10  w-tes-cnf-imp          pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per bufferizzazione riga corpo                  *
      *    *-----------------------------------------------------------*
       01  w-rig.
           05  w-rig-num-prg              pic  9(05)                  .
           05  w-rig-tip-rig              pic  x(05)                  .
           05  w-rig-tip-rig-tpr          pic  x(01)                  .
           05  w-rig-tip-rig-tfu          pic  x(01)                  .
           05  w-rig-tip-mag              pic  9(02)                  .
           05  w-rig-num-pro              pic  9(07)                  .
           05  w-rig-alf-pro              pic  x(14)                  .
           05  w-rig-des-rig.
               10  w-rig-der-rig occurs 10
                                          pic  x(40)                  .
           05  w-rig-dec-qta              pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Quantita' da evadere                                  *
      *        *-------------------------------------------------------*
           05  w-rig-qta-dev              pic s9(10)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Quantita' assegnata precedentemente                   *
      *        *-------------------------------------------------------*
           05  w-rig-qas-pre              pic s9(10)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Quantita' assegnata                                   *
      *        *-------------------------------------------------------*
           05  w-rig-qta-ass              pic s9(10)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Quantita' disponibile                                 *
      *        *-------------------------------------------------------*
           05  w-rig-qta-dsp              pic s9(08)v9(03)            .
           05  w-rig-per-mrg              pic s9(03)                  .
           05  w-rig-ocl-dat              pic  9(07)                  .
           05  w-rig-ocl-num              pic  x(10)                  .
           05  w-rig-dat-doc              pic  9(07)                  .
           05  w-rig-num-doc              pic  9(11)                  .
           05  w-rig-sgl-vpp              pic  x(03)                  .
           05  w-rig-dec-vpp              pic  9(01)                  .
           05  w-rig-dec-prz              pic  9(01)                  .
           05  w-rig-prz-net              pic  9(09)                  .
           05  w-rig-sgl-vpl              pic  x(03)                  .
           05  w-rig-ccr-vpl              pic  9(06)v9(03)            .
           05  w-rig-plm-vpl              pic  9(01)v9(02)            .
           05  w-rig-tlm-vpl              pic  x(01)                  .
           05  w-rig-lot-ven              pic  9(10)v9(03)            .
           05  w-rig-dcn-ric              pic  9(07)                  .
           05  w-rig-dcn-prv              pic  9(07)                  .
           05  w-rig-prt-orc              pic  9(11)                  .
           05  w-rig-prg-orc              pic  9(05)                  .

      *    *===========================================================*
      *    * Area di comunicazione per gestione file relative di sup-  *
      *    * porto, con buffer in grado di ospitare l'area w-rig.      *
      *    *-----------------------------------------------------------*
       01  w-rlt-sup.
           05  w-rlt-sup-ope              pic  x(02)                  .
           05  w-rlt-sup-exs              pic  x(01)                  .
           05  w-rlt-sup-prg              pic  9(05)                  .
           05  w-rlt-sup-max              pic  9(05)                  .
           05  w-rlt-sup-ctr              pic  9(05)                  .
           05  w-rlt-sup-buf.
               10  filler occurs 1024     pic  x(01)                  .

      *    *===========================================================*
      *    * Work per linea corpo a video                              *
      *    *-----------------------------------------------------------*
       01  w-lin.
      *        *-------------------------------------------------------*
      *        * Numero righe di corpo effettive visibili contempora-  *
      *        * neamente in una pagina di corpo nell'area di scroll   *
      *        *-------------------------------------------------------*
           05  w-lin-num-lin-vis          pic  9(02)       value 11   .
      *        *-------------------------------------------------------*
      *        * Numero linee di display impegnate per ogni riga corpo *
      *        * nell'area di scroll                                   *
      *        *-------------------------------------------------------*
           05  w-lin-num-lin-prc          pic  9(02)       value 01   .
      *        *-------------------------------------------------------*
      *        * Prima linea di display utilizzata per le righe corpo  *
      *        * nell'area di scroll                                   *
      *        *-------------------------------------------------------*
           05  w-lin-pri-lin-vid          pic  9(02)       value 08   .
      *        *-------------------------------------------------------*
      *        * Immagine di una riga di corpo su video                *
      *        *-------------------------------------------------------*
           05  w-lin-imm.
      *            *---------------------------------------------------*
      *            * Linee di display per ogni riga corpo in scroll    *
      *            *---------------------------------------------------*
               10  w-lin-imm-dsp.
                   15  w-lin-imm-dsp-lin occurs 01
                                          pic  x(80)                  .
      *            *---------------------------------------------------*
      *            * Riga corpo in scroll rappresentata linearmente    *
      *            *---------------------------------------------------*
               10  w-lin-imm-scr redefines
                   w-lin-imm-dsp.
                   15  w-lin-imm-des-000.
                       20  w-lin-imm-des-001.
                           25  w-lin-imm-des-rig
                                          pic  x(40)                  .
                       20  w-lin-imm-des-002 redefines
                           w-lin-imm-des-001.
                           25  w-lin-imm-d25-p01
                                          pic  x(25)                  .
                           25  w-lin-imm-brv-p01
                                          pic  x(01)                  .
                           25  w-lin-imm-cod-p01
                                          pic  x(14)                  .
                       20  w-lin-imm-des-003 redefines
                           w-lin-imm-des-001.
                           25  w-lin-imm-d21-p02
                                          pic  x(21)                  .
                           25  w-lin-imm-brv-p02
                                          pic  x(01)                  .
                           25  w-lin-imm-pqs-p02
                                          pic  x(01)                  .
                           25  w-lin-imm-tco-p02
                                          pic  x(01)                  .
                           25  w-lin-imm-pqd-p02
                                          pic  x(01)                  .
                           25  filler     pic  x(01)                  .
                           25  w-lin-imm-cod-p02
                                          pic  x(14)                  .
                       20  w-lin-imm-des-004 redefines
                           w-lin-imm-des-001.
                           25  w-lin-imm-cod-p03
                                          pic  x(14)                  .
                           25  w-lin-imm-brv-p03
                                          pic  x(01)                  .
                           25  w-lin-imm-d25-p03
                                          pic  x(25)                  .
                       20  w-lin-imm-des-005 redefines
                           w-lin-imm-des-001.
                           25  w-lin-imm-pqs-p04
                                          pic  x(01)                  .
                           25  w-lin-imm-tco-p04
                                          pic  x(01)                  .
                           25  w-lin-imm-pqd-p04
                                          pic  x(01)                  .
                           25  w-lin-imm-brv-p04
                                          pic  x(01)                  .
                           25  w-lin-imm-cod-p04
                                          pic  x(14)                  .
                           25  filler     pic  x(01)                  .
                           25  w-lin-imm-d21-p04
                                          pic  x(21)                  .
                   15  w-lin-imm-brv-001  pic  x(01)                  .
                   15  w-lin-imm-qta-dev  pic  x(10)                  .
                   15  w-lin-imm-brv-002  pic  x(01)                  .
                   15  w-lin-imm-qta-ass  pic  x(11)                  .
                   15  w-lin-imm-brv-003  pic  x(01)                  .
                   15  w-lin-imm-qta-dsp  pic  x(11)                  .
                   15  w-lin-imm-brv-004  pic  x(01)                  .
                   15  w-lin-imm-per-mrg  pic  x(04)                  .

      *    *===========================================================*
      *    * Work-area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Personalizzazioni per blocco cliente in spedizioni    *
      *        *-------------------------------------------------------*
           05  w-prs-blo-cli.
      *            *---------------------------------------------------*
      *            * Tipo di blocco                                    *
      *            *---------------------------------------------------*
               10  w-prs-blo-cli-tip.
      *                *-----------------------------------------------*
      *                * Da anagrafica commerciale cliente             *
      *                *-----------------------------------------------*
                   15  w-prs-blo-cli-t01  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Libero per usi futuri                         *
      *                *-----------------------------------------------*
                   15  w-prs-blo-cli-t02  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Libero per usi futuri                         *
      *                *-----------------------------------------------*
                   15  w-prs-blo-cli-t03  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Libero per usi futuri                         *
      *                *-----------------------------------------------*
                   15  w-prs-blo-cli-t04  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Libero per usi futuri                         *
      *                *-----------------------------------------------*
                   15  w-prs-blo-cli-t05  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Personalizzazioni per la riga di scroll               *
      *        *-------------------------------------------------------*
           05  w-prs-rig-scr.
      *            *---------------------------------------------------*
      *            * Esposizione della descrizione                     *
      *            *                                                   *
      *            *   - 00 : Descrizione completa                     *
      *            *                                                   *
      *            *   - 01 : Primi 25 caratteri della descrizione     *
      *            *          Codice                                   *
      *            *                                                   *
      *            *   - 02 : Primi 21 caratteri della descrizione     *
      *            *          Tipo codice                              *
      *            *          Codice                                   *
      *            *                                                   *
      *            *   - 03 : Codice                                   *
      *            *          Primi 25 caratteri della descrizione     *
      *            *                                                   *
      *            *   - 04 : Tipo codice                              *
      *            *          Codice                                   *
      *            *          Primi 21 caratteri della descrizione     *
      *            *                                                   *
      *            *   - 05 : Codice                                   *
      *            *                                                   *
      *            *   - 06 : Tipo codice                              *
      *            *          Codice                                   *
      *            *                                                   *
      *            *---------------------------------------------------*
               10  w-prs-rig-scr-des      pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area referenze                                       *
      *    *-----------------------------------------------------------*
       01  w-ref.
      *        *-------------------------------------------------------*
      *        * Referenza relativa default per il tipo movimento      *
      *        *-------------------------------------------------------*
           05  w-ref-tmo-orc.
      *            *---------------------------------------------------*
      *            * Modalita' di trattamento default                  *
      *            *                                                   *
      *            *  - ' ' : Nessun default                           *
      *            *  - 'I' : Default iniziale in entrata programma    *
      *            *  - 'C' : Default continuo, anche cioe' se valore  *
      *            *          successivamente variato                  *
      *            *  - 'O' : Default obbligatorio, cioe' valore non   *
      *            *          modificabile per nessun motivo           *
      *            *---------------------------------------------------*
               10  w-ref-tmo-orc-trt      pic  x(01)                  .
               10  filler                 pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice tipo movimento di default                  *
      *            *---------------------------------------------------*
               10  w-ref-tmo-orc-cod      pic  x(05)                  .
      *        *-------------------------------------------------------*
      *        * Referenza relativa default per il tipo movimento      *
      *        *-------------------------------------------------------*
           05  w-ref-tmo-ods.
      *            *---------------------------------------------------*
      *            * Modalita' di trattamento default                  *
      *            *                                                   *
      *            *  - ' ' : Nessun default                           *
      *            *  - 'I' : Default iniziale in entrata programma    *
      *            *  - 'C' : Default continuo, anche cioe' se valore  *
      *            *          successivamente variato                  *
      *            *  - 'O' : Default obbligatorio, cioe' valore non   *
      *            *          modificabile per nessun motivo           *
      *            *---------------------------------------------------*
               10  w-ref-tmo-ods-trt      pic  x(01)                  .
               10  filler                 pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice tipo movimento di default                  *
      *            *---------------------------------------------------*
               10  w-ref-tmo-ods-cod      pic  x(05)                  .

      *    *===========================================================*
      *    * Work-area per salvataggi                                  *
      *    *-----------------------------------------------------------*
       01  w-sav.
      *        *-------------------------------------------------------*
      *        * Codice cliente                                        *
      *        *-------------------------------------------------------*
           05  w-sav-cod-cli              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Quantita' assegnata                                   *
      *        *-------------------------------------------------------*
           05  w-sav-qta-ass              pic  9(10)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Tipo uscita da accettazione precedente                *
      *        *-------------------------------------------------------*
           05  w-sav-tip-usc              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Tipo movimento ordini                                 *
      *        *-------------------------------------------------------*
           05  w-sav-tmo-orc              pic  x(05)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zoc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zoc.
               10  w-let-arc-zoc-flg      pic  x(01)                  .
               10  w-let-arc-zoc-cod      pic  x(05)                  .
               10  w-let-arc-zoc-des      pic  x(30)                  .
               10  w-let-arc-zoc-vld      pic  9(02)                  .
               10  w-let-arc-zoc-dpz      pic  9(02)                  .
               10  w-let-arc-zoc-ord      pic  9(02)                  .
               10  w-let-arc-zoc-prd      pic  9(02)                  .
               10  w-let-arc-zoc-sgl      pic  x(03)                  .
               10  w-let-arc-zoc-dtr      pic  x(05)                  .
               10  w-let-arc-zoc-tip      pic  x(01)                  .
               10  w-let-arc-zoc-dds      pic  9(02)                  .
               10  w-let-arc-zoc-tar      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zsc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zsc.
               10  w-let-arc-zsc-flg      pic  x(01)                  .
               10  w-let-arc-zsc-cod      pic  x(05)                  .
               10  w-let-arc-zsc-des      pic  x(30)                  .
               10  w-let-arc-zsc-vld      pic  9(02)                  .
               10  w-let-arc-zsc-dpz      pic  9(02)                  .
               10  w-let-arc-zsc-maf      pic  9(02)                  .
               10  w-let-arc-zsc-dmf      pic  x(05)                  .
               10  w-let-arc-zsc-tar      pic  x(01)                  .
               10  w-let-arc-zsc-dtr      pic  x(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [cli]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-cli.
               10  w-let-arc-cli-flg      pic  x(01)                  .
               10  w-let-arc-cli-cod      pic  9(07)                  .
               10  w-let-arc-cli-rag      pic  x(40)                  .
               10  w-let-arc-cli-via      pic  x(40)                  .
               10  w-let-arc-cli-loc      pic  x(40)                  .
               10  w-let-arc-cli-cge      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcc.
               10  w-let-arc-dcc-flg      pic  x(01)                  .
               10  w-let-arc-dcc-tle      pic  x(01)                  .
               10  w-let-arc-dcc-cod      pic  9(07)                  .
               10  w-let-arc-dcc-dpz      pic  x(04)                  .
               10  w-let-arc-dcc-rag      pic  x(40)                  .
               10  w-let-arc-dcc-via      pic  x(40)                  .
               10  w-let-arc-dcc-loc      pic  x(40)                  .
               10  w-let-arc-dcc-abi      pic  9(05)                  .
               10  w-let-arc-dcc-cab      pic  9(05)                  .
               10  w-let-arc-dcc-blo      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [ocx]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-ocx.
               10  w-let-arc-ocx-flg      pic  x(01)                  .
               10  w-let-arc-ocx-prt      pic  9(11)                  .
               10  w-let-arc-ocx-prg      pic  9(05)                  .
               10  w-let-arc-ocx-trc      pic  9(02)                  .
               10  w-let-arc-ocx-des.
                   15  w-let-arc-ocx-drg occurs 10
                                          pic  x(40)                  .

      *    *===========================================================*
      *    * Work per Let su archivio [dcp] e [pdx]                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/ldcppdx0.ltw"                   .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det prezzo eventualmente sottoposto a legame *
      *        * valutario                                             *
      *        *-------------------------------------------------------*
           05  w-det-prz-lvl.
               10  w-det-prz-lvl-prz      pic  9(09)                  .
               10  w-det-prz-lvl-svl      pic  x(03)                  .
               10  w-det-prz-lvl-ccr      pic  9(06)v9(05)            .
               10  w-det-prz-lvl-cdc      pic  9(06)v9(05)            .
               10  w-det-prz-lvl-plm      pic  9(01)v9(02)            .
               10  w-det-prz-lvl-tlm      pic  x(01)                  .
               10  w-det-prz-lvl-wps      pic  9(08)v9(05)            .
               10  w-det-prz-lvl-wpc      pic  9(06)v9(05)            .
               10  w-det-prz-lvl-wpz      pic  9(13)v9(05)            .
      *        *-------------------------------------------------------*
      *        * Work per Det descrizione in riga ordine cliente       *
      *        *-------------------------------------------------------*
           05  w-det-des-rig.
               10  w-det-des-rig-des      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det numero pagina riga corpo                 *
      *        *-------------------------------------------------------*
           05  w-det-pag-cor.
               10  w-det-pag-cor-max      pic  9(03)                  .
               10  w-det-pag-cor-att      pic  9(03)                  .
               10  w-det-pag-cor-rem      pic  9(02)                  .
               10  w-det-pag-cor-ep1      pic  x(03)                  .
               10  w-det-pag-cor-ep2      pic  x(03)                  .
               10  w-det-pag-cor-npa      pic  x(07)                  .
      *        *-------------------------------------------------------*
      *        * Per Fine riga                                         *
      *        *-------------------------------------------------------*
           05  w-det-fin-rig.
      *            *---------------------------------------------------*
      *            * Separatore 'CR'                                   *
      *            *---------------------------------------------------*
               10  w-det-fin-rig-chr      pic  x(01)   value H"0D"    .
      *            *---------------------------------------------------*
      *            * Separatore 'TAB'                                  *
      *            *---------------------------------------------------*
               10  w-det-fin-rig-tab      pic  x(01)   value H"09"    .
      *        *-------------------------------------------------------*
      *        * Work per Det esposizione cliente                      *
      *        *-------------------------------------------------------*
           05  w-det-esp-cli.
               10  w-det-esp-cli-cod      pic  9(07)                  .
               10  w-det-esp-cli-esp      pic s9(13)                  .
               10  w-det-esp-cli-wfd      pic s9(13)                  .
               10  w-det-esp-cli-wac      pic s9(13)                  .
               10  w-det-esp-cli-olf      pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per routine pmt-cor-reg-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-pmt-cor-reg.
           05  w-pmt-cor-reg-x80          pic  x(80)                  .
           05  w-pmt-cor-reg-pnt          pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per routine vis-prz-ven-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-vis-prz-ven.
           05  w-vis-prz-ven-x40          pic  x(40)                  .
           05  w-vis-prz-ven-pnt          pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per routine vis-rif-ocl-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-vis-rif-ocl.
           05  w-vis-rif-ocl-x40          pic  x(40)                  .
           05  w-vis-rif-ocl-pnt          pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per routine car-fil-rap-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-car-fil-rap.
      *        *-------------------------------------------------------*
      *        * Work per rottura numero protocollo ordine cliente     *
      *        *-------------------------------------------------------*
           05  w-car-fil-rap-wrp          pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Work per composizione intestazione cliente            *
      *        *-------------------------------------------------------*
           05  w-car-fil-rap-x40          pic  x(40)                  .
           05  w-car-fil-rap-pnt          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per ridefinizione numero documento               *
      *        *-------------------------------------------------------*
           05  w-car-fil-rap-ndo          pic  9(11)                  .
           05  w-car-fil-rap-ndo-r redefines
               w-car-fil-rap-ndo.
               10  w-car-fil-rap-saa      pic  9(03)                  .
               10  w-car-fil-rap-dpz      pic  9(02)                  .
               10  w-car-fil-rap-prg      pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Work per ridefinizione tipo riga                      *
      *        *-------------------------------------------------------*
           05  w-car-fil-rap-wtr.
               10  w-car-fil-rap-wtp      pic  x(01)                  .
               10  w-car-fil-rap-wtf      pic  x(01)                  .
               10  filler                 pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per quantita' evasa                              *
      *        *-------------------------------------------------------*
           05  w-car-fil-rap-wqe          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Work per quantita' assegnata                          *
      *        *-------------------------------------------------------*
           05  w-car-fil-rap-wqa          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Work per quantita' in giacenza                        *
      *        *-------------------------------------------------------*
           05  w-car-fil-rap-wqg          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Work per quantita' in corso di spedizione             *
      *        *-------------------------------------------------------*
           05  w-car-fil-rap-wqs          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Work per quantita' disponibile                        *
      *        *-------------------------------------------------------*
           05  w-car-fil-rap-wqd          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Work per determinazione margine lordo                 *
      *        *-------------------------------------------------------*
           05  w-car-fil-rap-9v2          pic  9(09)v9(02)            .
           05  w-car-fil-rap-wvu          pic  9(11)v9(02)            .
           05  w-car-fil-rap-vsc          pic s9(11)v9(02)            .

      *    *===========================================================*
      *    * Work-area per routine sca-fil-rap-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-sca-fil-rap.
      *        *-------------------------------------------------------*
      *        * Tabella dei protocolli ordini cliente trattati        *
      *        *-------------------------------------------------------*
           05  w-sca-fil-rap-tpo.
      *            *---------------------------------------------------*
      *            * Numero elementi in tabella                        *
      *            *---------------------------------------------------*
               10  w-sca-fil-rap-ele      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero massimo elementi in tabella                *
      *            *---------------------------------------------------*
               10  w-sca-fil-rap-max      pic  9(05) value 999        .
      *            *---------------------------------------------------*
      *            * Tabella vera e propria                            *
      *            *---------------------------------------------------*
               10  w-sca-fil-rap-tse occurs 999.
      *                *-----------------------------------------------*
      *                * Numero protocollo ordine cliente              *
      *                *-----------------------------------------------*
                   15  w-sca-fil-rap-tnp  pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Contatori di scansione                                *
      *        *-------------------------------------------------------*
           05  w-sca-fil-rap-c01          pic  9(05)                  .
           05  w-sca-fil-rap-c02          pic  9(05)                  .
           05  w-sca-fil-rap-c03          pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per rottura numero protocollo                    *
      *        *-------------------------------------------------------*
           05  w-sca-fil-rap-rnp          pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Work per ridefinizione variabile di i.p.c. per numeri *
      *        * protocollo ordini clienti trattati                    *
      *        *-------------------------------------------------------*
           05  w-sca-fil-rap-wrl.
               10  w-sca-fil-rap-wrn
                              occurs  07  pic  9(11)                  .
               10  filler                 pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per ridefinizione nome variabile di i.p.c. per   *
      *        * numeri protocollo ordini clienti trattati             *
      *        *-------------------------------------------------------*
           05  w-sca-fil-rap-wnv.
               10  w-sca-fil-rap-wn0      pic  x(07)                  .
               10  w-sca-fil-rap-wn9      pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Buffer delle frammentazioni riga ordine cliente       *
      *        *-------------------------------------------------------*
           05  w-sca-fil-rap-bfr.
      *            *---------------------------------------------------*
      *            * Numero elementi in buffer                         *
      *            *---------------------------------------------------*
               10  w-sca-fil-rap-bfe      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero massimo elementi in buffer                 *
      *            *---------------------------------------------------*
               10  w-sca-fil-rap-bfm      pic  9(05) value 500        .
      *            *---------------------------------------------------*
      *            * Buffer vero e proprio                             *
      *            *---------------------------------------------------*
               10  w-sca-fil-rap-bfb occurs 500.
                   15  filler occurs 128  pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Comodo per contatore frammenti                    *
      *            *---------------------------------------------------*
               10  w-sca-fil-rap-ctf      pic  9(05)                  .

      *    *===========================================================*
      *    * Work-area per allineamento a destra di un campo           *
      *    *-----------------------------------------------------------*
       01  w-all-adx.
           05  w-all-adx-max              pic  9(02)                  .
           05  w-all-adx-str.
               10  w-all-adx-chr occurs 40
                                          pic  x(01)                  .
           05  w-all-adx-stw.
               10  w-all-adx-chw occurs 40
                                          pic  x(01)                  .
           05  w-all-adx-c01              pic  9(02)                  .
           05  w-all-adx-c02              pic  9(02)                  .

      *    *===========================================================*
      *    * Work per valori di default                                *
      *    *-----------------------------------------------------------*
       01  w-def.
      *        *-------------------------------------------------------*
      *        * Tipo movimento per ordine cliente                     *
      *        *-------------------------------------------------------*
           05  w-def-tmo-orc              pic  x(05)                  .
           05  w-def-tmo-orc-flg          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Tipo movimento per la spedizione                      *
      *        *-------------------------------------------------------*
           05  w-def-tmo-ods              pic  x(05)                  .
           05  w-def-tmo-ods-flg          pic  x(01)                  .

      *    *===========================================================*
      *    * Work area per la definizione dei record in output         *
      *    *-----------------------------------------------------------*
       01  w-out.
      *        *-------------------------------------------------------*
      *        * Output di work                                        *
      *        *-------------------------------------------------------*
           05  w-out-wrk.
               10  w-out-wrk-txt-msg.
                   15  filler occurs 512  pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale, o per messaggi centra- *
      *        * li circondati da un box                               *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .
               10  w-err-box-err-m02      pic  x(65)                  .

      *    *===========================================================*
      *    * Area di interfaccia per sottoprogramma         "pazi000d" *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/pazi000d.pgl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione tipo movimento ordini clienti  *
      *    *-----------------------------------------------------------*
           copy      "pgm/orc/prg/cpy/acdezoc0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice tipo movimento spedi-   *
      *    * zioni clienti                                             *
      *    *-----------------------------------------------------------*
           copy      "pgm/ods/prg/cpy/acdezsc0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice cliente commerciale     *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmndcc0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice dipendenza del cliente  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoddcc0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione coefficiente cambio valuta     *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoecmb0.acl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione quantita' da e-  *
      *    * vadere riga ordine cliente                                *
      *    *-----------------------------------------------------------*
           copy      "pgm/orc/prg/cpy/dqevroc0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione quantita' da     *
      *    * spedire riga ordine di spedizione                         *
      *    *-----------------------------------------------------------*
           copy      "pgm/ods/prg/cpy/dqdsros0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione saldi magazzino  *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldmag0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione valore unitario  *
      *    * di magazzino                                              *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dvunmag0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione esposizione      *
      *    * cliente                                                   *
      *    *-----------------------------------------------------------*
           copy      "pgm/gep/prg/cpy/despcec0.dtl"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di visualizzazione titolo  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-tit      .
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
       main-050.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-800.
       main-100.
      *              *-------------------------------------------------*
      *              * Accettazione campi chiave                       *
      *              *-------------------------------------------------*
           perform   acc-key-reg-000      thru acc-key-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita "E" : fine programma         *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-key    =    "E"
                     go to main-800.
      *              *-------------------------------------------------*
      *              * Lettura registrazione pre-esistente             *
      *              *-------------------------------------------------*
           perform   rou-let-reg-000      thru rou-let-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se esito negativo : riciclo su chiave       *
      *                  *---------------------------------------------*
           if        w-cnt-rou-let-reg    not  = spaces
                     go to main-100.
      *              *-------------------------------------------------*
      *              * Routine pre-accettazione campi non chiave       *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     go to main-130
           else if   w-cnt-mfu-tip-fun    =    "M"
                     go to main-140
           else if   w-cnt-mfu-tip-fun    =    "V"
                     go to main-150
           else      go to main-100.
       main-130.
           move      spaces               to   w-cnt-pre-acc-ins      .
           perform   pre-acc-ins-000      thru pre-acc-ins-999        .
           if        w-cnt-pre-acc-ins    =    spaces
                     go to main-180
           else      go to main-100.
       main-140.
           move      spaces               to   w-cnt-pre-acc-mod      .
           perform   pre-acc-mod-000      thru pre-acc-mod-999        .
           if        w-cnt-pre-acc-mod    =    spaces
                     go to main-180
           else      go to main-100.
       main-150.
           move      spaces               to   w-cnt-pre-acc-vis      .
           perform   pre-acc-vis-000      thru pre-acc-vis-999        .
           if        w-cnt-pre-acc-vis    =    spaces
                     go to main-180
           else      go to main-100.
       main-180.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di modifica di almeno un   *
      *              * campo non chiave                                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-flg-aum      .
      *              *-------------------------------------------------*
      *              * Accettazione campi non chiave                   *
      *              *-------------------------------------------------*
           perform   acc-nok-reg-000      thru acc-nok-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "E"
                     go to main-200.
      *                      *-----------------------------------------*
      *                      * Routine post-exit su campi non chiave   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se Inserimento                      *
      *                          *-------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-exi-ins-000
                                          thru pos-exi-ins-999
      *                          *-------------------------------------*
      *                          * Se Modifica                         *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-exi-mod-000
                                          thru pos-exi-mod-999
      *                          *-------------------------------------*
      *                          * Se Visualizzazione                  *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "V"
                     perform   pos-exi-vis-000
                                          thru pos-exi-vis-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-200.
      *                  *---------------------------------------------*
      *                  * Se uscita per annullamento                  *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "X"
                     go to main-300.
      *                      *-----------------------------------------*
      *                      * Routine post-conferma di annullamento   *
      *                      *-----------------------------------------*
           perform   pos-cnf-ann-000      thru pos-cnf-ann-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-300.
      *                  *---------------------------------------------*
      *                  * Se uscita per conferma                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Routine post-conferma                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se post-conferma di Inserimento     *
      *                          *-------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-cnf-ins-000
                                          thru pos-cnf-ins-999
      *                          *-------------------------------------*
      *                          * Se post-conferma di Modifica        *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-cnf-mod-000
                                          thru pos-cnf-mod-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-800.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione routine post-esecuzione programma    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pos-exe-pgm      .
           perform   pos-exe-pgm-000      thru pos-exe-pgm-999        .
           if        w-cnt-pos-exe-pgm    not  = spaces
                     go to main-050.
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Prnt                          *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mst-flg          .
           if        w-cnt-mst-sel        not  = "S"
                     go to exe-acc-cmp-025.
           if        w-cnt-mfu-tip-imp    =    "K"
                     go to exe-acc-cmp-025.
           if        v-pfk (05)           =    "DO  "
                     move  "PRNT"         to   v-pfk (18)             .
       exe-acc-cmp-025.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Prsc :                        *
      *              * - se in tipo impostazione testata e su pagina   *
      *              *   maggiore di 1 : abilitato                     *
      *              * - altrimenti    : invariato                     *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "T" and
                     w-cnt-sts-imp-npt    >    1
                     move  "PRSC"         to   v-pfk (07)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Nxsc :                        *
      *              * - se in tipo impostazione testata e se pagina   *
      *              *   gia' completamente impostata o testata gia'   *
      *              *   completamente impostata : abilitato           *
      *              *  - altrimenti             : invariato           *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    not  = "T"
                     go to exe-acc-cmp-050.
           if        w-cnt-sts-imp-tes    not  = spaces or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     move  "NXSC"         to   v-pfk (08)             .
       exe-acc-cmp-050.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Delt :                        *
      *              *  - se Impostazione chiave    : non abilitato    *
      *              *  - se Altri campi corpo      : non abilitato    *
      *              *  - se Inserimento            : non abilitato    *
      *              *  - se Visualizzazione        : non abilitato    *
      *              *  - se Disabilitato manualm.  : non abilitato    *
      *              *  - se Almeno una modifica    : non abilitato    *
      *              *  - altrimenti                : abilitato        *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "K"      or
                     w-cnt-mfu-tip-imp    =    "R"      or
                     w-cnt-mfu-tip-fun    =    "I"      or
                     w-cnt-mfu-tip-fun    =    "V"      or
                     w-cnt-sts-imp-itd    not  = spaces or
                     w-cnt-acc-flg-aum    not  = spaces
                     go to exe-acc-cmp-100.
           move      "DELT"               to   v-pfk (19)             .
       exe-acc-cmp-100.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Do :                          *
      *              *  - se Visualizzazione     : disabilitato        *
      *              *  - altrimenti             : inalterato          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     move  spaces         to   v-pfk (05)             .
      *              *-------------------------------------------------*
      *              * Tasti di funzione Insr e Remv :                 *
      *              *  - se Visualizzazione e in                      *
      *              *    primo campo riga corpo : disabilitati        *
      *              *  - altrimenti             : inalterati          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V" and
                     w-cnt-mfu-tip-imp    =    "C"
                     move  spaces         to   v-pfk (04)
                     move  spaces         to   v-pfk (06)             .
      *              *-------------------------------------------------*
      *              * Salvataggio parametri di accettazione           *
      *              *-------------------------------------------------*
           move      v-tip                to   w-cnt-acc-sav-tip      .
           move      v-car                to   w-cnt-acc-sav-car      .
           move      v-lin                to   w-cnt-acc-sav-lin      .
           move      v-pos                to   w-cnt-acc-sav-pos      .
           if        v-tip                =    "A" or
                     v-tip                =    "U" or
                     v-tip                =    "L" or
                     v-tip                =    "E"
                     move  v-alf          to   w-cnt-acc-sav-alf      .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  v-dec          to   w-cnt-acc-sav-dec
                     move  v-sgn          to   w-cnt-acc-sav-sgn
                     move  v-edm          to   w-cnt-acc-sav-edm
                     move  v-msk          to   w-cnt-acc-sav-msk
                     move  v-num          to   w-cnt-acc-sav-num      .
           if        v-tip                =    "D"
                     move  v-dat          to   w-cnt-acc-sav-dat      .
           if        v-tip                =    "T" or
                     v-tip                =    "E"
                     move  v-ldt          to   w-cnt-acc-sav-ldt
                     move  v-txt          to   w-cnt-acc-sav-txt      .
           move      v-ufk                to   w-cnt-acc-sav-ufk      .
       exe-acc-cmp-200.
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Memorizzazione segnale di campo modificato      *
      *              *-------------------------------------------------*
           move      v-mod                to   w-cnt-acc-sav-mod      .
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "DELT"
                     go to exe-acc-cmp-600.
      *              *-------------------------------------------------*
      *              * Se il campo impostato ha modificato il valore   *
      *              * precedente : ripetizione impostazione           *
      *              *-------------------------------------------------*
           if        w-cnt-acc-sav-mod    not  = spaces
                     go to exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Routine pre-richiesta di ratifica tasto Delete  *
      *              *-------------------------------------------------*
           perform   pre-snx-del-000      thru pre-snx-del-999        .
      *              *-------------------------------------------------*
      *              * Se errore : a ripristino                        *
      *              *-------------------------------------------------*
           if        w-cnt-pre-snx-del    not  = spaces
                     go to exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Salvataggio linee 23 e 24 di note operative     *
      *              *-------------------------------------------------*
           move      "GL"                 to   v-ope                  .
           move      23                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l23      .
           move      "GL"                 to   v-ope                  .
           move      24                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l24      .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative attuali            *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      spaces               to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Richiesta conferma annullamento                 *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "Conferma operazione di annullamento dell'intero do
      -              "cumento (S/N) ?"    to   v-not                  .
           move      "N"                  to   v-alf                  .
           move      "SN"                 to   v-msk                  .
           move      "DELT"               to   v-pfk (19)             .
           move      "UP  "               to   v-pfk (02)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                =    spaces
                     if      v-alf        =    "S"
                             move  "DELT" to   v-key
                     else    move  "UP  " to   v-key                  .
      *              *-------------------------------------------------*
      *              * Se non function key DELT si ripristina          *
      *              *-------------------------------------------------*
           if        v-key                not  = "DELT"
                     go to exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Routine post-richiesta di ratifica tasto Delete *
      *              *-------------------------------------------------*
           perform   pos-snx-del-000      thru pos-snx-del-999        .
      *              *-------------------------------------------------*
      *              * Se errore : a ripristino                        *
      *              *-------------------------------------------------*
           if        w-cnt-pos-snx-del    not  = spaces
                     go to exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Altrimenti : uscita                             *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-999.
       exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Ripristino linee 23 e 24 di note operative      *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      w-cnt-acc-sav-l23    to   v-nt1                  .
           move      w-cnt-acc-sav-l24    to   v-nt2                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Ripristino parametri di impostazione            *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      w-cnt-acc-sav-tip    to   v-tip                  .
           move      w-cnt-acc-sav-car    to   v-car                  .
           move      w-cnt-acc-sav-lin    to   v-lin                  .
           move      w-cnt-acc-sav-pos    to   v-pos                  .
           if        v-tip                =    "A" or
                     v-tip                =    "U" or
                     v-tip                =    "L" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-alf
                                          to   v-alf                  .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-dec
                                          to   v-dec
                     move  w-cnt-acc-sav-sgn
                                          to   v-sgn
                     move  w-cnt-acc-sav-edm
                                          to   v-edm
                     move  w-cnt-acc-sav-msk
                                          to   v-msk
                     move  w-cnt-acc-sav-num
                                          to   v-num                  .
           if        v-tip                =    "D"
                     move  w-cnt-acc-sav-dat
                                          to   v-dat                  .
           if        v-tip                =    "T" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-ldt
                                          to   v-ldt
                     move  w-cnt-acc-sav-txt
                                          to   v-txt                  .
           move      w-cnt-acc-sav-ufk    to   v-ufk                  .
      *              *-------------------------------------------------*
      *              * Ritorno alla impostazione                       *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-200.
       exe-acc-cmp-600.
      *              *-------------------------------------------------*
      *              * Flag globale di avvenuta almeno una modifica    *
      *              *-------------------------------------------------*
           if        w-cnt-acc-sav-mod    not  = spaces
                     move  "#"            to   w-cnt-acc-flg-aum      .
      *              *-------------------------------------------------*
      *              * Set del flag di tasto Prnt                      *
      *              *-------------------------------------------------*
           if        v-key                not  = "PRNT"
                     go to exe-acc-cmp-800.
           move      "#"                  to   w-cnt-mst-flg          .
           move      "DO  "               to   v-key                  .
       exe-acc-cmp-800.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "EXIT"
                     go to exe-acc-cmp-999.
      *                  *---------------------------------------------*
      *                  * Subroutine di controllo per Exit            *
      *                  *---------------------------------------------*
           perform   exe-acc-cmp-exi-000  thru exe-acc-cmp-exi-999    .
      *                  *---------------------------------------------*
      *                  * Se Exit non attivato : a ripristino para-   *
      *                  * metri di impostazione                       *
      *                  *---------------------------------------------*
           if        w-cnt-acc-flg-exi    not  = spaces
                     go to exe-acc-cmp-400.
      *                  *---------------------------------------------*
      *                  * Altrimenti : uscita                         *
      *                  *---------------------------------------------*
           go to     exe-acc-cmp-999.
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *                                                           *
      *    * Subroutine di controllo tasto 'Exit'                      *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-exi-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-flg-exi      .
       exe-acc-cmp-exi-050.
      *              *-------------------------------------------------*
      *              * Se impostazione campi chiave : si ignora        *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "K"
                     go to exe-acc-cmp-exi-920.
      *              *-------------------------------------------------*
      *              * Se in visualizzazione : si ignora               *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to exe-acc-cmp-exi-920.
      *              *-------------------------------------------------*
      *              * Se in impostazione altri campi riga corpo : si  *
      *              * ignora                                          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "R"
                     go to exe-acc-cmp-exi-920.
      *              *-------------------------------------------------*
      *              * Se non avvenuta alcuna modifica : si ignora     *
      *              *-------------------------------------------------*
           if        w-cnt-acc-flg-aum    =    spaces
                     go to exe-acc-cmp-exi-920.
       exe-acc-cmp-exi-100.
      *              *-------------------------------------------------*
      *              * Salvataggio linee 23 e 24 di note operative     *
      *              *-------------------------------------------------*
           move      "GL"                 to   v-ope                  .
           move      23                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l23      .
           move      "GL"                 to   v-ope                  .
           move      24                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l24      .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative attuali            *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      spaces               to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Richiesta conferma di uscita                    *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "Conferma operazione di uscita senza memorizzazione
      -              " dei dati (S/N) ?"  to   v-not                  .
           move      "N"                  to   v-alf                  .
           move      "SN"                 to   v-msk                  .
           move      "EXIT"               to   v-pfk (20)             .
           move      "UP  "               to   v-pfk (02)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                =    spaces
                     if      v-alf        =    "S"
                             move  "EXIT" to   v-key
                     else    move  "UP  " to   v-key                  .
      *              *-------------------------------------------------*
      *              * Se non function key EXIT si ripristina          *
      *              *-------------------------------------------------*
           if        v-key                not  = "EXIT"
                     go to exe-acc-cmp-exi-600.
      *              *-------------------------------------------------*
      *              * Altrimenti : ad Exit attivato                   *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-exi-800.
       exe-acc-cmp-exi-600.
      *              *-------------------------------------------------*
      *              * Se uscita senza Exit                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di Exit non attivato                   *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-acc-flg-exi      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     exe-acc-cmp-exi-900.
       exe-acc-cmp-exi-800.
      *              *-------------------------------------------------*
      *              * Se uscita con Exit                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     exe-acc-cmp-exi-900.
       exe-acc-cmp-exi-900.
      *              *-------------------------------------------------*
      *              * Ripristino linee 23 e 24 di note operative      *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      w-cnt-acc-sav-l23    to   v-nt1                  .
           move      w-cnt-acc-sav-l24    to   v-nt2                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-exi-920.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-exi-999.
       exe-acc-cmp-exi-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Test su flag di visualizzazione titolo          *
      *              *-------------------------------------------------*
           if        w-cnt-sts-vis-tit    not  = spaces
                     move  spaces         to   w-cnt-sts-vis-tit
                     go to vis-tit-pgm-999.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione tipo funzionamento                        *
      *    *-----------------------------------------------------------*
       vis-tip-fun-000.
       vis-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Visualizzazione titolo programma                *
      *              *-------------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
           move      "#"                  to   w-cnt-sts-vis-tit      .
       pre-exe-pgm-100.
      *              *-------------------------------------------------*
      *              * Determinazione codici dipendenze per l'azienda  *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      "DA"                 to   w-dpz-tip-ope          .
           move      s-ter                to   w-dpz-ide-ter          .
           move      s-ute                to   w-dpz-ide-ute          .
           move      s-azi                to   w-dpz-ide-azi          .
           move      s-sap                to   w-dpz-ide-sap          .
           move      s-arg                to   w-dpz-ide-arg          .
           move      s-set                to   w-dpz-ide-set          .
           move      s-fas                to   w-dpz-ide-fas          .
           move      i-ide-des            to   w-dpz-ide-des          .
           move      s-pro                to   w-dpz-ide-pro          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
      *              *-------------------------------------------------*
      *              * Se zero dipendenze : errore ed uscita           *
      *              *-------------------------------------------------*
           if        w-dpz-ctr-dpz        >    zero
                     go to pre-exe-pgm-120.
           move      "EN"                 to   w-dpz-tip-ope          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
           move      "#"                  to   w-cnt-pre-exe-pgm      .
           go to     pre-exe-pgm-999.
       pre-exe-pgm-120.
      *              *-------------------------------------------------*
      *              * Selezione codice dipendenza per il programma    *
      *              *-------------------------------------------------*
           move      "SD"                 to   w-dpz-tip-ope          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
       pre-exe-pgm-180.
      *              *-------------------------------------------------*
      *              * Se scelta non effettuata : uscita               *
      *              *-------------------------------------------------*
           if        w-dpz-cod-prg        =    zero
                     move  "#"            to   w-cnt-pre-exe-pgm
                     go to pre-exe-pgm-999.
      *              *-------------------------------------------------*
      *              * Altrimenti memorizzazione in campo testata      *
      *              *-------------------------------------------------*
           move      w-dpz-cod-prg        to   w-tes-cod-dpz          .
       pre-exe-pgm-200.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Modalita' di blocco cliente in fase di bol- *
      *                  * lettazione                                  *
      *                  *---------------------------------------------*
           perform   prs-blo-cli-000      thru prs-blo-cli-999        .
      *                  *---------------------------------------------*
      *                  * Esposizione della riga in scroll            *
      *                  *---------------------------------------------*
           perform   prs-rig-scr-000      thru prs-rig-scr-999        .
      *              *-------------------------------------------------*
      *              * Referenza per default tipo movimento            *
      *              *-------------------------------------------------*
           perform   ref-tmo-orc-000      thru ref-tmo-orc-999        .
      *              *-------------------------------------------------*
      *              * Referenza per default tipo movimento spediz.    *
      *              *-------------------------------------------------*
           perform   ref-tmo-ods-000      thru ref-tmo-ods-999        .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione tipo movimento per gli *
      *              * ordini clienti                                  *
      *              *-------------------------------------------------*
           perform   cod-des-zoc-opn-000  thru cod-des-zoc-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione tipo movimento per     *
      *              * spedizioni clienti                              *
      *              *-------------------------------------------------*
           perform   cod-des-zsc-opn-000  thru cod-des-zsc-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice cliente commer- *
      *              * ciale                                           *
      *              *-------------------------------------------------*
           perform   cod-mne-dcc-opn-000  thru cod-mne-dcc-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice dipendenza del  *
      *              * cliente                                         *
      *              *-------------------------------------------------*
           perform   cod-cod-dcc-opn-000  thru cod-cod-dcc-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione coefficiente di cambio *
      *              * valuta                                          *
      *              *-------------------------------------------------*
           perform   coe-cmb-vlt-opn-000  thru coe-cmb-vlt-opn-999    .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura delle personalizzazioni relative al tipo di bloc- *
      *    * co cliente in fase di spedizioni a clienti                *
      *    *-----------------------------------------------------------*
       prs-blo-cli-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/ods/mov/ods300[tip-blo]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Se personalizzazione esistente si spostano i    *
      *              * valori letti in area di destinazione, altri-    *
      *              * menti si normalizza l'area di destinazione      *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-blo-cli-tip
           else      move  "S"            to   w-prs-blo-cli-t01
                     move  spaces         to   w-prs-blo-cli-t02
                     move  spaces         to   w-prs-blo-cli-t03
                     move  spaces         to   w-prs-blo-cli-t04
                     move  spaces         to   w-prs-blo-cli-t05      .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-blo-cli-t01    not  = "S" and
                     w-prs-blo-cli-t01    not  = "B"
                     move  "S"            to   w-prs-blo-cli-t01      .
       prs-blo-cli-999.
           exit.

      *    *===========================================================*
      *    * Lettura delle personalizzazioni relative al tipo di espo- *
      *    * sizione della riga di scroll                              *
      *    *-----------------------------------------------------------*
       prs-rig-scr-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/ods/mov/ods300[rig-scr]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Se personalizzazione esistente si spostano i    *
      *              * valori letti in area di destinazione, altri-    *
      *              * menti si normalizza l'area di destinazione      *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-rig-scr
           else      move  zero           to   w-prs-rig-scr-des      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo esposizione descrizione    *
      *              *-------------------------------------------------*
           if        w-prs-rig-scr-des    not  = 00 and
                     w-prs-rig-scr-des    not  = 01 and
                     w-prs-rig-scr-des    not  = 02 and
                     w-prs-rig-scr-des    not  = 03 and
                     w-prs-rig-scr-des    not  = 04 and
                     w-prs-rig-scr-des    not  = 05 and
                     w-prs-rig-scr-des    not  = 06
                     move  00             to   w-prs-rig-scr-des      .
       prs-rig-scr-999.
           exit.

      *    *===========================================================*
      *    * Lettura delle referenze relative al default per il tipo   *
      *    * movimento                                                 *
      *    *-----------------------------------------------------------*
       ref-tmo-orc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione work-area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-ref-tmo-orc-cod      .
           move      spaces               to   w-ref-tmo-orc-trt      .
       ref-tmo-orc-200.
      *              *-------------------------------------------------*
      *              * Lettura referenza                               *
      *              *-------------------------------------------------*
           move      "R:"                 to   s-ope                  .
           move      "pgm/orc/mov/orc300[def-tmo]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-ref-tmo-orc
           else      move  spaces         to   w-ref-tmo-orc          .
       ref-tmo-orc-400.
      *              *-------------------------------------------------*
      *              * Normalizzazione valori letti                    *
      *              *-------------------------------------------------*
           if        w-ref-tmo-orc-trt    not  = spaces and
                     w-ref-tmo-orc-trt    not  = "I"    and
                     w-ref-tmo-orc-trt    not  = "C"    and
                     w-ref-tmo-orc-trt    not  = "O"
                     move  spaces         to   w-ref-tmo-orc-trt      .
       ref-tmo-orc-420.
           if        w-ref-tmo-orc-trt    =    spaces
                     move  spaces         to   w-ref-tmo-orc-cod      .
       ref-tmo-orc-999.
           exit.

      *    *===========================================================*
      *    * Lettura delle referenze relative al default per il tipo   *
      *    * movimento di spedizione                                   *
      *    *-----------------------------------------------------------*
       ref-tmo-ods-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione work-area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-ref-tmo-ods-cod      .
           move      spaces               to   w-ref-tmo-ods-trt      .
       ref-tmo-ods-200.
      *              *-------------------------------------------------*
      *              * Lettura referenza                               *
      *              *-------------------------------------------------*
           move      "R:"                 to   s-ope                  .
           move      "pgm/ods/mov/ods300[def-tmo]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-ref-tmo-ods
           else      move  spaces         to   w-ref-tmo-ods          .
       ref-tmo-ods-400.
      *              *-------------------------------------------------*
      *              * Normalizzazione valori letti                    *
      *              *-------------------------------------------------*
           if        w-ref-tmo-ods-trt    not  = spaces and
                     w-ref-tmo-ods-trt    not  = "I"    and
                     w-ref-tmo-ods-trt    not  = "C"    and
                     w-ref-tmo-ods-trt    not  = "O"
                     move  spaces         to   w-ref-tmo-ods-trt      .
       ref-tmo-ods-420.
           if        w-ref-tmo-ods-trt    =    spaces
                     move  spaces         to   w-ref-tmo-ods-cod      .
       ref-tmo-ods-999.
           exit.

      *    *===========================================================*
      *    * Routine post-esecuzione programma                         *
      *    *-----------------------------------------------------------*
       pos-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione tipo movimento per    *
      *              * ordini clienti                                  *
      *              *-------------------------------------------------*
           perform   cod-des-zoc-cls-000  thru cod-des-zoc-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione tipo movimento per la *
      *              * bollettazione                                   *
      *              *-------------------------------------------------*
           perform   cod-des-zsc-cls-000  thru cod-des-zsc-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice cliente com-   *
      *              * merciale                                        *
      *              *-------------------------------------------------*
           perform   cod-mne-dcc-cls-000  thru cod-mne-dcc-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice dipendenza del *
      *              * cliente                                         *
      *              *-------------------------------------------------*
           perform   cod-cod-dcc-cls-000  thru cod-cod-dcc-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione coefficiente di cam-  *
      *              * bio valuta                                      *
      *              *-------------------------------------------------*
           perform   coe-cmb-vlt-cls-000  thru coe-cmb-vlt-cls-999    .
       pos-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Open files                                                *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [zoc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofzoc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zoc                 .
      *              *-------------------------------------------------*
      *              * [zsc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/ods/fls/ioc/obj/iofzsc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zsc                 .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [ocr]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *              *-------------------------------------------------*
      *              * [ocp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *              *-------------------------------------------------*
      *              * [ocx]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocx                 .
      *              *-------------------------------------------------*
      *              * [osr]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/ods/fls/ioc/obj/iofosr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-osr                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [pdx]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione quantita' da e-   *
      *              * vadere riga ordine                              *
      *              *-------------------------------------------------*
           move      "OP"                 to   d-qev-roc-tip-ope      .
           move      "pgm/orc/prg/obj/dqevroc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-qev-roc
                                               rf-ocr                 .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione quantita' da      *
      *              * spedire riga ordine di spedizione               *
      *              *-------------------------------------------------*
           move      "OP"                 to   d-qds-ros-tip-ope      .
           move      "pgm/ods/prg/obj/dqdsros0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-qds-ros
                                               rf-osr                 .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione saldo di magazz.  *
      *              *-------------------------------------------------*
           move      "OP"                 to   d-sld-mag-tip-ope      .
           move      "pgm/mag/prg/obj/pmag300y"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-sld-mag              .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione valore di magazz. *
      *              *-------------------------------------------------*
           move      "OP"                 to   d-vun-mag-tip-ope      .
           move      "pgm/mag/prg/obj/pmag300v"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-vun-mag              .
      *              *-------------------------------------------------*
      *              * Open modulo determinazione esposizione          *
      *              *-------------------------------------------------*
           move      "OP"                 to   d-esp-cec-tip-ope      .
           move      "pgm/gep/prg/obj/despcec0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-esp-cec              .
      *              *-------------------------------------------------*
      *              * File relative di supporto                       *
      *              *-------------------------------------------------*
           move      "OP"                 to   w-rlt-sup-ope          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files                                               *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [zoc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofzoc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zoc                 .
      *              *-------------------------------------------------*
      *              * [zsc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/ods/fls/ioc/obj/iofzsc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zsc                 .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [ocr]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *              *-------------------------------------------------*
      *              * [ocp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *              *-------------------------------------------------*
      *              * [ocx]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocx                 .
      *              *-------------------------------------------------*
      *              * [osr]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/ods/fls/ioc/obj/iofosr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-osr                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [pdx]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
       rou-cls-fls-100.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione quantita' da e-  *
      *              * vadere riga ordine                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura modulo                             *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-qev-roc-tip-ope      .
           move      "pgm/orc/prg/obj/dqevroc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-qev-roc
                                               rf-ocr                 .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-qev-roc-tip-ope      .
           move      "pgm/orc/prg/obj/dqevroc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-qev-roc
                                               rf-ocr                 .
           if        d-qev-roc-exi-sts    not  = spaces
                     go to rou-cls-fls-200.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "pgm/orc/prg/obj/dqevroc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       rou-cls-fls-200.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione quantita' da     *
      *              * spedire riga ordine di spedizione               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura modulo                             *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-qds-ros-tip-ope      .
           move      "pgm/ods/prg/obj/dqdsros0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-qds-ros
                                               rf-osr                 .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-qds-ros-tip-ope      .
           move      "pgm/ods/prg/obj/dqdsros0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-qds-ros
                                               rf-osr                 .
           if        d-qds-ros-exi-sts    not  = spaces
                     go to rou-cls-fls-300.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "pgm/ods/prg/obj/dqdsros0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       rou-cls-fls-300.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione saldo di magazz. *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura modulo                             *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-sld-mag-tip-ope      .
           move      "pgm/mag/prg/obj/pmag300y"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-sld-mag              .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-sld-mag-tip-ope      .
           move      "pgm/mag/prg/obj/pmag300y"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-sld-mag              .
           if        d-sld-mag-exi-sts    not  = spaces
                     go to rou-cls-fls-400.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "pgm/mag/prg/obj/pmag300y"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       rou-cls-fls-400.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione valore di magazz.*
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura modulo                             *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-vun-mag-tip-ope      .
           move      "pgm/mag/prg/obj/pmag300v"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-vun-mag              .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-vun-mag-tip-ope      .
           move      "pgm/mag/prg/obj/pmag300v"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-vun-mag              .
           if        d-vun-mag-exi-sts    not  = spaces
                     go to rou-cls-fls-500.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "pgm/mag/prg/obj/pmag300v"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       rou-cls-fls-500.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione esposizione      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura modulo                             *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-esp-cec-tip-ope      .
           move      "pgm/gep/prg/obj/despcec0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-esp-cec              .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-esp-cec-tip-ope      .
           move      "pgm/gep/prg/obj/despcec0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-esp-cec              .
           if        d-esp-cec-exi-sts    not  = spaces
                     go to rou-cls-fls-600.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "pgm/gep/prg/obj/despcec0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-esp-cec              .
       rou-cls-fls-600.
      *              *-------------------------------------------------*
      *              * File relative di supporto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   w-rlt-sup-ope          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
      *                  *---------------------------------------------*
      *                  * Cancel                                      *
      *                  *---------------------------------------------*
           perform   cnc-rlt-sup-000      thru cnc-rlt-sup-999        .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi chiave della registrazione             *
      *    *-----------------------------------------------------------*
       acc-key-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-fun      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo impostazione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-sts-imp-npt      .
           move      spaces               to   w-cnt-sts-imp-key
                                               w-cnt-sts-imp-tes
                                               w-cnt-sts-imp-pte
                                               w-cnt-sts-ing-pte
                                               w-cnt-sts-imp-cor
                                               w-cnt-sts-imp-rig
                                               w-cnt-sts-imp-pie
                                               w-cnt-sts-imp-itd      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key
                                               w-cnt-sts-pmt-tes
                                               w-cnt-sts-pmt-pte
                                               w-cnt-sts-pmt-cor
                                               w-cnt-sts-pmt-rig
                                               w-cnt-sts-pmt-pie      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-key
                                               w-cnt-sts-vis-tes
                                               w-cnt-sts-vis-pte
                                               w-cnt-sts-vis-cor
                                               w-cnt-sts-vis-rig
                                               w-cnt-sts-vis-pie      .
      *              *-------------------------------------------------*
      *              * Normalizzazione area di controllo variazioni    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-var-tes-cor      .
      *              *-------------------------------------------------*
      *              * Normalizzazione registrazione                   *
      *              *-------------------------------------------------*
           perform   nor-key-nok-000      thru nor-key-nok-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           perform   pmt-key-reg-000      thru pmt-key-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per prima pagina testata            *
      *                  *---------------------------------------------*
           perform   pmt-tes-reg-000      thru pmt-tes-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : chiave                      *
      *              *-------------------------------------------------*
           move      "K"                  to   w-cnt-mfu-tip-imp      .
       acc-key-reg-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Codice cliente                              *
      *                  *---------------------------------------------*
           perform   acc-cod-cli-000      thru acc-cod-cli-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
       acc-key-reg-200.
      *                  *---------------------------------------------*
      *                  * Dipendenza cliente                          *
      *                  *---------------------------------------------*
           perform   acc-dpz-cli-000      thru acc-dpz-cli-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-100.
       acc-key-reg-250.
      *                  *---------------------------------------------*
      *                  * Data emissione ordini minima                *
      *                  *---------------------------------------------*
           perform   acc-dem-min-000      thru acc-dem-min-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-200.
       acc-key-reg-300.
      *                  *---------------------------------------------*
      *                  * Data emissione ordini massima               *
      *                  *---------------------------------------------*
           perform   acc-dem-max-000      thru acc-dem-max-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-250.
       acc-key-reg-350.
      *                  *---------------------------------------------*
      *                  * Data emissione ordini di spedizione         *
      *                  *---------------------------------------------*
           perform   acc-dat-emi-000      thru acc-dat-emi-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-300.
       acc-key-reg-400.
      *                  *---------------------------------------------*
      *                  * Data consegna richiesta minima              *
      *                  *---------------------------------------------*
           perform   acc-dcr-min-000      thru acc-dcr-min-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-350.
       acc-key-reg-425.
      *                  *---------------------------------------------*
      *                  * Data consegna richiesta massima             *
      *                  *---------------------------------------------*
           perform   acc-dcr-max-000      thru acc-dcr-max-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-400.
       acc-key-reg-450.
      *                  *---------------------------------------------*
      *                  * Tipo movimento ordini clienti               *
      *                  *---------------------------------------------*
           perform   acc-tmo-orc-000      thru acc-tmo-orc-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-400.
       acc-key-reg-500.
      *                  *---------------------------------------------*
      *                  * Tipo movimento per spedizione               *
      *                  *---------------------------------------------*
           perform   acc-tmo-ods-000      thru acc-tmo-ods-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-450.
       acc-key-reg-700.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma impostazioni          *
      *                  *---------------------------------------------*
           perform   acc-cnf-imp-000      thru acc-cnf-imp-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-500.
       acc-key-reg-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-key      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visual. dati chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-key      .
      *              *-------------------------------------------------*
      *              * Test se chiave vuota                            *
      *              *-------------------------------------------------*
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-key-reg-999.
      *              *-------------------------------------------------*
      *              * Controllo globale su tasto Do su chiave         *
      *              *-------------------------------------------------*
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-key-reg-100.
           move      "S"                  to   w-cnt-tus-acc-key      .
       acc-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campi chiave della registrazione          *
      *    *-----------------------------------------------------------*
       vis-key-reg-000.
      *              *-------------------------------------------------*
      *              * Codice cliente                                  *
      *              *-------------------------------------------------*
           perform   vis-cod-cli-000      thru vis-cod-cli-999        .
           perform   vis-cod-cli-rag-000  thru vis-cod-cli-rag-999    .
           perform   vis-cod-cli-via-000  thru vis-cod-cli-via-999    .
           perform   vis-cod-cli-loc-000  thru vis-cod-cli-loc-999    .
      *              *-------------------------------------------------*
      *              * Dipendenza cliente                              *
      *              *-------------------------------------------------*
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
      *              *-------------------------------------------------*
      *              * Data emissione ordini minima                    *
      *              *-------------------------------------------------*
           perform   vis-dem-min-000      thru vis-dem-min-999        .
      *              *-------------------------------------------------*
      *              * Data emissione ordini massima                   *
      *              *-------------------------------------------------*
           perform   vis-dem-max-000      thru vis-dem-max-999        .
      *              *-------------------------------------------------*
      *              * Data emissione ordini di spedizione             *
      *              *-------------------------------------------------*
           perform   vis-dat-emi-000      thru vis-dat-emi-999        .
      *              *-------------------------------------------------*
      *              * Data consegna richiesta minima                  *
      *              *-------------------------------------------------*
           perform   vis-dcr-min-000      thru vis-dcr-min-999        .
      *              *-------------------------------------------------*
      *              * Data consegna richiesta massima                 *
      *              *-------------------------------------------------*
           perform   vis-dcr-max-000      thru vis-dcr-max-999        .
      *              *-------------------------------------------------*
      *              * Tipo movimento                                  *
      *              *-------------------------------------------------*
           perform   vis-tmo-orc-000      thru vis-tmo-orc-999        .
           perform   vis-tmo-orc-des-000  thru vis-tmo-orc-des-999    .
      *              *-------------------------------------------------*
      *              * Tipo movimento per spedizioni                   *
      *              *-------------------------------------------------*
           perform   vis-tmo-ods-000      thru vis-tmo-ods-999        .
           perform   vis-tmo-ods-des-000  thru vis-tmo-ods-des-999    .
       vis-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per campi chiave                  *
      *    *-----------------------------------------------------------*
       pmt-key-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate dalla chiave              *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-key-reg-100.
      *              *-------------------------------------------------*
      *              * Visualizzazioni prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice cliente                              *
      *                  *---------------------------------------------*
           perform   pmt-cod-cli-000      thru pmt-cod-cli-999        .
      *                  *---------------------------------------------*
      *                  * Dipendenza cliente                          *
      *                  *---------------------------------------------*
           perform   pmt-dpz-cli-000      thru pmt-dpz-cli-999        .
      *                  *---------------------------------------------*
      *                  * Data emissione ordini minima                *
      *                  *---------------------------------------------*
           perform   pmt-dem-min-000      thru pmt-dem-min-999        .
      *                  *---------------------------------------------*
      *                  * Data emissione ordini massima               *
      *                  *---------------------------------------------*
           perform   pmt-dem-max-000      thru pmt-dem-max-999        .
      *                  *---------------------------------------------*
      *                  * Data emissione ordini di spedizione         *
      *                  *---------------------------------------------*
           perform   pmt-dat-emi-000      thru pmt-dat-emi-999        .
      *                  *---------------------------------------------*
      *                  * Data consegna richiesta minima              *
      *                  *---------------------------------------------*
           perform   pmt-dcr-min-000      thru pmt-dcr-min-999        .
      *                  *---------------------------------------------*
      *                  * Data consegna richiesta minima e massima    *
      *                  *---------------------------------------------*
           perform   pmt-dcr-max-000      thru pmt-dcr-max-999        .
      *                  *---------------------------------------------*
      *                  * Tipo movimento                              *
      *                  *---------------------------------------------*
           perform   pmt-tmo-orc-000      thru pmt-tmo-orc-999        .
      *                  *---------------------------------------------*
      *                  * Tipo movimento                              *
      *                  *---------------------------------------------*
           perform   pmt-tmo-ods-000      thru pmt-tmo-ods-999        .
       pmt-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per : Codice cliente              *
      *    *-----------------------------------------------------------*
       pmt-cod-cli-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice cliente             :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-cod-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per : Dipendenza cliente          *
      *    *-----------------------------------------------------------*
       pmt-dpz-cli-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Dipendenza del cliente     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-dpz-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per : Data emissione ordini mini- *
      *    * ma                                                        *
      *    *-----------------------------------------------------------*
       pmt-dem-min-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Ordini emessi          dal :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-dem-min-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per : Data emissione ordini mas-  *
      *    * sima                                                      *
      *    *-----------------------------------------------------------*
       pmt-dem-max-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "al :"               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-dem-max-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per : Data emissione ordini       *
      *    *-----------------------------------------------------------*
       pmt-dat-emi-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Emissione ordini di spediz.:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-dat-emi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per : Data consegna richiesta     *
      *    * minima                                                    *
      *    *-----------------------------------------------------------*
       pmt-dcr-min-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Con consegna richiesta dal :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-dcr-min-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per : Data consegna richiesta     *
      *    * massima                                                   *
      *    *-----------------------------------------------------------*
       pmt-dcr-max-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "al :"               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-dcr-max-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per tipo movimento                *
      *    *-----------------------------------------------------------*
       pmt-tmo-orc-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo ordine cliente        :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-tmo-orc-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per tipo movimento spedizione     *
      *    *-----------------------------------------------------------*
       pmt-tmo-ods-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo ordine spedizione     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-tmo-ods-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice cliente                       *
      *    *-----------------------------------------------------------*
       acc-cod-cli-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-cli-100.
      *              *-------------------------------------------------*
      *              * Salvataggio valore precedente                   *
      *              *-------------------------------------------------*
           move      w-tes-cod-cli        to   w-sav-cod-cli          .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-dcc-ope      .
           move      w-tes-cod-cli        to   w-cod-mne-dcc-cod      .
           move      05                   to   w-cod-mne-dcc-lin      .
           move      30                   to   w-cod-mne-dcc-pos      .
           move      05                   to   w-cod-mne-dcc-rln      .
           move      41                   to   w-cod-mne-dcc-rps      .
           move      06                   to   w-cod-mne-dcc-vln      .
           move      41                   to   w-cod-mne-dcc-vps      .
           move      07                   to   w-cod-mne-dcc-lln      .
           move      41                   to   w-cod-mne-dcc-lps      .
           move      "<B"                 to   v-edm                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXPD"               to   v-pfk (13)             .
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
       acc-cod-cli-110.
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           if        w-cod-mne-dcc-ope    =    "F+"
                     go to acc-cod-cli-115.
           if        w-cod-mne-dcc-ope    =    "AC"
                     go to acc-cod-cli-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-cli-115.
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
           go to     acc-cod-cli-110.
       acc-cod-cli-120.
           move      w-cod-mne-dcc-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-cli-999.
       acc-cod-cli-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-cod-cli          .
       acc-cod-cli-300.
      *              *-------------------------------------------------*
      *              * Se Expd                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        v-key                not  = "EXPD"
                     go to acc-cod-cli-400.
           if        w-tes-cod-cli        =    zero
                     go to acc-cod-cli-400.
      *                  *---------------------------------------------*
      *                  * Box di espansione                           *
      *                  *---------------------------------------------*
           perform   rou-exp-cec-000      thru rou-exp-cec-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-cod-cli-100.
       acc-cod-cli-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-cli-410.
      *                  *---------------------------------------------*
      *                  * Lettura file [cli]                          *
      *                  *---------------------------------------------*
           move      w-tes-cod-cli        to   w-let-arc-cli-cod      .
           perform   let-arc-cli-000      thru let-arc-cli-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione ragione sociale, indirizzo,  *
      *                  * localita', e sottoconto associato da ana-   *
      *                  * grafica contabile                           *
      *                  *---------------------------------------------*
           move      w-let-arc-cli-rag    to   w-tes-cod-cli-rag      .
           move      w-let-arc-cli-via    to   w-tes-cod-cli-via      .
           move      w-let-arc-cli-loc    to   w-tes-cod-cli-loc      .
       acc-cod-cli-420.
      *                  *---------------------------------------------*
      *                  * Visualizzazione ragione sociale da anagra-  *
      *                  * fica contabile                              *
      *                  *---------------------------------------------*
           perform   vis-cod-cli-rag-000  thru vis-cod-cli-rag-999    .
           perform   vis-cod-cli-via-000  thru vis-cod-cli-via-999    .
           perform   vis-cod-cli-loc-000  thru vis-cod-cli-loc-999    .
       acc-cod-cli-430.
      *                  *---------------------------------------------*
      *                  * Se cliente non esistente                    *
      *                  *---------------------------------------------*
           if        w-let-arc-cli-flg    =    spaces
                     go to acc-cod-cli-440.
       acc-cod-cli-432.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione di-   *
      *                      * pendenza del cliente                    *
      *                      *-----------------------------------------*
           if        w-tes-dpz-cli        =    spaces and
                     w-tes-dpz-cli-rag    =    spaces and
                     w-tes-dpz-cli-via    =    spaces and
                     w-tes-dpz-cli-loc    =    spaces
                     go to acc-cod-cli-434.
           move      spaces               to   w-tes-dpz-cli          .
           move      spaces               to   w-tes-dpz-cli-rag      .
           move      spaces               to   w-tes-dpz-cli-via      .
           move      spaces               to   w-tes-dpz-cli-loc      .
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
       acc-cod-cli-434.
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-cod-cli-100.
       acc-cod-cli-440.
      *                  *---------------------------------------------*
      *                  * Se codice a zero                            *
      *                  *---------------------------------------------*
           if        w-tes-cod-cli        not  = zero
                     go to acc-cod-cli-450.
       acc-cod-cli-442.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione di-   *
      *                      * pendenza del cliente                    *
      *                      *-----------------------------------------*
           if        w-tes-dpz-cli        =    spaces and
                     w-tes-dpz-cli-rag    =    spaces and
                     w-tes-dpz-cli-via    =    spaces and
                     w-tes-dpz-cli-loc    =    spaces
                     go to acc-cod-cli-444.
           move      spaces               to   w-tes-dpz-cli          .
           move      spaces               to   w-tes-dpz-cli-rag      .
           move      spaces               to   w-tes-dpz-cli-via      .
           move      spaces               to   w-tes-dpz-cli-loc      .
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
       acc-cod-cli-444.
      *                      *-----------------------------------------*
      *                      * Reimpostazione, a meno che non si sia   *
      *                      * in tasto Up                             *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-cod-cli-600
           else      go to acc-cod-cli-100.
       acc-cod-cli-450.
      *                  *---------------------------------------------*
      *                  * Se codice diverso da zero                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda del confronto con  *
      *                      * il valore precedente                    *
      *                      *-----------------------------------------*
           if        w-tes-cod-cli        =    w-sav-cod-cli
                     go to acc-cod-cli-455
           else      go to acc-cod-cli-480.
       acc-cod-cli-455.
      *                      *-----------------------------------------*
      *                      * Se valore impostato pari al valore pre- *
      *                      * cedente                                 *
      *                      *-----------------------------------------*
       acc-cod-cli-457.
      *                          *-------------------------------------*
      *                          * Lettura anagrafica commerciale del  *
      *                          * cliente principale                  *
      *                          *-------------------------------------*
           move      "C"                  to   w-let-arc-dcc-tle      .
           move      w-tes-cod-cli        to   w-let-arc-dcc-cod      .
           move      spaces               to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                          *-------------------------------------*
      *                          * Deviazione a seconda dell'esito     *
      *                          * della lettura                       *
      *                          *-------------------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     go to acc-cod-cli-467.
       acc-cod-cli-459.
      *                          *-------------------------------------*
      *                          * Se anagrafica commerciale del cli-  *
      *                          * ente principale non esistente       *
      *                          *-------------------------------------*
       acc-cod-cli-461.
      *                              *---------------------------------*
      *                              * Normalizzazione e visualizza-   *
      *                              * zione dei dati relativi alla    *
      *                              * dipendenza                      *
      *                              *---------------------------------*
           if        w-tes-dpz-cli        =    spaces and
                     w-tes-dpz-cli-rag    =    spaces and
                     w-tes-dpz-cli-via    =    spaces and
                     w-tes-dpz-cli-loc    =    spaces
                     go to acc-cod-cli-463.
           move      spaces               to   w-tes-dpz-cli          .
           move      spaces               to   w-tes-dpz-cli-rag      .
           move      spaces               to   w-tes-dpz-cli-via      .
           move      spaces               to   w-tes-dpz-cli-loc      .
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
       acc-cod-cli-463.
      *                              *---------------------------------*
      *                              * Messaggio di errore             *
      *                              *---------------------------------*
           move      "Manca l'anagrafica commerciale per il cliente     
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
       acc-cod-cli-465.
      *                              *---------------------------------*
      *                              * A reimpostazione                *
      *                              *---------------------------------*
           go to     acc-cod-cli-100.
       acc-cod-cli-467.
      *                          *-------------------------------------*
      *                          * Se anagrafica commerciale del cli-  *
      *                          * ente principale esistente           *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Memorizzazione valori letti da  *
      *                              * anagrafica commerciale cliente  *
      *                              * principale in dati per la di-   *
      *                              * pendenza                        *
      *                              *---------------------------------*
           move      w-let-arc-dcc-rag    to   w-tes-dpz-cli-rag      .
           move      w-let-arc-dcc-via    to   w-tes-dpz-cli-via      .
           move      w-let-arc-dcc-loc    to   w-tes-dpz-cli-loc      .
      *                              *---------------------------------*
      *                              * Deviazione a seconda se il co-  *
      *                              * dice dipendenza e' a spaces op- *
      *                              * pure diverso da spaces          *
      *                              *---------------------------------*
           if        w-tes-dpz-cli        =    spaces
                     go to acc-cod-cli-469
           else      go to acc-cod-cli-471.
       acc-cod-cli-469.
      *                              *---------------------------------*
      *                              * Se codice dipendenza a spaces   *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Visualizzazione valori re-  *
      *                                  * lativi alla dipendenza      *
      *                                  *-----------------------------*
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
      *                                  *-----------------------------*
      *                                  * A dipendenze dall'imposta-  *
      *                                  * zione                       *
      *                                  *-----------------------------*
           go to     acc-cod-cli-600.
       acc-cod-cli-471.
      *                              *---------------------------------*
      *                              * Se codice dipendenza diverso da *
      *                              * spaces                          *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Lettura anagrafica commer-  *
      *                                  * ciale della dipendenza      *
      *                                  *-----------------------------*
           move      "D"                  to   w-let-arc-dcc-tle      .
           move      w-tes-cod-cli        to   w-let-arc-dcc-cod      .
           move      w-tes-dpz-cli        to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                                  *-----------------------------*
      *                                  * Deviazione a seconda del-   *
      *                                  * l'esito della lettura       *
      *                                  *-----------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     go to acc-cod-cli-473
           else      go to acc-cod-cli-475.
       acc-cod-cli-473.
      *                                  *-----------------------------*
      *                                  * Se anagrafica commerciale   *
      *                                  * della dipendenza esistente  *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Memorizzazione valori   *
      *                                      * letti da anagrafica     *
      *                                      * commerciale della di-   *
      *                                      * pendenza                *
      *                                      *-------------------------*
           move      w-let-arc-dcc-rag    to   w-tes-dpz-cli-rag      .
           move      w-let-arc-dcc-via    to   w-tes-dpz-cli-via      .
           move      w-let-arc-dcc-loc    to   w-tes-dpz-cli-loc      .
      *                                      *-------------------------*
      *                                      * Visualizzazione valori  *
      *                                      * relativi alla dipenden- *
      *                                      * za                      *
      *                                      *-------------------------*
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
      *                                      *-------------------------*
      *                                      * A dipendenze dall'impo- *
      *                                      * stazione                *
      *                                      *-------------------------*
           go to     acc-cod-cli-600.
       acc-cod-cli-475.
      *                                  *-----------------------------*
      *                                  * Se anagrafica commerciale   *
      *                                  * della dipendenza non esi-   *
      *                                  * stente                      *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Memorizzazione valori   *
      *                                      * letti da anagrafica     *
      *                                      * commerciale della di-   *
      *                                      * pendenza                *
      *                                      *-------------------------*
           move      w-let-arc-dcc-rag    to   w-tes-dpz-cli-rag      .
           move      w-let-arc-dcc-via    to   w-tes-dpz-cli-via      .
           move      w-let-arc-dcc-loc    to   w-tes-dpz-cli-loc      .
      *                                      *-------------------------*
      *                                      * Visualizzazione valori  *
      *                                      * relativi alla dipenden- *
      *                                      * za                      *
      *                                      *-------------------------*
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
      *                                      *-------------------------*
      *                                      * Messaggio di errore     *
      *                                      *-------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "Manca l'anagrafica commerciale per la dipendenza "
                                delimited by   size
                     "'"        delimited by   size
                     w-tes-dpz-cli       
                                delimited by spaces
                     "'"        delimited by   size
                                          into w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                                      *-------------------------*
      *                                      * A reimpostazione        *
      *                                      *-------------------------*
           go to     acc-cod-cli-100.
       acc-cod-cli-480.
      *                      *-----------------------------------------*
      *                      * Se valore impostato diverso dal valore  *
      *                      * precedente                              *
      *                      *-----------------------------------------*
       acc-cod-cli-482.
      *                              *---------------------------------*
      *                              * Preparazione default per codice *
      *                              * dipendenza                      *
      *                              *---------------------------------*
           move      "*   "               to   w-tes-dpz-cli          .
      *                                  *-----------------------------*
      *                                  * Lettura anagrafica commer-  *
      *                                  * ciale della dipendenza      *
      *                                  *-----------------------------*
           move      "D"                  to   w-let-arc-dcc-tle      .
           move      w-tes-cod-cli        to   w-let-arc-dcc-cod      .
           move      w-tes-dpz-cli        to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                                  *-----------------------------*
      *                                  * Memorizzazione valori letti *
      *                                  * da anagrafica commerciale   *
      *                                  * della dipendenza            *
      *                                  *-----------------------------*
           move      w-let-arc-dcc-rag    to   w-tes-dpz-cli-rag      .
           move      w-let-arc-dcc-via    to   w-tes-dpz-cli-via      .
           move      w-let-arc-dcc-loc    to   w-tes-dpz-cli-loc      .
      *                                  *-----------------------------*
      *                                  * Visualizzazione dei dati    *
      *                                  * relativi alla dipendenza    *
      *                                  *-----------------------------*
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
      *                              *---------------------------------*
      *                              * A dipendenze dall'impostazione  *
      *                              *---------------------------------*
           go to     acc-cod-cli-600.
       acc-cod-cli-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore attuale come precedente : oltre   *
      *                  *---------------------------------------------*
           if        w-tes-cod-cli        =    w-sav-cod-cli
                     go to acc-cod-cli-800.
      *                  *---------------------------------------------*
      *                  * Rilettura record [dcc]                      *
      *                  *---------------------------------------------*
           move      "C"                  to   w-let-arc-dcc-tle      .
           move      w-tes-cod-cli        to   w-let-arc-dcc-cod      .
           move      spaces               to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                  *---------------------------------------------*
      *                  * Subroutine per note su cliente              *
      *                  *                                             *
      *                  * SIRI                                        *
      *                  *---------------------------------------------*
           move      "pods3000"           to   i-ide-pro              .
           perform   cod-mne-dcc-not-000  thru cod-mne-dcc-not-999    .
           move      "pods4500"           to   i-ide-pro              .
      *                  *---------------------------------------------*
      *                  * Test su flag di consegne bloccate           *
      *                  *---------------------------------------------*
           if        w-let-arc-dcc-blo    not  = 02
                     go to acc-cod-cli-700.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "ATTENZIONE : Cliente con consegne bloccate !      
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * A seconda della personalizzazione rela- *
      *                      * tiva alla modalita' di blocco del cli-  *
      *                      * ente si prosegue, oppure si ritorna ad  *
      *                      * impostazione                            *
      *                      *-----------------------------------------*
           if        w-prs-blo-cli-t01    =    "B"
                     go to acc-cod-cli-100
           else      go to acc-cod-cli-700.
       acc-cod-cli-700.
      *                  *---------------------------------------------*
      *                  * Determinazione esposizione cliente          *
      *                  *---------------------------------------------*
           perform   rou-det-cec-000      thru rou-det-cec-999        .
           if        w-det-esp-cli-olf    =    spaces
                     go to acc-cod-cli-800.
           perform   rou-exp-cec-000      thru rou-exp-cec-999        .
       acc-cod-cli-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cod-cli-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cod-cli-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cod-cli-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cod-cli-999.
       acc-cod-cli-999.
           exit.

      *    *===========================================================*
      *    * Determinazione esposizione cliente                        *
      *    *-----------------------------------------------------------*
       rou-det-cec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-esp-cli-esp      .
           move      zero                 to   w-det-esp-cli-wfd      .
           move      zero                 to   w-det-esp-cli-wac      .
           move      spaces               to   w-det-esp-cli-olf      .
       rou-det-cec-100.
      *              *-------------------------------------------------*
      *              * Preparazione parametri                          *
      *              *-------------------------------------------------*
           move      "EC"                 to   d-esp-cec-tip-ope      .
           move      w-tes-cod-cli        to   d-esp-cec-cod-cli      .
      *              *-------------------------------------------------*
      *              * Chiamata modulo                                 *
      *              *-------------------------------------------------*
           move      "pgm/gep/prg/obj/despcec0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-esp-cec              .
       rou-det-cec-200.
      *              *-------------------------------------------------*
      *              * Determinazione se cliente oltre Fido            *
      *              *-------------------------------------------------*
           move      d-esp-cec-esp-orc    to   w-det-esp-cli-esp      .
           add       d-esp-cec-esp-ods    to   w-det-esp-cli-esp      .
           add       d-esp-cec-esp-bol    to   w-det-esp-cli-esp      .
           add       d-esp-cec-esp-gep    to   w-det-esp-cli-esp      .
      *
           move      d-esp-cec-max-fid    to   w-det-esp-cli-wfd      .
           move      d-esp-cec-imp-acr    to   w-det-esp-cli-wac      .
      *
           if        w-det-esp-cli-wfd    =    zero
                     go to rou-det-cec-250.
      *
           if        c-dec                =    2
                     multiply  100        by   w-det-esp-cli-wfd
           else if   c-dec                =    1
                     multiply  10         by   w-det-esp-cli-wfd      .
       rou-det-cec-250.
           if        w-det-esp-cli-wac    =    zero
                     go to rou-det-cec-300.
      *
           if        c-dec                =    2
                     multiply  100        by   w-det-esp-cli-wac
           else if   c-dec                =    1
                     multiply  10         by   w-det-esp-cli-wac      .
       rou-det-cec-300.
      *              *-------------------------------------------------*
      *              * Test su Fido                                    *
      *              *-------------------------------------------------*
           if        w-det-esp-cli-esp    =    zero or
                     w-det-esp-cli-wfd    =    zero
                     go to rou-det-cec-400.
      *
           if        w-det-esp-cli-esp    >    w-det-esp-cli-wfd
                     move  "#"            to   w-det-esp-cli-olf      .
       rou-det-cec-400.
      *              *-------------------------------------------------*
      *              * Test su Assicurazione                           *
      *              *-------------------------------------------------*
           if        w-det-esp-cli-esp    =    zero or
                     w-det-esp-cli-wac    =    zero
                     go to rou-det-cec-900.
      *
           if        w-det-esp-cli-esp    >    w-det-esp-cli-wac
                     move  "#"            to   w-det-esp-cli-olf      .
       rou-det-cec-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     rou-det-cec-999.
       rou-det-cec-999.
           exit.

      *    *===========================================================*
      *    * Espansione per informazioni su esposizione cliente        *
      *    *-----------------------------------------------------------*
       rou-exp-cec-000.
      *              *-------------------------------------------------*
      *              * Preparazione parametri                          *
      *              *-------------------------------------------------*
           move      "VE"                 to   d-esp-cec-tip-ope      .
           move      w-tes-cod-cli        to   d-esp-cec-cod-cli      .
           move      zero                 to   d-esp-cec-esp-coi      .   
           move      zero                 to   d-esp-cec-esp-csi      .   
           move      zero                 to   d-esp-cec-esp-cbf      .   
           move      zero                 to   d-esp-cec-esp-csp      .   
           move      zero                 to   d-esp-cec-esp-cv1      .   
           move      zero                 to   d-esp-cec-esp-cv2      .   
      *              *-------------------------------------------------*
      *              * Chiamata modulo                                 *
      *              *-------------------------------------------------*
           move      "pgm/gep/prg/obj/despcec0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-esp-cec              .
       rou-exp-cec-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     rou-exp-cec-999.
       rou-exp-cec-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice cliente                          *
      *    *-----------------------------------------------------------*
       vis-cod-cli-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      05                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-cod-cli        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice cliente , ragione sociale        *
      *    *-----------------------------------------------------------*
       vis-cod-cli-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-cod-cli-rag    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cli-rag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice cliente, indirizzo               *
      *    *-----------------------------------------------------------*
       vis-cod-cli-via-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-cod-cli-via    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cli-via-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice cliente, localita'               *
      *    *-----------------------------------------------------------*
       vis-cod-cli-loc-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-cod-cli-loc    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-cli-loc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice dipendenza cliente            *
      *    *-----------------------------------------------------------*
       acc-dpz-cli-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dpz-cli-025.
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-tes-cod-cli        =    zero
                     go to acc-dpz-cli-999.
       acc-dpz-cli-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "A*"                 to   w-cod-cod-dcc-ope      .
           move      w-tes-cod-cli        to   w-cod-cod-dcc-cli      .
           move      w-tes-dpz-cli        to   w-cod-cod-dcc-cod      .
           move      09                   to   w-cod-cod-dcc-lin      .
           move      30                   to   w-cod-cod-dcc-pos      .
           move      09                   to   w-cod-cod-dcc-rln      .
           move      41                   to   w-cod-cod-dcc-rps      .
           move      10                   to   w-cod-cod-dcc-vln      .
           move      41                   to   w-cod-cod-dcc-vps      .
           move      11                   to   w-cod-cod-dcc-lln      .
           move      41                   to   w-cod-cod-dcc-lps      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-dcc-cll-000  thru cod-cod-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dcc-foi-000  thru cod-cod-dcc-foi-999    .
       acc-dpz-cli-110.
           perform   cod-cod-dcc-cll-000  thru cod-cod-dcc-cll-999    .
           if        w-cod-cod-dcc-ope    =    "F+"
                     go to acc-dpz-cli-115.
           if        w-cod-cod-dcc-ope    =    "AC"
                     go to acc-dpz-cli-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-dpz-cli-115.
           perform   cod-cod-dcc-foi-000  thru cod-cod-dcc-foi-999    .
           go to     acc-dpz-cli-110.
       acc-dpz-cli-120.
           move      w-cod-cod-dcc-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dpz-cli-999.
       acc-dpz-cli-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-dpz-cli          .
       acc-dpz-cli-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dpz-cli-410.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se codice sipendenza   *
      *                  * a spaces oppure no                          *
      *                  *---------------------------------------------*
           if        w-tes-dpz-cli        =    spaces
                     go to acc-dpz-cli-420
           else      go to acc-dpz-cli-440.
       acc-dpz-cli-420.
      *                  *---------------------------------------------*
      *                  * Se codice dipendenza a spaces               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica commerciale del cli- *
      *                      * ente principale                         *
      *                      *-----------------------------------------*
           move      "C"                  to   w-let-arc-dcc-tle      .
           move      w-tes-cod-cli        to   w-let-arc-dcc-cod      .
           move      spaces               to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori letti da anagra-  *
      *                      * fica commerciale cliente principale in  *
      *                      * dati per la dipendenza                  *
      *                      *-----------------------------------------*
           move      w-let-arc-dcc-rag    to   w-tes-dpz-cli-rag      .
           move      w-let-arc-dcc-via    to   w-tes-dpz-cli-via      .
           move      w-let-arc-dcc-loc    to   w-tes-dpz-cli-loc      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione valori relativi alla    *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda dell'esito della   *
      *                      * lettura                                 *
      *                      *-----------------------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     go to acc-dpz-cli-425
           else      go to acc-dpz-cli-430.
       acc-dpz-cli-425.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale del cliente   *
      *                      * principale esistente                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * A dipendenze dall'impostazione      *
      *                          *-------------------------------------*
           go to     acc-dpz-cli-600.
       acc-dpz-cli-430.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale del cliente   *
      *                      * principale non esistente                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      "Manca l'anagrafica commerciale per il cliente     
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                          *-------------------------------------*
      *                          * A reimpostazione                    *
      *                          *-------------------------------------*
           go to     acc-dpz-cli-100.
       acc-dpz-cli-440.
      *                  *---------------------------------------------*
      *                  * Se codice dipendenza diverso da spaces      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica commerciale per la   *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           move      "D"                  to   w-let-arc-dcc-tle      .
           move      w-tes-cod-cli        to   w-let-arc-dcc-cod      .
           move      w-tes-dpz-cli        to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori letti da anagra-  *
      *                      * fica commerciale della dipendenza in    *
      *                      * dati per la dipendenza                  *
      *                      *-----------------------------------------*
           move      w-let-arc-dcc-rag    to   w-tes-dpz-cli-rag      .
           move      w-let-arc-dcc-via    to   w-tes-dpz-cli-via      .
           move      w-let-arc-dcc-loc    to   w-tes-dpz-cli-loc      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione valori relativi alla    *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           perform   vis-dpz-cli-000      thru vis-dpz-cli-999        .
           perform   vis-dpz-cli-rag-000  thru vis-dpz-cli-rag-999    .
           perform   vis-dpz-cli-via-000  thru vis-dpz-cli-via-999    .
           perform   vis-dpz-cli-loc-000  thru vis-dpz-cli-loc-999    .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda dell'esito della   *
      *                      * lettura                                 *
      *                      *-----------------------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     go to acc-dpz-cli-445
           else      go to acc-dpz-cli-450.
       acc-dpz-cli-445.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale della dipen-  *
      *                      * denza esistente                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * A dipendenze dall'impostazione      *
      *                          *-------------------------------------*
           go to     acc-dpz-cli-600.
       acc-dpz-cli-450.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale della dipen-  *
      *                      * denza non esistente                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "Manca l'anagrafica commerciale per la dipendenza "
                                delimited by   size
                     "'"        delimited by   size
                     w-tes-dpz-cli       
                                delimited by spaces
                     "'"        delimited by   size
                                          into w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                          *-------------------------------------*
      *                          * A reimpostazione                    *
      *                          *-------------------------------------*
           go to     acc-dpz-cli-100.
       acc-dpz-cli-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dpz-cli-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-dpz-cli-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dpz-cli-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-dpz-cli-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-dpz-cli-999.
       acc-dpz-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice dipendenza del cliente           *
      *    *-----------------------------------------------------------*
       vis-dpz-cli-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-dpz-cli        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-cli-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice dipendenza cliente, ragione so-  *
      *    *                   ciale                                   *
      *    *-----------------------------------------------------------*
       vis-dpz-cli-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-dpz-cli-rag    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-cli-rag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice dipendenza cliente, indirizzo    *
      *    *-----------------------------------------------------------*
       vis-dpz-cli-via-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-dpz-cli-via    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-cli-via-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice dipendenza cliente, localita'    *
      *    *-----------------------------------------------------------*
       vis-dpz-cli-loc-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-dpz-cli-loc    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-cli-loc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Data ordini cliente minima           *
      *    *-----------------------------------------------------------*
       acc-dem-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dem-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-dem-min        to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dem-min-999.
       acc-dem-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   w-tes-dem-min          .
       acc-dem-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dem-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dem-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-dem-min-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dem-min-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-dem-min-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-dem-min-999.
       acc-dem-min-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Data ordini cliente minima        *
      *    *-----------------------------------------------------------*
       vis-dem-min-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-dem-min        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dem-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Data ordini cliente massima          *
      *    *-----------------------------------------------------------*
       acc-dem-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dem-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      46                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-dem-max        to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dem-max-999.
       acc-dem-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   w-tes-dem-max          .
       acc-dem-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dem-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dem-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-dem-max-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dem-max-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-dem-max-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-dem-max-999.
       acc-dem-max-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Data ordini cliente massima       *
      *    *-----------------------------------------------------------*
       vis-dem-max-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      46                   to   v-pos                  .
           move      w-tes-dem-max        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dem-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Data emissione ordini di spedizione  *
      *    *-----------------------------------------------------------*
       acc-dat-emi-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione valore di default              *
      *                  *---------------------------------------------*
           if        w-tes-dat-emi        not  = zero
                     go to acc-dat-emi-100.
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-tes-dat-emi          .
       acc-dat-emi-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      15                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-dat-emi        to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dat-emi-999.
       acc-dat-emi-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   w-tes-dat-emi          .
       acc-dat-emi-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se a zero : reimpostazione                  *
      *                  *---------------------------------------------*
           if        w-tes-dat-emi        not  = zero
                     go to acc-dat-emi-600.
           if        v-key                =    "UP  "
                     go to acc-dat-emi-600
           else      go to acc-dat-emi-100.
       acc-dat-emi-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dat-emi-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-dat-emi-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dat-emi-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-dat-emi-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-dat-emi-999.
       acc-dat-emi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Data emissione ordini di spedi-   *
      *    * zione                                                     *
      *    *-----------------------------------------------------------*
       vis-dat-emi-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      15                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-dat-emi        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dat-emi-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Data consegna richiesta minima       *
      *    *-----------------------------------------------------------*
       acc-dcr-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dcr-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      16                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      ">"                  to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-dcr-min        to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dcr-min-999.
       acc-dcr-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   w-tes-dcr-min          .
       acc-dcr-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dcr-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dcr-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-dcr-min-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dcr-min-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-dcr-min-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-dcr-min-999.
       acc-dcr-min-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Data consegna richiesta minima    *
      *    *-----------------------------------------------------------*
       vis-dcr-min-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      16                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-dcr-min        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dcr-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Data consegna richiesta massima      *
      *    *-----------------------------------------------------------*
       acc-dcr-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione valore di default              *
      *                  *---------------------------------------------*
           if        w-tes-dcr-max        not  = zero
                     go to acc-dcr-max-100.
      *                      *-----------------------------------------*
      *                      * Preparazione data di fine mese          *
      *                      *-----------------------------------------*
           move      w-tes-dat-emi        to   s-dat                  .
           move      31                   to   s-gio                  .
       acc-dcr-max-020.
           move      "CD"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-sts                not  = spaces
                     subtract 1           from s-gio
                     go to acc-dcr-max-020.
           move      s-dat                to   w-tes-dcr-max          .
       acc-dcr-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      16                   to   v-lin                  .
           move      46                   to   v-pos                  .
           move      ">"                  to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-dcr-max        to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dcr-max-999.
       acc-dcr-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   w-tes-dcr-max          .
       acc-dcr-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dcr-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dcr-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-dcr-max-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dcr-max-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-dcr-max-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-dcr-max-999.
       acc-dcr-max-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Data consegna richiesta massima   *
      *    *-----------------------------------------------------------*
       vis-dcr-max-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      16                   to   v-lin                  .
           move      46                   to   v-pos                  .
           move      w-tes-dcr-max        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dcr-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo chiave : Tipo movimento per ordini     *
      *    * clienti                                                   *
      *    *-----------------------------------------------------------*
       acc-tmo-orc-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio                                 *
      *                  *---------------------------------------------*
           move      w-tes-tmo-orc        to   w-sav-tmo-orc          .
      *                  *---------------------------------------------*
      *                  * Test se da proporre                         *
      *                  *---------------------------------------------*
           if        w-tes-tmo-orc        not  = spaces
                     go to acc-tmo-orc-100.
      *                  *---------------------------------------------*
      *                  * Preparazione valore di defult               *
      *                  *---------------------------------------------*
           perform   acc-tmo-orc-def-000  thru acc-tmo-orc-def-999    .
           if        w-def-tmo-orc-flg    not  = spaces
                     move  w-tes-tmo-orc  to   w-sav-tmo-orc
                     go to acc-tmo-orc-400.
       acc-tmo-orc-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-des-zoc-ope      .
           move      w-tes-tmo-orc        to   w-cod-des-zoc-cod      .
           move      18                   to   w-cod-des-zoc-lin      .
           move      30                   to   w-cod-des-zoc-pos      .
           move      18                   to   w-cod-des-zoc-dln      .
           move      41                   to   w-cod-des-zoc-dps      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-des-zoc-cll-000  thru cod-des-zoc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-des-zoc-foi-000  thru cod-des-zoc-foi-999    .
       acc-tmo-orc-110.
           perform   cod-des-zoc-cll-000  thru cod-des-zoc-cll-999    .
           if        w-cod-des-zoc-ope    =    "F+"
                     go to acc-tmo-orc-115.
           if        w-cod-des-zoc-ope    =    "AC"
                     go to acc-tmo-orc-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-tmo-orc-115.
           perform   cod-des-zoc-foi-000  thru cod-des-zoc-foi-999    .
           go to     acc-tmo-orc-110.
       acc-tmo-orc-120.
           move      w-cod-des-zoc-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-tmo-orc-999.
       acc-tmo-orc-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-tmo-orc          .
       acc-tmo-orc-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [zoc]                      *
      *                  *---------------------------------------------*
           move      w-tes-tmo-orc        to   w-let-arc-zoc-cod      .
           perform   let-arc-zoc-000      thru let-arc-zoc-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valori associati al tipo    *
      *                  * movimento ordini clienti                    *
      *                  *---------------------------------------------*
           move      w-let-arc-zoc-des    to   w-tes-tmo-orc-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-tmo-orc-des-000  thru vis-tmo-orc-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-zoc-flg    not  = spaces
                     go to acc-tmo-orc-100.
       acc-tmo-orc-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se valore variato                      *
      *                  *---------------------------------------------*
           if        w-tes-tmo-orc        =    w-sav-tmo-orc
                     go to acc-tmo-orc-800.
      *                  *---------------------------------------------*
      *                  * Normalizzazione tipo ordine spedizione      *
      *                  *---------------------------------------------*
           move      spaces               to   w-tes-tmo-ods          .
           move      spaces               to   w-tes-tmo-ods-des      .
           perform   vis-tmo-ods-000      thru vis-tmo-ods-999        .
           perform   vis-tmo-ods-des-000  thru vis-tmo-ods-des-999    .
       acc-tmo-orc-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-tmo-orc-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-tmo-orc-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-tmo-orc-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-tmo-orc-999.
       acc-tmo-orc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo chiave : Tipo movimento                *
      *    *                                                           *
      *    * Subroutine di trattamento del default                     *
      *    *-----------------------------------------------------------*
       acc-tmo-orc-def-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di obbligatorieta'         *
      *              *-------------------------------------------------*
           move      spaces               to   w-def-tmo-orc-flg      .
       acc-tmo-orc-def-100.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di trattamento  *
      *              * da referenza                                    *
      *              *-------------------------------------------------*
           if        w-ref-tmo-orc-trt    =    spaces
                     go to acc-tmo-orc-def-200
           else if   w-ref-tmo-orc-trt    =    "I"
                     go to acc-tmo-orc-def-300
           else if   w-ref-tmo-orc-trt    =    "C"
                     go to acc-tmo-orc-def-400
           else if   w-ref-tmo-orc-trt    =    "O"
                     go to acc-tmo-orc-def-500
           else      go to acc-tmo-orc-def-900.
       acc-tmo-orc-def-200.
      *              *-------------------------------------------------*
      *              * Se nessun default                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se default da utilizzare               *
      *                  *---------------------------------------------*
           if        w-tes-tmo-orc        not  = spaces
                     go to acc-tmo-orc-def-900.
      *                  *---------------------------------------------*
      *                  * Utilizzo del default                        *
      *                  *---------------------------------------------*
           move      w-def-tmo-orc        to   w-tes-tmo-orc          .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     acc-tmo-orc-def-900.
       acc-tmo-orc-def-300.
      *              *-------------------------------------------------*
      *              * Se default iniziale                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se default da utilizzare               *
      *                  *---------------------------------------------*
           if        w-tes-tmo-orc        not  = spaces
                     go to acc-tmo-orc-def-900.
      *                  *---------------------------------------------*
      *                  * Utilizzo del default                        *
      *                  *---------------------------------------------*
           move      w-def-tmo-orc        to   w-tes-tmo-orc          .
      *                  *---------------------------------------------*
      *                  * A lettura e visualizzazione                 *
      *                  *---------------------------------------------*
           go to     acc-tmo-orc-def-600.
       acc-tmo-orc-def-400.
      *              *-------------------------------------------------*
      *              * Se default continuo                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Utilizzo del default                        *
      *                  *---------------------------------------------*
           move      w-ref-tmo-orc-cod    to   w-tes-tmo-orc          .
      *                  *---------------------------------------------*
      *                  * A lettura e visualizzazione                 *
      *                  *---------------------------------------------*
           go to     acc-tmo-orc-def-600.
       acc-tmo-orc-def-500.
      *              *-------------------------------------------------*
      *              * Se default obbligatorio                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Utilizzo del default                        *
      *                  *---------------------------------------------*
           move      w-def-tmo-orc        to   w-tes-tmo-orc          .
      *                  *---------------------------------------------*
      *                  * Forzatura del flag di obbligatorieta'       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-def-tmo-orc-flg      .
      *                  *---------------------------------------------*
      *                  * A lettura e visualizzazione                 *
      *                  *---------------------------------------------*
           go to     acc-tmo-orc-def-600.
       acc-tmo-orc-def-600.
      *              *-------------------------------------------------*
      *              * Lettura descrizione tipo movimento              *
      *              *-------------------------------------------------*
           move      w-tes-tmo-orc        to   w-let-arc-zoc-cod      .
           perform   let-arc-zoc-000      thru let-arc-zoc-999        .
      *              *-------------------------------------------------*
      *              * Bufferizzazione descrizione tipo movimento      *
      *              *-------------------------------------------------*
           move      w-let-arc-zoc-des    to   w-tes-tmo-orc-des      .
      *              *-------------------------------------------------*
      *              * Visualizzazione tipo movimento                  *
      *              *-------------------------------------------------*
           perform   vis-tmo-orc-000      thru vis-tmo-orc-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione descrizione tipo movimento      *
      *              *-------------------------------------------------*
           perform   vis-tmo-orc-des-000  thru vis-tmo-orc-des-999    .
       acc-tmo-orc-def-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     acc-tmo-orc-def-999.
       acc-tmo-orc-def-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo chiave : tipo movimento per ordini  *
      *    * clienti                                                   *
      *    *-----------------------------------------------------------*
       vis-tmo-orc-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-tmo-orc        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tmo-orc-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo chiave : descrizione tipo movimento *
      *    * per ordini clienti                                        *
      *    *-----------------------------------------------------------*
       vis-tmo-orc-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      30                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-tmo-orc-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tmo-orc-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo chiave : Tipo movimento per spedizioni *
      *    *-----------------------------------------------------------*
       acc-tmo-ods-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da proporre                         *
      *                  *---------------------------------------------*
           if        w-tes-tmo-ods        not  = spaces
                     go to acc-tmo-ods-100.
      *                  *---------------------------------------------*
      *                  * Preparazione valore di default              *
      *                  *---------------------------------------------*
           perform   acc-tmo-ods-def-000  thru acc-tmo-ods-def-999    .
           if        w-def-tmo-ods-flg    not  = spaces
                     go to acc-tmo-ods-400.
      *                  *---------------------------------------------*
      *                  * Preparazione altri default                  *
      *                  *---------------------------------------------*
           if        w-tes-tmo-ods        =    spaces   and
                     w-tes-tmo-orc        =    "OC   "
                     move  "OS   "        to   w-tes-tmo-ods          .
           if        w-tes-tmo-ods        =    spaces   and
                     w-tes-tmo-orc        =    "OD   "
                     move  "OSD  "        to   w-tes-tmo-ods          .
       acc-tmo-ods-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-des-zsc-ope      .
           move      w-tes-tmo-ods        to   w-cod-des-zsc-cod      .
           move      19                   to   w-cod-des-zsc-lin      .
           move      30                   to   w-cod-des-zsc-pos      .
           move      19                   to   w-cod-des-zsc-dln      .
           move      41                   to   w-cod-des-zsc-dps      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-des-zsc-cll-000  thru cod-des-zsc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-des-zsc-foi-000  thru cod-des-zsc-foi-999    .
       acc-tmo-ods-110.
           perform   cod-des-zsc-cll-000  thru cod-des-zsc-cll-999    .
           if        w-cod-des-zsc-ope    =    "F+"
                     go to acc-tmo-ods-115.
           if        w-cod-des-zsc-ope    =    "AC"
                     go to acc-tmo-ods-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-tmo-ods-115.
           perform   cod-des-zsc-foi-000  thru cod-des-zsc-foi-999    .
           go to     acc-tmo-ods-110.
       acc-tmo-ods-120.
           move      w-cod-des-zsc-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-tmo-ods-999.
       acc-tmo-ods-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-tmo-ods          .
       acc-tmo-ods-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [zsc]                      *
      *                  *---------------------------------------------*
           move      w-tes-tmo-ods        to   w-let-arc-zsc-cod      .
           perform   let-arc-zsc-000      thru let-arc-zsc-999        .
           move      w-let-arc-zsc-des    to   w-tes-tmo-ods-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-tmo-ods-des-000  thru vis-tmo-ods-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice errato : a errore                 *
      *                  *---------------------------------------------*
           if        w-let-arc-zsc-flg    not  = spaces
                     go to acc-tmo-ods-100.
       acc-tmo-ods-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-tmo-ods-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-tmo-ods-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-tmo-ods-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-tmo-ods-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-tmo-ods-999.
       acc-tmo-ods-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo chiave : Tipo movimento per spedizione *
      *    *                                                           *
      *    * Subroutine di trattamento del default                     *
      *    *-----------------------------------------------------------*
       acc-tmo-ods-def-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di obbligatorieta'         *
      *              *-------------------------------------------------*
           move      spaces               to   w-def-tmo-ods-flg      .
       acc-tmo-ods-def-100.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di trattamento  *
      *              * da referenza                                    *
      *              *-------------------------------------------------*
           if        w-ref-tmo-ods-trt    =    spaces
                     go to acc-tmo-ods-def-200
           else if   w-ref-tmo-ods-trt    =    "I"
                     go to acc-tmo-ods-def-300
           else if   w-ref-tmo-ods-trt    =    "C"
                     go to acc-tmo-ods-def-400
           else if   w-ref-tmo-ods-trt    =    "O"
                     go to acc-tmo-ods-def-500
           else      go to acc-tmo-ods-def-900.
       acc-tmo-ods-def-200.
      *              *-------------------------------------------------*
      *              * Se nessun default                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se default da utilizzare               *
      *                  *---------------------------------------------*
           if        w-tes-tmo-ods        not  = spaces
                     go to acc-tmo-ods-def-900.
      *                  *---------------------------------------------*
      *                  * Utilizzo del default                        *
      *                  *---------------------------------------------*
           move      w-def-tmo-ods        to   w-tes-tmo-ods          .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     acc-tmo-ods-def-900.
       acc-tmo-ods-def-300.
      *              *-------------------------------------------------*
      *              * Se default iniziale                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se default da utilizzare               *
      *                  *---------------------------------------------*
           if        w-tes-tmo-ods        not  = spaces
                     go to acc-tmo-ods-def-900.
      *                  *---------------------------------------------*
      *                  * Utilizzo del default                        *
      *                  *---------------------------------------------*
           move      w-def-tmo-ods        to   w-tes-tmo-ods          .
      *                  *---------------------------------------------*
      *                  * A lettura e visualizzazione                 *
      *                  *---------------------------------------------*
           go to     acc-tmo-ods-def-600.
       acc-tmo-ods-def-400.
      *              *-------------------------------------------------*
      *              * Se default continuo                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Utilizzo del default                        *
      *                  *---------------------------------------------*
           move      w-ref-tmo-ods-cod    to   w-tes-tmo-ods          .
      *                  *---------------------------------------------*
      *                  * A lettura e visualizzazione                 *
      *                  *---------------------------------------------*
           go to     acc-tmo-ods-def-600.
       acc-tmo-ods-def-500.
      *              *-------------------------------------------------*
      *              * Se default obbligatorio                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Utilizzo del default                        *
      *                  *---------------------------------------------*
           move      w-def-tmo-ods        to   w-tes-tmo-ods          .
      *                  *---------------------------------------------*
      *                  * Forzatura del flag di obbligatorieta'       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-def-tmo-ods-flg      .
      *                  *---------------------------------------------*
      *                  * A lettura e visualizzazione                 *
      *                  *---------------------------------------------*
           go to     acc-tmo-ods-def-600.
       acc-tmo-ods-def-600.
      *              *-------------------------------------------------*
      *              * Lettura descrizione tipo movimento              *
      *              *-------------------------------------------------*
           move      w-tes-tmo-ods        to   w-let-arc-zsc-cod      .
           perform   let-arc-zsc-000      thru let-arc-zsc-999        .
      *              *-------------------------------------------------*
      *              * Bufferizzazione descrizione tipo movimento      *
      *              *-------------------------------------------------*
           move      w-let-arc-zsc-des    to   w-tes-tmo-ods-des      .
      *              *-------------------------------------------------*
      *              * Visualizzazione tipo movimento                  *
      *              *-------------------------------------------------*
           perform   vis-tmo-ods-000      thru vis-tmo-ods-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione descrizione tipo movimento      *
      *              *-------------------------------------------------*
           perform   vis-tmo-ods-des-000  thru vis-tmo-ods-des-999    .
       acc-tmo-ods-def-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     acc-tmo-ods-def-999.
       acc-tmo-ods-def-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo chiave : Tipo movimento per spedi-  *
      *    * zioni                                                     *
      *    *-----------------------------------------------------------*
       vis-tmo-ods-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-tmo-ods        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tmo-ods-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo chiave : Descrizione tipo movimento *
      *    * per spedizioni                                            *
      *    *-----------------------------------------------------------*
       vis-tmo-ods-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      30                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-tmo-ods-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tmo-ods-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Conferma impostazioni                *
      *    *-----------------------------------------------------------*
       acc-cnf-imp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea 23                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Linea 24                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Conferma impostazioni (S/N/E) ? "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione valore da impostare         *
      *                  *---------------------------------------------*
           move      spaces               to   w-tes-cnf-imp          .
       acc-cnf-imp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      33                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-tes-cnf-imp        to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cnf-imp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-cnf-imp          .
       acc-cnf-imp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se impostata una function-key prevista : Ok *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  " or
                     v-key                =    "DO  " or
                     v-key                =    "EXIT"
                     go to acc-cnf-imp-450.
      *                  *---------------------------------------------*
      *                  * Se impostato un carattere previsto : Ok     *
      *                  *---------------------------------------------*
           if        w-tes-cnf-imp        =    "S" or
                     w-tes-cnf-imp        =    "N" or
                     w-tes-cnf-imp        =    "E"
                     go to acc-cnf-imp-450.
      *                  *---------------------------------------------*
      *                  * Altrimenti : reimpostazione                 *
      *                  *---------------------------------------------*
           go to     acc-cnf-imp-100.
       acc-cnf-imp-450.
      *                  *---------------------------------------------*
      *                  * Cancellazione prompts                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea 23                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Linea 24                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cnf-imp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda della function-key o   *
      *                  * del carattere impostato                     *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-cnf-imp-625
           else if   v-key                =    "DO  "
                     go to acc-cnf-imp-650
           else if   v-key                =    "EXIT"
                     go to acc-cnf-imp-675.
           if        w-tes-cnf-imp        =    "N"
                     go to acc-cnf-imp-625
           else if   w-tes-cnf-imp        =    "S"
                     go to acc-cnf-imp-650
           else if   w-tes-cnf-imp        =    "E"
                     go to acc-cnf-imp-675.
       acc-cnf-imp-625.
      *                  *---------------------------------------------*
      *                  * Se Up o 'N'                                 *
      *                  *---------------------------------------------*
           move      "UP  "               to   v-key                  .
           go to     acc-cnf-imp-999.
       acc-cnf-imp-650.
      *                  *---------------------------------------------*
      *                  * Se Do o 'S'                                 *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
           go to     acc-cnf-imp-999.
       acc-cnf-imp-675.
      *                  *---------------------------------------------*
      *                  * Se Exit o 'E'                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di uscita ad 'E'                 *
      *                      *-----------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-key      .
           go to     acc-cnf-imp-999.
       acc-cnf-imp-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi non chiave della registrazione         *
      *    *-----------------------------------------------------------*
       acc-nok-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-nok      .
      *              *-------------------------------------------------*
      *              * Visualizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           perform   vis-tip-fun-000      thru vis-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione se in modi- *
      *              * fica o visualizzazione, per testata e corpo     *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M" or
                     w-cnt-mfu-tip-fun    =    "V"
                     move  "#"            to   w-cnt-sts-imp-tes
                     move  all "#"        to   w-cnt-sts-imp-pte
                     move  all "#"        to   w-cnt-sts-ing-pte
                     move  "#"            to   w-cnt-sts-imp-cor      .
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione per piede   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-pie      .
       acc-nok-reg-200.
      *              *-------------------------------------------------*
      *              * Trattamento testata                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione del numero di pagine che     *
      *                  * compongono la testata                       *
      *                  *---------------------------------------------*
           perform   dmp-tes-reg-000      thru dmp-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati corpo                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-cor      
                                               w-cnt-sts-vis-cor      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati riga corpo             *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-rig      
                                               w-cnt-sts-vis-rig      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati piede                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-pie      
                                               w-cnt-sts-vis-pie      .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-key    =    spaces
                     perform pmt-key-reg-000
                                          thru pmt-key-reg-999
                     move    "#"          to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati campi chiave           *
      *                  *---------------------------------------------*
           if        w-cnt-sts-vis-key    =    spaces
                     perform vis-key-reg-000
                                          thru vis-key-reg-999
                     move    "#"          to   w-cnt-sts-vis-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per pagina di testata               *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-ptx
                    (w-cnt-sts-imp-npt)   =    spaces
                     perform pmt-tes-reg-000
                                          thru pmt-tes-reg-999
                     move    "#"          to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati pagina testata         *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M"      or
                     w-cnt-mfu-tip-fun    =    "V"      or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces or
                     w-cnt-sts-ing-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     if    w-cnt-sts-vis-ptx
                          (w-cnt-sts-imp-npt)
                                          =    spaces
                           perform vis-tes-reg-000
                                          thru vis-tes-reg-999
                           move    "#"    to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Flag di ingresso in pagina di testata       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-ing-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Accettazione dati testata                   *
      *                  *---------------------------------------------*
           perform   acc-tes-reg-000      thru acc-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita definitivo                   *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "S" or
                     w-cnt-tus-acc-tes    =    "X" or
                     w-cnt-tus-acc-tes    =    "E"
                     move  w-cnt-tus-acc-tes
                                          to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999.
      *                  *---------------------------------------------*
      *                  * Se spostamento di pagina                    *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "-"
                     go to acc-nok-reg-225
           else      go to acc-nok-reg-250.
       acc-nok-reg-225.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina precedente      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' 1 si ignora *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  > 1
                     go to acc-nok-reg-200.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina attuale a : no    *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
       acc-nok-reg-230.
      *                          *-------------------------------------*
      *                          * Decremento numero pagina attuale    *
      *                          *-------------------------------------*
           subtract  1                    from w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : decremento ulteriore        *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces and
                     w-cnt-sts-imp-npt    >    1
                     go to acc-nok-reg-230.
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-250.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina successiva      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Salvataggio numero pagina attuale   *
      *                          *-------------------------------------*
           move      w-cnt-sts-imp-npt    to   w-cnt-sts-imp-svp      .
       acc-nok-reg-260.
      *                          *-------------------------------------*
      *                          * Status di impostazione dati della   *
      *                          * della pagina attuale a : si'        *
      *                          *-------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si pone lo status di impostazione   *
      *                          * dati generale testata a si'         *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  "#"            to   w-cnt-sts-imp-tes      .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si va' ad accettazione corpo        *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  w-cnt-sts-imp-svp
                                          to   w-cnt-sts-imp-npt
                     go to acc-nok-reg-300.
      *                          *-------------------------------------*
      *                          * Incremento numero pagina attuale    *
      *                          *-------------------------------------*
           add       1                    to   w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : a re-incremento             *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces
                     go to acc-nok-reg-260.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina impostata a : no  *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-svp)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-svp)     .
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-300.
      *                  *---------------------------------------------*
      *                  * Numero riga corpo da accettare : 1          *
      *                  *---------------------------------------------*
           move       1                   to   w-cnt-cor-nrg-dac      .
       acc-nok-reg-400.
      *              *-------------------------------------------------*
      *              * Trattamento corpo                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati chiave                 *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      
                                               w-cnt-sts-vis-key      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati testata                *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-tes
                                               w-cnt-sts-pmt-pte
                                               w-cnt-sts-vis-tes
                                               w-cnt-sts-vis-pte      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati piede                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-pie      
                                               w-cnt-sts-vis-pie      .
      *                  *---------------------------------------------*
      *                  * Accettazione dati corpo                     *
      *                  *---------------------------------------------*
           perform   acc-cor-reg-000      thru acc-cor-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita definitivo                   *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-cor    =    "S" or
                     w-cnt-tus-acc-cor    =    "X" or
                     w-cnt-tus-acc-cor    =    "E"
                     move  w-cnt-tus-acc-cor
                                          to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999.
      *                  *---------------------------------------------*
      *                  * Se tipo uscita "-"                          *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-cor    =    "-"
                     go to acc-nok-reg-200.
       acc-nok-reg-800.
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Se attualmente visualizzato il corpo si e-  *
      *                  * segue la visualizzazione dei prompts della  *
      *                  * riga corpo espansa                          *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-cor    =    spaces
                     go to acc-nok-reg-805.
           perform   pmt-rig-cor-000      thru pmt-rig-cor-999        .
       acc-nok-reg-805.
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-nok-reg-810.
      *                  *---------------------------------------------*
      *                  * Test se sola visualizzazione                *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to acc-nok-reg-820
           else      go to acc-nok-reg-830.
       acc-nok-reg-820.
      *                      *-----------------------------------------*
      *                      * Accettazione se sola visualizzazione    *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "[Exit] per fine visualizzazione :"
                                          to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "E"                  to   v-msk                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "E"
                     move  "EXIT"         to   v-key                  .
           go to     acc-nok-reg-840.
       acc-nok-reg-830.
      *                      *-----------------------------------------*
      *                      * Accettazione se inserimento o modifica  *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "Conferma impostazioni (S/N/E/P) ?"
                                          to   v-not
           else      move  "Conferma impostazioni (N/E/P) ?"
                                          to   v-not                  .
           move      spaces               to   v-alf                  .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "SNEP"         to   v-msk
           else      move  "NEP"          to   v-msk                  .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
      *                          *-------------------------------------*
      *                          * Tasto Print                         *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-mst-flg          .
           if        w-cnt-mst-sel        not  = "S"
                     go to acc-nok-reg-835.
           if        w-cnt-mfu-tip-imp    =    "K"
                     go to acc-nok-reg-835.
           if        v-pfk (05)           =    "DO  "
                     move  "PRNT"         to   v-pfk (18)             .
       acc-nok-reg-835.
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "E"           to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key
           else if   v-alf                =    "P"
                     move   "PRNT"        to   v-key                  .
       acc-nok-reg-840.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-nok-reg-850
           else if   v-key                =    "EXIT"
                     go to acc-nok-reg-860
           else if   v-key                =    "UP  "
                     go to acc-nok-reg-870
           else if   v-key                =    "PRNT"
                     go to acc-nok-reg-880
           else      go to acc-nok-reg-810.
       acc-nok-reg-850.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-tus-acc-nok      .
           perform   cnt-tdo-nok-000      thru cnt-tdo-nok-999        .
           if        w-cnt-tdo-nok-flg    not  = spaces
                     go to acc-nok-reg-870.
           go to     acc-nok-reg-999.
       acc-nok-reg-860.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine di controllo per Exit        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se Exit non attivato : come 'Up'    *
      *                          *-------------------------------------*
           perform   exe-acc-cmp-exi-000  thru exe-acc-cmp-exi-999    .
           if        w-cnt-acc-flg-exi    not  = spaces
                     go to acc-nok-reg-870.
      *                          *-------------------------------------*
      *                          * Se Exit attivato                    *
      *                          *-------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-nok      .
           go to     acc-nok-reg-999.
       acc-nok-reg-870.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nr riga corpo da accettare : max        *
      *                      *-----------------------------------------*
           move      w-rlt-sup-max        to   w-cnt-cor-nrg-dac      .
      *                      *-----------------------------------------*
      *                      * Ad accettazione corpo                   *
      *                      *-----------------------------------------*
           move      spaces               to   v-key                  .
           go to     acc-nok-reg-400.
       acc-nok-reg-880.
      *                  *---------------------------------------------*
      *                  * Se Print                                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-mst-flg          .
      *                      *-----------------------------------------*
      *                      * Uscita come per 'Do'                    *
      *                      *-----------------------------------------*
           go to     acc-nok-reg-850.
       acc-nok-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione numero pagine che compongono la testata    *
      *    *-----------------------------------------------------------*
       dmp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * La testata e' composta di nr. 1 pagine          *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-sts-imp-mpt      .
       dmp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione si/no pagina w-cnt-sts-imp-npt da trattare *
      *    *-----------------------------------------------------------*
       snp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Flag di uscita a Si                             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-snp      .
       snp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione testata registrazione                        *
      *    *-----------------------------------------------------------*
       acc-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-tes      .
      *              *-------------------------------------------------*
      *              * Normalizzazione function-key                    *
      *              *-------------------------------------------------*
           move      spaces               to   v-key                  .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : testata                     *
      *              *-------------------------------------------------*
           move      "T"                  to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Disabilitazione forzata del tasto Delt      *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-itd      .
      *                  *---------------------------------------------*
      *                  * Fine Pagina                                 *
      *                  *---------------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-tes      .
           go to     acc-tes-reg-999.
       acc-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione testata registrazione                     *
      *    *-----------------------------------------------------------*
       vis-tes-reg-000.
       vis-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts testata                           *
      *    *-----------------------------------------------------------*
       pmt-tes-reg-000.
       pmt-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Presa visione per pagina     *
      *    *-----------------------------------------------------------*
       acc-pre-vpg-000.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      spaces               to   v-msk                  .
           move      spaces               to   v-alf                  .
           move      spaces               to   v-not                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-pre-vpg-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-pre-vpg-000.
       acc-pre-vpg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione corpo a partire dalla riga con numero d'or-  *
      *    * dine : w-cnt-cor-nrg-dac                                  *
      *    *-----------------------------------------------------------*
       acc-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita da corpo            *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-cor      .
      *              *-------------------------------------------------*
      *              * Confronto tra numero d'ordine riga da accettare *
      *              * e numero d'ordine dell'ultima riga              *
      *              *-------------------------------------------------*
           if        w-cnt-cor-nrg-dac    not  > w-rlt-sup-max
                     go to acc-cor-reg-025.
      *              *-------------------------------------------------*
      *              * Se oltre numero riga massimo si esce con status *
      *              * di uscita "+"                                   *
      *              *-------------------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-025.
      *              *-------------------------------------------------*
      *              * Video in 'OFF'                                  *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Prompts per corpo                               *
      *              *-------------------------------------------------*
           if        w-cnt-sts-pmt-cor    =    spaces
                     perform pmt-cor-reg-000
                                          thru pmt-cor-reg-999
                     move    "#"          to   w-cnt-sts-pmt-cor      .
      *              *-------------------------------------------------*
      *              * Visualizzazione dati corpo                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione nr pagina da visualizzare    *
      *                  *---------------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrp-dav      .
           add       w-lin-num-lin-vis    to   w-cnt-cor-nrp-dav      .
           subtract  1                    from w-cnt-cor-nrp-dav      .
           divide    w-lin-num-lin-vis    into w-cnt-cor-nrp-dav      .
      *                  *---------------------------------------------*
      *                  * Se non e' visualizzata nessuna pagina corpo *
      *                  * o una pagina corpo diversa da quella da vi- *
      *                  * sualizzare si procede alla visualizzazione  *
      *                  *---------------------------------------------*
           if        w-cnt-sts-vis-cor    =    spaces           or
                     w-cnt-cor-nrp-vis    not  = w-cnt-cor-nrp-dav
                     perform vis-cor-reg-000
                                          thru vis-cor-reg-999
                     move    "#"          to   w-cnt-sts-vis-cor
                     move    w-cnt-cor-nrp-dav
                                          to   w-cnt-cor-nrp-vis      .
      *              *-------------------------------------------------*
      *              * Lettura riga da file relative di supporto       *
      *              *-------------------------------------------------*
           move      "RD"                 to   w-rlt-sup-ope          .
           move      w-cnt-cor-nrg-dac    to   w-rlt-sup-prg          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
           move      w-rlt-sup-buf        to   w-rig                  .
       acc-cor-reg-050.
      *              *-------------------------------------------------*
      *              * Routine pre-accettazione riga corpo             *
      *              *-------------------------------------------------*
           perform   pre-rig-cor-000      thru pre-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts per riga d'accettazione *
      *              *-------------------------------------------------*
           perform   pmt-rig-cor-000      thru pmt-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione dati per riga di accettazione   *
      *              *-------------------------------------------------*
           perform   vis-rig-cor-000      thru vis-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Video in 'ON'                                   *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Flag di status impostazione corpo               *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-cor      .
      *              *-------------------------------------------------*
      *              * Flag di status impostione riga attuale          *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-rig      .
      *              *-------------------------------------------------*
      *              * Indicatore linea in corso di trattamento        *
      *              *-------------------------------------------------*
           move      "I"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita da riga corpo       *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-rig      .
       acc-cor-reg-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo impostazione : primo campo riga corpo  *
      *                  *---------------------------------------------*
           move      "C"                  to   w-cnt-mfu-tip-imp      .
      *                  *---------------------------------------------*
      *                  * Accettazione quantita' assegnata            *
      *                  *---------------------------------------------*
           perform   acc-qta-ass-000      thru acc-qta-ass-999        .
      *                  *---------------------------------------------*
      *                  * Salvataggio tipo uscita da accettazione     *
      *                  *---------------------------------------------*
           move      w-cnt-tus-acc-rig    to   w-sav-tip-usc          .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-925.
      *                  *---------------------------------------------*
      *                  * Tipo impostazione : altri campi riga corpo  *
      *                  *---------------------------------------------*
           move      "R"                  to   w-cnt-mfu-tip-imp      .
       acc-cor-reg-200.
      *              *-------------------------------------------------*
      *              * Normalizzazione function key                    *
      *              *-------------------------------------------------*
           move      spaces               to   v-key                  .
       acc-cor-reg-800.
      *              *-------------------------------------------------*
      *              * Controllo finale su riga impostata              *
      *              *-------------------------------------------------*
           perform   cnt-tdo-rig-000      thru cnt-tdo-rig-999        .
           if        w-cnt-tdo-rig-flg    not  = spaces
                     move  spaces         to   w-cnt-tdo-rig-flg
                     move  "UP  "         to   v-key
                     go to acc-cor-reg-200.
       acc-cor-reg-900.
      *              *-------------------------------------------------*
      *              * Tests per uscita significativa da interno riga  *
      *              *-------------------------------------------------*
           if        w-cnt-tus-acc-rig    =    spaces or
                     w-cnt-tus-acc-rig    =    "S"
                     go to acc-cor-reg-905.
      *                  *---------------------------------------------*
      *                  * Se Exit da interno riga                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione numero riga             *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
           go to     acc-cor-reg-000.
       acc-cor-reg-905.
      *                  *---------------------------------------------*
      *                  * Se Do da interno riga                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Routine post-accettazione riga          *
      *                      *-----------------------------------------*
           move      "+"                  to   w-cnt-cor-tip-agg      .
           perform   pos-rig-cor-000      thru pos-rig-cor-999        .
      *                      *-----------------------------------------*
      *                      * Update riga su file relative di suppor- *
      *                      * to                                      *
      *                      *-----------------------------------------*
           move      "UP"                 to   w-rlt-sup-ope          .
           move      w-cnt-cor-nrg-dac    to   w-rlt-sup-prg          .
           move      w-rig                to   w-rlt-sup-buf          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
      *                      *-----------------------------------------*
      *                      * Visualizzazione linea corpo             *
      *                      *-----------------------------------------*
           move      "R"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Incremento del numero d'ordine della    *
      *                      * riga da accettare                       *
      *                      *-----------------------------------------*
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-925.
      *              *-------------------------------------------------*
      *              * Tests per uscita significativa dal primo campo  *
      *              * di impostazione della riga                      *
      *              *-------------------------------------------------*
           if        w-cnt-tus-acc-rig    =    "U"
                     go to acc-cor-reg-935
           else if   w-cnt-tus-acc-rig    =    "D"
                     go to acc-cor-reg-940
           else if   w-cnt-tus-acc-rig    =    "S"
                     go to acc-cor-reg-945
           else if   w-cnt-tus-acc-rig    =    "T"
                     go to acc-cor-reg-965
           else if   w-cnt-tus-acc-rig    =    "B"
                     go to acc-cor-reg-970
           else if   w-cnt-tus-acc-rig    =    "N"
                     go to acc-cor-reg-975
           else if   w-cnt-tus-acc-rig    =    "P"
                     go to acc-cor-reg-980
           else if   w-cnt-tus-acc-rig    =    "."
                     go to acc-cor-reg-985.
       acc-cor-reg-930.
      *                  *---------------------------------------------*
      *                  * Se Exit da primo campo di impostazione riga *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-935.
      *                  *---------------------------------------------*
      *                  * Se Up da primo campo di impostazione riga   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Decremento numero riga da accettare     *
      *                      *-----------------------------------------*
           subtract  1                    from w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-940.
      *                  *---------------------------------------------*
      *                  * Se Down da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Incremento del numero riga              *
      *                      *-----------------------------------------*
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-945.
      *                  *---------------------------------------------*
      *                  * Se Do da primo campo di impostazione riga   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di uscita a 'S'                  *
      *                      *-----------------------------------------*
           move      "S"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-965.
      *                  *---------------------------------------------*
      *                  * Se Tab da primo campo di impostazione riga  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Ad accettazione ultimo record           *
      *                      *-----------------------------------------*
           move      w-rlt-sup-max        to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-970.
      *                  *---------------------------------------------*
      *                  * Se Back da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
           move      1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-975.
      *                  *---------------------------------------------*
      *                  * Se Nxsc da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Determinazione numero d'ordine della    *
      *                      * prima riga appartenente alla pagina     *
      *                      * successiva a quella attuale             *
      *                      *-----------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-cnt-wrk-ctr-001      .
           add       w-lin-num-lin-vis    to   w-cnt-wrk-ctr-001      .
           subtract  1                    from w-cnt-wrk-ctr-001      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-001      .
           multiply  w-lin-num-lin-vis    by   w-cnt-wrk-ctr-001      .
           add       1                    to   w-cnt-wrk-ctr-001      .
      *                      *-----------------------------------------*
      *                      * Se questa e' maggiore del numero riga   *
      *                      * massimo si esce con '+'                 *
      *                      *-----------------------------------------*
           if        w-cnt-wrk-ctr-001    >    w-rlt-sup-max
                     move  "+"            to   w-cnt-tus-acc-cor
                     go to acc-cor-reg-990.
      *                      *-----------------------------------------*
      *                      * Altrimenti : ad accettazione della pri- *
      *                      * ma riga della pagina successiva         *
      *                      *-----------------------------------------*
           move      w-cnt-wrk-ctr-001    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-980.
      *                  *---------------------------------------------*
      *                  * Se Prsc da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Se si e' sulla prima pagina : si ignora *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  > w-lin-num-lin-vis
                     go to acc-cor-reg-000.
      *                      *-----------------------------------------*
      *                      * Se non si e' sulla prima pagina : alla  *
      *                      * accettazione della prima riga della pa- *
      *                      * gina precedente                         *
      *                      *-----------------------------------------*
           subtract  w-lin-num-lin-vis    from w-cnt-cor-nrg-dac      .
           subtract  1                    from w-cnt-cor-nrg-dac      .
           divide    w-lin-num-lin-vis    into w-cnt-cor-nrg-dac      .
           multiply  w-lin-num-lin-vis    by   w-cnt-cor-nrg-dac      .
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-985.
      *                  *---------------------------------------------*
      *                  * Se Slct da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Ad accettazione nr riga selezionato     *
      *                      *-----------------------------------------*
           move      w-cnt-slc-num-rig    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-990.
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione corpo       *
      *              *-------------------------------------------------*
           if        w-rlt-sup-max        =    zero
                     move  spaces         to   w-cnt-sts-imp-cor
           else      move  "#"            to   w-cnt-sts-imp-cor      .
       acc-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina corpo numero : w-cnt-cor-nrp-dav   *
      *    *-----------------------------------------------------------*
       vis-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Video in 'OFF'                                  *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Erase linee impegnate, escluse fincature        *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      18                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Composizione linea per griglia                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-lin-imm              .
      *                  *---------------------------------------------*
      *                  * Eventuale barra verticale per descrizione   *
      *                  *---------------------------------------------*
           if        w-prs-rig-scr-des    =    01 or
                     w-prs-rig-scr-des    =    05
                     move  "|"            to   w-lin-imm-brv-p01
           else if   w-prs-rig-scr-des    =    02 or
                     w-prs-rig-scr-des    =    06
                     move  "|"            to   w-lin-imm-brv-p02
           else if   w-prs-rig-scr-des    =    03
                     move  "|"            to   w-lin-imm-brv-p03
           else if   w-prs-rig-scr-des    =    04
                     move  "|"            to   w-lin-imm-brv-p04      .
      *                  *---------------------------------------------*
      *                  * Altre barre verticali                       *
      *                  *---------------------------------------------*
           move      "|"                  to   w-lin-imm-brv-001
                                               w-lin-imm-brv-002
                                               w-lin-imm-brv-003
                                               w-lin-imm-brv-004      .
      *              *-------------------------------------------------*
      *              * Visualizzazione griglia                         *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-lin-imm            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      09                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      10                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      11                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      12                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      13                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      14                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      15                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      16                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      17                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      18                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-cor-reg-150.
      *              *-------------------------------------------------*
      *              * Determinazione numero d'ordine del primo numero *
      *              * riga da visualizzare                            *
      *              *-------------------------------------------------*
           move      w-cnt-cor-nrp-dav    to   w-cnt-wrk-ctr-008      .
           multiply  w-lin-num-lin-vis    by   w-cnt-wrk-ctr-008      .
           add       1                    to   w-cnt-wrk-ctr-008      .
           subtract  w-lin-num-lin-vis    from w-cnt-wrk-ctr-008      .
      *              *-------------------------------------------------*
      *              * Determinazione numero d'ordine dell'ultimo nu-  *
      *              * mero riga da visualizzare                       *
      *              *-------------------------------------------------*
           move      w-cnt-wrk-ctr-008    to   w-cnt-wrk-ctr-009      .
           add       w-lin-num-lin-vis    to   w-cnt-wrk-ctr-009      .
           subtract  1                    from w-cnt-wrk-ctr-009      .
       vis-cor-reg-175.
      *              *-------------------------------------------------*
      *              * Numero di pagina                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione pagina attuale               *
      *                  *---------------------------------------------*
           divide    w-lin-num-lin-vis    into w-rlt-sup-max
                                        giving w-det-pag-cor-max
                                     remainder w-det-pag-cor-rem      .
           if        w-det-pag-cor-rem    >    zero
                     add 1                to   w-det-pag-cor-max      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-009
                                        giving w-det-pag-cor-att      .
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-det-pag-cor-att    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-edt                to   w-det-pag-cor-ep1      .
      *
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-det-pag-cor-max    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-edt                to   w-det-pag-cor-ep2      .
      *                  *---------------------------------------------*
      *                  * Composizione                                *
      *                  *---------------------------------------------*
           move      spaces               to   w-det-pag-cor-npa      .
           string    w-det-pag-cor-ep1
                                delimited by   spaces
                     "/"
                                delimited by   size
                     w-det-pag-cor-ep2
                                delimited by   spaces
                                          into w-det-pag-cor-npa      .
      *                  *---------------------------------------------*
      *                  * Allineamento a destra                       *
      *                  *---------------------------------------------*
           move      07                   to   w-all-str-lun          .
           move      w-det-pag-cor-npa    to   w-all-str-alf          .
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      74                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-cor-reg-200.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se si e' entro il massimo  *
      *              * numero di records caricati oppure no            *
      *              *-------------------------------------------------*
           if        w-cnt-wrk-ctr-008    >    w-rlt-sup-max
                     go to vis-cor-reg-300
           else      go to vis-cor-reg-400.
       vis-cor-reg-300.
      *              *-------------------------------------------------*
      *              * Se si e' oltre il massimo numero di records ca- *
      *              * ricati                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione linea a Spaces              *
      *                  *---------------------------------------------*
           move      "B"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-wrk-ctr-008    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     vis-cor-reg-500.
       vis-cor-reg-400.
      *              *-------------------------------------------------*
      *              * Se non si e' oltre il massimo numero di records *
      *              * caricati                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura file relative di supporto           *
      *                  *---------------------------------------------*
           move      "RD"                 to   w-rlt-sup-ope          .
           move      w-cnt-wrk-ctr-008    to   w-rlt-sup-prg          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
           move      w-rlt-sup-buf        to   w-rig                  .
      *                  *---------------------------------------------*
      *                  * Visualizzazione riga                        *
      *                  *---------------------------------------------*
           move      "R"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-wrk-ctr-008    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
       vis-cor-reg-500.
      *              *-------------------------------------------------*
      *              * Incremento numero riga da visualizzare          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-wrk-ctr-008      .
      *              *-------------------------------------------------*
      *              * Test se oltre ultima riga da visualizzare       *
      *              *-------------------------------------------------*
           if        w-cnt-wrk-ctr-008    not  > w-cnt-wrk-ctr-009
                     go to vis-cor-reg-200.
       vis-cor-reg-900.
      *              *-------------------------------------------------*
      *              * Video in 'ON'                                   *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione linea corpo numero : w-cnt-cor-nrg-dav    *
      *    *-----------------------------------------------------------*
       vis-lin-cor-000.
      *              *-------------------------------------------------*
      *              * Abblencamento immagine linea di corpo           *
      *              *-------------------------------------------------*
           move      spaces               to   w-lin-imm              .
      *              *-------------------------------------------------*
      *              * Forzatura barre verticali                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Eventuale barra verticale per descrizione   *
      *                  *---------------------------------------------*
           if        w-prs-rig-scr-des    =    01 or
                     w-prs-rig-scr-des    =    05
                     move  "|"            to   w-lin-imm-brv-p01
           else if   w-prs-rig-scr-des    =    02 or
                     w-prs-rig-scr-des    =    06
                     move  "|"            to   w-lin-imm-brv-p02
           else if   w-prs-rig-scr-des    =    03
                     move  "|"            to   w-lin-imm-brv-p03
           else if   w-prs-rig-scr-des    =    04
                     move  "|"            to   w-lin-imm-brv-p04      .
      *                  *---------------------------------------------*
      *                  * Altre barre verticali                       *
      *                  *---------------------------------------------*
           move      "|"                  to   w-lin-imm-brv-001
                                               w-lin-imm-brv-002
                                               w-lin-imm-brv-003
                                               w-lin-imm-brv-004      .
      *              *-------------------------------------------------*
      *              * Determinazione numero linea assoluta a video    *
      *              *-------------------------------------------------*
           move      w-cnt-cor-nrg-dav    to   w-cnt-wrk-ctr-001      .
           subtract  1                    from w-cnt-wrk-ctr-001      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-001
                                        giving w-cnt-wrk-ctr-003
                                     remainder w-cnt-wrk-ctr-002      .
           multiply  w-lin-num-lin-prc    by   w-cnt-wrk-ctr-002      .
           add       w-lin-pri-lin-vid    to   w-cnt-wrk-ctr-002      .
      *              *-------------------------------------------------*
      *              * Test su tipo visualizzazione riga               *
      *              *-------------------------------------------------*
           if        w-cnt-cor-tvi-rig    =    "I"
                     go to vis-lin-cor-100
           else if   w-cnt-cor-tvi-rig    =    "B"
                     go to vis-lin-cor-150
           else if   w-cnt-cor-tvi-rig    =    "S"
                     go to vis-lin-cor-200
           else if   w-cnt-cor-tvi-rig    =    "N"
                     go to vis-lin-cor-300
           else      go to vis-lin-cor-400.
       vis-lin-cor-100.
      *              *-------------------------------------------------*
      *              * Se visualizzazione indicatore linea             *
      *              *-------------------------------------------------*
           go to     vis-lin-cor-999.
       vis-lin-cor-150.
      *              *-------------------------------------------------*
      *              * Se visualizzazione linea a blanks               *
      *              *-------------------------------------------------*
           move      80                   to   v-car                  .
           go to     vis-lin-cor-900.
       vis-lin-cor-200.
      *              *-------------------------------------------------*
      *              * Se visualizzazione numero linea a spaces        *
      *              *-------------------------------------------------*
           go to     vis-lin-cor-999.
       vis-lin-cor-300.
      *              *-------------------------------------------------*
      *              * Se visualizzazione numero d'ordine riga         *
      *              *-------------------------------------------------*
           go to     vis-lin-cor-999.
       vis-lin-cor-400.
      *              *-------------------------------------------------*
      *              * Se visualizzazione riga intera                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing descrizione                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda del tipo riga      *
      *                      *-----------------------------------------*
           if        w-rig-tip-rig-tpr    =    "P" and
                     w-rig-tip-rig-tfu    =    spaces
                     go to vis-lin-cor-404
           else      go to vis-lin-cor-420.
       vis-lin-cor-404.
      *                          *-------------------------------------*
      *                          * Se il tipo riga indica che si sta   *
      *                          * trattando un codice di magazzino    *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Deviazione a seconda della per- *
      *                              * sonalizzazione di tipo esposi-  *
      *                              * zione descrizione               *
      *                              *---------------------------------*
           if        w-prs-rig-scr-des    =    00
                     go to vis-lin-cor-406
           else if   w-prs-rig-scr-des    =    01
                     go to vis-lin-cor-408
           else if   w-prs-rig-scr-des    =    02
                     go to vis-lin-cor-410
           else if   w-prs-rig-scr-des    =    03
                     go to vis-lin-cor-412
           else if   w-prs-rig-scr-des    =    04
                     go to vis-lin-cor-414
           else if   w-prs-rig-scr-des    =    05
                     go to vis-lin-cor-416
           else if   w-prs-rig-scr-des    =    06
                     go to vis-lin-cor-418
           else      go to vis-lin-cor-406.
       vis-lin-cor-406.
      *                              *---------------------------------*
      *                              * Se personalizzazione tipo : 00  *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * A visualizzazione della so- *
      *                                  * la intera descrizione       *
      *                                  *-----------------------------*
           go to     vis-lin-cor-422.
       vis-lin-cor-408.
      *                              *---------------------------------*
      *                              * Se personalizzazione tipo : 01  *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Editing primi 25 caratteri  *
      *                                  * della descrizione           *
      *                                  *-----------------------------*
           move      w-rig-der-rig (1)    to   w-lin-imm-d25-p01      .
      *                                  *-----------------------------*
      *                                  * Editing codice magazzino    *
      *                                  *-----------------------------*
           move      w-rig-alf-pro        to   w-lin-imm-cod-p01      .
      *                                  *-----------------------------*
      *                                  * Continuazione               *
      *                                  *-----------------------------*
           go to     vis-lin-cor-430.
       vis-lin-cor-410.
      *                              *---------------------------------*
      *                              * Se personalizzazione tipo : 02  *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Editing primi 21 caratteri  *
      *                                  * della descrizione           *
      *                                  *-----------------------------*
           move      w-rig-der-rig (1)    to   w-lin-imm-d21-p02      .
      *                                  *-----------------------------*
      *                                  * Editing parentesi sinistra  *
      *                                  *-----------------------------*
           move      "["                  to   w-lin-imm-pqs-p02      .
      *                                  *-----------------------------*
      *                                  * Editing tipo codice di ma-  *
      *                                  * gazzino                     *
      *                                  *-----------------------------*
           if        w-rig-tip-mag        =    01
                     move  "P"            to   w-lin-imm-tco-p02
           else if   w-rig-tip-mag        =    02
                     move  "S"            to   w-lin-imm-tco-p02
           else if   w-rig-tip-mag        =    03
                     move  "M"            to   w-lin-imm-tco-p02
           else      move  "?"            to   w-lin-imm-tco-p02      .
      *                                  *-----------------------------*
      *                                  * Editing parentesi destra    *
      *                                  *-----------------------------*
           move      "]"                  to   w-lin-imm-pqd-p02      .
      *                                  *-----------------------------*
      *                                  * Editing codice magazzino    *
      *                                  *-----------------------------*
           move      w-rig-alf-pro        to   w-lin-imm-cod-p02      .
      *                                  *-----------------------------*
      *                                  * Continuazione               *
      *                                  *-----------------------------*
           go to     vis-lin-cor-430.
       vis-lin-cor-412.
      *                              *---------------------------------*
      *                              * Se personalizzazione tipo : 03  *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Editing codice magazzino    *
      *                                  *-----------------------------*
           move      w-rig-alf-pro        to   w-lin-imm-cod-p03      .
      *                                  *-----------------------------*
      *                                  * Editing primi 25 caratteri  *
      *                                  * della descrizione           *
      *                                  *-----------------------------*
           move      w-rig-der-rig (1)    to   w-lin-imm-d25-p03      .
      *                                  *-----------------------------*
      *                                  * Continuazione               *
      *                                  *-----------------------------*
           go to     vis-lin-cor-430.
       vis-lin-cor-414.
      *                              *---------------------------------*
      *                              * Se personalizzazione tipo : 04  *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Editing parentesi sinistra  *
      *                                  *-----------------------------*
           move      "["                  to   w-lin-imm-pqs-p04      .
      *                                  *-----------------------------*
      *                                  * Editing tipo codice di ma-  *
      *                                  * gazzino                     *
      *                                  *-----------------------------*
           if        w-rig-tip-mag        =    01
                     move  "P"            to   w-lin-imm-tco-p04
           else if   w-rig-tip-mag        =    02
                     move  "S"            to   w-lin-imm-tco-p04
           else if   w-rig-tip-mag        =    03
                     move  "M"            to   w-lin-imm-tco-p04
           else      move  "?"            to   w-lin-imm-tco-p04      .
      *                                  *-----------------------------*
      *                                  * Editing parentesi destra    *
      *                                  *-----------------------------*
           move      "]"                  to   w-lin-imm-pqd-p04      .
      *                                  *-----------------------------*
      *                                  * Editing codice magazzino    *
      *                                  *-----------------------------*
           move      w-rig-alf-pro        to   w-lin-imm-cod-p04      .
      *                                  *-----------------------------*
      *                                  * Editing primi 21 caratteri  *
      *                                  * della descrizione           *
      *                                  *-----------------------------*
           move      w-rig-der-rig (1)    to   w-lin-imm-d21-p04      .
      *                                  *-----------------------------*
      *                                  * Continuazione               *
      *                                  *-----------------------------*
           go to     vis-lin-cor-430.
       vis-lin-cor-416.
      *                              *---------------------------------*
      *                              * Se personalizzazione tipo : 05  *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Editing codice magazzino    *
      *                                  *-----------------------------*
           move      w-rig-alf-pro        to   w-lin-imm-cod-p01      .
      *                                  *-----------------------------*
      *                                  * Continuazione               *
      *                                  *-----------------------------*
           go to     vis-lin-cor-430.
       vis-lin-cor-418.
      *                              *---------------------------------*
      *                              * Se personalizzazione tipo : 06  *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Editing parentesi sinistra  *
      *                                  *-----------------------------*
           move      "["                  to   w-lin-imm-pqs-p02      .
      *                                  *-----------------------------*
      *                                  * Editing tipo codice di ma-  *
      *                                  * gazzino                     *
      *                                  *-----------------------------*
           if        w-rig-tip-mag        =    01
                     move  "P"            to   w-lin-imm-tco-p02
           else if   w-rig-tip-mag        =    02
                     move  "S"            to   w-lin-imm-tco-p02
           else if   w-rig-tip-mag        =    03
                     move  "M"            to   w-lin-imm-tco-p02
           else      move  "?"            to   w-lin-imm-tco-p02      .
      *                                  *-----------------------------*
      *                                  * Editing parentesi destra    *
      *                                  *-----------------------------*
           move      "]"                  to   w-lin-imm-pqd-p02      .
      *                                  *-----------------------------*
      *                                  * Editing codice magazzino    *
      *                                  *-----------------------------*
           move      w-rig-alf-pro        to   w-lin-imm-cod-p02      .
      *                                  *-----------------------------*
      *                                  * Continuazione               *
      *                                  *-----------------------------*
           go to     vis-lin-cor-430.
       vis-lin-cor-420.
      *                          *-------------------------------------*
      *                          * Se il tipo riga indica che non si   *
      *                          * sta trattando un codice di magaz-   *
      *                          * zino                                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * A visualizzazione della sola    *
      *                              * intera descrizione              *
      *                              *---------------------------------*
           go to     vis-lin-cor-422.
       vis-lin-cor-422.
      *                              *---------------------------------*
      *                              * Visualizzazione della sola in-  *
      *                              * tera descrizione                *
      *                              *---------------------------------*
           move      w-rig-der-rig (1)    to   w-lin-imm-des-rig      .
       vis-lin-cor-430.
      *                  *---------------------------------------------*
      *                  * Se tipo riga a spazi o 'C' : a visualizza-  *
      *                  * zione                                       *
      *                  *---------------------------------------------*
           if        w-rig-tip-rig        =    spaces or
                     w-rig-tip-rig        =    "C"
                     go to vis-lin-cor-800.
      *                  *---------------------------------------------*
      *                  * Editing quantita' da evadere                *
      *                  *                                             *
      *                  * SIRI                                        *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      w-rig-qta-dev        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-qta-dev      .
       vis-lin-cor-440.
      *                  *---------------------------------------------*
      *                  * Editing quantita' assegnata                 *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-rig-qta-ass        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-qta-ass      .
       vis-lin-cor-450.
      *                  *---------------------------------------------*
      *                  * Editing quantita' disponibile               *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      w-rig-qta-dsp        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-qta-dsp      .
       vis-lin-cor-460.
      *                  *---------------------------------------------*
      *                  * Editing margine lordo                       *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      spaces               to   v-edm                  .
           move      w-rig-per-mrg        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-per-mrg      .
       vis-lin-cor-800.
      *                  *---------------------------------------------*
      *                  * Parametri per visualizzazione               *
      *                  *---------------------------------------------*
           move      80                   to   v-car                  .
       vis-lin-cor-900.
      *              *-------------------------------------------------*
      *              * Esecuzione visualizzazione prima linea          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-lin-imm-dsp-lin (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se una sola linea : uscita                      *
      *              *-------------------------------------------------*
           if        w-lin-num-lin-prc    =    1
                     go to vis-lin-cor-999.
      *              *-------------------------------------------------*
      *              * Esecuzione visualizzazione altre linee          *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-wrk-ctr-003      .
       vis-lin-cor-925.
           add       1                    to   w-cnt-wrk-ctr-003      .
           if        w-cnt-wrk-ctr-003    >    w-lin-num-lin-prc
                     go to vis-lin-cor-999.
           add       1                    to   w-cnt-wrk-ctr-002      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-lin-imm-dsp-lin
                    (w-cnt-wrk-ctr-003)   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     vis-lin-cor-925.
       vis-lin-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts area linee di corpo               *
      *    *-----------------------------------------------------------*
       pmt-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate sia dall'area per la fin- *
      *              * catura che dall'area delle righe effettive      *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      19                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Intestazione cliente                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione stringa                        *
      *                  *---------------------------------------------*
           move      spaces               to   w-pmt-cor-reg-x80      .
           move      1                    to   w-pmt-cor-reg-pnt      .
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           string    "Cliente : "
                                delimited by   size
                                          into w-pmt-cor-reg-x80
                                  with pointer w-pmt-cor-reg-pnt      .
      *                      *-----------------------------------------*
      *                      * Codice                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Editing                             *
      *                          *-------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-tes-cod-cli        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * String                              *
      *                          *-------------------------------------*
           string    v-edt
                                delimited by   spaces
                                          into w-pmt-cor-reg-x80
                                  with pointer w-pmt-cor-reg-pnt      .
      *                      *-----------------------------------------*
      *                      * Dipendenza                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se esistente                   *
      *                          *-------------------------------------*
           if        w-tes-dpz-cli        =    spaces or
                     w-tes-dpz-cli        =    "*   "
                     go to pmt-cor-reg-020.
      *                          *-------------------------------------*
      *                          * String                              *
      *                          *-------------------------------------*
           string    "-"
                                delimited by   size
                     w-tes-dpz-cli
                                delimited by   spaces
                                          into w-pmt-cor-reg-x80
                                  with pointer w-pmt-cor-reg-pnt      .
       pmt-cor-reg-020.
      *                      *-----------------------------------------*
      *                      * Ragione sociale                         *
      *                      *-----------------------------------------*
           string    "  "
                                delimited by   size
                     w-tes-cod-cli-rag
                                delimited by   size
                                          into w-pmt-cor-reg-x80
                                  with pointer w-pmt-cor-reg-pnt      .
      *                  *---------------------------------------------*
      *                  * Stampa stringa                              *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-pmt-cor-reg-x80    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-cor-reg-100.
       pmt-cor-reg-200.
      *              *-------------------------------------------------*
      *              * Trattini a linea 05                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-cor-reg-300.
      *              *-------------------------------------------------*
      *              * Fincatura per descrizione                       *
      *              *-------------------------------------------------*
       pmt-cor-reg-310.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda della personalizzazio- *
      *                  * di tipo esposizione della descrizione       *
      *                  *---------------------------------------------*
           if        w-prs-rig-scr-des    =    00
                     go to pmt-cor-reg-320
           else if   w-prs-rig-scr-des    =    01 or
                     w-prs-rig-scr-des    =    05
                     go to pmt-cor-reg-330
           else if   w-prs-rig-scr-des    =    02 or
                     w-prs-rig-scr-des    =    06
                     go to pmt-cor-reg-340
           else if   w-prs-rig-scr-des    =    03
                     go to pmt-cor-reg-350
           else if   w-prs-rig-scr-des    =    04
                     go to pmt-cor-reg-360
           else      go to pmt-cor-reg-320.
       pmt-cor-reg-320.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 00              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Fincatura                               *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "              Descrizione               "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura                          *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "----------------------------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-cor-reg-400.
       pmt-cor-reg-330.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 01 oppure 05    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Fincatura                               *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "       Descrizione       |    Codice    "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura                          *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "-------------------------|--------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-cor-reg-400.
       pmt-cor-reg-340.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 02 oppure 06    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Fincatura                               *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "     Descrizione     |      Codice      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura                          *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "---------------------|------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-cor-reg-400.
       pmt-cor-reg-350.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 03              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Fincatura                               *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "    Codice    |       Descrizione       "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura                          *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "--------------|-------------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-cor-reg-400.
       pmt-cor-reg-360.
      *                  *---------------------------------------------*
      *                  * Se personalizzazione tipo : 04              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Fincatura                               *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "      Codice      |     Descrizione     "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura                          *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "------------------|---------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     pmt-cor-reg-400.
       pmt-cor-reg-400.
      *              *-------------------------------------------------*
      *              * Fincatura rimanente                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "|Da evadere| Assegnato |Disponibile|  % "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura rimanente              *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "|----------|-----------|-----------|----"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 19                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione riga corpo di accettazione in w-rig       *
      *    *-----------------------------------------------------------*
       vis-rig-cor-000.
      *              *-------------------------------------------------*
      *              * Riferimenti ordine cliente                      *
      *              *-------------------------------------------------*
           perform   vis-rif-ocl-000      thru vis-rif-ocl-999        .
      *              *-------------------------------------------------*
      *              * Prezzo di vendita                               *
      *              *-------------------------------------------------*
           perform   vis-prz-ven-000      thru vis-prz-ven-999        .
      *              *-------------------------------------------------*
      *              * Lotto di vendita                                *
      *              *-------------------------------------------------*
           perform   vis-lot-ven-000      thru vis-lot-ven-999        .
      *              *-------------------------------------------------*
      *              * Data consegna richiesta                         *
      *              *-------------------------------------------------*
           perform   vis-dcn-ric-000      thru vis-dcn-ric-999        .
       vis-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per riga corpo di accettazione    *
      *    *-----------------------------------------------------------*
       pmt-rig-cor-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate dall'area di impostazione *
      *              * della singola riga corpo espansa a piede        *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      20                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Riferimenti ordine cliente                      *
      *              *-------------------------------------------------*
           perform   pmt-rif-ocl-000      thru pmt-rif-ocl-999        .
      *              *-------------------------------------------------*
      *              * Prezzo di vendita                               *
      *              *-------------------------------------------------*
           perform   pmt-prz-ven-000      thru pmt-prz-ven-999        .
      *              *-------------------------------------------------*
      *              * Lotto di vendita                                *
      *              *-------------------------------------------------*
           perform   pmt-lot-ven-000      thru pmt-lot-ven-999        .
      *              *-------------------------------------------------*
      *              * Data consegna richiesta                         *
      *              *-------------------------------------------------*
           perform   pmt-dcn-ric-000      thru pmt-dcn-ric-999        .
       pmt-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Riferimenti ordine cliente       *
      *    *-----------------------------------------------------------*
       pmt-rif-ocl-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Ordine    :"        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-rif-ocl-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Prezzo di vendita                *
      *    *-----------------------------------------------------------*
       pmt-prz-ven-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Prezzo    :"        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      08                   to   v-pos                  .
           move      w-rig-sgl-vpp        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-prz-ven-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Lotto di vendita                 *
      *    *-----------------------------------------------------------*
       pmt-lot-ven-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      54                   to   v-pos                  .
           move      "Lotto di vend.:"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-lot-ven-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Data consegna richiesta          *
      *    *-----------------------------------------------------------*
       pmt-dcn-ric-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      54                   to   v-pos                  .
           move      "Consegna rich.:"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-dcn-ric-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Numero e data ordine cliente      *
      *    *-----------------------------------------------------------*
       vis-rif-ocl-000.
      *              *-------------------------------------------------*
      *              * Composizione stringa                            *
      *              *-------------------------------------------------*
           move      spaces               to   w-vis-rif-ocl-x40      .
           move      1                    to   w-vis-rif-ocl-pnt      .
      *                  *---------------------------------------------*
      *                  * Numero ordine                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se esistente                       *
      *                      *-----------------------------------------*
           if        w-rig-ocl-num        =    spaces
                     go to vis-rif-ocl-020.
      *                      *-----------------------------------------*
      *                      * String                                  *
      *                      *-----------------------------------------*
           string    w-rig-ocl-num
                                delimited by   size
                                          into w-vis-rif-ocl-x40
                                  with pointer w-vis-rif-ocl-pnt      .
      *                      *-----------------------------------------*
      *                      * Riposizionamento puntatore              *
      *                      *-----------------------------------------*
           move      zero                 to   w-vis-rif-ocl-pnt      .
           inspect   w-vis-rif-ocl-x40
                                      tallying w-vis-rif-ocl-pnt
                                          for  trailing spaces        .
           subtract  w-vis-rif-ocl-pnt    from 40
                                        giving w-vis-rif-ocl-pnt      .
           add       2                    to   w-vis-rif-ocl-pnt      .
       vis-rif-ocl-020.
      *                  *---------------------------------------------*
      *                  * Data ordine                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se esistente                       *
      *                      *-----------------------------------------*
           if        w-rig-ocl-dat        =    zero
                     go to vis-rif-ocl-040.
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      "<"                  to   v-edm                  .
           move      w-rig-ocl-dat        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * String                                  *
      *                      *-----------------------------------------*
           string    "del "
                                delimited by   size
                     v-edt
                                delimited by   spaces
                                          into w-vis-rif-ocl-x40
                                  with pointer w-vis-rif-ocl-pnt      .
       vis-rif-ocl-040.
      *              *-------------------------------------------------*
      *              * Stampa stringa                                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-vis-rif-ocl-pnt    to   v-car                  .
           move      20                   to   v-lin                  .
           move      13                   to   v-pos                  .
           move      w-vis-rif-ocl-x40    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-rif-ocl-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Prezzo di vendita                 *
      *    *-----------------------------------------------------------*
       vis-prz-ven-000.
      *              *-------------------------------------------------*
      *              * Composizione stringa                            *
      *              *-------------------------------------------------*
           move      spaces               to   w-vis-prz-ven-x40      .
           move      1                    to   w-vis-prz-ven-pnt      .
      *                  *---------------------------------------------*
      *                  * Prezzo                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      w-rig-dec-prz        to   v-dec                  .
           add       w-rig-dec-vpp        to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "G<"                 to   v-edm                  .
           move      w-rig-prz-net        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * String                                  *
      *                      *-----------------------------------------*
           string    v-edt
                                delimited by   spaces
                                          into w-vis-prz-ven-x40
                                  with pointer w-vis-prz-ven-pnt      .
      *                  *---------------------------------------------*
      *                  * Se legame valutario non esitente a stampa   *
      *                  * stringa                                     *
      *                  *---------------------------------------------*
           if        w-rig-sgl-vpl        =    spaces
                     go to vis-prz-ven-800.
      *                  *---------------------------------------------*
      *                  * Sigla valuta per legame valutario           *    
      *                  *---------------------------------------------*
           string    " "
                                delimited by   size
                     w-rig-sgl-vpl
                                delimited by   spaces
                                          into w-vis-prz-ven-x40
                                  with pointer w-vis-prz-ven-pnt      .
      *                  *---------------------------------------------*
      *                  * Coefficiente di cambio di riferimento       *    
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      05                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<D"                 to   v-edm                  .
           move      w-rig-ccr-vpl        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * String                                  *
      *                      *-----------------------------------------*
           string    " "
                                delimited by   size
                     v-edt
                                delimited by   spaces
                                          into w-vis-prz-ven-x40
                                  with pointer w-vis-prz-ven-pnt      .
      *                  *---------------------------------------------*
      *                  * Percentuale di limitazione                  *    
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      01                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<D"                 to   v-edm                  .
           move      w-rig-plm-vpl        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * String                                  *
      *                      *-----------------------------------------*
           string    " +/- "
                                delimited by   size
                     v-edt
                                delimited by   spaces
                                          into w-vis-prz-ven-x40
                                  with pointer w-vis-prz-ven-pnt      .
      *                  *---------------------------------------------*
      *                  * Tipo di limitazione                         *    
      *                  *---------------------------------------------*
           string    " "
                                delimited by   size
                     w-rig-tlm-vpl
                                delimited by   spaces
                                          into w-vis-prz-ven-x40
                                  with pointer w-vis-prz-ven-pnt      .
       vis-prz-ven-800.
      *              *-------------------------------------------------*
      *              * Stampa stringa                                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-vis-prz-ven-pnt    to   v-car                  .
           move      21                   to   v-lin                  .
           move      13                   to   v-pos                  .
           move      w-vis-prz-ven-x40    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-prz-ven-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Lotto di vendita                  *
      *    *-----------------------------------------------------------*
       vis-lot-ven-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      w-rig-dec-qta        to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      20                   to   v-lin                  .
           move      70                   to   v-pos                  .
           move      w-rig-lot-ven        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-lot-ven-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Data consegna richiesta           *
      *    *-----------------------------------------------------------*
       vis-dcn-ric-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      21                   to   v-lin                  .
           move      70                   to   v-pos                  .
           move      w-rig-dcn-ric        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-dcn-ric-999.
           exit.

      *    *===========================================================*
      *    * Accettazione del primo campo riga corpo espansa : Quanti- *
      *    * ta' assegnata                                             *
      *    *-----------------------------------------------------------*
       acc-qta-ass-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se tipo riga a spaces o 'C'            *
      *                  *---------------------------------------------*
           if        w-rig-tip-rig        not  = spaces and
                     w-rig-tip-rig        not  = "C"
                     go to acc-qta-ass-050.
      *                      *-----------------------------------------*
      *                      * Se tipo uscita da impostazione prece-   *
      *                      * dente e' Up e numero riga da accettare  *
      *                      * superiore alla 2 : Uscita per Up        *
      *                      *-----------------------------------------*
           if        w-sav-tip-usc        =    "U" and
                     w-cnt-cor-nrg-dac    >    2
                     move  "U"            to   w-cnt-tus-acc-rig
                     move  spaces         to   w-sav-tip-usc
                     go to acc-qta-ass-999.
      *                      *-----------------------------------------*
      *                      * Altrimenti uscita per Down              *
      *                      *-----------------------------------------*
           move      "D"                  to   w-cnt-tus-acc-rig      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     acc-qta-ass-999.
       acc-qta-ass-050.
      *                  *---------------------------------------------*
      *                  * Determinazione numero linea assoluta a vi-  *
      *                  * deo                                         *
      *                  *---------------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-cnt-wrk-ctr-001      .
           subtract  1                    from w-cnt-wrk-ctr-001      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-001
                                        giving w-cnt-wrk-ctr-003
                                     remainder w-cnt-wrk-ctr-002      .
           multiply  w-lin-num-lin-prc    by   w-cnt-wrk-ctr-002      .
           add       w-lin-pri-lin-vid    to   w-cnt-wrk-ctr-002      .
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-rig-qta-ass        to   w-sav-qta-ass          .
       acc-qta-ass-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ripristino valore precedente                *
      *                  *---------------------------------------------*
           move      w-sav-qta-ass        to   w-rig-qta-ass          .
      *                  *---------------------------------------------*
      *                  * Parametri generici                          *
      *                  *                                             *
      *                  * SIRI                                        *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           move      53                   to   v-pos                  .
           move      "GB"                 to   v-edm                  .
      *                  *---------------------------------------------*
      *                  * Tasti funzione                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Up   : sempre ammesso, a meno che non   *
      *                      *        si sia alla riga numero 1        *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    >    1
                     move  "UP  "         to   v-pfk (01)
           else      move  spaces         to   v-pfk (01)             .
      *                      *-----------------------------------------*
      *                      * Down : sempre ammesso a meno che non ci *
      *                      *        siano zero righe                 *
      *                      *-----------------------------------------*
           if        w-cnt-sts-imp-cor    not  = spaces
                     move  "DOWN"         to   v-pfk (02)             .
      *                      *-----------------------------------------*
      *                      * Insr : non ammesso                      *
      *                      *-----------------------------------------*
           move      spaces               to   v-pfk (04)             .
      *                      *-----------------------------------------*
      *                      * Do   : sempre ammesso, purche' sia con- *
      *                      *        cesso dallo status delle impo-   *
      *                      *        stazioni; eventualmente disat-   *
      *                      *        tivato dal richiamo della sub-   *
      *                      *        routine di accettazione          *
      *                      *-----------------------------------------*
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)
           else      move  spaces         to   v-pfk (05)             .
      *                      *-----------------------------------------*
      *                      * Remv : mai ammesso                      *
      *                      *-----------------------------------------*
           move      spaces               to   v-pfk (06)             .
      *                      *-----------------------------------------*
      *                      * Prsc : sempre ammesso, a meno che non   *
      *                      *        si sia alla pagina numero 1      *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    >    w-lin-num-lin-vis
                     move  "PRSC"         to   v-pfk (07)
           else      move  spaces         to   v-pfk (07)             .
      *                      *-----------------------------------------*
      *                      * Nxsc : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "NXSC"               to   v-pfk (08)             .
      *                      *-----------------------------------------*
      *                      * Back : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sulla prima riga     *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  = 1
                     move  "BACK"         to   v-pfk (09)
           else      move  spaces         to   v-pfk (09)             .
      *                      *-----------------------------------------*
      *                      * Tab  : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sull'ultima riga     *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  = w-rlt-sup-max
                     move  "TAB "         to   v-pfk (10)
           else      move  spaces         to   v-pfk (10)             .
      *                      *-----------------------------------------*
      *                      * Slct : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sull'unica riga      *
      *                      *-----------------------------------------*
           if        w-rlt-sup-max        not  < 2
                     move  "SLCT"         to   v-pfk (11)
           else      move  spaces         to   v-pfk (11)             .
      *                      *-----------------------------------------*
      *                      * Valore di accettazione                  *
      *                      *-----------------------------------------*
           move      w-rig-qta-ass        to   v-num                  .
       acc-qta-ass-200.
      *                      *-----------------------------------------*
      *                      * Richiamo subroutine di accettazione     *
      *                      *-----------------------------------------*
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Return                                       *
      *              *-------------------------------------------------*
           if        v-key                =    spaces
                     go to acc-qta-ass-400.
       acc-qta-ass-250.
      *              *-------------------------------------------------*
      *              * Se Slct                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "SLCT"
                     go to acc-qta-ass-300.
      *                  *---------------------------------------------*
      *                  * Conversione numero riga impostato in forma- *
      *                  * to numerico                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Conversione numero riga impostato in    *
      *                      * formato numerico                        *
      *                      *-----------------------------------------*
           move      v-num                to   w-cnt-slc-rap-num      .
      *                      *-----------------------------------------*
      *                      * Se numero riga impostato minore di 1 o  *
      *                      * maggiore del massimo : reimpostazione   *
      *                      *-----------------------------------------*
           if        w-cnt-slc-rap-num    =    zero       or
                     w-cnt-slc-rap-num    >    w-rlt-sup-max
                     go to acc-qta-ass-100.
      *                          *-------------------------------------*
      *                          * Se numero riga impostato pari a nu- *
      *                          * numero riga attuale : reimpostazio- *
      *                          * ne                                  *
      *                          *-------------------------------------*
           if        w-cnt-slc-rap-num    =    w-cnt-cor-nrg-dac
                     go to acc-qta-ass-100.
      *                          *-------------------------------------*
      *                          * Preparazione parametri e uscita     *
      *                          *-------------------------------------*
           move      w-cnt-slc-rap-num    to   w-cnt-slc-num-rig      .
           move      "."                  to   w-cnt-tus-acc-rig      .
           go to     acc-qta-ass-999.
       acc-qta-ass-300.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-qta-ass-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-rig
                     go to acc-qta-ass-999.
      *              *-------------------------------------------------*
      *              * Se premuto un altro tasto funzione non deve es- *
      *              * sere avvenuta variazione del campo d'impostaz.  *
      *              *-------------------------------------------------*
           if        v-mod                not  = spaces
                     go to acc-qta-ass-100.
      *              *-------------------------------------------------*
      *              * Se Up                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "UP  "
                     move  "U"            to   w-cnt-tus-acc-rig
                     go to acc-qta-ass-999.
      *              *-------------------------------------------------*
      *              * Se Down                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DOWN"
                     move  "D"            to   w-cnt-tus-acc-rig
                     go to acc-qta-ass-999.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-qta-ass-999
                     else    go to acc-qta-ass-100.
      *              *-------------------------------------------------*
      *              * Se Insr                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "INSR"
                     move  "I"            to   w-cnt-tus-acc-rig
                     go to acc-qta-ass-999.
      *              *-------------------------------------------------*
      *              * Se Tab                                          *
      *              *-------------------------------------------------*
           if        v-key                =    "TAB "
                     move  "T"            to   w-cnt-tus-acc-rig
                     go to acc-qta-ass-999.
      *              *-------------------------------------------------*
      *              * Se Back                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "BACK"
                     move  "B"            to   w-cnt-tus-acc-rig
                     go to acc-qta-ass-999.
      *              *-------------------------------------------------*
      *              * Se Nxsc                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "NXSC"
                     move  "N"            to   w-cnt-tus-acc-rig
                     go to acc-qta-ass-999.
      *              *-------------------------------------------------*
      *              * Se Prsc                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "PRSC"
                     move  "P"            to   w-cnt-tus-acc-rig
                     go to acc-qta-ass-999.
       acc-qta-ass-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore in campo di destinazione             *
      *                  *---------------------------------------------*
           move      v-num                to   w-rig-qta-ass          .
      *                  *---------------------------------------------*
      *                  * Valore negativo non ammesso                 *
      *                  *---------------------------------------------*
           if        w-rig-qta-ass        <    zero
                     go to acc-qta-ass-100.
       acc-qta-ass-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-qta-ass-800.
       acc-qta-ass-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Quantita' assegnata               *
      *    *-----------------------------------------------------------*
       vis-qta-ass-000.
      *              *-------------------------------------------------*
      *              * Determinazione numero linea assoluta a video    *
      *              *-------------------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-cnt-wrk-ctr-001      .
           subtract  1                    from w-cnt-wrk-ctr-001      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-001
                                        giving w-cnt-wrk-ctr-003
                                     remainder w-cnt-wrk-ctr-002      .
           multiply  w-lin-num-lin-prc    by   w-cnt-wrk-ctr-002      .
           add       w-lin-pri-lin-vid    to   w-cnt-wrk-ctr-002      .
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           move      53                   to   v-pos                  .
           move      "GB"                 to   v-edm                  .
           move      w-rig-qta-ass        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-qta-ass-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi chiave           *
      *    *-----------------------------------------------------------*
       cnt-tdo-key-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-key-flg      .
       cnt-tdo-key-100.
      *              *-------------------------------------------------*
      *              * Controlli                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice cliente                              *
      *                  *---------------------------------------------*
           if        w-tes-cod-cli        not  = zero
                     go to cnt-tdo-key-110.
           move      "Manca il codice cliente                           
      -              "               "    to   w-err-box-err-msg      .
           go to     cnt-tdo-key-900.
       cnt-tdo-key-110.
      *                  *---------------------------------------------*
      *                  * Data emissione ordini di spedizione         *
      *                  *---------------------------------------------*
           if        w-tes-dat-emi        not  = zero
                     go to cnt-tdo-key-120.
           move      "Manca la data emissione ordini di spedizione      
      -              "               "    to   w-err-box-err-msg      .
           go to     cnt-tdo-key-900.
       cnt-tdo-key-120.
      *                  *---------------------------------------------*
      *                  * Data ordini emessiminima e massima          *
      *                  *---------------------------------------------*
           if        w-tes-dem-max        not  < w-tes-dem-min
                     go to cnt-tdo-key-130.
           move      "Data ordini emessi massima inferiore a quella mini
      -              "ma             "    to   w-err-box-err-msg      .
           go to     cnt-tdo-key-900.
       cnt-tdo-key-130.
       cnt-tdo-key-500.
      *              *-------------------------------------------------*
      *              * Normalizzazioni                                 *
      *              *-------------------------------------------------*
           if        w-tes-tmo-orc        =    spaces
                     move  "OC   "        to   w-tes-tmo-orc          .
           if        w-tes-tmo-ods        =    spaces
                     move  "OS   "        to   w-tes-tmo-ods          .
       cnt-tdo-key-800.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     cnt-tdo-key-999.
       cnt-tdo-key-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Emissione messaggio                         *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-key-flg      .
       cnt-tdo-key-999.
           exit.
           
      *    *===========================================================*
      *    * Controllo se chiave vuota                                 *
      *    *-----------------------------------------------------------*
       cnt-key-vuo-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-key-vuo-flg      .
       cnt-key-vuo-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi non chiave       *
      *    *-----------------------------------------------------------*
       cnt-tdo-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-nok-flg      .
       cnt-tdo-nok-999.
           exit.
           
      *    *===========================================================*
      *    * Controllo su impostazione tasto Do riga corpo             *
      *    *-----------------------------------------------------------*
       cnt-tdo-rig-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-rig-flg      .
       cnt-tdo-rig-999.
           exit.

      *    *===========================================================*
      *    * Preparazioni pre-accettazione riga corpo                  *
      *    *-----------------------------------------------------------*
       pre-rig-cor-000.
       pre-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Azioni post-accettazione riga corpo                       *
      *    *-----------------------------------------------------------*
       pos-rig-cor-000.
       pos-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati chiave e non chiave                  *
      *    *-----------------------------------------------------------*
       nor-key-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione dati chiave                     *
      *              *-------------------------------------------------*
           perform   nor-key-reg-000      thru nor-key-reg-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave testata         *
      *              *-------------------------------------------------*
           perform   nor-nok-tes-000      thru nor-nok-tes-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave riga corpo      *
      *              *-------------------------------------------------*
           perform   nor-nok-rig-000      thru nor-nok-rig-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave piede           *
      *              *-------------------------------------------------*
           perform   nor-nok-pie-000      thru nor-nok-pie-999        .
      *              *-------------------------------------------------*
      *              * Inizializzazione file relative di supporto      *
      *              *-------------------------------------------------*
           move      "BE"                 to   w-rlt-sup-ope          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       nor-key-nok-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati chiave                               *
      *    *-----------------------------------------------------------*
       nor-key-reg-000.
           move      zero                 to   w-tes-cod-cli          .
           move      spaces               to   w-tes-cod-cli-rag      .
           move      spaces               to   w-tes-cod-cli-via      .
           move      spaces               to   w-tes-cod-cli-loc      .
           move      spaces               to   w-tes-dpz-cli          .
           move      spaces               to   w-tes-dpz-cli-rag      .
           move      spaces               to   w-tes-dpz-cli-via      .
           move      spaces               to   w-tes-dpz-cli-loc      .
           move      zero                 to   w-tes-dem-min          .
           move      zero                 to   w-tes-dem-max          .
           move      zero                 to   w-tes-dcr-min          .
           move      zero                 to   w-tes-dcr-max          .
           move      spaces               to   w-tes-tmo-orc          .
           move      spaces               to   w-tes-tmo-orc-des      .
           move      spaces               to   w-tes-tmo-ods          .
           move      spaces               to   w-tes-tmo-ods-des      .
           move      zero                 to   w-tes-dat-emi          .
           move      spaces               to   w-tes-cnf-imp          .
       nor-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave testata                   *
      *    *-----------------------------------------------------------*
       nor-nok-tes-000.
       nor-nok-tes-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave riga corpo                *
      *    *-----------------------------------------------------------*
       nor-nok-rig-000.
           move      zero                 to   w-rig-num-prg          .
           move      spaces               to   w-rig-tip-rig          .
           move      spaces               to   w-rig-tip-rig-tpr      .
           move      spaces               to   w-rig-tip-rig-tfu      .
           move      zero                 to   w-rig-tip-mag          .
           move      zero                 to   w-rig-num-pro          .
           move      spaces               to   w-rig-alf-pro          .
           move      spaces               to   w-rig-des-rig          .
           move      zero                 to   w-rig-dec-qta          .
           move      zero                 to   w-rig-qta-dev          .
           move      zero                 to   w-rig-qas-pre          .
           move      zero                 to   w-rig-qta-ass          .
           move      zero                 to   w-rig-qta-dsp          .
           move      zero                 to   w-rig-per-mrg          .
           move      zero                 to   w-rig-ocl-dat          .
           move      spaces               to   w-rig-ocl-num          .
           move      zero                 to   w-rig-dat-doc          .
           move      zero                 to   w-rig-num-doc          .
           move      spaces               to   w-rig-sgl-vpp          .
           move      zero                 to   w-rig-dec-vpp          .
           move      zero                 to   w-rig-dec-prz          .
           move      zero                 to   w-rig-prz-net          .
           move      spaces               to   w-rig-sgl-vpl          .
           move      zero                 to   w-rig-ccr-vpl          .
           move      zero                 to   w-rig-plm-vpl          .
           move      spaces               to   w-rig-tlm-vpl          .
           move      zero                 to   w-rig-lot-ven          .
           move      zero                 to   w-rig-dcn-ric          .
           move      zero                 to   w-rig-dcn-prv          .
           move      zero                 to   w-rig-prt-orc          .
           move      zero                 to   w-rig-prg-orc          .
       nor-nok-rig-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave piede                     *
      *    *-----------------------------------------------------------*
       nor-nok-pie-000.
       nor-nok-pie-999.
           exit.

      *    *===========================================================*
      *    * Lettura registrazione pre-esistente                       *
      *    *-----------------------------------------------------------*
       rou-let-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-let-reg      .
       rou-let-reg-100.
      *              *-------------------------------------------------*
      *              * Esecuzione caricamento file relative di appog-  *
      *              * gio                                             *
      *              *-------------------------------------------------*
           perform   car-fil-rap-000      thru car-fil-rap-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del numero di records ca-  *
      *              * ricati nel file relative di appoggio            *
      *              *-------------------------------------------------*
           if        w-rlt-sup-max        =    zero
                     go to rou-let-reg-200
           else      go to rou-let-reg-300.
       rou-let-reg-200.
      *              *-------------------------------------------------*
      *              * Se numero di records caricati : zero            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Nessun ordine per il cliente da trattare !        
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Status di uscita ad errore                  *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-rou-let-reg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-300.
      *              *-------------------------------------------------*
      *              * Se numero di records caricati maggiore di zero  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Modifica                                    *
      *                  *---------------------------------------------*
           move      "M"                  to   w-cnt-mfu-tip-fun      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per inserimento                  *
      *    *-----------------------------------------------------------*
       pre-acc-ins-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-ins      .
       pre-acc-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per modifica                     *
      *    *-----------------------------------------------------------*
       pre-acc-mod-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-mod      .
       pre-acc-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per visualizzazione              *
      *    *-----------------------------------------------------------*
       pre-acc-vis-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-vis      .
       pre-acc-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-richiesta di ratifica tasto Delete            *
      *    *-----------------------------------------------------------*
       pre-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-snx-del      .
      *              *-------------------------------------------------*
      *              * Si ignora comunque il tasto Delt                *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-pre-snx-del      .
       pre-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-richiesta di ratifica tasto Delete           *
      *    *-----------------------------------------------------------*
       pos-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pos-snx-del      .
      *              *-------------------------------------------------*
      *              * Si ignora comunque il tasto Delt                *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-pos-snx-del      .
       pos-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su inserimento                          *
      *    *-----------------------------------------------------------*
       pos-exi-ins-000.
       pos-exi-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su modifica                             *
      *    *-----------------------------------------------------------*
       pos-exi-mod-000.
       pos-exi-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su visualizzazione                      *
      *    *-----------------------------------------------------------*
       pos-exi-vis-000.
       pos-exi-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di inserimento                      *
      *    *-----------------------------------------------------------*
       pos-cnf-ins-000.
       pos-cnf-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di modifica                         *
      *    *-----------------------------------------------------------*
       pos-cnf-mod-000.
      *              *-------------------------------------------------*
      *              * Scaricamento file relative di appoggio          *
      *              *-------------------------------------------------*
           perform   sca-fil-rap-000      thru sca-fil-rap-999        .
       pos-cnf-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di annullamento                     *
      *    *-----------------------------------------------------------*
       pos-cnf-ann-000.
       pos-cnf-ann-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione caricamento file relative di appoggio          *
      *    *-----------------------------------------------------------*
       car-fil-rap-000.
      *              *-------------------------------------------------*
      *              * Messaggio di caricamento in esecuzione          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "               ---- Caricamento ordini cliente in 
      -              "esecuzione ----               "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Normalizzazione work per rottura protocollo     *
      *              *-------------------------------------------------*
           move      zero                 to   w-car-fil-rap-wrp      .
      *              *-------------------------------------------------*
      *              * Start su file [ocr]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "RCHARC    "         to   f-key                  .
           move      w-tes-cod-dpz        to   rf-ocr-cod-dpz         .
           move      spaces               to   rf-ocr-flg-rch         .
           move      "C"                  to   rf-ocr-tip-arc         .
           move      w-tes-cod-cli        to   rf-ocr-cod-arc         .
           move      zero                 to   rf-ocr-num-prt         .
           move      zero                 to   rf-ocr-num-prg         .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-900.
       car-fil-rap-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale record [ocr]                *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At End'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-900.
       car-fil-rap-110.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-ocr-cod-dpz       not  = w-tes-cod-dpz or
                     rf-ocr-flg-rch       not  = spaces        or
                     rf-ocr-tip-arc       not  = "C"           or
                     rf-ocr-cod-arc       not  = w-tes-cod-cli
                     go to car-fil-rap-900.
       car-fil-rap-115.
      *              *-------------------------------------------------*
      *              * Selezioni sul record                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo ordini                         *
      *                  *---------------------------------------------*
           if        rf-ocr-tip-ord       not  = spaces
                     go to car-fil-rap-100.
      *                  *---------------------------------------------*
      *                  * Test su tipo movimento                      *
      *                  *---------------------------------------------*
           if        rf-ocr-tmo-orc       not  = w-tes-tmo-orc
                     go to car-fil-rap-100.
      *                  *---------------------------------------------*
      *                  * Test su dipendenza del cliente              *
      *                  *---------------------------------------------*
           if        w-tes-dpz-cli        =    "*   "
                     go to car-fil-rap-116.
           if        rf-ocr-dpz-arc       not  = w-tes-dpz-cli
                     go to car-fil-rap-100.
       car-fil-rap-116.
      *                  *---------------------------------------------*
      *                  * Test su data emissione ordini minima        *
      *                  *---------------------------------------------*
           if        rf-ocr-dat-doc       <    w-tes-dem-min
                     go to car-fil-rap-100.
      *                  *---------------------------------------------*
      *                  * Test su data emissione ordini massima       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se esistente                            *
      *                      *-----------------------------------------*
           if        w-tes-dem-max        =    zero
                     go to car-fil-rap-120.
           if        rf-ocr-dat-doc       >    w-tes-dem-max
                     go to car-fil-rap-100.
           go to     car-fil-rap-140.
       car-fil-rap-120.
      *                      *-----------------------------------------*
      *                      * Se non esistente                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se anche data minima non esistente, *
      *                          * nessuna selezione                   *
      *                          *-------------------------------------*
           if        w-tes-dem-min        =    zero
                     go to car-fil-rap-140.
           if        rf-ocr-dat-doc       >    w-tes-dem-min
                     go to car-fil-rap-100.
           go to     car-fil-rap-140.
       car-fil-rap-140.
      *                  *---------------------------------------------*
      *                  * Test su data consegna richiesta minima      *
      *                  *---------------------------------------------*
           if        w-tes-dcr-min        not  = zero    and
                     rf-ocr-dcn-ric       <    w-tes-dcr-min
                     go to car-fil-rap-100.
      *                  *---------------------------------------------*
      *                  * Test su data consegna richiesta massima     *
      *                  *---------------------------------------------*
           if        w-tes-dcr-max        not  = zero    and
                     rf-ocr-dcn-ric       >    w-tes-dcr-max
                     go to car-fil-rap-100.
      *                  *---------------------------------------------*
      *                  * Tipo riga in comodo ridefinito              *
      *                  *---------------------------------------------*
           move      rf-ocr-tip-rig       to   w-car-fil-rap-wtr      .
      *                  *---------------------------------------------*
      *                  * Test su tipo riga                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se riga di commento: selezione superata *
      *                      *-----------------------------------------*
           if        w-car-fil-rap-wtp    =    "C"
                     go to car-fil-rap-160.
      *                      *-----------------------------------------*
      *                      * Se riga di addebito: riciclo            *
      *                      *-----------------------------------------*
           if        w-car-fil-rap-wtp    =    "A"
                     go to car-fil-rap-100.
      *                  *---------------------------------------------*
      *                  * Determinazione quantita' da evadere         *
      *                  *---------------------------------------------*
           move      "DT"                 to   d-qev-roc-tip-ope      .
           move      "pgm/orc/prg/obj/dqevroc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-qev-roc
                                               rf-ocr                 .
      *                  *---------------------------------------------*
      *                  * Test su quantita' da evadere                *
      *                  *---------------------------------------------*
           if        d-qev-roc-qta-ord    not  > zero
                     go to car-fil-rap-100.
           if        d-qev-roc-qta-dev    not  > zero
                     go to car-fil-rap-100.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valore                      *
      *                  *---------------------------------------------*
           move      d-qev-roc-qta-dev    to   w-car-fil-rap-wqe      .
       car-fil-rap-150.
      *                  *---------------------------------------------*
      *                  * Determinazione quantita' assegnata alla ri- *
      *                  * ga ordine                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione work di comodo          *
      *                      *-----------------------------------------*
           move      zero                 to   w-car-fil-rap-wqa      .
      *                      *-----------------------------------------*
      *                      * Lettura record [ocp]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      rf-ocr-num-prt       to   rf-ocp-num-prt         .
           move      rf-ocr-num-prg       to   rf-ocp-num-prg         .
           move      001                  to   rf-ocp-prg-frm         .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *                          *-------------------------------------*
      *                          * Test su esito operazione            *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-160.
      *                      *-----------------------------------------*
      *                      * Controllo che sia un'assegnazione alla  *
      *                      * giacenza                                *
      *                      *-----------------------------------------*
           if        rf-ocp-dat-ass       not  = zero
                     go to car-fil-rap-160.
      *                      *-----------------------------------------*
      *                      * Bufferizzazione quantita' assegnata     *
      *                      *-----------------------------------------*
           move      rf-ocp-qta-ass       to   w-car-fil-rap-wqa      .
       car-fil-rap-160.
      *              *-------------------------------------------------*
      *              * Fine selezioni sul record                       *
      *              *-------------------------------------------------*
       car-fil-rap-200.
      *              *-------------------------------------------------*
      *              * Se rottura numero protocollo                    *
      *              *-------------------------------------------------*
           if        rf-ocr-num-prt       =    w-car-fil-rap-wrp
                     go to car-fil-rap-300.
      *                  *---------------------------------------------*
      *                  * Aggiornamento area rottura protocollo       *
      *                  *---------------------------------------------*
           move      rf-ocr-num-prt       to   w-car-fil-rap-wrp      .
      *                  *---------------------------------------------*
      *                  * Composizione stringa per descrizione riga   *
      *                  *---------------------------------------------*
           move      all "*"              to   w-car-fil-rap-x40      .
           move      4                    to   w-car-fil-rap-pnt      .
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
           string    " Conferma nr. "
                                delimited by   size
                                          into w-car-fil-rap-x40
                                  with pointer w-car-fil-rap-pnt      .
      *                  *---------------------------------------------*
      *                  * Numero conferma                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      rf-ocr-num-doc       to   w-car-fil-rap-ndo      .
           move      w-car-fil-rap-prg    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * String                                  *
      *                      *-----------------------------------------*
           string    v-edt
                                delimited by   spaces
                                          into w-car-fil-rap-x40
                                  with pointer w-car-fil-rap-pnt      .
      *                  *---------------------------------------------*
      *                  * Data conferma                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      "<"                  to   v-edm                  .
           move      rf-ocr-dat-doc       to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * String                                  *
      *                      *-----------------------------------------*
           string    " del "
                                delimited by   size
                     v-edt
                                delimited by   spaces
                     " "
                                delimited by   size
                                          into w-car-fil-rap-x40
                                  with pointer w-car-fil-rap-pnt      .
      *                  *---------------------------------------------*
      *                  * Scrittura di un record con tipo riga a spa- *
      *                  * ces per intestazione ordine cliente         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione dati non chiave riga    *
      *                      * corpo                                   *
      *                      *-----------------------------------------*
           perform   nor-nok-rig-000      thru nor-nok-rig-999        .
      *                      *-----------------------------------------*
      *                      * Numero progressivo record caricato      *
      *                      *-----------------------------------------*
           move      w-rlt-sup-max        to   w-rig-num-prg          .
           add       1                    to   w-rig-num-prg          .
      *                      *-----------------------------------------*
      *                      * Composizione area w-rig                 *
      *                      *-----------------------------------------*
           move      spaces               to   w-rig-tip-rig          .
           move      w-car-fil-rap-x40    to   w-rig-des-rig          .
      *                      *-----------------------------------------*
      *                      * Put su file relative di appoggio        *
      *                      *-----------------------------------------*
           move      "PT"                 to   w-rlt-sup-ope          .
           move      w-rig                to   w-rlt-sup-buf          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       car-fil-rap-300.
      *              *-------------------------------------------------*
      *              * Se riga di commento                             *
      *              *-------------------------------------------------*
           if        w-car-fil-rap-wtp    not  = "C"
                     go to car-fil-rap-400.
      *                  *---------------------------------------------*
      *                  * Scrittura di un record per la riga di com-  *
      *                  * mento                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione dati non chiave riga    *
      *                      * corpo                                   *
      *                      *-----------------------------------------*
           perform   nor-nok-rig-000      thru nor-nok-rig-999        .
      *                      *-----------------------------------------*
      *                      * Numero progressivo record caricato      *
      *                      *-----------------------------------------*
           move      w-rlt-sup-max        to   w-rig-num-prg          .
           add       1                    to   w-rig-num-prg          .
      *                      *-----------------------------------------*
      *                      * Composizione area w-rig                 *
      *                      *-----------------------------------------*
           move      w-car-fil-rap-wtp    to   w-rig-tip-rig          .
      *                      *-----------------------------------------*
      *                      * Descrizione riga                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione                      *
      *                          *-------------------------------------*
           perform   det-des-rig-000      thru det-des-rig-999        .
      *                          *-------------------------------------*
      *                          * Bufferizzazione                     *
      *                          *-------------------------------------*
           move      w-det-des-rig-des    to   w-rig-des-rig          .
      *                      *-----------------------------------------*
      *                      * Put su file relative di appoggio        *
      *                      *-----------------------------------------*
           move      "PT"                 to   w-rlt-sup-ope          .
           move      w-rig                to   w-rlt-sup-buf          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     car-fil-rap-100.
       car-fil-rap-400.
      *              *-------------------------------------------------*
      *              * Determinazione quantita' disponibile            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione quantita' in giacenza        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione link-area                  *
      *                      *-----------------------------------------*
           move      "SL"                 to   d-sld-mag-tip-ope      .
           move      0000                 to   d-sld-mag-tip-sld      .
           move      w-tes-dat-emi        to   d-sld-mag-dat-sld      .
           move      "U"                  to   d-sld-mag-uot-dpz      .
           move      w-tes-cod-dpz        to   d-sld-mag-cod-dpz      .
           move      rf-ocr-tip-mag       to   d-sld-mag-tip-mag      .
           move      rf-ocr-num-pro       to   d-sld-mag-num-mag      .
           move      "T"                  to   d-sld-mag-uot-var      .
           move      spaces               to   d-sld-mag-var-mag      .
           move      "T"                  to   d-sld-mag-uot-dsl      .
           move      spaces               to   d-sld-mag-cod-dsl      .
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           move      "pgm/mag/prg/obj/pmag300y"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-sld-mag              .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valore                      *
      *                  *---------------------------------------------*
           move      d-sld-mag-sld-mag    to   w-car-fil-rap-wqg      .
       car-fil-rap-410.
      *                  *---------------------------------------------*
      *                  * Determinazione quantita' in corso di spedi- *
      *                  * zione                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione work di accumulo        *
      *                      *-----------------------------------------*
           move      zero                 to   w-car-fil-rap-wqs      .
      *                      *-----------------------------------------*
      *                      * Start su file [osr]                     *
      *                      *-----------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "RCHMAG    "         to   f-key                  .
           move      w-tes-cod-dpz        to   rf-osr-cod-dpz         .
           move      spaces               to   rf-osr-flg-rch         .
           move      rf-ocr-tip-mag       to   rf-osr-tip-mag         .
           move      rf-ocr-num-pro       to   rf-osr-num-pro         .
           move      zero                 to   rf-osr-num-prt         .
           move      zero                 to   rf-osr-num-prg         .
           move      "pgm/ods/fls/ioc/obj/iofosr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-osr                 .
      *                          *-------------------------------------*
      *                          * Test su esito operazione            *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-480.
       car-fil-rap-420.
      *                      *-----------------------------------------*
      *                      * Lettura sequenziale record [osr]        *
      *                      *-----------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/ods/fls/ioc/obj/iofosr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-osr                 .
      *                          *-------------------------------------*
      *                          * Test se 'At end'                    *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-480.
      *                      *-----------------------------------------*
      *                      * Test sul massimo                        *
      *                      *-----------------------------------------*
           if        rf-osr-cod-dpz       not  = w-tes-cod-dpz  or
                     rf-osr-flg-rch       not  = spaces         or
                     rf-osr-tip-mag       not  = rf-ocr-tip-mag or
                     rf-osr-num-pro       not  = rf-ocr-num-pro
                     go to car-fil-rap-480.
      *                      *-----------------------------------------*
      *                      * Selezione sul record                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Selezione su tipo riga              *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Tipo riga in comodo ridefinito  *
      *                              *---------------------------------*
           move      rf-osr-tip-rig       to   w-car-fil-rap-wtr      .
      *                              *---------------------------------*
      *                              * Test su tipo funzionamento      *
      *                              *---------------------------------*
           if        w-car-fil-rap-wtf    not  = spaces
                     go to car-fil-rap-420.
      *                          *-------------------------------------*
      *                          * Determinazione, relativamente alla  *
      *                          * riga ordine di spedizione letta :   *
      *                          *                                     *
      *                          *  - Quantita' in ordine              *
      *                          *  - Quantita' spedita                *
      *                          *                                     *
      *                          *  - Quantita' ancora da spedire      *
      *                          *                                     *
      *                          *-------------------------------------*
           move      "DT"                 to   d-qds-ros-tip-ope      .
           move      "pgm/ods/prg/obj/dqdsros0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-qds-ros
                                               rf-osr                 .
      *                          *-------------------------------------*
      *                          * Se quantita' da spedire a zero: ri- *
      *                          * ciclo                               *
      *                          *-------------------------------------*
           if        d-qds-ros-qta-dsp    not  > zero
                     go to car-fil-rap-420.
      *                      *-----------------------------------------*
      *                      * Aggiornamento quantita' da spedire      *
      *                      *-----------------------------------------*
           add       d-qds-ros-qta-dsp    to   w-car-fil-rap-wqs      .
      *                      *-----------------------------------------*
      *                      * Riciclo su lettura sequenziale record   *
      *                      * [osr]                                   *
      *                      *-----------------------------------------*
           go to     car-fil-rap-420.
       car-fil-rap-480.
      *                  *---------------------------------------------*
      *                  * Determinazione disponibilita'               *
      *                  *---------------------------------------------*
           move      w-car-fil-rap-wqg    to   w-car-fil-rap-wqd      .
           subtract  w-car-fil-rap-wqs    from w-car-fil-rap-wqd      .
       car-fil-rap-500.
      *              *-------------------------------------------------*
      *              * Scrittura riga in catena                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione dati non chiave riga corpo  *
      *                  *---------------------------------------------*
           perform   nor-nok-rig-000      thru nor-nok-rig-999        .
      *                  *---------------------------------------------*
      *                  * Numero progressivo record caricato          *
      *                  *---------------------------------------------*
           move      w-rlt-sup-max        to   w-rig-num-prg          .
           add       1                    to   w-rig-num-prg          .
      *                  *---------------------------------------------*
      *                  * Composizione area w-rig                     *
      *                  *---------------------------------------------*
           move      rf-ocr-tip-rig       to   w-rig-tip-rig          .
           move      rf-ocr-tip-rig       to   w-car-fil-rap-wtr      .
           move      w-car-fil-rap-wtp    to   w-rig-tip-rig-tpr      .
           move      w-car-fil-rap-wtf    to   w-rig-tip-rig-tfu      .
           move      rf-ocr-tip-mag       to   w-rig-tip-mag          .
           move      rf-ocr-num-pro       to   w-rig-num-pro          .
           move      rf-ocr-alf-pro       to   w-rig-alf-pro          .
           move      rf-ocr-dec-qta       to   w-rig-dec-qta          .
           move      w-car-fil-rap-wqe    to   w-rig-qta-dev          .
           move      w-car-fil-rap-wqa    to   w-rig-qas-pre          .
           move      w-car-fil-rap-wqa    to   w-rig-qta-ass          .
           move      w-car-fil-rap-wqd    to   w-rig-qta-dsp          .
           move      rf-ocr-ocl-dat       to   w-rig-ocl-dat          .
           move      rf-ocr-ocl-num       to   w-rig-ocl-num          .
           move      rf-ocr-dat-doc       to   w-rig-dat-doc          .
           move      rf-ocr-num-doc       to   w-rig-num-doc          .
           move      rf-ocr-sgl-vpp       to   w-rig-sgl-vpp          .
           move      rf-ocr-dec-vpp       to   w-rig-dec-vpp          .
           move      rf-ocr-dec-prz       to   w-rig-dec-prz          .
           move      rf-ocr-prz-net       to   w-rig-prz-net          .
           move      rf-ocr-sgl-vpl       to   w-rig-sgl-vpl          .
           move      rf-ocr-ccr-vpl       to   w-rig-ccr-vpl          .
           move      rf-ocr-plm-vpl       to   w-rig-plm-vpl          .
           move      rf-ocr-tlm-vpl       to   w-rig-tlm-vpl          .
           move      rf-ocr-dcn-ric       to   w-rig-dcn-ric          .
           move      rf-ocr-dcn-prv       to   w-rig-dcn-prv          .
           move      rf-ocr-num-prt       to   w-rig-prt-orc          .
           move      rf-ocr-num-prg       to   w-rig-prg-orc          .
      *                      *-----------------------------------------*
      *                      * Descrizione riga                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione                      *
      *                          *-------------------------------------*
           perform   det-des-rig-000      thru det-des-rig-999        .
      *                          *-------------------------------------*
      *                          * Bufferizzazione                     *
      *                          *-------------------------------------*
           move      w-det-des-rig-des    to   w-rig-des-rig          .
      *                      *-----------------------------------------*
      *                      * % di margine lordo                      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione costo medio continuo *
      *                          *-------------------------------------*
           move      "VM"                 to   d-vun-mag-tip-ope      .
           move      0005                 to   d-vun-mag-tip-val      .
           move      zero                 to   d-vun-mag-dat-val      .
           move      01                   to   d-vun-mag-tip-mag      .
           move      rf-ocr-num-pro       to   d-vun-mag-num-mag      .
           move      "pgm/mag/prg/obj/pmag300v"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-vun-mag              .
      *                          *-------------------------------------*
      *                          * Test se margine determinabile       *
      *                          *-------------------------------------*
           if        d-vun-mag-val-uni    =    zero or
                     w-rig-prz-net        =    zero
                     go to car-fil-rap-560.
      *                          *-------------------------------------*
      *                          * Determinazione coefficiente di cam- *
      *                          * bio attuale per legame valutario    *
      *                          *-------------------------------------*
           move      "CC"                 to   w-coe-cmb-vlt-ope      .
           move      rf-ocr-sgl-vpl       to   w-coe-cmb-vlt-sdv      .
           move      rf-ocr-tdc-vpl       to   w-coe-cmb-vlt-tdc      .
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-coe-cmb-vlt-drc      .
           move      00                   to   w-coe-cmb-vlt-quc      .
           perform   coe-cmb-vlt-cll-000  thru coe-cmb-vlt-cll-999    .
      *                          *-------------------------------------*
      *                          * Test su esito determinazione        *
      *                          *-------------------------------------*
           if        w-coe-cmb-vlt-ope    not  = "CC"
                     go to car-fil-rap-560.
      *                          *-------------------------------------*
      *                          * Determinazione prezzo sottoposto a  *
      *                          * legame valutario                    *
      *                          *-------------------------------------*
           move      rf-ocr-prz-net       to   w-det-prz-lvl-prz      .
           move      rf-ocr-sgl-vpl       to   w-det-prz-lvl-svl      .
           move      rf-ocr-ccr-vpl       to   w-det-prz-lvl-ccr      .
           move      w-coe-cmb-vlt-cdc    to   w-det-prz-lvl-cdc      .
           move      rf-ocr-plm-vpl       to   w-det-prz-lvl-plm      .
           move      rf-ocr-tlm-vpl       to   w-det-prz-lvl-tlm      .
           perform   det-prz-lvl-000      thru det-prz-lvl-999        .
      *                          *-------------------------------------*
      *                          * Spostamento in area di comodo con   *
      *                          * 2 decimali                          *
      *                          *-------------------------------------*
           move      w-det-prz-lvl-prz    to   w-car-fil-rap-9v2      .
           if        rf-ocr-dec-prz       =    1
                     divide 10            into w-car-fil-rap-9v2
           else if   rf-ocr-dec-prz       =    2
                     divide 100           into w-car-fil-rap-9v2      .
      *                          *-------------------------------------*
      *                          * Determinazione valore scostamento   *
      *                          *-------------------------------------*
           divide    100                  into d-vun-mag-val-uni
                                        giving w-car-fil-rap-wvu      .
           subtract  w-car-fil-rap-wvu    from w-car-fil-rap-9v2
                                        giving w-car-fil-rap-vsc      .
      *                          *-------------------------------------*
      *                          * Determinazione percentuale scosta-  *
      *                          * mento                               *
      *                          *-------------------------------------*
           multiply  100                  by   w-car-fil-rap-vsc      .
           divide    w-car-fil-rap-9v2    into w-car-fil-rap-vsc
                                        giving w-rig-per-mrg
                                               rounded                .
       car-fil-rap-560.
      *                      *-----------------------------------------*
      *                      * Lotto di vendita                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Lettura record [dcp]                *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      rf-ocr-num-pro       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                          *-------------------------------------*
      *                          * Se record non trovato : oltre       *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to car-fil-rap-600.
      *                          *-------------------------------------*
      *                          * Bufferizzazione                     *
      *                          *-------------------------------------*
           move      rf-dcp-lot-ven       to   w-rig-lot-ven          .
       car-fil-rap-600.
      *              *-------------------------------------------------*
      *              * Put su file relative di appoggio                *
      *              *-------------------------------------------------*
           move      "PT"                 to   w-rlt-sup-ope          .
           move      w-rig                to   w-rlt-sup-buf          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       car-fil-rap-800.
      *              *-------------------------------------------------*
      *              * Riciclo a Read Next                             *
      *              *-------------------------------------------------*
           go to     car-fil-rap-100.
       car-fil-rap-900.
      *              *-------------------------------------------------*
      *              * Eliminazione messaggio di caricamento in esecu- *
      *              * zione                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       car-fil-rap-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione scaricamento da file relative di appoggio      *
      *    *-----------------------------------------------------------*
       sca-fil-rap-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione numero elementi in tabella     *
      *              * protocolli ordini clienti trattati              *
      *              *-------------------------------------------------*
           move      zero                 to   w-sca-fil-rap-ele      .
      *              *-------------------------------------------------*
      *              * Inizializzazione work per rottura numero proto- *
      *              * collo ordini clienti trattati                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-sca-fil-rap-rnp      .
      *              *-------------------------------------------------*
      *              * Contatore records scaricati a zero              *
      *              *-------------------------------------------------*
           move      zero                 to   w-rlt-sup-ctr          .
       sca-fil-rap-100.
      *              *-------------------------------------------------*
      *              * Incremento contatore records scaricati          *
      *              *-------------------------------------------------*
           add       1                    to   w-rlt-sup-ctr          .
      *              *-------------------------------------------------*
      *              * Se maggiore del numero di records caricati  :   *
      *              * uscita                                          *
      *              *-------------------------------------------------*
           if        w-rlt-sup-ctr        >    w-rlt-sup-max
                     go to sca-fil-rap-600.
      *              *-------------------------------------------------*
      *              * Lettura riga da file relative di supporto       *
      *              *-------------------------------------------------*
           move      "RD"                 to   w-rlt-sup-ope          .
           move      w-rlt-sup-ctr        to   w-rlt-sup-prg          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
           move      w-rlt-sup-buf        to   w-rig                  .
       sca-fil-rap-200.
      *              *-------------------------------------------------*
      *              * Aggiornamento tabella numeri protocollo ordini  *
      *              * clienti trattati                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se quantita' assegnata a zero : oltre       *
      *                  *---------------------------------------------*
           if        w-rig-qta-ass        =    zero
                     go to sca-fil-rap-400.
      *                  *---------------------------------------------*
      *                  * Test se rottura numero protocollo           *
      *                  *---------------------------------------------*
           if        w-rig-prt-orc        =    w-sca-fil-rap-rnp
                     go to sca-fil-rap-400.
      *                  *---------------------------------------------*
      *                  * Aggiornamento work per rottura numero pro-  *
      *                  * tocollo                                     *
      *                  *---------------------------------------------*
           move      w-rig-prt-orc        to   w-sca-fil-rap-rnp      .
      *                  *---------------------------------------------*
      *                  * Incremento contatore elementi in tabella    *
      *                  *---------------------------------------------*
           if        w-sca-fil-rap-ele    <    w-sca-fil-rap-max
                     add   1              to   w-sca-fil-rap-ele      .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione elemento                    *
      *                  *---------------------------------------------*
           move      w-rig-prt-orc        to   w-sca-fil-rap-tnp
                                              (w-sca-fil-rap-ele)     .
      *                  *---------------------------------------------*
      *                  * Oltre                                       *
      *                  *---------------------------------------------*
           go to     sca-fil-rap-400.
       sca-fil-rap-400.
      *              *-------------------------------------------------*
      *              * Aggiornamento quantita' assegnata               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da eseguire                         *
      *                  *---------------------------------------------*
           if        w-rig-qta-ass        =    w-rig-qas-pre
                     go to sca-fil-rap-500.
      *                  *---------------------------------------------*
      *                  * Ottenimento primo record [ocp]              *
      *                  *---------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-rig-prt-orc        to   rf-ocp-num-prt         .
           move      w-rig-prg-orc        to   rf-ocp-num-prg         .
           move      001                  to   rf-ocp-prg-frm         .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *                      *-----------------------------------------*
      *                      * Test su esito operazione                *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to sca-fil-rap-420.
       sca-fil-rap-405.
      *                  *---------------------------------------------*
      *                  * Test se record di assegnazione alla giacen- *
      *                  * za                                          *
      *                  *---------------------------------------------*
           if        rf-ocp-dat-ass       =    zero
                     go to sca-fil-rap-410.
      *                      *-----------------------------------------*
      *                      * Release record [ocp]                    *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     sca-fil-rap-420.
       sca-fil-rap-410.
      *                  *---------------------------------------------*
      *                  * Aggiornamento record [ocp]                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Aggiornamento quantita' assegnata       *
      *                      *-----------------------------------------*
           move      w-rig-qta-ass        to   rf-ocp-qta-ass         .
      *                      *-----------------------------------------*
      *                      * Update record [ocp]                     *
      *                      *-----------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *                      *-----------------------------------------*
      *                      * Release record [ocp]                    *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     sca-fil-rap-500.
       sca-fil-rap-420.
      *                  *---------------------------------------------*
      *                  * Se record di assegnazione alla giacenza non *
      *                  * trovato                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ciclo di bufferizzazione e cancellazio- *
      *                      * ne records [ocp]                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione numero elementi nel *
      *                          * buffer                              *
      *                          *-------------------------------------*
           move      zero                 to   w-sca-fil-rap-bfe      .
      *                          *-------------------------------------*
      *                          * Start su file [ocp]                 *
      *                          *-------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-rig-prt-orc        to   rf-ocp-num-prt         .
           move      w-rig-prg-orc        to   rf-ocp-num-prg         .
           move      zero                 to   rf-ocp-prg-frm         .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *                              *---------------------------------*
      *                              * Se start a buon fine            *
      *                              *---------------------------------*
           if        f-sts                =    e-not-err
                     go to sca-fil-rap-430.
      *                              *---------------------------------*
      *                              * Se start non a buon fine        *
      *                              *---------------------------------*
           go to     sca-fil-rap-440.
       sca-fil-rap-430.
      *                          *-------------------------------------*
      *                          * Lettura sequenziale record [ocp]    *
      *                          *-------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *                          *-------------------------------------*
      *                          * Test se 'At End'                    *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to sca-fil-rap-440.
      *                          *-------------------------------------*
      *                          * Test sul massimo                    *
      *                          *-------------------------------------*
           if        rf-ocp-num-prt       not  = w-rig-prt-orc or
                     rf-ocp-num-prg       not  = w-rig-prg-orc
                     go to sca-fil-rap-440.
      *                          *-------------------------------------*
      *                          * Incremento numero elementi          *
      *                          *-------------------------------------*
           if        w-sca-fil-rap-bfe    <    w-sca-fil-rap-bfm
                     add   1              to   w-sca-fil-rap-bfe      .
      *                          *-------------------------------------*
      *                          * Bufferizzazione elemento            *
      *                          *-------------------------------------*
           move      rf-ocp               to   w-sca-fil-rap-bfb
                                              (w-sca-fil-rap-bfe)     .
      *                          *-------------------------------------*
      *                          * Cancellazione record [ocp]          *
      *                          *-------------------------------------*
           move      "DE"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *                          *-------------------------------------*
      *                          * Riciclo                             *
      *                          *-------------------------------------*
           go to     sca-fil-rap-430.
       sca-fil-rap-440.
      *                      *-----------------------------------------*
      *                      * Ciclo di riscrittura records [ocp]      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Inizializzazione contatore frammen- *
      *                          * ti                                  *
      *                          *-------------------------------------*
           move      zero                 to   w-sca-fil-rap-ctf      .
      *                          *-------------------------------------*
      *                          * Scrittura record per la giacenza    *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Test se da effettuare           *
      *                              *---------------------------------*
           if        w-rig-qta-ass        =    zero
                     go to sca-fil-rap-460.
      *                              *---------------------------------*
      *                              * Incremento contatore frammenti  *
      *                              *---------------------------------*
           add       1                    to   w-sca-fil-rap-ctf      .
      *                              *---------------------------------*
      *                              * Normalizzazione record [ocp]    *
      *                              *---------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *                              *---------------------------------*
      *                              * Composizione record [ocp]       *
      *                              *---------------------------------*
           move      w-rig-prt-orc        to   rf-ocp-num-prt         .
           move      w-rig-prg-orc        to   rf-ocp-num-prg         .
           move      w-sca-fil-rap-ctf    to   rf-ocp-prg-frm         .
           move      w-rig-qta-ass        to   rf-ocp-qta-ass         .
           move      zero                 to   rf-ocp-dat-ass         .
      *                              *---------------------------------*
      *                              * Put record [ocp]                *
      *                              *---------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
       sca-fil-rap-460.
      *                          *-------------------------------------*
      *                          * Scrittura records bufferizzati      *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Ciclo di scansione buffer       *
      *                              *---------------------------------*
           move      zero                 to   w-sca-fil-rap-c01      .
       sca-fil-rap-470.
           add       1                    to   w-sca-fil-rap-c01      .
           if        w-sca-fil-rap-c01    >    w-sca-fil-rap-bfe
                     go to sca-fil-rap-500.
      *                              *---------------------------------*
      *                              * Scomposizione buffer in record  *
      *                              * file                            *
      *                              *---------------------------------*
           move      w-sca-fil-rap-bfb
                    (w-sca-fil-rap-c01)   to   rf-ocp                 .
      *                              *---------------------------------*
      *                              * Incremento contatore frammenti  *
      *                              *---------------------------------*
           add       1                    to   w-sca-fil-rap-ctf      .
      *                              *---------------------------------*
      *                              * Aggiustamento numero frammento  *
      *                              *---------------------------------*
           move      w-sca-fil-rap-ctf    to   rf-ocp-prg-frm         .
      *                              *---------------------------------*
      *                              * Put record [ocp]                *
      *                              *---------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *                              *---------------------------------*
      *                              * Riciclo su scansione            *
      *                              *---------------------------------*
           go to     sca-fil-rap-470.
       sca-fil-rap-500.
      *              *-------------------------------------------------*
      *              * Riciclo su lettura riga da file relative di     *
      *              * supporto                                        *
      *              *-------------------------------------------------*
           go to     sca-fil-rap-100.
       sca-fil-rap-600.
      *              *-------------------------------------------------*
      *              * Esecuzione generazione ordini di spedizione     *
      *              *                                                 *
      *              * Essa avviene mediante il richiamo del programma *
      *              * 'ods400', passando delle variabili di i.p.c.    *
      *              * per le richieste di selezione e per i numeri di *
      *              * protocollo da trattare                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se zero elementi in tabella protocolli or-  *
      *                  * dini clienti da trattare : oltre            *
      *                  *---------------------------------------------*
           if        w-sca-fil-rap-ele    =    zero
                     go to sca-fil-rap-900.
      *                  *---------------------------------------------*
      *                  * Scrittura variabile di i.p.c. per il codice *
      *                  * dipendenza in uso                           *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "cod-dpz"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      02                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      w-tes-cod-dpz        to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Scrittura variabile di i.p.c. per il numero *
      *                  * totale di protocolli trattati               *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "prt-orc"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      03                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      w-sca-fil-rap-ele    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Scrittura variabile di i.p.c. per i numeri  *
      *                  * protocollo ordini clienti da trattare       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Inizializzazione indice 1..143 per nu-  *
      *                      * mero progressivo record                 *
      *                      *-----------------------------------------*
           move      zero                 to   w-sca-fil-rap-c01      .
      *                      *-----------------------------------------*
      *                      * Inizializzazione indice 1..7 per gruppo *
      *                      * di numeri protocollo                    *
      *                      *-----------------------------------------*
           move      zero                 to   w-sca-fil-rap-c02      .
      *                      *-----------------------------------------*
      *                      * Ciclo di scansione su tabella protocol- *
      *                      * li ordini clienti                       *
      *                      *-----------------------------------------*
           move      zero                 to   w-sca-fil-rap-c03      .
       sca-fil-rap-620.
           add       1                    to   w-sca-fil-rap-c03      .
           if        w-sca-fil-rap-c03    >    w-sca-fil-rap-ele
                     go to sca-fil-rap-640.
      *                      *-----------------------------------------*
      *                      * Se e' il primo elemento del gruppo di   *
      *                      * 7 protocolli si inizializza il record   *
      *                      * per la variabile di i.p.c.              *
      *                      *-----------------------------------------*
           if        w-sca-fil-rap-c02    =    zero
                     move  spaces         to   w-sca-fil-rap-wrl      .
      *                      *-----------------------------------------*
      *                      * Incremento indice 1..7                  *
      *                      *-----------------------------------------*
           add       1                    to   w-sca-fil-rap-c02      .
      *                      *-----------------------------------------*
      *                      * Memorizzo numero protocollo             *
      *                      *-----------------------------------------*
           move      w-sca-fil-rap-tnp
                    (w-sca-fil-rap-c03)    to  w-sca-fil-rap-wrn
                                              (w-sca-fil-rap-c02)     .
      *                      *-----------------------------------------*
      *                      * Se non e' l'ultimo elemento : riciclo   *
      *                      *-----------------------------------------*
           if        w-sca-fil-rap-c02    <    7
                     go to sca-fil-rap-620.
      *                      *-----------------------------------------*
      *                      * Incremento indice per gruppo di 7 pro-  *
      *                      * tocolli                                 *
      *                      *-----------------------------------------*
           add       1                    to   w-sca-fil-rap-c01      .
      *                      *-----------------------------------------*
      *                      * Scrittura variabile di i.p.c. per il    *
      *                      * gruppo di 7 protocolli                  *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "prt-orc"            to   w-sca-fil-rap-wn0      .
           move      w-sca-fil-rap-c01    to   w-sca-fil-rap-wn9      .
           move      w-sca-fil-rap-wnv    to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      80                   to   s-car                  .
           move      w-sca-fil-rap-wrl    to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Inizializzazione indice 1..7 per gruppo *
      *                      * di numeri protocollo                    *
      *                      *-----------------------------------------*
           move      zero                 to   w-sca-fil-rap-c02      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     sca-fil-rap-620.
       sca-fil-rap-640.
      *                      *-----------------------------------------*
      *                      * Se l' indice 1..7 per gruppo di numeri  *
      *                      * protocollo e' a zero : no scrittura del *
      *                      * record finale in sospeso                *
      *                      *-----------------------------------------*
           if        w-sca-fil-rap-c02    =    zero
                     go to sca-fil-rap-660.
      *                      *-----------------------------------------*
      *                      * Incremento indice per gruppo di 7 pro-  *
      *                      * tocolli                                 *
      *                      *-----------------------------------------*
           add       1                    to   w-sca-fil-rap-c01      .
      *                      *-----------------------------------------*
      *                      * Scrittura variabile di i.p.c. per il    *
      *                      * gruppo di 7 protocolli                  *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "prt-orc"            to   w-sca-fil-rap-wn0      .
           move      w-sca-fil-rap-c01    to   w-sca-fil-rap-wn9      .
           move      w-sca-fil-rap-wnv    to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      80                   to   s-car                  .
           move      w-sca-fil-rap-wrl    to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       sca-fil-rap-660.
      *                  *---------------------------------------------*
      *                  * Scrittura variabile di i.p.c. per Si/No     *
      *                  * stampa ordini di spedizione generati        *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "snx-stp"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      01                   to   s-car                  .
           if        w-cnt-mst-flg        =    spaces
                     move  "N"            to   s-alf
           else      move  "S"            to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Scrittura variabile di i.p.c. per data e-   *
      *                  * missione ordini di spedizione               *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "dat-emi"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "D"                  to   s-tip                  .
           move      w-tes-dat-emi        to   s-dat                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Scrittura variabile di i.p.c. per data con- *
      *                  * segna richiesta massima                     *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "dcn-ric"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "D"                  to   s-tip                  .
           move      w-tes-dcr-max        to   s-dat                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Scrittura variabile di i.p.c. per tipo di   *
      *                  * ordine spedizione da generare               *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "tmo-ods"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      05                   to   s-car                  .
           move      w-tes-tmo-ods        to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       sca-fil-rap-700.
      *                  *---------------------------------------------*
      *                  * Richiamo del programma di generazione       *
      *                  *---------------------------------------------*
           move      "pgm/ods/prg/obj/pods4000"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
      *                  *---------------------------------------------*
      *                  * Cancellazione del programma di generazione  *
      *                  *---------------------------------------------*
           cancel    s-pat                                            .
       sca-fil-rap-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     sca-fil-rap-999.
       sca-fil-rap-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [cli]                         *
      *    *-----------------------------------------------------------*
       let-arc-cli-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cli-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice cliente a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-cli-cod    =    zero
                     go to let-arc-cli-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-let-arc-cli-cod    to   rf-cli-cod-cli         .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-cli-400.
       let-arc-cli-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-cli-rag-soc       to   w-let-arc-cli-rag      .
           move      rf-cli-via-cli       to   w-let-arc-cli-via      .
           move      rf-cli-loc-cli       to   w-let-arc-cli-loc      .
           move      rf-cli-cod-cge       to   w-let-arc-cli-cge      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-cli-999.
       let-arc-cli-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-cli-flg      .
           move      all   "."            to   w-let-arc-cli-rag      .
           go to     let-arc-cli-600.
       let-arc-cli-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cli-rag      .
       let-arc-cli-600.
           move      spaces               to   w-let-arc-cli-via      .
           move      spaces               to   w-let-arc-cli-loc      .
           move      zero                 to   w-let-arc-cli-cge      .
       let-arc-cli-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio dipendenza cliente in [dcc]      *
      *    *-----------------------------------------------------------*
       let-arc-dcc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice cliente a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-cod    =    zero
                     go to let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a spaces, solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-dpz    =    spaces and
                     w-let-arc-dcc-tle    =    "D"
                     go to let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a "*   ", solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-dpz    =    "*   " and
                     w-let-arc-dcc-tle    =    "D"
                     go to let-arc-dcc-450.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-let-arc-dcc-cod    to   rf-dcc-cod-cli         .
           move      w-let-arc-dcc-dpz    to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcc-400.
       let-arc-dcc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcc-rag-soc       to   w-let-arc-dcc-rag      .
           move      rf-dcc-via-dcc       to   w-let-arc-dcc-via      .
           move      rf-dcc-loc-dcc       to   w-let-arc-dcc-loc      .
           move      rf-dcc-cod-abi       to   w-let-arc-dcc-abi      .
           move      rf-dcc-cod-cab       to   w-let-arc-dcc-cab      .
           move      rf-dcc-fco-blo       to   w-let-arc-dcc-blo      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcc-999.
       let-arc-dcc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcc-flg      .
           move      all   "."            to   w-let-arc-dcc-rag      .
           go to     let-arc-dcc-600.
       let-arc-dcc-450.
      *              *-------------------------------------------------*
      *              * Normalizzazione per codice dipendenza "*   "    *
      *              *-------------------------------------------------*
           move      "Sia la sede che tutte le dipendenze     "
                                          to   w-let-arc-dcc-rag      .
           go to     let-arc-dcc-600.
       let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-rag      .
       let-arc-dcc-600.
           move      spaces               to   w-let-arc-dcc-via      .
           move      spaces               to   w-let-arc-dcc-loc      .
           move      zero                 to   w-let-arc-dcc-abi      .
           move      zero                 to   w-let-arc-dcc-cab      .
           move      zero                 to   w-let-arc-dcc-blo      .
       let-arc-dcc-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [zoc]                         *
      *    *-----------------------------------------------------------*
       let-arc-zoc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zoc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spazi                          *
      *              *-------------------------------------------------*
           if        w-let-arc-zoc-cod    =    spaces
                     go to let-arc-zoc-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODTOC"             to   f-key                  .
           move      w-let-arc-zoc-cod    to   rf-zoc-cod-toc         .
           move      "pgm/orc/fls/ioc/obj/iofzoc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zoc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zoc-400.
       let-arc-zoc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zoc-des-toc       to   w-let-arc-zoc-des      .
           move      rf-zoc-vld-dpz       to   w-let-arc-zoc-vld      .
           move      rf-zoc-cod-dpz       to   w-let-arc-zoc-dpz      .
           move      rf-zoc-org-doc       to   w-let-arc-zoc-ord      .
           move      rf-zoc-prv-doc       to   w-let-arc-zoc-prd      .
           move      rf-zoc-sgl-num       to   w-let-arc-zoc-sgl      .
           move      rf-zoc-def-tpr       to   w-let-arc-zoc-dtr      .
           move      rf-zoc-tip-ord       to   w-let-arc-zoc-tip      .
           move      rf-zoc-def-fds       to   w-let-arc-zoc-dds      .
           move      rf-zoc-def-tar       to   w-let-arc-zoc-tar      .
      *              *-------------------------------------------------*
      *              * Normalizzazione valori                          *
      *              *-------------------------------------------------*
           if        rf-zoc-def-fds       not  numeric
                     move  zero           to   w-let-arc-zoc-dds      .
      *
           if        rf-zoc-def-tar       =    spaces
                     move  "C"            to   w-let-arc-zoc-tar      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zoc-999.
       let-arc-zoc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zoc-flg      .
           move      all   "."            to   w-let-arc-zoc-des      .
           go to     let-arc-zoc-600.
       let-arc-zoc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zoc-des      .
       let-arc-zoc-600.
           move      spaces               to   w-let-arc-zoc-des      .
           move      zero                 to   w-let-arc-zoc-vld      .
           move      zero                 to   w-let-arc-zoc-dpz      .
           move      zero                 to   w-let-arc-zoc-ord      .
           move      zero                 to   w-let-arc-zoc-prd      .
           move      spaces               to   w-let-arc-zoc-sgl      .
           move      spaces               to   w-let-arc-zoc-dtr      .
           move      spaces               to   w-let-arc-zoc-tip      .
           move      zero                 to   w-let-arc-zoc-dds      .
           move      spaces               to   w-let-arc-zoc-tar      .
       let-arc-zoc-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [zsc]                         *
      *    *-----------------------------------------------------------*
       let-arc-zsc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zsc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spazi                          *
      *              *-------------------------------------------------*
           if        w-let-arc-zsc-cod    =    spaces
                     go to let-arc-zsc-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODTMS"             to   f-key                  .
           move      w-let-arc-zsc-cod    to   rf-zsc-cod-tos         .
           move      "pgm/ods/fls/ioc/obj/iofzsc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zsc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zsc-400.
       let-arc-zsc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zsc-des-tos       to   w-let-arc-zsc-des      .
           move      rf-zsc-vld-dpz       to   w-let-arc-zsc-vld      .
           move      rf-zsc-cod-dpz       to   w-let-arc-zsc-dpz      .
           move      rf-zsc-mov-afd       to   w-let-arc-zsc-maf      .
           move      rf-zsc-def-tmf       to   w-let-arc-zsc-dmf      .
           move      rf-zsc-tip-arc       to   w-let-arc-zsc-tar      .
           move      rf-zsc-def-tpr       to   w-let-arc-zsc-dtr      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zsc-999.
       let-arc-zsc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zsc-flg      .
           move      all   "."            to   w-let-arc-zsc-des      .
           go to     let-arc-zsc-600.
       let-arc-zsc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zsc-des      .
       let-arc-zsc-600.
           move      zero                 to   w-let-arc-zsc-vld      .
           move      zero                 to   w-let-arc-zsc-dpz      .
           move      zero                 to   w-let-arc-zsc-maf      .
           move      spaces               to   w-let-arc-zsc-dmf      .
           move      spaces               to   w-let-arc-zsc-tar      .
           move      spaces               to   w-let-arc-zsc-dtr      .
       let-arc-zsc-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [ocx]                         *
      *    *-----------------------------------------------------------*
       let-arc-ocx-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-ocx-flg      .
      *              *-------------------------------------------------*
      *              * Test se codici nulli                            *
      *              *-------------------------------------------------*
           if        w-let-arc-ocx-prt    =    zero   or
                     w-let-arc-ocx-prg    =    zero   or
                     w-let-arc-ocx-trc    =    zero
                     go to let-arc-ocx-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-let-arc-ocx-prt    to   rf-ocx-num-prt         .
           move      w-let-arc-ocx-prg    to   rf-ocx-num-prg         .
           move      w-let-arc-ocx-trc    to   rf-ocx-tip-rec         .
           move      "pgm/orc/fls/ioc/obj/iofocx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocx                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-ocx-400.
       let-arc-ocx-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-ocx-des-400       to   w-let-arc-ocx-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-ocx-999.
       let-arc-ocx-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-ocx-flg      .
           move      spaces               to   w-let-arc-ocx-des      .
           move      all   "."            to   w-let-arc-ocx-drg (1)  .
           go to     let-arc-ocx-999.
       let-arc-ocx-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-ocx-des      .
       let-arc-ocx-999.
           exit.

      *    *===========================================================*
      *    * Determinazione descrizione in riga ordine                 *
      *    *-----------------------------------------------------------*
       det-des-rig-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di estensione   *
      *              *-------------------------------------------------*
           if        rf-ocr-des-ext       =    0
                     go to det-des-rig-100
           else if   rf-ocr-des-ext       =    1
                     go to det-des-rig-200
           else if   rf-ocr-des-ext       =    2
                     go to det-des-rig-300.
       det-des-rig-100.
      *              *-------------------------------------------------*
      *              * Se nessuna estensione : bufferizzazione descri- *
      *              * zione contenuta nel record [ocr]                *
      *              *-------------------------------------------------*
           move      rf-ocr-des-rig       to   w-det-des-rig-des      .
           go to     det-des-rig-999.
       det-des-rig-200.
      *              *-------------------------------------------------*
      *              * Se estensione nel file [ocx]                    *
      *              *-------------------------------------------------*
           move      rf-ocr-num-prt       to   w-let-arc-ocx-prt      .
           move      rf-ocr-num-prg       to   w-let-arc-ocx-prg      .
           move      11                   to   w-let-arc-ocx-trc      .
           perform   let-arc-ocx-000      thru let-arc-ocx-999        .
           move      w-let-arc-ocx-des    to   w-det-des-rig-des      .
           go to     det-des-rig-999.
       det-des-rig-300.
      *              *-------------------------------------------------*
      *              * Se estensione nel file [pdx]                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcp]                      *
      *                  *---------------------------------------------*
           move      rf-ocr-num-pro       to   w-let-dcp-pdx-cod      .
           move      "C"                  to   w-let-dcp-pdx-tar      .
           move      rf-ocr-cod-arc       to   w-let-dcp-pdx-arc      .
           move      rf-ocr-cod-lng       to   w-let-dcp-pdx-lng      .
           perform   let-dcp-pdx-000      thru let-dcp-pdx-999        .
           move      w-let-dcp-pdx-des    to   w-det-des-rig-des      .
           go to     det-des-rig-999.
       det-des-rig-999.
           exit.

      *    *===========================================================*
      *    * Determinazione prezzo sottoposto a legame valutario       *
      *    *-----------------------------------------------------------*
       det-prz-lvl-000.
      *              *-------------------------------------------------*
      *              * Controllo esistenza parametri                   *
      *              *-------------------------------------------------*
           if        w-det-prz-lvl-svl    =    spaces or
                     w-det-prz-lvl-prz    =    zero   or
                     w-det-prz-lvl-ccr    =    zero   or
                     w-det-prz-lvl-cdc    =    zero
                     go to det-prz-lvl-999.
           if        w-det-prz-lvl-plm    =    zero and
                     w-det-prz-lvl-tlm    not  = spaces
                     go to det-prz-lvl-999.
           if       (w-det-prz-lvl-plm    not  = zero  ) and
                    (w-det-prz-lvl-tlm    not  = "T" and
                     w-det-prz-lvl-tlm    not  = "F" and
                     w-det-prz-lvl-tlm    not  = "M"   )
                     go to det-prz-lvl-999.
       det-prz-lvl-050.
      *              *-------------------------------------------------*
      *              * Determinazione valore scostamento rispetto al   *
      *              * cambio di riferimento                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda che esista o meno la   *
      *                  * percentuale di tolleranza                   *
      *                  *---------------------------------------------*
           if        w-det-prz-lvl-plm    =    zero
                     go to det-prz-lvl-052
           else      go to det-prz-lvl-054.
       det-prz-lvl-052.
      *                  *---------------------------------------------*
      *                  * Se percentuale di tolleranza a zero         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * A calcolo nuovo prezzo con tipo di li-  *
      *                      * mitazione : Tolleranza                  *
      *                      *-----------------------------------------*
           go to     det-prz-lvl-120.
       det-prz-lvl-054.
      *                  *---------------------------------------------*
      *                  * Se percentuale di tolleranza esistente      *
      *                  *---------------------------------------------*
           multiply  w-det-prz-lvl-plm    by   w-det-prz-lvl-ccr
                                        giving w-det-prz-lvl-wps      .
           divide    100                  into w-det-prz-lvl-wps      .
           go to     det-prz-lvl-060.
       det-prz-lvl-060.
      *              *-------------------------------------------------*
      *              * Test se esiste uno scostamento in piu'          *
      *              *-------------------------------------------------*
           add       w-det-prz-lvl-wps    to   w-det-prz-lvl-ccr
                                        giving w-det-prz-lvl-wpc      .
           if        w-det-prz-lvl-cdc    >    w-det-prz-lvl-wpc
                     go to det-prz-lvl-100.
      *              *-------------------------------------------------*
      *              * Test se esiste uno scostamento in meno          *
      *              *-------------------------------------------------*
           subtract  w-det-prz-lvl-wps    from w-det-prz-lvl-ccr
                                        giving w-det-prz-lvl-wpc      .
           if        w-det-prz-lvl-cdc    <    w-det-prz-lvl-wpc
                     go to det-prz-lvl-100.
      *              *-------------------------------------------------*
      *              * Uscita con prezzo invariato                     *
      *              *-------------------------------------------------*
           go to     det-prz-lvl-999.
       det-prz-lvl-100.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo limitazione     *
      *              *-------------------------------------------------*
           if        w-det-prz-lvl-tlm    =    "T"
                     go to det-prz-lvl-120
           else if   w-det-prz-lvl-tlm    =    "F"
                     go to det-prz-lvl-140
           else if   w-det-prz-lvl-tlm    =    "M"
                     go to det-prz-lvl-160.
       det-prz-lvl-120.
      *              *-------------------------------------------------*
      *              * Tipo limitazione : Tolleranza                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Calcolo nuovo prezzo                        *
      *                  *---------------------------------------------*
           multiply  w-det-prz-lvl-prz    by   w-det-prz-lvl-cdc
                                        giving w-det-prz-lvl-wpz      .
           divide    w-det-prz-lvl-ccr    into w-det-prz-lvl-wpz
                                               rounded                .
           move      w-det-prz-lvl-wpz    to   w-det-prz-lvl-prz      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-prz-lvl-999.
       det-prz-lvl-140.
      *              *-------------------------------------------------*
      *              * Tipo limitazione : Franchigia                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Calcolo nuovo prezzo                        *
      *                  *---------------------------------------------*
           multiply  w-det-prz-lvl-prz    by   w-det-prz-lvl-cdc
                                        giving w-det-prz-lvl-wpz      .
           divide    w-det-prz-lvl-wpc    into w-det-prz-lvl-wpz
                                               rounded                .
           move      w-det-prz-lvl-wpz    to   w-det-prz-lvl-prz      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-prz-lvl-999.
       det-prz-lvl-160.
      *              *-------------------------------------------------*
      *              * Tipo limitazione : Tetto massimo                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Calcolo nuovo prezzo                        *
      *                  *---------------------------------------------*
           multiply  w-det-prz-lvl-prz    by   w-det-prz-lvl-wpc
                                        giving w-det-prz-lvl-wpz      .
           divide    w-det-prz-lvl-ccr    into w-det-prz-lvl-wpz
                                               rounded                .
           move      w-det-prz-lvl-wpz    to   w-det-prz-lvl-prz      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-prz-lvl-999.
       det-prz-lvl-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [dcp] e [pdx]                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/ldcppdx0.lts"                   .

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Richiamo sottoprogramma per gestione catena righe         *
      *    *-----------------------------------------------------------*
       cll-rlt-sup-000.
           call      "pgm/ods/prg/obj/pods4502"
                                         using w-rlt-sup              .
       cll-rlt-sup-999.
           exit.

      *    *===========================================================*
      *    * Cancellazione sottoprogramma per gestione catena righe    *
      *    *-----------------------------------------------------------*
       cnc-rlt-sup-000.
           cancel    "pgm/ods/prg/obj/pods4502"                       .
       cnc-rlt-sup-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per l'accettazione tipo movimento per ordini  *
      *    * clienti                                                   *
      *    *-----------------------------------------------------------*
           copy      "pgm/orc/prg/cpy/acdezoc0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione tipo movimento per spedi-  *
      *    * zioni clienti                                             *
      *    *-----------------------------------------------------------*
           copy      "pgm/ods/prg/cpy/acdezsc0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione codice cliente commerciale *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmndcc0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione codice dipendenza cliente  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoddcc0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del coefficiente di cambio *
      *    * valuta                                                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoecmb0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

