       Identification division.
       Program-Id.                                 porc6301           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    orc                 *
      *                                Settore:    ass                 *
      *                                   Fase:    orc630              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 18/07/95    *
      *                       Ultima revisione:    NdK del 07/06/22    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione stampa per il programma orc630   *
      *                                                                *
      *                    Lista assegnazioni ordini per cliente       *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Ragione sociale cliente in Uppercase              *
      *            *---------------------------------------------------*
               10  srt-rag-key            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice cliente                                    *
      *            *---------------------------------------------------*
               10  srt-cod-cli            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza cliente                         *
      *            *---------------------------------------------------*
               10  srt-dpz-cli            pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Data ordine                                       *
      *            *---------------------------------------------------*
               10  srt-dat-doc            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero ordine                                     *
      *            *---------------------------------------------------*
               10  srt-num-doc            pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Numero protocollo ordine                          *
      *            *---------------------------------------------------*
               10  srt-num-prt            pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Numero riga ordine                                *
      *            *---------------------------------------------------*
               10  srt-num-prg            pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Sigla valuta per fatturazione                     *
      *            *---------------------------------------------------*
               10  srt-sgl-vpf            pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Decimali valuta per fatturazione                  *
      *            *---------------------------------------------------*
               10  srt-dec-vpf            pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo di cambio valuta per fatturazione            *
      *            *---------------------------------------------------*
               10  srt-tdc-vpf            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Coefficiente di cambio valuta per fatturazione    *
      *            * rilevato alla data ordine                         *
      *            *---------------------------------------------------*
               10  srt-cdc-vpf            pic  9(06)v9(05)            .
      *            *---------------------------------------------------*
      *            * Ragione sociale cliente                           *
      *            *---------------------------------------------------*
               10  srt-rag-soc            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Data ordine cliente                               *
      *            *---------------------------------------------------*
               10  srt-ocl-dat            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero ordine cliente                             *
      *            *---------------------------------------------------*
               10  srt-ocl-num            pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Data di consegna richiesta riga ordine            *
      *            *---------------------------------------------------*
               10  srt-dcn-ric            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data di consegna prevista riga ordine             *
      *            *---------------------------------------------------*
               10  srt-dcn-prv            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Flag di conferma a cliente                        *
      *            *---------------------------------------------------*
               10  srt-flg-cnf            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice prodotto numerico                          *
      *            *---------------------------------------------------*
               10  srt-num-pro            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice prodotto alfanumerico                      *
      *            *---------------------------------------------------*
               10  srt-alf-pro            pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Dscrizione riga ordine                            *
      *            *---------------------------------------------------*
               10  srt-des-rig            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Tipo movimento                                    *
      *            *---------------------------------------------------*
               10  srt-tip-mov            pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Sigla valuta per il prezzo                        *
      *            *---------------------------------------------------*
               10  srt-sgl-vpp            pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Decimali valuta per il prezzo                     *
      *            *---------------------------------------------------*
               10  srt-dec-vpp            pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Decimali per il prezzo                            *
      *            *---------------------------------------------------*
               10  srt-dec-prz            pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Prezzo unitario                                   *
      *            *---------------------------------------------------*
               10  srt-prz-net            pic  9(09)                  .
      *            *---------------------------------------------------*
      *            * Importo residuo riga ordine                       *
      *            *---------------------------------------------------*
               10  srt-imp-res            pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Quantita' ordinata                                *
      *            *---------------------------------------------------*
               10  srt-qta-ord            pic s9(06)v9(03)            .
      *            *---------------------------------------------------*
      *            * Quantita' spedita                                 *
      *            *---------------------------------------------------*
               10  srt-qta-gsp            pic s9(06)v9(03)            .
      *            *---------------------------------------------------*
      *            * Quantita' in spedizione                           *
      *            *---------------------------------------------------*
               10  srt-qta-ics            pic s9(06)v9(03)            .
      *            *---------------------------------------------------*
      *            * Quantita' residua                                 *
      *            *---------------------------------------------------*
               10  srt-qta-dev            pic s9(06)v9(03)            .
      *            *---------------------------------------------------*
      *            * Quantita' assegnata                               *
      *            *---------------------------------------------------*
               10  srt-qta-ass            pic s9(06)v9(03)            .
      *            *---------------------------------------------------*
      *            * Data assegnazione                                 *
      *            *---------------------------------------------------*
               10  srt-dat-ass            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Valuta per l'espressione del legame valutario     *
      *            *---------------------------------------------------*
               10  srt-sgl-vpl            pic  x(03)                  .
               10  srt-dec-vpl            pic  9(01)                  .
               10  srt-tdc-vpl            pic  x(01)                  .
               10  srt-prz-vpl            pic  9(09)                  .
               10  srt-cdc-vpl            pic  9(06)v9(05)            .
               10  srt-ccr-vpl            pic  9(06)v9(05)            .
               10  srt-plm-vpl            pic  9(01)v9(02)            .
               10  srt-tlm-vpl            pic  x(01)                  .
               10  srt-map-vpl            pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "orc"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "ass"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "orc630"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "porc6301"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     " LISTA ASSEGNAZIONI ORDINI PER CLIENTE  "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records logici                                            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [ocr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfocr"                          .
      *        *-------------------------------------------------------*
      *        * [ocx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfocx"                          .
      *        *-------------------------------------------------------*
      *        * [ocp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfocp"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [pdx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfpdx"                          .

      *    *===========================================================*
      *    * Work-area richieste per stampa                            *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Codice dipendenza in uso                              *
      *        *-------------------------------------------------------*
           05  rr-dpz-inu                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice cliente                                        *
      *        *-------------------------------------------------------*
           05  rr-cod-cli                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice cliente, ragione sociale                       *
      *        *-------------------------------------------------------*
           05  rr-cod-cli-rag             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Codice cliente, indirizzo                             *
      *        *-------------------------------------------------------*
           05  rr-cod-cli-via             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Codice cliente, localita'                             *
      *        *-------------------------------------------------------*
           05  rr-cod-cli-loc             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza del cliente                         *
      *        *-------------------------------------------------------*
           05  rr-dpz-cli                 pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza del cliente, ragione sociale        *
      *        *-------------------------------------------------------*
           05  rr-dpz-cli-rag             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza del cliente, indirizzo              *
      *        *-------------------------------------------------------*
           05  rr-dpz-cli-via             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza del cliente, localita'              *
      *        *-------------------------------------------------------*
           05  rr-dpz-cli-loc             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Data emissione minima da ricercare                    *
      *        *-------------------------------------------------------*
           05  rr-dem-min                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Data emissione massima da ricercare                   *
      *        *-------------------------------------------------------*
           05  rr-dem-max                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Data consegna richiesta max                           *
      *        *-------------------------------------------------------*
           05  rr-dcn-ric                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Stato degli ordini                                    *
      *        * - 01 : Solo quelli assegnati                          *
      *        * - 02 : Tutti                                          *
      *        *-------------------------------------------------------*
           05  rr-sts-ass                 pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Tipo funzionamento per generazione ordini di spedi-   *
      *        * zione                                                 *
      *        *-------------------------------------------------------*
           05  w-prs-tfu-gos.
      *            *---------------------------------------------------*
      *            * Tipo funzionamento                                *
      *            *                                                   *
      *            *   - 01 : Assegnazione quantita' da gestione       *
      *            *          ordini clienti                           *
      *            *   - 02 : Assegnazione quantita' da giacenza       *
      *            *---------------------------------------------------*
               10  w-prs-tfu-gos-tip      pic  x(02)                  .

      *    *===========================================================*
      *    * Work-area per routine stp-srt-inp-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-stp-srt-inp.
      *        *-------------------------------------------------------*
      *        * Work per tipo riga                                    *
      *        *-------------------------------------------------------*
           05  w-stp-srt-inp-wtr.
               10  w-stp-srt-inp-wtp      pic  x(01)                  .
               10  w-stp-srt-inp-wtf      pic  x(01)                  .
               10  filler                 pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per prezzi e importi                             *
      *        *-------------------------------------------------------*
           05  w-stp-srt-inp-prz          pic  9(09)                  .
           05  w-stp-srt-inp-imp          pic s9(11)                  .
           05  w-stp-srt-inp-ipr          pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Work per quantita' assegnata                          *
      *        *-------------------------------------------------------*
           05  w-stp-srt-inp-qta          pic s9(08)v9(03)            .
           05  w-stp-srt-inp-dat          pic  9(07)                  .

      *    *===========================================================*
      *    * Work-area per determinazioni                              *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det descrizione riga ordine                  *
      *        *-------------------------------------------------------*
           05  w-det-des-rig.
               10  w-det-des-rig-des      pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per routine prn-ini-lr2-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-prn-ini-lr2.
           05  w-prn-ini-lr2-x63          pic  x(63)                  .
           05  w-prn-ini-lr2-pnt          pic  9(02)                  .
           05  w-prn-ini-lr2-ctr          pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per routine prn-ini-lr1-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-prn-ini-lr1.
           05  w-prn-ini-lr1-x55          pic  x(55)                  .
           05  w-prn-ini-lr1-pnt          pic  9(02)                  .
           05  w-prn-ini-lr1-ctr          pic  9(02)                  .

      *    *===========================================================*
      *    * Work area totali                                          *
      *    *-----------------------------------------------------------*
       01  w-tot.
      *        *-------------------------------------------------------*
      *        * Work per totale generale                              *
      *        *-------------------------------------------------------*
           05  w-tot-gen.
               10  w-tot-gen-cli          pic  9(05)                  .
               10  w-tot-gen-tiv          pic s9(11)                  .
               10  w-tot-gen-tot          pic s9(11)                  .
               10  w-tot-gen-vpf          pic  x(03)                  .
               10  w-tot-gen-dpf          pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per totale cliente                               *
      *        *-------------------------------------------------------*
           05  w-tot-cli.
               10  w-tot-cli-ord          pic  9(05)                  .
               10  w-tot-cli-tiv          pic s9(11)                  .
               10  w-tot-cli-tot          pic s9(11)                  .
               10  w-tot-cli-vpf          pic  x(03)                  .
               10  w-tot-cli-dpf          pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per totale ordine                                *
      *        *-------------------------------------------------------*
           05  w-tot-ord.
               10  w-tot-ord-nrg          pic  9(05)                  .
               10  w-tot-ord-tiv          pic s9(11)                  .
               10  w-tot-ord-tot          pic s9(11)                  .
               10  w-tot-ord-vpf          pic  x(03)                  .
               10  w-tot-ord-dpf          pic  9(01)                  .

      *    *===========================================================*
      *    * Work area generica                                        *
      *    *-----------------------------------------------------------*
       01  w-wrk.
           05  w-wrk-num-011              pic  9(11)                  .
           05  w-wrk-num-011-r redefines
               w-wrk-num-011                                          .
               10  w-wrk-num-011-saa      pic  9(03)                  .
               10  w-wrk-num-011-dpz      pic  9(02)                  .
               10  w-wrk-num-011-prg      pic  9(06)                  .

      *    *===========================================================*
      *    * Work-area per routine stp-val-tot-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-stp-val-tot.
           05  w-stp-val-tot-pmt          pic  x(16)                  .
           05  w-stp-val-tot-vlt          pic  x(03)                  .
           05  w-stp-val-tot-dcv          pic  9(01)                  .
           05  w-stp-val-tot-tot          pic s9(11)                  .
           05  w-stp-val-tot-tiv          pic s9(11)                  .
           05  w-stp-val-tot-x60          pic  x(60)                  .
           05  w-stp-val-tot-pnt          pic  9(02)                  .
           05  w-stp-val-tot-ctr          pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per stampa corpo documento                      *
      *    *-----------------------------------------------------------*
       01  w-stp-cor-doc.
      *        *-------------------------------------------------------*
      *        * Comodo per stringa contenente legame valutario        *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-x40          pic  x(40)                  .
           05  w-stp-cor-doc-pnt          pic  9(03)                  .

      *    *===========================================================*
      *    * Link-area per accettazione coefficiente cambio valuta     *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoecmb0.acl"                   .

      *    *===========================================================*
      *    * Work-area per conversioni rispetto alla valuta base       *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wcvsvlt0.cpw"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione quantita' da e-  *
      *    * vadere riga ordine cliente                                *
      *    *-----------------------------------------------------------*
           copy      "pgm/orc/prg/cpy/dqevroc0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione saldi magazzino  *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldmag0.dtl"                   .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
      *            *---------------------------------------------------*
      *            * Codice cliente                                    *
      *            *---------------------------------------------------*
               10  w-rot-l02-cod-cli      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza cliente                         *
      *            *---------------------------------------------------*
               10  w-rot-l02-dpz-cli      pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
      *            *---------------------------------------------------*
      *            * Protocollo documento                              *
      *            *---------------------------------------------------*
               10  w-rot-l01-num-prt      pic  9(11)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Elaborazioni preliminari su aree titolo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area nome azienda  *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-cnt-tit-des-azi      .
           move      40                   to   w-cnt-tit-ctr-azi      .
       int-pag-std-100.
           if        w-cnt-tit-chr-azi
                    (w-cnt-tit-ctr-azi)   =    spaces
                     if     w-cnt-tit-ctr-azi
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-azi
                            go to     int-pag-std-100.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza titolo stampato    *
      *                  *---------------------------------------------*
           move      80                   to   w-cnt-tit-ctr-tit      .
       int-pag-std-200.
           if        w-cnt-tit-chr-tit
                    (w-cnt-tit-ctr-tit)   =    spaces
                     if     w-cnt-tit-ctr-tit
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-tit
                            go to     int-pag-std-200.
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale titolo    *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-tit      .
           subtract  w-cnt-tit-ctr-tit    from w-cnt-tit-pos-tit      .
           divide    2                    into w-cnt-tit-pos-tit      .
           add       1                    to   w-cnt-tit-pos-tit      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area data e pagina *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-pag    =    zero
                     move  4              to   w-cnt-tit-ctr-wrk
                     go to int-pag-std-300.
           move      zero                 to   w-cnt-tit-ctr-wrk      .
           inspect   w-cnt-tit-num-pag
                                      tallying w-cnt-tit-ctr-wrk
                                   for leading "0"                    .
       int-pag-std-300.
           subtract  w-cnt-tit-ctr-wrk    from 27
                                        giving w-cnt-tit-ctr-dep      .
           subtract  w-cnt-tit-ctr-wrk    from 5
                                        giving w-cnt-tit-ctr-cif      .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale data e p. *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-dep      .
           subtract  w-cnt-tit-ctr-dep    from w-cnt-tit-pos-dep      .
           add       1                    to   w-cnt-tit-pos-dep      .
      *                  *---------------------------------------------*
      *                  * Determinazione se titolo su una o due linee *
      *                  *---------------------------------------------*
           move      w-cnt-tit-ctr-azi    to   w-cnt-tit-ctr-wrk      .
           add       2                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-tit
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      w-cnt-tit-pos-tit    to   w-cnt-tit-ctr-wrk      .
           add       w-cnt-tit-ctr-tit    to   w-cnt-tit-ctr-wrk      .
           add       1                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-dep
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      1                    to   w-cnt-tit-num-lin      .
       int-pag-std-500.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome azienda                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-azi    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-cnt-tit-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-lin    =    2
                     go to int-pag-std-600.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-600.
      *                  *---------------------------------------------*
      *                  * Literal per Data                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           move      "Data :"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       7                    to   p-pos                  .
           move      w-cnt-tit-dat-stp    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal per Pag.                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       17                   to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      w-cnt-tit-ctr-cif    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       22                   to   p-pos                  .
           move      w-cnt-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea titolo                            *
      *              *-------------------------------------------------*
           if        w-cnt-tit-num-lin    not  = 2
                     go to int-pag-std-900.
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-900.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo funzionamento generazione ordini di    *
      *                  * spedizione                                  *
      *                  *---------------------------------------------*
           perform   prs-tfu-gos-000      thru prs-tfu-gos-999        .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura delle personalizzazioni relative al tipo di fun-  *
      *    * zionamento generazione ordini di spedizione               *
      *    *-----------------------------------------------------------*
       prs-tfu-gos-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/ods/gen[tfu-gos]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Se personalizzazione esistente si spostano i    *
      *              * valori letti in area di destinazione, altri-    *
      *              * menti si normalizza l'area di destinazione      *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-tfu-gos-tip
           else      move  spaces         to   w-prs-tfu-gos-tip      .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-tfu-gos-tip    not  = "01" and
                     w-prs-tfu-gos-tip    not  = "02"
                     move  "01"           to   w-prs-tfu-gos-tip      .
       prs-tfu-gos-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [ocr]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *              *-------------------------------------------------*
      *              * [ocx]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocx                 .
      *              *-------------------------------------------------*
      *              * [ocp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [pdx]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione coefficiente di cambio *
      *              * valuta                                          *
      *              *-------------------------------------------------*
           perform   coe-cmb-vlt-opn-000  thru coe-cmb-vlt-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione quantita' da e-   *
      *              * vadere riga ordine                              *
      *              *-------------------------------------------------*
           perform   det-qev-roc-opn-000  thru det-qev-roc-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione saldo di magazz.  *
      *              *-------------------------------------------------*
           perform   det-sld-mag-opn-000  thru det-sld-mag-opn-999    .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [ocr]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *              *-------------------------------------------------*
      *              * [ocx]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocx                 .
      *              *-------------------------------------------------*
      *              * [ocp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [pdx]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione coefficiente di cam-  *
      *              * bio valuta                                      *
      *              *-------------------------------------------------*
           perform   coe-cmb-vlt-cls-000  thru coe-cmb-vlt-cls-999    .
       prn-cls-fls-800.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione quantita' da e-  *
      *              * vadere riga ordine                              *
      *              *-------------------------------------------------*
           perform   det-qev-roc-cls-000  thru det-qev-roc-cls-999    .
       prn-cls-fls-820.
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione saldo di magazz. *
      *              *-------------------------------------------------*
           perform   det-sld-mag-cls-000  thru det-sld-mag-cls-999    .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : Si'                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-exe-rou-srt      .
      *              *-------------------------------------------------*
      *              * Esecuzione sort                                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   prn-rou-pri-000
                                          thru prn-rou-pri-999        .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Start su file [ocr]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "RCHARC    "         to   f-key                  .
           move      rr-dpz-inu           to   rf-ocr-cod-dpz         .
           move      spaces               to   rf-ocr-flg-rch         .
           move      "C"                  to   rf-ocr-tip-arc         .
           move      rr-cod-cli           to   rf-ocr-cod-arc         .
           move      zero                 to   rf-ocr-num-prt         .
           move      zero                 to   rf-ocr-num-prg         .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-999.
       stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale record [ocr]                *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-999.
       stp-srt-inp-110.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
       stp-srt-inp-120.
      *                  *---------------------------------------------*
      *                  * Test su codice dipendenza                   *
      *                  *---------------------------------------------*
           if        rf-ocr-cod-dpz       not  = rr-dpz-inu
                     go to stp-srt-inp-999.
       stp-srt-inp-125.
      *                  *---------------------------------------------*
      *                  * Test su flag di riga ordine chiusa          *
      *                  *---------------------------------------------*
           if        rf-ocr-flg-rch       not  = spaces
                     go to stp-srt-inp-999.
       stp-srt-inp-130.
      *                  *---------------------------------------------*
      *                  * Test su tipo e codice archivio              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su tipo archivio                   *
      *                      *-----------------------------------------*
           if        rf-ocr-tip-arc       not  = "C"
                     go to stp-srt-inp-999.
      *                      *-----------------------------------------*
      *                      * Test su codice archivio                 *
      *                      *-----------------------------------------*
           if        rr-cod-cli           not  = zero   and
                     rf-ocr-cod-arc       not  = rr-cod-cli
                     go to stp-srt-inp-999.
       stp-srt-inp-140.
      *              *-------------------------------------------------*
      *              * Selezione sul record                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Selezione su tipi ordine                    *
      *                  *                                             *
      *                  * Solo ordini normali                         *
      *                  *---------------------------------------------*
           if        rf-ocr-tip-ord       not  = spaces
                     go to stp-srt-inp-100.
      *                  *---------------------------------------------*
      *                  * Selezione su codice dipendenza del cliente  *
      *                  *---------------------------------------------*
           if        rr-cod-cli           =    zero
                     go to stp-srt-inp-142.
           if        rr-dpz-cli           =    "*    "
                     go to stp-srt-inp-142.
           if        rf-ocr-dpz-arc       not  = rr-dpz-cli
                     go to stp-srt-inp-100.
       stp-srt-inp-142.
      *                  *---------------------------------------------*
      *                  * Selezione su data emissione minima          *
      *                  *---------------------------------------------*
           if        rf-ocr-dat-doc       <    rr-dem-min
                     go to stp-srt-inp-100.
      *                  *---------------------------------------------*
      *                  * Selezione su data emissione massima         *
      *                  *---------------------------------------------*
           if        rf-ocr-dat-doc       >    rr-dem-max
                     go to stp-srt-inp-100.
      *                  *---------------------------------------------*
      *                  * Selezione su data consegna richiesta max    *
      *                  *---------------------------------------------*
           if        rr-dcn-ric           =    zero
                     go to stp-srt-inp-150.
           if        rf-ocr-dcn-ric       >    rr-dcn-ric
                     go to stp-srt-inp-100.
       stp-srt-inp-150.
      *                  *---------------------------------------------*
      *                  * Selezione su tipo riga                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo riga in comodo ridefinito          *
      *                      *-----------------------------------------*
           move      rf-ocr-tip-rig       to   w-stp-srt-inp-wtr      .
      *                      *-----------------------------------------*
      *                      * Se tipo riga 'C' o 'A' : riciclo        *
      *                      *-----------------------------------------*
           if        w-stp-srt-inp-wtp    =    "C" or
                     w-stp-srt-inp-wtp    =    "A"
                     go to stp-srt-inp-100.
       stp-srt-inp-220.
      *                  *---------------------------------------------*
      *                  * Selezione sulla quantita' ancora da evadere *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Determinazione quantita' evasa riga or- *
      *                      * dine cliente                            *
      *                      *-----------------------------------------*
           move      "DT"                 to   d-qev-roc-tip-ope      .
           perform   det-qev-roc-cll-000  thru det-qev-roc-cll-999    .
      *                          *-------------------------------------*
      *                          * Se quantita' ancora da evadere a    *
      *                          * zero : riciclo                      *
      *                          *-------------------------------------*
           if        d-qev-roc-qta-dev    =    zero
                     go to stp-srt-inp-100.
       stp-srt-inp-230.
      *                  *---------------------------------------------*
      *                  * Selezione sulla quantita' assegnata         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione quantita' assegnata     *
      *                      *-----------------------------------------*
           move      zero                 to   w-stp-srt-inp-qta      .
      *                      *-----------------------------------------*
      *                      * Normalizzazione data assegnazione       *
      *                      *-----------------------------------------*
           move      zero                 to   w-stp-srt-inp-dat      .
      *                      *-----------------------------------------*
      *                      * Lettura record [ocp]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      rf-ocr-num-prt       to   rf-ocp-num-prt         .
           move      rf-ocr-num-prg       to   rf-ocp-num-prg         .
           move      001                  to   rf-ocp-prg-frm         .
           move      "pgm/orc/fls/ioc/obj/iofocp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocp                 .
      *                      *-----------------------------------------*
      *                      * Test su esito operazione                *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-240.
      *                      *-----------------------------------------*
      *                      * Test se assegnazione alla giacenza      *
      *                      *-----------------------------------------*
           if        rf-ocp-dat-ass       not  = zero
                     go to stp-srt-inp-240.
      *                      *-----------------------------------------*
      *                      * Bufferizzazione quantita' assegnata     *
      *                      *-----------------------------------------*
           move      rf-ocp-qta-ass       to   w-stp-srt-inp-qta      .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione data assegnazione       *
      *                      *-----------------------------------------*
           move      rf-ocp-dat-ass       to   w-stp-srt-inp-dat      .
       stp-srt-inp-240.
      *                      *-----------------------------------------*
      *                      * Test sulla quantita' assegnata          *
      *                      *-----------------------------------------*
           if        rr-sts-ass           not  = 01
                     go to stp-srt-inp-260.
           if        w-stp-srt-inp-qta    =    zero
                     go to stp-srt-inp-100.
       stp-srt-inp-260.
      *              *-------------------------------------------------*
      *              * Fine selezioni sul record                       *
      *              *-------------------------------------------------*
       stp-srt-inp-300.
      *              *-------------------------------------------------*
      *              * Raccolta dati cliente                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [dcc]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [dcc]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-ocr-cod-arc       to   rf-dcc-cod-cli         .
           move      rf-ocr-dpz-arc       to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
           if        f-sts                not  = e-not-err
                     move  all "."        to   rf-dcc-rag-soc         .
       stp-srt-inp-310.
      *              *-------------------------------------------------*
      *              * Determinazione descrizione riga ordine          *
      *              *-------------------------------------------------*
           perform   det-des-rig-000      thru det-des-rig-999        .
       stp-srt-inp-315.
      *              *-------------------------------------------------*
      *              * Determinazione prezzo unitario                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se tipo riga 'A' : oltre                    *
      *                  *---------------------------------------------*
           if        w-stp-srt-inp-wtp    =    "A"
                     move  zero           to   w-stp-srt-inp-prz
                     go to stp-srt-inp-320.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione prezzo netto contenuto nel  *
      *                  * record                                      *
      *                  *---------------------------------------------*
           move      rf-ocr-prz-net       to   w-stp-srt-inp-prz      .
       stp-srt-inp-320.
      *              *-------------------------------------------------*
      *              * Determinazione importo residuo nella valuta di  *
      *              * fatturazione                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se tipo riga 'A'                            *
      *                  *---------------------------------------------*
           if        w-stp-srt-inp-wtp    =    "A"
                     move  rf-ocr-imp-rig to   w-stp-srt-inp-ipr
                     go to stp-srt-inp-340.
      *                  *---------------------------------------------*
      *                  * Se altro tipo riga                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione dello stato de-  *
      *                      * gli ordini richiesto                    *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-321
                     stp-srt-inp-322
                     stp-srt-inp-323
                     stp-srt-inp-324
                     depending            on   rr-sts-ass             .
       stp-srt-inp-321.
      *                      *-----------------------------------------*
      *                      * Se solo ordini da evadere               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * (q.ta' da evadere x prezzo netto)   *
      *                          *-------------------------------------*
           multiply  d-qev-roc-qta-dev    by   w-stp-srt-inp-prz
                                        giving w-stp-srt-inp-ipr      .
           go to     stp-srt-inp-330.
       stp-srt-inp-322.
      *                      *-----------------------------------------*
      *                      * Se solo ordini in spedizione            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * (q.ta' in spediz. x prezzo netto)   *
      *                          *-------------------------------------*
           multiply  d-qev-roc-qta-ics    by   w-stp-srt-inp-prz
                                        giving w-stp-srt-inp-ipr      .
           go to     stp-srt-inp-330.
       stp-srt-inp-323.
      *                      *-----------------------------------------*
      *                      * Se solo ordini gia' evasi               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * (q.ta' spedita x prezzo netto)      *
      *                          *-------------------------------------*
           multiply  d-qev-roc-qta-gsp    by   w-stp-srt-inp-prz
                                        giving w-stp-srt-inp-ipr      .
           go to     stp-srt-inp-330.
       stp-srt-inp-324.
      *                      *-----------------------------------------*
      *                      * Se tutti gli ordini                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * (q.ta' ordinata x prezzo netto)     *
      *                          *-------------------------------------*
           multiply  d-qev-roc-qta-ord    by   w-stp-srt-inp-prz
                                        giving w-stp-srt-inp-ipr      .
           go to     stp-srt-inp-330.
       stp-srt-inp-330.
      *                      *-----------------------------------------*
      *                      * Eventuale aggiustamento con decimali    *
      *                      * prezzo                                  *
      *                      *-----------------------------------------*
           if        rf-ocr-dec-prz       =    1
                     divide 10            into w-stp-srt-inp-ipr
           else if   rf-ocr-dec-prz       =    2
                     divide 100           into w-stp-srt-inp-ipr      .
      *                      *-----------------------------------------*
      *                      * Eventuale conversione nella valuta di   *
      *                      * fatturazione                            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se necessario                  *
      *                          *-------------------------------------*
           if        rf-ocr-sgl-vpp       =    rf-ocr-sgl-vpf
                     go to stp-srt-inp-340.
      *                          *-------------------------------------*
      *                          * Determinazione coefficiente di cam- *
      *                          * bio alla data attuale per la valu-  *
      *                          * ta per il prezzo                    *
      *                          *-------------------------------------*
           move      "CC"                 to   w-coe-cmb-vlt-ope      .
           move      rf-ocr-sgl-vpp       to   w-coe-cmb-vlt-sdv      .
           move      rf-ocr-tdc-vpp       to   w-coe-cmb-vlt-tdc      .
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-coe-cmb-vlt-drc      .
           move      00                   to   w-coe-cmb-vlt-quc      .
           perform   coe-cmb-vlt-cll-000  thru coe-cmb-vlt-cll-999    .
      *                          *-------------------------------------*
      *                          * Se esito determinazione negativo si *
      *                          * considera il coefficiente rilevato  *
      *                          * alla data ordine                    *
      *                          *-------------------------------------*
           if        w-coe-cmb-vlt-ope    not  = "CC"
                     move  rf-ocr-cdc-vpp to   w-coe-cmb-vlt-cdc      .
      *                          *-------------------------------------*
      *                          * Conversione importo da valuta per   *
      *                          * il prezzo a valuta base             *
      *                          *-------------------------------------*
           move      rf-ocr-sgl-vpp       to   w-cvs-vlt-sgl          .
           move      rf-ocr-dec-vpp       to   w-cvs-vlt-dec          .
           move      rf-ocr-tdc-vpp       to   w-cvs-vlt-tdc          .
           move      w-coe-cmb-vlt-cdc    to   w-cvs-vlt-cdc          .
           move      w-stp-srt-inp-ipr    to   w-cvs-vlt-aav          .
           perform   cvs-alt-vlb-000      thru cvs-alt-vlb-999        .
      *                          *-------------------------------------*
      *                          * Determinazione coefficiente di cam- *
      *                          * bio alla data attuale per la valu-  *
      *                          * ta per fatturazione                 *
      *                          *-------------------------------------*
           move      "CC"                 to   w-coe-cmb-vlt-ope      .
           move      rf-ocr-sgl-vpf       to   w-coe-cmb-vlt-sdv      .
           move      rf-ocr-tdc-vpf       to   w-coe-cmb-vlt-tdc      .
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-coe-cmb-vlt-drc      .
           move      00                   to   w-coe-cmb-vlt-quc      .
           perform   coe-cmb-vlt-cll-000  thru coe-cmb-vlt-cll-999    .
      *                          *-------------------------------------*
      *                          * Se esito determinazione negativo si *
      *                          * considera il coefficiente rilevato  *
      *                          * alla data ordine                    *
      *                          *-------------------------------------*
           if        w-coe-cmb-vlt-ope    not  = "CC"
                     move  rf-ocr-cdc-vpf to   w-coe-cmb-vlt-cdc      .
      *                          *-------------------------------------*
      *                          * Conversione importo da valuta base  *
      *                          * a valuta per fatturazione           *
      *                          *-------------------------------------*
           move      rf-ocr-sgl-vpf       to   w-cvs-vlt-sgl          .
           move      rf-ocr-dec-vpf       to   w-cvs-vlt-dec          .
           move      rf-ocr-tdc-vpf       to   w-cvs-vlt-tdc          .
           move      w-coe-cmb-vlt-cdc    to   w-cvs-vlt-cdc          .
           perform   cvs-vlb-alt-000      thru cvs-vlb-alt-999        .
      *                          *-------------------------------------*
      *                          * Bufferizzazione del risultato       *
      *                          *-------------------------------------*
           move      w-cvs-vlt-aav        to   w-stp-srt-inp-ipr      .
       stp-srt-inp-340.
      *              *-------------------------------------------------*
      *              * Preparazione record di Sort                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione iniziale                    *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
      *                  *---------------------------------------------*
      *                  * Chiave di sort                              *
      *                  *---------------------------------------------*
           move      rf-dcc-rag-key       to   srt-rag-key            .
           move      rf-ocr-cod-arc       to   srt-cod-cli            .
           move      rf-ocr-dpz-arc       to   srt-dpz-cli            .
           move      rf-ocr-dat-doc       to   srt-dat-doc            .
           move      rf-ocr-num-doc       to   srt-num-doc            .
           move      rf-ocr-num-prt       to   srt-num-prt            .
           move      rf-ocr-num-prg       to   srt-num-prg            .
      *                  *---------------------------------------------*
      *                  * Dati di sort                                *
      *                  *---------------------------------------------*
           move      rf-ocr-sgl-vpf       to   srt-sgl-vpf            .
           move      rf-ocr-dec-vpf       to   srt-dec-vpf            .
           move      rf-ocr-tdc-vpf       to   srt-tdc-vpf            .
           move      rf-ocr-cdc-vpf       to   srt-cdc-vpf            .
           move      rf-dcc-rag-soc       to   srt-rag-soc            .
           move      rf-ocr-ocl-dat       to   srt-ocl-dat            .
           move      rf-ocr-ocl-num       to   srt-ocl-num            .
           move      rf-ocr-dcn-ric       to   srt-dcn-ric            .
           move      rf-ocr-dcn-prv       to   srt-dcn-prv            .
           move      rf-ocr-flg-cnf       to   srt-flg-cnf            .
           move      rf-ocr-num-pro       to   srt-num-pro            .
           move      rf-ocr-alf-pro       to   srt-alf-pro            .
           if        w-stp-srt-inp-wtf    =    "N"
                     move  zero           to   srt-num-pro
                     move  spaces         to   srt-alf-pro            .
           move      w-det-des-rig-des    to   srt-des-rig            .
           move      rf-ocr-tmo-orc       to   srt-tip-mov            .
           move      rf-ocr-sgl-vpp       to   srt-sgl-vpp            .
           move      rf-ocr-dec-vpp       to   srt-dec-vpp            .
           move      rf-ocr-dec-prz       to   srt-dec-prz            .
           move      w-stp-srt-inp-prz    to   srt-prz-net            .
           move      w-stp-srt-inp-ipr    to   srt-imp-res            .
           move      d-qev-roc-qta-ord    to   srt-qta-ord            .
           move      d-qev-roc-qta-gsp    to   srt-qta-gsp            .
           move      d-qev-roc-qta-ics    to   srt-qta-ics            .
           move      d-qev-roc-qta-dev    to   srt-qta-dev            .
           move      w-stp-srt-inp-qta    to   srt-qta-ass            .
           move      w-stp-srt-inp-dat    to   srt-dat-ass            .
      *                      *-----------------------------------------*
      *                      * Se riga di addebito : normalizzazione   *
      *                      *-----------------------------------------*
           if        w-stp-srt-inp-wtp    =    "A"
                     move  zero           to   srt-qta-ord
                     move  zero           to   srt-qta-gsp
                     move  zero           to   srt-qta-ics
                     move  zero           to   srt-qta-dev
                     move  zero           to   srt-qta-ass
                     move  spaces         to   srt-sgl-vpl
                     move  zero           to   srt-dec-vpl
                     move  spaces         to   srt-tdc-vpl
                     move  zero           to   srt-prz-vpl
                     move  zero           to   srt-cdc-vpl
                     move  zero           to   srt-ccr-vpl
                     move  zero           to   srt-plm-vpl
                     move  spaces         to   srt-tlm-vpl
                     move  spaces         to   srt-map-vpl
                     go to stp-srt-inp-380.
      *                      *-----------------------------------------*
      *                      * Legame valutario                        *
      *                      *-----------------------------------------*
           move      rf-ocr-sgl-vpl       to   srt-sgl-vpl            .
           move      rf-ocr-dec-vpl       to   srt-dec-vpl            .
           move      rf-ocr-tdc-vpl       to   srt-tdc-vpl            .
           move      rf-ocr-prz-vpl       to   srt-prz-vpl            .
           move      rf-ocr-cdc-vpl       to   srt-cdc-vpl            .
           move      rf-ocr-ccr-vpl       to   srt-ccr-vpl            .
           move      rf-ocr-plm-vpl       to   srt-plm-vpl            .
           move      rf-ocr-tlm-vpl       to   srt-tlm-vpl            .
           move      rf-ocr-map-vpl       to   srt-map-vpl            .
       stp-srt-inp-380.
      *              *-------------------------------------------------*
      *              * Rilascio del record al Sort                     *
      *              *-------------------------------------------------*
           release   srt-rec                                          .
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale record [ocr]     *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-100.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessuna registrazione entro i limiti assegnati !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
           return    srt    at end
                            move  "#"     to   w-cnt-prn-flg-sub
                            go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
      *              *-------------------------------------------------*
      *              * Cliente                                         *
      *              *-------------------------------------------------*
           move      srt-cod-cli          to   w-rot-l02-cod-cli      .
           move      srt-dpz-cli          to   w-rot-l02-dpz-cli      .
      *              *-------------------------------------------------*
      *              * Protocollo documento                            *
      *              *-------------------------------------------------*
           move      srt-num-prt          to   w-rot-l01-num-prt      .
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Inizializzazione work totale generale           *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-gen-cli          .
           move      zero                 to   w-tot-gen-tiv          .
           move      zero                 to   w-tot-gen-tot          .
           move      srt-sgl-vpf          to   w-tot-gen-vpf          .
           move      srt-dec-vpf          to   w-tot-gen-dpf          .
      *              *-------------------------------------------------*
      *              * Intestazione foglio                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Inizializzazione work totali cliente            *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-cli-ord          .
           move      zero                 to   w-tot-cli-tiv          .
           move      zero                 to   w-tot-cli-tot          .
           move      srt-sgl-vpf          to   w-tot-cli-vpf          .
           move      srt-dec-vpf          to   w-tot-cli-dpf          .
      *              *-------------------------------------------------*
      *              * Intestazione cliente                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    5
                     go to prn-ini-lr2-100.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr2-999.
       prn-ini-lr2-100.
      *                  *---------------------------------------------*
      *                  * 1. linea per intestazione cliente           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea subordinata                  *
      *                      *-----------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       02
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa trattini superiori               *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      64                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      035                  to   p-pos                  .
           move      all "="              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 2. linea per intestazione cliente           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-prn-ini-lr2-x63      .
           move      1                    to   w-prn-ini-lr2-pnt      .
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           string    "Cliente : "
                                delimited by   size
                                          into w-prn-ini-lr2-x63
                                  with pointer w-prn-ini-lr2-pnt      .
      *                      *-----------------------------------------*
      *                      * Codice cliente                          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Editing                             *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      srt-cod-cli          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * String                              *
      *                          *-------------------------------------*
           string    p-edt      delimited by   spaces
                                          into w-prn-ini-lr2-x63
                                  with pointer w-prn-ini-lr2-pnt      .
      *                      *-----------------------------------------*
      *                      * Dipendenza cliente                      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se esistente                   *
      *                          *-------------------------------------*
           if        srt-dpz-cli          =    spaces
                     go to prn-ini-lr2-120.
      *                          *-------------------------------------*
      *                          * String                              *
      *                          *-------------------------------------*
           string    "-"
                                delimited by   size
                     srt-dpz-cli
                                delimited by   spaces
                                          into w-prn-ini-lr2-x63
                                  with pointer w-prn-ini-lr2-pnt      .
       prn-ini-lr2-120.
      *                      *-----------------------------------------*
      *                      * Ragione sociale cliente                 *
      *                      *-----------------------------------------*
           string    " "
                                delimited by   size
                     srt-rag-soc
                                delimited by   size
                                          into w-prn-ini-lr2-x63
                                  with pointer w-prn-ini-lr2-pnt      .
      *                      *-----------------------------------------*
      *                      * Ricerca ultimo carattere non blank      *
      *                      *-----------------------------------------*
           move      zero                 to   w-prn-ini-lr2-ctr      .
           inspect   w-prn-ini-lr2-x63    
                                      tallying w-prn-ini-lr2-ctr
                                          for  trailing spaces        .
           subtract  w-prn-ini-lr2-ctr    from 63
                                        giving w-prn-ini-lr2-pnt      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-prn-ini-lr2-pnt    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           divide    2                    into w-prn-ini-lr2-ctr
                                        giving p-pos                  .
           add       35                   to   p-pos                  .
           move      w-prn-ini-lr2-x63    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * 3. linea per intestazione cliente           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa trattini inferiori               *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      64                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      035                  to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Aggiornamento totali generali                   *
      *              *-------------------------------------------------*
           if        w-tot-gen-cli        <    99999
                     add   1              to   w-tot-gen-cli          .
           add       w-tot-cli-tot        to   w-tot-gen-tot          .
           add       w-tot-cli-tiv        to   w-tot-gen-tiv          .
           if        w-tot-cli-vpf        not  = w-tot-gen-vpf
                     move  spaces         to   w-tot-gen-vpf          .
      *              *-------------------------------------------------*
      *              * Stampa totale cliente                           *
      *              *-------------------------------------------------*
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Inizializzazione work totali ordine             *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-ord-nrg          .
           move      zero                 to   w-tot-ord-tiv          .
           move      zero                 to   w-tot-ord-tot          .
           move      srt-sgl-vpf          to   w-tot-ord-vpf          .
           move      srt-dec-vpf          to   w-tot-ord-dpf          .
      *              *-------------------------------------------------*
      *              * Intestazione ordine cliente                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    7
                     go to prn-ini-lr1-100.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr1-999.
       prn-ini-lr1-100.
      *                  *---------------------------------------------*
      *                  * 1 interlinea subordinata                    *
      *                  *---------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       02
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Identificazione documento                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-prn-ini-lr1-x55      .
           move      1                    to   w-prn-ini-lr1-pnt      .
      *                      *-----------------------------------------*
      *                      * Descrizione movimento                   *
      *                      *-----------------------------------------*
           string    srt-tip-mov
                                delimited by   size
                                          into w-prn-ini-lr1-x55
                                  with pointer w-prn-ini-lr1-pnt      .
           move      zero                 to   w-prn-ini-lr1-ctr      .
           inspect   w-prn-ini-lr1-x55    
                                      tallying w-prn-ini-lr1-ctr
                                          for  trailing spaces        .
           subtract  w-prn-ini-lr1-ctr    from 55
                                        giving w-prn-ini-lr1-pnt      .
           add       1                    to   w-prn-ini-lr1-pnt      .
      *                      *-----------------------------------------*
      *                      * Numero ordine cliente                   *
      *                      *-----------------------------------------*
           string    " nr. "
                                delimited by   size
                                          into w-prn-ini-lr1-x55
                                  with pointer w-prn-ini-lr1-pnt      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      srt-num-doc          to   w-wrk-num-011          .
           move      w-wrk-num-011-prg    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           string    p-edt
                                delimited by   spaces
                                          into w-prn-ini-lr1-x55
                                  with pointer w-prn-ini-lr1-pnt      .
      *                      *-----------------------------------------*
      *                      * Data ordine cliente                     *
      *                      *-----------------------------------------*
           string    " del "
                                delimited by   size
                                          into w-prn-ini-lr1-x55
                                  with pointer w-prn-ini-lr1-pnt      .
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      "<"                  to   p-edm                  .
           move      srt-dat-doc          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           string    p-edt
                                delimited by   spaces
                                          into w-prn-ini-lr1-x55
                                  with pointer w-prn-ini-lr1-pnt      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      55                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-prn-ini-lr1-x55    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr1-200.
      *                  *---------------------------------------------*
      *                  * Riferimenti cliente                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se da stampare                     *
      *                      *-----------------------------------------*
           if        srt-ocl-dat          =    zero   and
                     srt-ocl-num          =    spaces
                     go to prn-ini-lr1-300.
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-prn-ini-lr1-x55      .
           move      1                    to   w-prn-ini-lr1-pnt      .
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           string    "Rif. Cliente : "
                                delimited by   size
                                          into w-prn-ini-lr1-x55
                                  with pointer w-prn-ini-lr1-pnt      .
      *                          *-------------------------------------*
      *                          * Numero riferimento cliente          *
      *                          *-------------------------------------*
           if        srt-ocl-num          =    spaces
                     go to prn-ini-lr1-220.
           string    srt-ocl-num
                                delimited by   size
                                          into w-prn-ini-lr1-x55
                                  with pointer w-prn-ini-lr1-pnt      .
           move      zero                 to   w-prn-ini-lr1-ctr      .
           inspect   w-prn-ini-lr1-x55    
                                      tallying w-prn-ini-lr1-ctr
                                          for  trailing spaces        .
           subtract  w-prn-ini-lr1-ctr    from 55
                                        giving w-prn-ini-lr1-pnt      .
           add       2                    to   w-prn-ini-lr1-pnt      .
       prn-ini-lr1-220.
      *                          *-------------------------------------*
      *                          * Data riferimento cliente            *
      *                          *-------------------------------------*
           if        srt-ocl-dat          =    zero
                     go to prn-ini-lr1-240.
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      "<"                  to   p-edm                  .
           move      srt-ocl-dat          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           string    p-edt
                                delimited by   spaces
                                          into w-prn-ini-lr1-x55
                                  with pointer w-prn-ini-lr1-pnt      .
       prn-ini-lr1-240.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      34                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      099                  to   p-pos                  .
           move      w-prn-ini-lr1-x55    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-ini-lr1-300.
      *                  *---------------------------------------------*
      *                  * Fincatura per dettaglio                     *
      *                  *---------------------------------------------*
           perform   fin-liv-det-000      thru fin-liv-det-999        .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Aggiornamento totali cliente                    *
      *              *-------------------------------------------------*
           if        w-tot-cli-ord        <    99999
                     add   1              to   w-tot-cli-ord          .
           add       w-tot-ord-tiv        to   w-tot-cli-tiv          .
           add       w-tot-ord-tot        to   w-tot-cli-tot          .
           if        w-tot-ord-vpf        not  = w-tot-cli-vpf
                     move  spaces         to   w-tot-cli-vpf          .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Aggiornamento totali ordine                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero righe ordine                         *
      *                  *---------------------------------------------*
           if        w-tot-ord-nrg        <    99999
                     add   1              to   w-tot-ord-nrg          .
      *                  *---------------------------------------------*
      *                  * Totali ordine in valuta base e non          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda che il documento   *
      *                      * sia in valuta base o no                 *
      *                      *-----------------------------------------*
           if        srt-sgl-vpf          =    c-sgl
                     go to prn-liv-det-052
           else      go to prn-liv-det-054.
       prn-liv-det-052.
      *                      *-----------------------------------------*
      *                      * Se ordine in valuta base                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Aggiornamento totale ordine in va-  *
      *                          * luta base                           *
      *                          *-------------------------------------*
           add       srt-imp-res          to   w-tot-ord-tot          .
           go to     prn-liv-det-060.
       prn-liv-det-054.
      *                      *-----------------------------------------*
      *                      * Se documento in valuta                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Aggiornamento totale documento in   *
      *                          * valuta                              *
      *                          *-------------------------------------*
           add       srt-imp-res          to   w-tot-ord-tiv          .
      *                          *-------------------------------------*
      *                          * Determinazione coefficiente di cam- *
      *                          * bio alla data attuale per la valu-  *
      *                          * ta per fatturazione                 *
      *                          *-------------------------------------*
           move      "CC"                 to   w-coe-cmb-vlt-ope      .
           move      srt-sgl-vpf          to   w-coe-cmb-vlt-sdv      .
           move      srt-tdc-vpf          to   w-coe-cmb-vlt-tdc      .
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-coe-cmb-vlt-drc      .
           move      00                   to   w-coe-cmb-vlt-quc      .
           perform   coe-cmb-vlt-cll-000  thru coe-cmb-vlt-cll-999    .
      *                          *-------------------------------------*
      *                          * Se esito determinazione negativo si *
      *                          * considera il coefficiente rilevato  *
      *                          * alla data ordine                    *
      *                          *-------------------------------------*
           if        w-coe-cmb-vlt-ope    not  = "CC"
                     move  srt-cdc-vpf    to   w-coe-cmb-vlt-cdc      .
      *                          *-------------------------------------*
      *                          * Determinazione importo residuo riga *
      *                          * in valuta base                      *
      *                          *-------------------------------------*
           move      srt-sgl-vpf          to   w-cvs-vlt-sgl          .
           move      srt-dec-vpf          to   w-cvs-vlt-dec          .
           move      srt-tdc-vpf          to   w-cvs-vlt-tdc          .
           move      w-coe-cmb-vlt-cdc    to   w-cvs-vlt-cdc          .
           move      srt-imp-res          to   w-cvs-vlt-aav          .
           perform   cvs-alt-vlb-000      thru cvs-alt-vlb-999        .
      *                          *-------------------------------------*
      *                          * Aggiornamento totale ordine in va-  *
      *                          * luta base                           *
      *                          *-------------------------------------*
           add       w-cvs-vlt-avb        to   w-tot-ord-tot          .
           go to     prn-liv-det-060.
       prn-liv-det-060.
      *              *-------------------------------------------------*
      *              * Stampa riga di dettaglio                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    1
                     go to prn-liv-det-100.
      *                      *-----------------------------------------*
      *                      * Reintestazione                          *
      *                      *-----------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
      *                      *-----------------------------------------*
      *                      * Fincatura per dettaglio                 *
      *                      *-----------------------------------------*
           perform   fin-liv-det-000      thru fin-liv-det-999        .
       prn-liv-det-100.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Codice prodotto                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      srt-alf-pro          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Descrizione riga                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      016                  to   p-pos                  .
           move      srt-des-rig          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Quantita' ordinata                          *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           if        srt-qta-ord          >    99999 or
                     srt-qta-ord          <   -99999
                     move  06             to   p-car
           else      move  05             to   p-car                  .
           move      03                   to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           if        srt-qta-ord          >    99999 or
                     srt-qta-ord          <   -99999
                     move  "BD"           to   p-edm
           else      move  "GBD"          to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      056                  to   p-pos                  .
           move      srt-qta-ord          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Quantita' spedita                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           if        srt-qta-gsp          >    99999 or
                     srt-qta-gsp          <   -99999
                     move  06             to   p-car
           else      move  05             to   p-car                  .
           move      03                   to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           if        srt-qta-gsp          >    99999 or
                     srt-qta-gsp          <   -99999
                     move  "BD"           to   p-edm
           else      move  "GBD"          to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      067                  to   p-pos                  .
           move      srt-qta-gsp          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Quantita' in spedizione                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           if        srt-qta-ics          >    99999 or
                     srt-qta-ics          <   -99999
                     move  06             to   p-car
           else      move  05             to   p-car                  .
           move      03                   to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           if        srt-qta-ics          >    99999 or
                     srt-qta-ics          <   -99999
                     move  "BD"           to   p-edm
           else      move  "GBD"          to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      078                  to   p-pos                  .
           move      srt-qta-ics          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Quantita' da evadere                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           if        srt-qta-dev          >    99999 or
                     srt-qta-dev          <   -99999
                     move  06             to   p-car
           else      move  05             to   p-car                  .
           move      03                   to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           if        srt-qta-dev          >    99999 or
                     srt-qta-dev          <   -99999
                     move  "BD"           to   p-edm
           else      move  "GBD"          to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      089                  to   p-pos                  .
           move      srt-qta-dev          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-200.
      *                  *---------------------------------------------*
      *                  * Test su personalizzazioni                   *
      *                  *---------------------------------------------*
           if        w-prs-tfu-gos-tip    not  = "01"
                     go to prn-liv-det-220.
       prn-liv-det-210.
      *                  *---------------------------------------------*
      *                  * Quantita' assegnata                         *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           if        srt-qta-ass          >    99999 or
                     srt-qta-ass          <   -99999
                     move  06             to   p-car
           else      move  05             to   p-car                  .
           move      03                   to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           if        srt-qta-ass          >    99999 or
                     srt-qta-ass          <   -99999
                     move  "BD"           to   p-edm
           else      move  "GBD"          to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      100                  to   p-pos                  .
           move      srt-qta-ass          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     prn-liv-det-240.
       prn-liv-det-220.
      *                  *---------------------------------------------*
      *                  * Quantita' in giacenza                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Determinazione                          *
      *                      *-----------------------------------------*
           move      "SL"                 to   d-sld-mag-tip-ope      .
           move      0000                 to   d-sld-mag-tip-sld      .
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   d-sld-mag-dat-sld      .
           move      "U"                  to   d-sld-mag-uot-dpz      .
           move      rr-dpz-inu           to   d-sld-mag-cod-dpz      .
           move      01                   to   d-sld-mag-tip-mag      .
           move      srt-num-pro          to   d-sld-mag-num-mag      .
           move      "T"                  to   d-sld-mag-uot-var      .
           move      spaces               to   d-sld-mag-var-mag      .
           move      "T"                  to   d-sld-mag-uot-dsl      .
           move      spaces               to   d-sld-mag-cod-dsl      .
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           perform   det-sld-mag-cll-000  thru det-sld-mag-cll-999    .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           if        d-sld-mag-sld-mag    >    99999 or
                     d-sld-mag-sld-mag    <   -99999
                     move  06             to   p-car
           else      move  05             to   p-car                  .
           move      03                   to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           if        d-sld-mag-sld-mag    >    99999 or
                     d-sld-mag-sld-mag    <   -99999
                     move  "BD"           to   p-edm
           else      move  "GBD"          to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      100                  to   p-pos                  .
           move      d-sld-mag-sld-mag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     prn-liv-det-240.
       prn-liv-det-240.
      *                  *---------------------------------------------*
      *                  * Data consegna richiesta                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      113                  to   p-pos                  .
           move      srt-dcn-ric          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data consegna prevista                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      123                  to   p-pos                  .
           move      srt-dcn-prv          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Flag di conferma a cliente                  *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      132                  to   p-pos                  .
           move      srt-flg-cnf          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-400.
      *              *-------------------------------------------------*
      *              * Stampa eventuale legame valutario               *
      *              *-------------------------------------------------*
       prn-liv-det-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio                                       *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Preparazione parametri intestazione standard    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione titolo                         *
      *                  *---------------------------------------------*
           move      "LISTA ASSEGNAZIONI ORDINI EFFETTUATE PER CLIENTE"
                                          to   w-cnt-tit-des-tit      .
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-cnt-tit-dat-stp      .
           move      p-pag                to   w-cnt-tit-num-pag      .
           add       1                    to   w-cnt-tit-num-pag      .
      *              *-------------------------------------------------*
      *              * Intestazione standard                           *
      *              *-------------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per interruzione forzata          *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  int-pag-sta-999.
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Fincatura per il livello di dettaglio                     *
      *    *-----------------------------------------------------------*
       fin-liv-det-000.
      *              *-------------------------------------------------*
      *              * Interlinea subordinata                          *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       02
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura                                       *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "                         Prodotto                 
      -              "       Ordinato    Spedito  In spediz.   Residuo  
      -              " Assegnato  C. Rich.   C. Prev. "
                                          to   p-alf                  .
      *                  *---------------------------------------------*
      *                  * Ritaratura a seconda delle personalizzazio- *
      *                  * ni                                          *
      *                  *---------------------------------------------*
           if        w-prs-tfu-gos-tip    =    "02"
                     move  "Giacenza "    to   p-alf
                                              (102 : 009)             .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura                        *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "--------------------------------------------------
      -              "----- ---------- ---------- ---------- ---------- 
      -              "----------  --------  ----------"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       1
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       fin-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Determinazione descrizione riga ordine                    *
      *    *                                                           *
      *    * Input  :                                                  *
      *    *                                                           *
      *    *    - Record di [ocr] relativo alla riga ordine cliente a  *
      *    *      disposizione in rf-ocr                               *
      *    *                                                           *
      *    *    - Record di [dcc] relativo alla riga ordine cliente    *
      *    *                                                           *
      *    * Output :                                                  *
      *    *                                                           *
      *    *    - w-det-des-rig-des : Descrizione riga ordine          *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       det-des-rig-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valore in uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-des-rig-des      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del flag di estensione   *
      *              * alla descrizione                                *
      *              *-------------------------------------------------*
           if        rf-ocr-des-ext       =    0
                     go to det-des-rig-100
           else if   rf-ocr-des-ext       =    1
                     go to det-des-rig-200
           else if   rf-ocr-des-ext       =    2
                     go to det-des-rig-300.
       det-des-rig-100.
      *              *-------------------------------------------------*
      *              * Se nessuna estensione : bufferizzazione descri- *
      *              * zione contenuta nel record [ocr]                *
      *              *-------------------------------------------------*
           move      rf-ocr-des-rig       to   w-det-des-rig-des      .
           go to     det-des-rig-999.
       det-des-rig-200.
      *              *-------------------------------------------------*
      *              * Se estensione nel file [ocx]                    *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      rf-ocr-num-prt       to   rf-ocx-num-prt         .
           move      rf-ocr-num-prg       to   rf-ocx-num-prg         .
           move      11                   to   rf-ocx-tip-rec         .
           move      "pgm/orc/fls/ioc/obj/iofocx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocx                 .
           if        f-sts                not  = e-not-err
                     move  all '.'        to   rf-ocx-des-400         .
           move      rf-ocx-des-400       to   w-det-des-rig-des      .
           go to     det-des-rig-999.
       det-des-rig-300.
      *              *-------------------------------------------------*
      *              * Se estensione nel file [pdx]                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tentativo di lettura di una descrizione     *
      *                  * legata al cliente                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura archivio [pdx]                  *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "TRCLNG"             to   f-key                  .
           move      03                   to   rf-pdx-tip-rec         .
           move      rf-ocr-cod-arc       to   rf-pdx-cod-arc         .
           move      spaces               to   rf-pdx-cod-lng         .
           move      rf-ocr-num-pro       to   rf-pdx-cod-num         .
           move      spaces               to   rf-pdx-for-mat         .
           move      zero                 to   rf-pdx-num-prg         .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *                      *-----------------------------------------*
      *                      * Test su esito operazione                *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-des-rig-305.
      *                      *-----------------------------------------*
      *                      * Se record trovato : bufferizzazione de- *
      *                      * scrizione e uscita                      *
      *                      *-----------------------------------------*
           move      rf-pdx-des-pro       to   w-det-des-rig-des      .
           go to     det-des-rig-999.
       det-des-rig-305.
      *                  *---------------------------------------------*
      *                  * Se codice lingua 'I  '                      *
      *                  *---------------------------------------------*
           if        rf-ocr-cod-lng       not  = "I  "
                     go to det-des-rig-350.
       det-des-rig-310.
      *                      *-----------------------------------------*
      *                      * Lettura archivio [pdx]                  *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "TRCLNG"             to   f-key                  .
           move      01                   to   rf-pdx-tip-rec         .
           move      zero                 to   rf-pdx-cod-arc         .
           move      "I  "                to   rf-pdx-cod-lng         .
           move      rf-ocr-num-pro       to   rf-pdx-cod-num         .
           move      spaces               to   rf-pdx-for-mat         .
           move      01                   to   rf-pdx-num-prg         .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
           if        f-sts                not  = e-not-err
                     move  all "."        to   rf-pdx-des-pro         .
           move      rf-pdx-des-pro       to   w-det-des-rig-des      .
           go to     det-des-rig-999.
       det-des-rig-350.
      *                  *---------------------------------------------*
      *                  * Se codice lingua diverso da 'I  '           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tentativo di lettura file [pdx] per de- *
      *                      * scrizione in lingua estera              *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "TRCLNG"             to   f-key                  .
           move      02                   to   rf-pdx-tip-rec         .
           move      zero                 to   rf-pdx-cod-arc         .
           move      rf-ocr-cod-lng       to   rf-pdx-cod-lng         .
           move      rf-ocr-num-pro       to   rf-pdx-cod-num         .
           move      spaces               to   rf-pdx-for-mat         .
           move      01                   to   rf-pdx-num-prg         .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
           if        f-sts                not  = e-not-err
                     go to det-des-rig-310.
           move      rf-pdx-des-pro       to   w-det-des-rig-des      .
           go to     det-des-rig-999.
       det-des-rig-999.
           exit.

      *    *===========================================================*
      *    * Routine di conversione da altra valuta a valuta base      *
      *    *                                                           *
      *    * Input  : w-cvs-vlt-sgl = Sigla dell'altra valuta          *
      *    *                                                           *
      *    *          w-cvs-vlt-dec = Numero decimali dell'altra valu- *
      *    *                          ta                               *
      *    *                                                           *
      *    *          w-cvs-vlt-tdc = Tipo di coefficiente dell'altra  *
      *    *                          valuta                           *
      *    *                                                           *
      *    *          w-cvs-vlt-cdc = Coefficiente di cambio dell'al-  *
      *    *                          tra valuta                       *
      *    *                                                           *
      *    *          w-cvs-vlt-aav = Ammontare da convertire, espres- *
      *    *                          so nell'altra valuta             *
      *    *                                                           *
      *    * Output : w-cvs-vlt-avb = Ammontare convertito, espresso   *
      *    *                          nella valuta base                *
      *    *                                                           *
      *    *-----------------------------------------------------------*
      *    * Routine di conversione da valuta base ad altra valuta     *
      *    *                                                           *
      *    * Input  : w-cvs-vlt-sgl = Sigla dell'altra valuta          *
      *    *                                                           *
      *    *          w-cvs-vlt-dec = Numero decimali dell'altra valu- *
      *    *                          ta                               *
      *    *                                                           *
      *    *          w-cvs-vlt-tdc = Tipo di coefficiente dell'altra  *
      *    *                          valuta                           *
      *    *                                                           *
      *    *          w-cvs-vlt-cdc = Coefficiente di cambio dell'al-  *
      *    *                          tra valuta                       *
      *    *                                                           *
      *    *          w-cvs-vlt-avb = Ammontare da convertire, espres- *
      *    *                          so nella valuta base             *
      *    *                                                           *
      *    * Output : w-cvs-vlt-aav = Ammontare convertito, espresso   *
      *    *                          nell'altra valuta                *
      *    *                                                           *
      *    *-----------------------------------------------------------*
      *    * Routine di conversione da valuta a valuta                 *
      *    *                                                           *
      *    * Input  : Valuta da trasformare                            *
      *    *                                                           *
      *    *            - w-cvs-vdt-sgl = Sigla valuta                 *
      *    *                                                           *
      *    *            - w-cvs-vdt-dec = Numero decimali              *
      *    *                                                           *
      *    *            - w-cvs-vdt-tdc = Tipo di coefficiente         *
      *    *                                                           *
      *    *            - w-cvs-vdt-cdc = Coefficiente di cambio ri-   *
      *    *                              spetto alla valuta base      *
      *    *                                                           *
      *    *            - w-cvs-vdt-amm = Ammontare da convertire,     *
      *    *                              espresso nella valuta da     *
      *    *                              trasformare                  *
      *    *                                                           *
      *    *          Valuta in cui trasformare                        *
      *    *                                                           *
      *    *            - w-cvs-vnu-sgl = Sigla valuta                 *
      *    *                                                           *
      *    *            - w-cvs-vnu-dec = Numero decimali              *
      *    *                                                           *
      *    *            - w-cvs-vnu-tdc = Tipo di coefficiente         *
      *    *                                                           *
      *    *            - w-cvs-vnu-cdc = Coefficiente di cambio ri-   *
      *    *                              spetto alla valuta base      *
      *    *                                                           *
      *    * Output : Valuta in cui trasformare                        *
      *    *                                                           *
      *    *            - w-cvs-vnu-amm = Ammontare convertito,        *
      *    *                              espresso nella valuta        *
      *    *                              in cui trasformare           *
      *    *                                                           *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wcvsvlt0.cps"                   .

      *    *===========================================================*
      *    * Subroutines per determinazione quantita' da evadere riga  *
      *    * ordine cliente                                            *
      *    *-----------------------------------------------------------*
           copy      "pgm/orc/prg/cpy/dqevroc0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per determinazione saldo di magazzino         *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldmag0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del coefficiente di cambio *
      *    * valuta                                                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoecmb0.acs"                   .

