       Identification Division.
       Program-Id.                                 porc300t           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    orc                 *
      *                                Settore:    mov                 *
      *                                   Fase:    orc300              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 18/05/03    *
      *                       Ultima revisione:    NdK del 23/03/18    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Modulo di stampa documento : ordine di la-  *
      *                    vorazione                                   *
      *                                                                *
      *                    ___ DA UTILIZZARE IN CASO DI STAMPA         *
      *                    ___ DEL FOGLIO DI LAVORO - F2 da orc300     *
      *                    ___ SI SERVE DEL MODULO AD HOC 'mposts'     *
      *                                                                *
      *                    ___ MAI UTILIZZATO                          *
      *                                                                *
      *                    ___ Vedi 'pet/orc/prg/cbl/porc300t'         *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "msegrt" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mpslct" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/r"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mposts"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/ps"                                 .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area per la ridefinizione della variabile di i.p.c.  *
      *    * in input  "inp-sfl"                                       *
      *    *-----------------------------------------------------------*
       01  w-inp-sfl.
      *        *-------------------------------------------------------*
      *        * Tipo operazione                                       *
      *        * - SF : Stampa foglio di lavoro                        *
      *        *-------------------------------------------------------*
           05  w-inp-sfl-ope              pic  x(02)                  .
      *        *-------------------------------------------------------*
      *        * Dati in input relativi ai tipi operazione             *
      *        *-------------------------------------------------------*
           05  w-inp-sfl-dat.
      *            *---------------------------------------------------*
      *            * Dati in input relativi al tipo operazione "SF"    *
      *            *---------------------------------------------------*
               10  w-inp-sfl-xst.
      *                *-----------------------------------------------*
      *                * Codice stampante da utilizzare                *
      *                *-----------------------------------------------*
                   15  w-inp-sfl-stp      pic  x(08)                  .
      *                *-----------------------------------------------*
      *                * Identificazione del documento                 *
      *                *-----------------------------------------------*
                   15  w-inp-sfl-prt      pic  9(11)                  .
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *-----------------------------------------------*
                   15  filler             pic  x(59)                  .

      *    *===========================================================*
      *    * Record files area 'orc'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [oct]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfoct"                          .
      *        *-------------------------------------------------------*
      *        * [ocr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfocr"                          .
      *        *-------------------------------------------------------*
      *        * [ocx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfocx"                          .
      *        *-------------------------------------------------------*
      *        * [zoc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfzoc"                          .
      *        *-------------------------------------------------------*
      *        * [zcv]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfzcv"                          .

      *    *===========================================================*
      *    * Record files area 'dcc'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [zfp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfzfp"                          .
      *        *-------------------------------------------------------*
      *        * [zdf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfzdf"                          .
      *        *-------------------------------------------------------*
      *        * [zvf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfzvf"                          .
      *        *-------------------------------------------------------*
      *        * [zsf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfzsf"                          .

      *    *===========================================================*
      *    * Record files area 'dcp'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [pdx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfpdx"                          .

      *    *===========================================================*
      *    * Record files area 'cge'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .

      *    *===========================================================*
      *    * Record files area 'abi'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [axs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxs"                          .
      *        *-------------------------------------------------------*
      *        * [axi]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxi"                          .

      *    *===========================================================*
      *    * Record files area 'age'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [age]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/age/fls/rec/rfage"                          .

      *    *===========================================================*
      *    * Record files area 'gep'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [cbp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfcbp"                          .

      *    *===========================================================*
      *    * Record files area 'mag'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [mau]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmau"                          .

      *    *===========================================================*
      *    * Record files area 'azi'                                   *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [ada]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/azi/fls/rec/rfada"                          .

      *    *===========================================================*
      *    * Work-area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Personalizzazione per modulo stampa conferme d'ordine *
      *        * cliente                                               *
      *        *-------------------------------------------------------*
      *            *---------------------------------------------------*
      *            * Si/No riga aggiuntiva per stampa codice prodotto  *
      *            *                                                   *
      *            *  - 'N' = Nessuna riga aggiuntiva                  *
      *            *  - 'C' = Una riga aggiuntiva con il codice del    *
      *            *          cliente                                  *
      *            *  - 'M' = Una riga aggiuntiva con il codice nostro *
      *            *  - 'E' = Due righe aggiuntive, la prima con il    *
      *            *          codice del cliente, la seconda con il    *
      *            *          nostro codice                            *
      *            *---------------------------------------------------*
               10  w-prs-soc-rac          pic  x(01) value "C"        .

      *    *===========================================================*
      *    * Work-area per estensioni al record di testata             *
      *    *-----------------------------------------------------------*
       01  w-ext.
           05  w-ext-rag-ids              pic  x(40)                  .
           05  w-ext-rs2-ids              pic  x(40)                  .
           05  w-ext-via-ids              pic  x(40)                  .
           05  w-ext-loc-ids              pic  x(40)                  .
           05  w-ext-des-cdv.
               10  w-ext-rig-cdv occurs 3 pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per stampa numero e data                        *
      *    *-----------------------------------------------------------*
       01  w-stp-ned.
      *        *-------------------------------------------------------*
      *        * Contatore di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-stp-ned-ctr              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Puntatore di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-stp-ned-pnt              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per descrizione documento                        *
      *        *-------------------------------------------------------*
           05  w-stp-ned-des.
               10  w-stp-ned-chd occurs 40
                                          pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per stampa corpo documento                      *
      *    *-----------------------------------------------------------*
       01  w-pre-cor-doc.
      *        *-------------------------------------------------------*
      *        * Contatori di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-pre-cor-doc-c01          pic  9(03)                  .
           05  w-pre-cor-doc-c02          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per descrizione                                *
      *        *-------------------------------------------------------*
           05  w-pre-cor-doc-der.
               10  w-pre-cor-doc-rgd occurs 12
                                          pic  x(40)                  .
           05  w-pre-cor-doc-nrd          pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per numero documento                            *
      *    *-----------------------------------------------------------*
       01  w-num-doc.
      *        *-------------------------------------------------------*
      *        * Work per ridefinizione                                *
      *        *-------------------------------------------------------*
           05  w-num-doc-num              pic  9(11)                  .
           05  w-num-doc-num-r redefines
               w-num-doc-num.
               10  w-num-doc-saa          pic  9(03)                  .
               10  w-num-doc-dpz          pic  9(02)                  .
               10  w-num-doc-prg          pic  9(06)                  .

      *    *===========================================================*
      *    * Work-area per dati di intestazione documento              *
      *    *-----------------------------------------------------------*
       01  w-int-doc.
           05  w-int-doc-rag              pic  x(40)                  .
           05  w-int-doc-via              pic  x(40)                  .
           05  w-int-doc-loc              pic  x(40)                  .
           05  w-int-doc-d01.
               10  w-int-doc-cfi          pic  x(16)                  .
           05  w-int-doc-d02.
               10  w-int-doc-piv          pic  9(11)                  .
           05  w-int-doc-tel              pic  x(20)                  .

      *    *===========================================================*
      *    * Work-area per dati di inoltro documento                   *
      *    *-----------------------------------------------------------*
       01  w-inl-dcm.
           05  w-inl-dcm-rs1              pic  x(40)                  .
           05  w-inl-dcm-rs2              pic  x(40)                  .
           05  w-inl-dcm-via              pic  x(40)                  .
           05  w-inl-dcm-loc              pic  x(40)                  .
           05  w-inl-dcm-tel              pic  x(20)                  .

      *    *===========================================================*
      *    * Work-area per stampa indirizzo di spedizione              *
      *    *-----------------------------------------------------------*
       01  w-ind-spe.
           05  w-ind-spe-rag              pic  x(40)                  .
           05  w-ind-spe-rs2              pic  x(40)                  .
           05  w-ind-spe-via              pic  x(40)                  .
           05  w-ind-spe-loc              pic  x(40)                  .
           05  w-ind-spe-tel              pic  x(20)                  .

      *    *===========================================================*
      *    * Work per Let su archivio [dcp] e [pdx]                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/ldcppdx0.ltw"                   .

      *    *===========================================================*
      *    * Work-area per bufferizzazione dati foglio di lavoro e per *
      *    * stampa foglio di lavoro                                   *
      *    *-----------------------------------------------------------*
       01  w-fdl.
      *        *-------------------------------------------------------*
      *        * Dati per stampa                                       *
      *        *-------------------------------------------------------*
           05  w-fdl-dps.
      *            *---------------------------------------------------*
      *            * Numero totale posizioni presenti                  *
      *            *---------------------------------------------------*
               10  w-fdl-dps-pos-tot      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero posizione attuale                          *
      *            *---------------------------------------------------*
               10  w-fdl-dps-num-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero posizione relativo al foglio               *
      *            *---------------------------------------------------*
               10  w-fdl-dps-num-rel      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero pagine totali                              *
      *            *---------------------------------------------------*
               10  w-fdl-dps-pag-tot      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina attuale                             *
      *            *---------------------------------------------------*
               10  w-fdl-dps-num-pag      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Coordinata y superiore per la posizione           *
      *            *---------------------------------------------------*
               10  w-fdl-dps-yyy-sup      pic s9(04)v9(03)            .
      *            *---------------------------------------------------*
      *            * Coordinata y inferiore per la posizione           *
      *            *---------------------------------------------------*
               10  w-fdl-dps-yyy-inf      pic s9(04)v9(03)            .
      *            *---------------------------------------------------*
      *            * Area di work locale                               *
      *            *---------------------------------------------------*
               10  w-fdl-dps-are-wrk.
                    15  w-fdl-dps-inx-lin pic  9(03)                  .
                    15  w-fdl-dps-quo-div pic  9(03)                  .
                    15  w-fdl-dps-inx-001 pic  9(03)                  .
                    15  w-fdl-dps-edt-npa pic  x(03)                  .
                    15  w-fdl-dps-edt-ntp pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Dati di testata                                       *
      *        *-------------------------------------------------------*
           05  w-fdl-tes.
      *            *---------------------------------------------------*
      *            * Nostro numero ordine                              *
      *            *---------------------------------------------------*
               10  w-fdl-tes-nnu-ord      pic  x(12)                  .
      *            *---------------------------------------------------*
      *            * Nostra data ordine                                *
      *            *---------------------------------------------------*
               10  w-fdl-tes-nda-ord      pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale cliente                           *
      *            *---------------------------------------------------*
               10  w-fdl-tes-rag-cli      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Numero di telefono del cliente                    *
      *            *---------------------------------------------------*
               10  w-fdl-tes-tel-cli      pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale destinatario merce                *
      *            *---------------------------------------------------*
               10  w-fdl-tes-rag-dst      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Indirizzo destinatario merce                      *
      *            *---------------------------------------------------*
               10  w-fdl-tes-via-dst      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Localita' destinatario merce                      *
      *            *---------------------------------------------------*
               10  w-fdl-tes-loc-dst      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Riferimenti ordine riga 1                         *
      *            *---------------------------------------------------*
               10  w-fdl-tes-rif-or1      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Riferimenti ordine riga 2                         *
      *            *---------------------------------------------------*
               10  w-fdl-tes-rif-or2      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Data consegna                                     *
      *            *---------------------------------------------------*
               10  w-fdl-tes-dat-cns      pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Note-1                                            *
      *            *---------------------------------------------------*
               10  w-fdl-tes-not-001      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Note-2                                            *
      *            *---------------------------------------------------*
               10  w-fdl-tes-not-002      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Note-3                                            *
      *            *---------------------------------------------------*
               10  w-fdl-tes-not-003      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Dati di posizione                                     *
      *        *-------------------------------------------------------*
           05  w-fdl-pos.
      *            *---------------------------------------------------*
      *            * Posizioni                                         *
      *            *---------------------------------------------------*
               10  w-fdl-pos-xxx occurs 500.
      *                *-----------------------------------------------*
      *                * Unita' di misura                              *
      *                *-----------------------------------------------*
                   15  w-fdl-pos-uni-mis  pic  x(03)                  .
      *                *-----------------------------------------------*
      *                * Quantita'                                     *
      *                *-----------------------------------------------*
                   15  w-fdl-pos-qta-pos  pic  x(08)                  .
      *                *-----------------------------------------------*
      *                * Codice prodotto                               *
      *                *-----------------------------------------------*
                   15  w-fdl-pos-cod-pro  pic  x(14)                  .
      *                *-----------------------------------------------*
      *                * Descrizione                                   *
      *                *-----------------------------------------------*
                   15  w-fdl-pos-des-pos  pic  x(40)                  .
      *                *-----------------------------------------------*
      *                * Data di consegna                              *
      *                *-----------------------------------------------*
                   15  w-fdl-pos-dat-cns  pic  x(10)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Lettura della variabile di i.p.c. dello stesso  *
      *              * livello "inp-sfl"                               *
      *              *-------------------------------------------------*
           perform   rea-inp-sfl-000      thru rea-inp-sfl-999        .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo operazione      *
      *              *-------------------------------------------------*
           if        w-inp-sfl-ope        =    "SF"
                     go to main-400
           else      go to main-999.
       main-400.
      *              *-------------------------------------------------*
      *              * Se funzione ST : Stampa                         *
      *              *-------------------------------------------------*
           perform   exe-fun-stp-000      thru exe-fun-stp-999        .
           go to     main-999.
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Lettura della variabile di i.p.c. dello stesso livello di *
      *    * nome "inp-sfl" per parametri su funzione da eseguire      *
      *    *-----------------------------------------------------------*
       rea-inp-sfl-000.
      *              *-------------------------------------------------*
      *              * Lettura della variabile                         *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "inp-sfl"            to   s-var                  .
           move      "="                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Test su esito lettura                           *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     go to rea-inp-sfl-600.
       rea-inp-sfl-300.
      *              *-------------------------------------------------*
      *              * Se variabile non trovata o non corretta         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione area di ridefinizione della *
      *                  * variabile                                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-inp-sfl              .
      *                  *---------------------------------------------*
      *                  * Cancellazione della variabile in uscita     *
      *                  *---------------------------------------------*
           perform   del-out-sfl-000      thru del-out-sfl-000        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     rea-inp-sfl-999.
       rea-inp-sfl-600.
      *              *-------------------------------------------------*
      *              * Se variabile trovata                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su formato della variabile             *
      *                  *---------------------------------------------*
           if        s-tip                not  = "A"
                     go to rea-inp-sfl-300.
           if        s-car                not  = 80
                     go to rea-inp-sfl-300.
      *                  *---------------------------------------------*
      *                  * Se formato variabile corretto               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Spostamento del valore della variabile  *
      *                      * in area di ridefinizione                *
      *                      *-----------------------------------------*
           move      s-alf                to   w-inp-sfl              .
       rea-inp-sfl-999.
           exit.

      *    *===========================================================*
      *    * Cancellazione della variabile di i.p.c. dello stesso li-  *
      *    * vello di nome "out-sfl"                                   *
      *    *-----------------------------------------------------------*
       del-out-sfl-000.
      *              *-------------------------------------------------*
      *              * Cancellazione della variabile                   *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "out-sfl"            to   s-var                  .
           move      "="                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       del-out-sfl-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione funzione ST : Stampa                           *
      *    *-----------------------------------------------------------*
       exe-fun-stp-000.
      *              *-------------------------------------------------*
      *              * Open files necessari alla stampa                *
      *              *-------------------------------------------------*
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Routine di stampa documento                     *
      *              *-------------------------------------------------*
           perform   rou-stp-doc-000      thru rou-stp-doc-999        .
      *              *-------------------------------------------------*
      *              * Close files necessari alla stampa              *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       exe-fun-stp-999.
           exit.

      *    *===========================================================*
      *    * Open files necessari alla stampa                          *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Apertura files area 'orc'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [oct]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *                  *---------------------------------------------*
      *                  * [ocr]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *                  *---------------------------------------------*
      *                  * [ocx]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocx                 .
      *                  *---------------------------------------------*
      *                  * [zoc]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofzoc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zoc                 .
      *                  *---------------------------------------------*
      *                  * [zcv]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofzcv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zcv                 .
       rou-opn-fls-100.
      *              *-------------------------------------------------*
      *              * Apertura files area 'dcc'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [dcc]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * [zfp]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zfp                 .
      *                  *---------------------------------------------*
      *                  * [zdf]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzdf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zdf                 .
      *                  *---------------------------------------------*
      *                  * [zvf]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzvf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zvf                 .
      *                  *---------------------------------------------*
      *                  * [zsf]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzsf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zsf                 .
       rou-opn-fls-200.
      *              *-------------------------------------------------*
      *              * Apertura files area 'dcp'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [dcp]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * [pdx]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
       rou-opn-fls-300.
      *              *-------------------------------------------------*
      *              * Apertura files area 'cge'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [cli]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * Apertura files area 'abi'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [axs]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
      *                  *---------------------------------------------*
      *                  * [axi]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
       rou-opn-fls-400.
      *              *-------------------------------------------------*
      *              * Apertura files area 'age'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [age]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
       rou-opn-fls-500.
      *              *-------------------------------------------------*
      *              * Apertura files area 'gep'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [cbp]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofcbp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cbp                 .
       rou-opn-fls-600.
      *              *-------------------------------------------------*
      *              * Apertura files area 'mag'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [mau]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmau"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mau                 .
       rou-opn-fls-700.
      *              *-------------------------------------------------*
      *              * Apertura files area 'azi'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [ada]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files necessari alla stampa                         *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Chiusura files area 'orc'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [oct]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *                  *---------------------------------------------*
      *                  * [ocr]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *                  *---------------------------------------------*
      *                  * [ocx]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocx                 .
      *                  *---------------------------------------------*
      *                  * [zoc]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofzoc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zoc                 .
      *                  *---------------------------------------------*
      *                  * [zcv]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofzcv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zcv                 .
       rou-cls-fls-100.
      *              *-------------------------------------------------*
      *              * Chiusura files area 'dcc'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [dcc]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * [zfp]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zfp                 .
      *                  *---------------------------------------------*
      *                  * [zdf]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzdf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zdf                 .
      *                  *---------------------------------------------*
      *                  * [zvf]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzvf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zvf                 .
      *                  *---------------------------------------------*
      *                  * [zsf]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzsf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zsf                 .
       rou-cls-fls-200.
      *              *-------------------------------------------------*
      *              * Chiusura files area 'dcp'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [dcp]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * [pdx]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
       rou-cls-fls-300.
      *              *-------------------------------------------------*
      *              * Chiusura files area 'cge'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [cli]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
       rou-cls-fls-400.
      *              *-------------------------------------------------*
      *              * Chiusura files area 'abi'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [axs]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
      *                  *---------------------------------------------*
      *                  * [axi]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
       rou-cls-fls-500.
      *              *-------------------------------------------------*
      *              * Chiusura files area 'age'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [age]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
       rou-cls-fls-600.
      *              *-------------------------------------------------*
      *              * Chiusura files area 'gep'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [cbp]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofcbp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cbp                 .
       rou-cls-fls-700.
      *              *-------------------------------------------------*
      *              * Chiusura files area 'mag'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [mau]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmau"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mau                 .
       rou-cls-fls-800.
      *              *-------------------------------------------------*
      *              * Chiusura files area 'azi'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [ada]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di stampa documento                               *
      *    *-----------------------------------------------------------*
       rou-stp-doc-000.
      *              *-------------------------------------------------*
      *              * Lettura record testata da stampare              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-inp-sfl-prt        to   rf-oct-num-prt         .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *              *-------------------------------------------------*
      *              * Se record non trovato : uscita senza nessuna    *
      *              * azione                                          *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to rou-stp-doc-900.
       rou-stp-doc-200.
      *              *-------------------------------------------------*
      *              * Tentativo di lettura record [ocx] di appoggio   *
      *              * ai valori di testata                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [ocx]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocx                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [ocx]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      rf-oct-num-prt       to   rf-ocx-num-prt         .
           move      zero                 to   rf-ocx-num-prg         .
           move      01                   to   rf-ocx-tip-rec         .
           move      "pgm/orc/fls/ioc/obj/iofocx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocx                 .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valori di estensione al re- *
      *                  * cord di testata                             *
      *                  *---------------------------------------------*
           move      rf-ocx-rag-ids       to   w-ext-rag-ids          .
           move      rf-ocx-rs2-ids       to   w-ext-rs2-ids          .
           move      rf-ocx-via-ids       to   w-ext-via-ids          .
           move      rf-ocx-loc-ids       to   w-ext-loc-ids          .
           move      rf-ocx-des-cdv       to   w-ext-des-cdv          .
      *              *-------------------------------------------------*
      *              * Preparazione dati per stampa testata documento  *
      *              *-------------------------------------------------*
           perform   pre-tes-doc-000      thru pre-tes-doc-999        .
       rou-stp-doc-300.
      *              *-------------------------------------------------*
      *              * Preparazione dati per stampa corpo documento    *
      *              *-------------------------------------------------*
           perform   pre-cor-doc-000      thru pre-cor-doc-999        .
       rou-stp-doc-400.
      *              *-------------------------------------------------*
      *              * Stampa modulo in PostScript                     *
      *              *-------------------------------------------------*
           perform   exe-000              thru exe-999                .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo 'mposts'                   *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mposts"                         .
       rou-stp-doc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     rou-stp-doc-999.
       rou-stp-doc-999.
           exit.

      *    *===========================================================*
      *    * Preparazione dati per stampa testata documento            *
      *    *-----------------------------------------------------------*
       pre-tes-doc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valori da stampare di testata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-fdl-tes              .
       pre-tes-doc-050.
      *              *-------------------------------------------------*
      *              * Numero documento                                *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      rf-oct-num-doc       to   w-num-doc-num          .
           move      w-num-doc-prg        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-fdl-tes-nnu-ord      .
       pre-tes-doc-100.
      *              *-------------------------------------------------*
      *              * Data documento                                  *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      rf-oct-dat-doc       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-fdl-tes-nda-ord      .
       pre-tes-doc-150.
      *              *-------------------------------------------------*
      *              * Lettura dati anagrafici archivio                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo archivio    *
      *                  *---------------------------------------------*
           if        rf-oct-tip-arc       =    "C"
                     go to pre-tes-doc-160
           else      go to pre-tes-doc-300.
       pre-tes-doc-160.
      *                  *---------------------------------------------*
      *                  * Tipo archivio : Clienti                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [cli]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [cli]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-oct-cod-arc       to   rf-cli-cod-cli         .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori                   *
      *                      *-----------------------------------------*
           move      rf-cli-rag-soc       to   w-int-doc-rag          .
           move      rf-cli-via-cli       to   w-int-doc-via          .
           move      rf-cli-loc-cli       to   w-int-doc-loc          .
           move      rf-cli-cod-fis       to   w-int-doc-cfi          .
           move      rf-cli-prt-iva       to   w-int-doc-piv          .
           move      spaces               to   w-int-doc-tel          .
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [dcc]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [dcc]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-oct-cod-arc       to   rf-dcc-cod-cli         .
           move      spaces               to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     pre-tes-doc-300.
       pre-tes-doc-190.
      *                  *---------------------------------------------*
      *                  * Tipo archivio : Nessuno                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione valori                  *
      *                      *-----------------------------------------*
           move      spaces               to   w-int-doc-rag          .
           move      spaces               to   w-int-doc-via          .
           move      spaces               to   w-int-doc-loc          .
           move      spaces               to   w-int-doc-cfi          .
           move      zero                 to   w-int-doc-piv          .
           move      spaces               to   w-int-doc-tel          .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     pre-tes-doc-300.
       pre-tes-doc-300.
      *              *-------------------------------------------------*
      *              * Indirizzo di spedizione merce                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo indirizzo   *
      *                  * di spedizione :                             *
      *                  * - 01 : Alla sede legale                     *
      *                  * - 02 : Manuale                              *
      *                  * - 03 : Alla sede                            *
      *                  * - 04 : Alla dipendenza                      *
      *                  *---------------------------------------------*
           go to     pre-tes-doc-310
                     pre-tes-doc-320
                     pre-tes-doc-330
                     pre-tes-doc-340
                                depending on   rf-oct-tip-ids         .
       pre-tes-doc-310.
      *                  *---------------------------------------------*
      *                  * Tipo indirizzo di spedizione : Alla sede    *
      *                  * legale                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Memorizzazione dati da intestazione do- *
      *                      * cumento                                 *
      *                      *-----------------------------------------*
           move      w-int-doc-rag        to   w-ind-spe-rag          .
           move      spaces               to   w-ind-spe-rs2          .
           move      w-int-doc-via        to   w-ind-spe-via          .
           move      w-int-doc-loc        to   w-ind-spe-loc          .
           move      w-int-doc-rag        to   w-ind-spe-rag          .
           move      w-int-doc-tel        to   w-ind-spe-tel          .
      *                      *-----------------------------------------*
      *                      * A stampa                                *
      *                      *-----------------------------------------*
           go to     pre-tes-doc-350.
       pre-tes-doc-320.
      *                  *---------------------------------------------*
      *                  * Tipo indirizzo di spedizione : Manuale      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Memorizzazione dati file di estensione  *
      *                      *-----------------------------------------*
           move      w-ext-rag-ids        to   w-ind-spe-rag          .
           move      w-ext-rs2-ids        to   w-ind-spe-rs2          .
           move      w-ext-via-ids        to   w-ind-spe-via          .
           move      w-ext-loc-ids        to   w-ind-spe-loc          .
      *                      *-----------------------------------------*
      *                      * A stampa                                *
      *                      *-----------------------------------------*
           go to     pre-tes-doc-350.
       pre-tes-doc-330.
      *                  *---------------------------------------------*
      *                  * Tipo indirizzo di spedizione : Alla sede    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [dcc]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [dcc]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-oct-cod-arc       to   rf-dcc-cod-cli         .
           move      spaces               to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione valori                  *
      *                      *-----------------------------------------*
           move      rf-dcc-rs1-doc       to   w-ind-spe-rag          .
           move      rf-dcc-rs2-doc       to   w-ind-spe-rs2          .
           move      rf-dcc-via-dcc       to   w-ind-spe-via          .
           move      rf-dcc-loc-dcc       to   w-ind-spe-loc          .
      *                      *-----------------------------------------*
      *                      * A stampa                                *
      *                      *-----------------------------------------*
           go to     pre-tes-doc-350.
       pre-tes-doc-340.
      *                  *---------------------------------------------*
      *                  * Tipo indirizzo di spedizione : Alla dipen-  *
      *                  * denza                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [dcc]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [dcc]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-oct-cod-arc       to   rf-dcc-cod-cli         .
           move      rf-oct-dpz-arc       to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione valori                  *
      *                      *-----------------------------------------*
           move      rf-dcc-rs1-doc       to   w-ind-spe-rag          .
           move      rf-dcc-rs2-doc       to   w-ind-spe-rs2          .
           move      rf-dcc-via-dcc       to   w-ind-spe-via          .
           move      rf-dcc-loc-dcc       to   w-ind-spe-loc          .
      *                      *-----------------------------------------*
      *                      * A stampa                                *
      *                      *-----------------------------------------*
           go to     pre-tes-doc-350.
       pre-tes-doc-350.
      *                  *---------------------------------------------*
      *                  * Ragione sociale - 1                         *
      *                  *---------------------------------------------*
           move      w-ind-spe-rag        to   w-fdl-tes-rag-dst      .
      *                  *---------------------------------------------*
      *                  * Indirizzo                                   *
      *                  *---------------------------------------------*
           move      w-ind-spe-via        to   w-fdl-tes-via-dst      .
      *                  *---------------------------------------------*
      *                  * Localita'                                   *
      *                  *---------------------------------------------*
           move      w-ind-spe-loc        to   w-fdl-tes-loc-dst      .
       pre-tes-doc-400.
      *              *-------------------------------------------------*
      *              * Indirizzo di inoltro documento                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo di inoltro  *
      *                  * documento :                                 *
      *                  * - 01 : alla sede                            *
      *                  * - 02 : alla sede legale                     *
      *                  * - 03 : alla dipendenza                      *
      *                  *---------------------------------------------*
           go to     pre-tes-doc-410
                     pre-tes-doc-420
                     pre-tes-doc-430
                                depending on   rf-oct-inl-dcm         .
       pre-tes-doc-410.
      *                  *---------------------------------------------*
      *                  * Indirizzo di inoltro : alla sede            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [dcc]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [dcc]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-oct-cod-arc       to   rf-dcc-cod-cli         .
           move      spaces               to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione valori                  *
      *                      *-----------------------------------------*
           move      rf-dcc-rs1-doc       to   w-inl-dcm-rs1          .
           move      rf-dcc-rs2-doc       to   w-inl-dcm-rs2          .
           move      rf-dcc-via-dcc       to   w-inl-dcm-via          .
           move      rf-dcc-loc-dcc       to   w-inl-dcm-loc          .
           move      spaces               to   w-inl-dcm-tel          .
      *                      *-----------------------------------------*
      *                      * A stampa indirizzo di inoltro           *
      *                      *-----------------------------------------*
           go to     pre-tes-doc-450.
       pre-tes-doc-420.
      *                  *---------------------------------------------*
      *                  * Indirizzo di inoltro : alla sede legale     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Memorizzazione dati da intestazione do- *
      *                      * cumento                                 *
      *                      *-----------------------------------------*
           move      w-int-doc-rag        to   w-inl-dcm-rs1          .
           move      spaces               to   w-inl-dcm-rs2          .
           move      w-int-doc-via        to   w-inl-dcm-via          .
           move      w-int-doc-loc        to   w-inl-dcm-loc          .
           move      w-int-doc-tel        to   w-inl-dcm-tel          .
      *                      *-----------------------------------------*
      *                      * A stampa indirizzo di inoltro           *
      *                      *-----------------------------------------*
           go to     pre-tes-doc-450.
       pre-tes-doc-430.
      *                  *---------------------------------------------*
      *                  * Indirizzo di spedizione : alla dipendenza   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [dcc]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [dcc]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      rf-oct-cod-arc       to   rf-dcc-cod-cli         .
           move      rf-oct-dpz-arc       to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione valori                  *
      *                      *-----------------------------------------*
           move      rf-dcc-rs1-doc       to   w-inl-dcm-rs1          .
           move      rf-dcc-rs2-doc       to   w-inl-dcm-rs2          .
           move      rf-dcc-via-dcc       to   w-inl-dcm-via          .
           move      rf-dcc-loc-dcc       to   w-inl-dcm-loc          .
           move      spaces               to   w-inl-dcm-tel          .
      *                      *-----------------------------------------*
      *                      * A stampa indirizzo di inoltro           *
      *                      *-----------------------------------------*
           go to     pre-tes-doc-450.
       pre-tes-doc-450.
      *                  *---------------------------------------------*
      *                  * Stampa indirizzo di inoltro                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ragione sociale 1a parte                *
      *                      *-----------------------------------------*
           move      w-inl-dcm-rs1        to   w-fdl-tes-rag-cli      .
       pre-tes-doc-500.
      *              *-------------------------------------------------*
      *              * Numero e data ordine cliente                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non esistenti : oltre                    *
      *                  *---------------------------------------------*
           if        rf-oct-ocl-num       =    spaces and
                     rf-oct-ocl-dat       =    zero
                     go to pre-tes-doc-550.
      *                  *---------------------------------------------*
      *                  * Composizione stringa                        *
      *                  *---------------------------------------------*
           move      spaces               to   w-stp-ned-des          .
           move      1                    to   w-stp-ned-pnt          .
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           string    "Vs. Ordine"
                                delimited by   size
                                          into w-stp-ned-des
                                  with pointer w-stp-ned-pnt          .
      *                      *-----------------------------------------*
      *                      * Numero ordine cliente                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se esistente                   *
      *                          *-------------------------------------*
           if        rf-oct-ocl-num       =    spaces
                     go to pre-tes-doc-510.
      *                          *-------------------------------------*
      *                          * String                              *
      *                          *-------------------------------------*
           string    " nr. "
                                delimited by   size
                     rf-oct-ocl-num
                                delimited by   spaces
                                          into w-stp-ned-des
                                  with pointer w-stp-ned-pnt          .
       pre-tes-doc-510.
      *                      *-----------------------------------------*
      *                      * Data ordine cliente                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se esistente                   *
      *                          *-------------------------------------*
           if        rf-oct-ocl-dat       =    zero
                     go to pre-tes-doc-520.
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           string    " del "
                                delimited by   size
                                          into w-stp-ned-des
                                  with pointer w-stp-ned-pnt          .
      *                          *-------------------------------------*
      *                          * Editing                             *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      rf-oct-ocl-dat       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Operazione di string                *
      *                          *-------------------------------------*
           string    p-edt
                                delimited by   spaces
                                          into w-stp-ned-des
                                  with pointer w-stp-ned-pnt          .
       pre-tes-doc-520.
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      w-stp-ned-des        to   w-fdl-tes-rif-or1      .
       pre-tes-doc-550.
      *              *-------------------------------------------------*
      *              * Riferimento ordine cliente                      *
      *              *-------------------------------------------------*
           move      rf-oct-ocl-rif       to   w-fdl-tes-rif-or2      .
       pre-tes-doc-560.
      *              *-------------------------------------------------*
      *              * Numero di telefono del cliente                  *
      *              *-------------------------------------------------*
           move      w-inl-dcm-tel        to   w-fdl-tes-tel-cli      .
       pre-tes-doc-800.
      *              *-------------------------------------------------*
      *              * Commenti ad uso interno                         *
      *              *-------------------------------------------------*
           move      rf-oct-com-rig (1)   to   w-fdl-tes-not-001      .
           move      rf-oct-com-rig (2)   to   w-fdl-tes-not-002      .
           move      rf-oct-com-rig (3)   to   w-fdl-tes-not-003      .
       pre-tes-doc-850.
      *              *-------------------------------------------------*
      *              * Data consegna unica generale                    *
      *              *-------------------------------------------------*
           if        rf-oct-dat-cns       =    rf-oct-dat-doc
                     go to pre-tes-doc-900.
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      rf-oct-dat-cns       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-fdl-tes-dat-cns      .
       pre-tes-doc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     pre-tes-doc-999.
       pre-tes-doc-999.
           exit.

      *    *===========================================================*
      *    * Preparazione dati per stampa corpo documento              *
      *    *-----------------------------------------------------------*
       pre-cor-doc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valori da stampare di corpo     *
      *              *-------------------------------------------------*
           move      spaces               to   w-fdl-pos              .
           move      zero                 to   w-fdl-dps-pos-tot      .
       pre-cor-doc-100.
      *              *-------------------------------------------------*
      *              * Start su righe documento [ocr]                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      rf-oct-num-prt       to   rf-ocr-num-prt         .
           move      zero                 to   rf-ocr-num-prg         .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *              *-------------------------------------------------*
      *              * Test su esito della start                       *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to pre-cor-doc-900.
       pre-cor-doc-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [ocr]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *              *-------------------------------------------------*
      *              * Test se 'at end'                                *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to pre-cor-doc-900.
       pre-cor-doc-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-ocr-num-prt       not  = rf-oct-num-prt
                     go to pre-cor-doc-900.
      *              *-------------------------------------------------*
      *              * Se quantita' diversa da zero e non si e' alla   *
      *              * prima riga : si crea una linea in bianco per la *
      *              * separazione                                     *
      *              *-------------------------------------------------*
           if        w-fdl-dps-pos-tot    =    zero
                     go to pre-cor-doc-350.
           if        rf-ocr-tip-rig       not  = "P " and
                     rf-ocr-tip-rig       not  = "PN" and
                     rf-ocr-tip-rig       not  = "M " and
                     rf-ocr-tip-rig       not  = "S " and
                     rf-ocr-tip-rig       not  = "V "
                     go to pre-cor-doc-350.
           if        rf-ocr-qta-ord       =    zero
                     go to pre-cor-doc-350.
           if        w-fdl-dps-pos-tot    <    500
                     perform   add-rig-bla-000
                        thru   add-rig-bla-999
           else      go to pre-cor-doc-900.
       pre-cor-doc-350.
      *              *-------------------------------------------------*
      *              * Incremento numero posizioni totali              *
      *              *-------------------------------------------------*
           if        w-fdl-dps-pos-tot    <    500
                     add   1              to   w-fdl-dps-pos-tot
           else      go to pre-cor-doc-900.
       pre-cor-doc-400.
      *              *-------------------------------------------------*
      *              * Se manca la quantita' : a descrizione           *
      *              *-------------------------------------------------*
           if        rf-ocr-tip-rig       not  = "P " and
                     rf-ocr-tip-rig       not  = "PN" and
                     rf-ocr-tip-rig       not  = "M " and
                     rf-ocr-tip-rig       not  = "S " and
                     rf-ocr-tip-rig       not  = "V "
                     go to pre-cor-doc-465.
           if        rf-ocr-qta-ord       =    zero
                     go to pre-cor-doc-465.
       pre-cor-doc-450.
      *              *-------------------------------------------------*
      *              * Unita' di misura                                *
      *              *-------------------------------------------------*
           move      rf-ocr-umi-ven       to   w-fdl-pos-uni-mis
                                              (w-fdl-dps-pos-tot)     .
       pre-cor-doc-455.
      *              *-------------------------------------------------*
      *              * Quantita'                                       *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      rf-ocr-dec-qta       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GD"                to   p-edm                  .
           move      rf-ocr-qta-ord       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-fdl-pos-qta-pos
                                              (w-fdl-dps-pos-tot)     .
       pre-cor-doc-457.
      *              *-------------------------------------------------*
      *              * Codice prodotto sulla linea successiva          *
      *              *-------------------------------------------------*
           if        rf-ocr-qta-ord       =    zero
                     go to pre-cor-doc-460.
           if        w-fdl-dps-pos-tot    not  < 500
                     go to pre-cor-doc-460.
           move      w-fdl-dps-pos-tot    to   w-fdl-dps-num-pos      .
           add       1                    to   w-fdl-dps-num-pos      .
           move      rf-ocr-alf-pro       to   w-fdl-pos-cod-pro
                                              (w-fdl-dps-num-pos)     .
       pre-cor-doc-460.
      *              *-------------------------------------------------*
      *              * Data consegna                                   *
      *              *-------------------------------------------------*
           if        rf-oct-dat-cns       not  = rf-oct-dat-doc
                     go to pre-cor-doc-465.
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      rf-ocr-dcn-ric       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-fdl-pos-dat-cns
                                              (w-fdl-dps-pos-tot)     .
       pre-cor-doc-465.
      *              *-------------------------------------------------*
      *              * Descrizione principale                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Sub-routine di determinazione della         *
      *                  * descrizione                                 *
      *                  *---------------------------------------------*
           perform   det-des-rig-000      thru det-des-rig-999        .
      *                  *---------------------------------------------*
      *                  * Prima riga della descrizione                *
      *                  *---------------------------------------------*
           move      w-pre-cor-doc-rgd (1)
                                          to   w-fdl-pos-des-pos
                                              (w-fdl-dps-pos-tot)     .
       pre-cor-doc-500.
      *                  *---------------------------------------------*
      *                  * Altre 11 eventuali righe di descrizione     *
      *                  *---------------------------------------------*
           move      1                    to   w-pre-cor-doc-nrd      .
       pre-cor-doc-510.
           add       1                    to   w-pre-cor-doc-nrd      .
           if        w-pre-cor-doc-nrd    >    12
                     go to pre-cor-doc-600.
           if        w-pre-cor-doc-rgd
                    (w-pre-cor-doc-nrd)   =    spaces
                     go to pre-cor-doc-510.
           if        w-fdl-dps-pos-tot    <    500
                     add   1              to   w-fdl-dps-pos-tot
           else      go to pre-cor-doc-900.
           move      w-pre-cor-doc-rgd
                    (w-pre-cor-doc-nrd)    to   w-fdl-pos-des-pos
                                              (w-fdl-dps-pos-tot)     .
           go to     pre-cor-doc-510.
       pre-cor-doc-600.
      *              *-------------------------------------------------*
      *              * Riciclo a lettura della riga successiva         *
      *              *-------------------------------------------------*
           go to     pre-cor-doc-200.
       pre-cor-doc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     pre-cor-doc-999.
       pre-cor-doc-999.
           exit.

      *    *===========================================================*
      *    * Aggiunta di una riga in bianco                            *
      *    *-----------------------------------------------------------*
       add-rig-bla-000.
      *              *-------------------------------------------------*
      *              * Test se il buffer la puo' ospitare              *
      *              *-------------------------------------------------*
           if        w-fdl-dps-pos-tot    not  < 500
                     go to add-rig-bla-999.
      *              *-------------------------------------------------*
      *              * Incremento numero posizione                     *
      *              *-------------------------------------------------*
           add       1                    to   w-fdl-dps-pos-tot      .
       add-rig-bla-999.
           exit.

      *    *===========================================================*
      *    * Determinazione descrizione per la riga                    *
      *    *-----------------------------------------------------------*
       det-des-rig-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valori di comodo                *
      *              *-------------------------------------------------*
           move      spaces               to   w-pre-cor-doc-der      .
           move      zero                 to   w-pre-cor-doc-c01      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del flag di estensione   *
      *              *-------------------------------------------------*
           if        rf-ocr-des-ext       =    0
                     go to det-des-rig-100
           else if   rf-ocr-des-ext       =    1
                     go to det-des-rig-300
           else if   rf-ocr-des-ext       =    2
                     go to det-des-rig-600.
       det-des-rig-100.
      *              *-------------------------------------------------*
      *              * Se nessuna estensione                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Descrizione contenuta in record [ocr]       *
      *                  *---------------------------------------------*
           move      rf-ocr-des-rig       to   w-pre-cor-doc-der      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-des-rig-900.
       det-des-rig-300.
      *              *-------------------------------------------------*
      *              * Se estensione in file [ocx]                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura file [ocx]                          *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-inp-sfl-prt        to   rf-ocx-num-prt         .
           move      rf-ocr-num-prg       to   rf-ocx-num-prg         .
           move      11                   to   rf-ocx-tip-rec         .
           move      "pgm/orc/fls/ioc/obj/iofocx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocx                 .
           if        f-sts                =    e-not-err
                     move  rf-ocx-des-400 to   w-pre-cor-doc-der
           else      move  spaces         to   w-pre-cor-doc-der      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-des-rig-900.
       det-des-rig-600.
      *              *-------------------------------------------------*
      *              * Se estensione in file [pdx]                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcp]                      *
      *                  *---------------------------------------------*
           move      rf-ocr-num-pro       to   w-let-dcp-pdx-cod      .
           move      rf-oct-tip-arc       to   w-let-dcp-pdx-tar      .
           if        rf-oct-tip-frn       =    11
                     move  rf-oct-cod-arc to   w-let-dcp-pdx-arc
           else      move  rf-oct-arc-plf to   w-let-dcp-pdx-arc      .
           move      rf-ocr-cod-lng       to   w-let-dcp-pdx-lng      .
           perform   let-dcp-pdx-000      thru let-dcp-pdx-999        .
           move      w-let-dcp-pdx-des    to   w-pre-cor-doc-der      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-des-rig-900.
       det-des-rig-900.
      *              *-------------------------------------------------*
      *              * Eventuale integrazione con righe aggiuntive per *
      *              * il codice prodotto                              *
      *              *-------------------------------------------------*
           perform   det-des-rig-rac-000  thru det-des-rig-rac-999    .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-des-rig-999.
       det-des-rig-999.
           exit.

      *    *===========================================================*
      *    * Determinazione descrizione per la riga                    *
      *    *                                                           *
      *    * Subroutine per l'eventuale integrazione con righe ag-     *
      *    * giuntive per il codice prodotto                           *
      *    *-----------------------------------------------------------*
       det-des-rig-rac-000.
      *              *-------------------------------------------------*
      *              * Scansione delle righe di descrizione per otte-  *
      *              * nere il posizionamento della prima riga libera  *
      *              * da utilizzare per la stampa dei codici          *
      *              *-------------------------------------------------*
           move      11                   to   w-pre-cor-doc-c01      .
       det-des-rig-rac-010.
           subtract  1                    from w-pre-cor-doc-c01      .
           if        w-pre-cor-doc-c01    =    zero
                     go to det-des-rig-rac-011.
           if        w-pre-cor-doc-rgd
                    (w-pre-cor-doc-c01)   =    spaces
                     go to det-des-rig-rac-010.
       det-des-rig-rac-011.
           move      w-pre-cor-doc-c01    to   w-pre-cor-doc-c02      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione della relativa persona-  *
      *              * lizzazione                                      *
      *              *-------------------------------------------------*
           if        w-prs-soc-rac        =    "N"
                     go to det-des-rig-rac-100
           else if   w-prs-soc-rac        =    "C" or
                     w-prs-soc-rac        =    "E"
                     go to det-des-rig-rac-200
           else if   w-prs-soc-rac        =    "M"
                     go to det-des-rig-rac-300
           else      go to det-des-rig-rac-100.
       det-des-rig-rac-100.
      *              *-------------------------------------------------*
      *              * Nessuna riga aggiuntiva                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     det-des-rig-rac-900.
       det-des-rig-rac-200.
      *              *-------------------------------------------------*
      *              * Una riga aggiuntiva con il codice del cliente   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test preliminari                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se codice del cliente a spaces : a test *
      *                      * se altra riga contenente in ns. codice  *
      *                      *-----------------------------------------*
           if        rf-ocr-cop-scl       =    spaces
                     go to det-des-rig-rac-290.
      *                      *-----------------------------------------*
      *                      * Incremento del contatore                *
      *                      *-----------------------------------------*
           add       1                    to   w-pre-cor-doc-c02      .
      *                      *-----------------------------------------*
      *                      * Composizione riga aggiuntiva            *
      *                      *-----------------------------------------*
           move      spaces               to   w-pre-cor-doc-rgd
                                              (w-pre-cor-doc-c02)     .
           string    "  - Vs. codice : "
                                delimited by   size
                     rf-ocr-cop-scl
                                delimited by   size
                                          into w-pre-cor-doc-rgd
                                              (w-pre-cor-doc-c02)     .
       det-des-rig-rac-290.
      *                  *---------------------------------------------*
      *                  * Test se altra riga aggiuntiva con il nostro *
      *                  * codice                                      *
      *                  *---------------------------------------------*
           if        w-prs-soc-rac        =    "E"
                     go to det-des-rig-rac-300.
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     det-des-rig-rac-900.
       det-des-rig-rac-300.
      *              *-------------------------------------------------*
      *              * Una riga aggiuntiva con il codice nostro        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test preliminari                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se nostro codice a spaces : ad uscita   *
      *                      *-----------------------------------------*
           if        rf-ocr-alf-pro       =    spaces
                     go to det-des-rig-rac-900.
      *                      *-----------------------------------------*
      *                      * Incremento del contatore                *
      *                      *-----------------------------------------*
           add       1                    to   w-pre-cor-doc-c02      .
      *                      *-----------------------------------------*
      *                      * Composizione riga aggiuntiva            *
      *                      *-----------------------------------------*
           move      spaces               to   w-pre-cor-doc-rgd
                                              (w-pre-cor-doc-c02)     .
           string    "  - Ns. codice : "
                                delimited by   size
                     rf-ocr-alf-pro
                                delimited by   size
                                          into w-pre-cor-doc-rgd
                                              (w-pre-cor-doc-c02)     .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     det-des-rig-rac-900.
       det-des-rig-rac-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-des-rig-rac-999.
       det-des-rig-rac-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [dcp] e [pdx]                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/ldcppdx0.lts"                   .

      *    *===========================================================*
      *    * Stampa modulo in PostScript                               *
      *    *-----------------------------------------------------------*
       exe-000.
      *              *-------------------------------------------------*
      *              * Determinazione numero posizioni presenti        *
      *              *-------------------------------------------------*
           move      501                  to   w-fdl-dps-pos-tot      .
       exe-050.
           subtract  1                    from w-fdl-dps-pos-tot      .
           if        w-fdl-dps-pos-tot    =    zero
                     go to exe-100.
           if        w-fdl-pos-xxx
                    (w-fdl-dps-pos-tot)   =    spaces
                     go to exe-050.
       exe-075.
           if        w-fdl-pos-des-pos
                    (w-fdl-dps-pos-tot)   =    spaces
                     go to exe-100.
           if        w-fdl-dps-pos-tot    <    500
                     add   1              to   w-fdl-dps-pos-tot      .
       exe-100.
      *              *-------------------------------------------------*
      *              * Se zero posizioni : uscita immediata            *
      *              *-------------------------------------------------*
           if        w-fdl-dps-pos-tot    =    zero
                     go to exe-900.
       exe-150.
      *              *-------------------------------------------------*
      *              * Inizializzazione numero pagina attuale          *
      *              *-------------------------------------------------*
           move      zero                 to   w-fdl-dps-num-pag      .
      *              *-------------------------------------------------*
      *              * Calcolo numero pagine totali                    *
      *              *-------------------------------------------------*
           move      w-fdl-dps-pos-tot    to   w-fdl-dps-quo-div      .
           divide    16                   into w-fdl-dps-quo-div
                                     remainder w-fdl-dps-pag-tot      .
           if        w-fdl-dps-pag-tot    >    zero
                     move  1              to   w-fdl-dps-pag-tot      .
           add       w-fdl-dps-quo-div    to   w-fdl-dps-pag-tot      .
       exe-200.
      *              *-------------------------------------------------*
      *              * Inizializzazione job di stampa                  *
      *              *-------------------------------------------------*
           perform   exe-ini-000          thru exe-ini-999            .
      *              *-------------------------------------------------*
      *              * Inizializzazione indice su numero posizione at- *
      *              * tuale                                           *
      *              *-------------------------------------------------*
           move      zero                 to   w-fdl-dps-num-pos      .
       exe-300.
      *              *-------------------------------------------------*
      *              * Incremento indice su numero posizione attuale   *
      *              *-------------------------------------------------*
           add       1                    to   w-fdl-dps-num-pos      .
      *              *-------------------------------------------------*
      *              * Se oltre il numero totale di posizioni presen-  *
      *              * ti : a fine pagina e terminazione job di stampa *
      *              *-------------------------------------------------*
           if        w-fdl-dps-num-pos    >    w-fdl-dps-pos-tot
                     go to exe-600.
      *              *-------------------------------------------------*
      *              * Calcolo del numero posizione relativo al fo-    *
      *              * glio                                            *
      *              *-------------------------------------------------*
           move      w-fdl-dps-num-pos    to   w-fdl-dps-quo-div      .
           divide    16                   into w-fdl-dps-quo-div
                                     remainder w-fdl-dps-num-rel      .
           if        w-fdl-dps-num-rel    =    zero
                     move  16             to   w-fdl-dps-num-rel      .
      *              *-------------------------------------------------*
      *              * Se numero posizione relativo diverso da 1 si    *
      *              * tralasciano le azioni di inizio pagina          *
      *              *-------------------------------------------------*
           if        w-fdl-dps-num-rel    >    1
                     go to exe-400.
      *              *-------------------------------------------------*
      *              * Incremento numero pagina                        *
      *              *-------------------------------------------------*
           add       1                    to   w-fdl-dps-num-pag      .
      *              *-------------------------------------------------*
      *              * Se numero pagina pari a 1 non si esegue il      *
      *              * fine pagina precedente                          *
      *              *-------------------------------------------------*
           if        w-fdl-dps-num-pag    =    1
                     go to exe-350.
      *              *-------------------------------------------------*
      *              * PageEnd                                         *
      *              *-------------------------------------------------*
           move      "PageEnd"
                                          to   ps-tip-ope             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-350.
      *              *-------------------------------------------------*
      *              * PageStart                                       *
      *              *-------------------------------------------------*
           move      "PageStart"
                                          to   ps-tip-ope             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * Disegna modulo                                  *
      *              *-------------------------------------------------*
           perform   exe-dis-mod-000      thru exe-dis-mod-999        .
      *              *-------------------------------------------------*
      *              * Intestazione modulo                             *
      *              *-------------------------------------------------*
           perform   exe-int-mod-000      thru exe-int-mod-999        .
       exe-400.
      *              *-------------------------------------------------*
      *              * Stampa posizione                                *
      *              *-------------------------------------------------*
           perform   exe-stp-pos-000      thru exe-stp-pos-999        .
       exe-450.
      *              *-------------------------------------------------*
      *              * Riciclo per posizione successiva                *
      *              *-------------------------------------------------*
           go to     exe-300.
       exe-600.
      *              *-------------------------------------------------*
      *              * PageEnd                                         *
      *              *-------------------------------------------------*
           move      "PageEnd"
                                          to   ps-tip-ope             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * Terminazione job                                *
      *              *-------------------------------------------------*
           perform   exe-ter-000          thru exe-ter-999            .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo 'mposts'                   *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mposts"                         .
       exe-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-999.
       exe-999.
           exit.

      *    *===========================================================*
      *    * Inizializzazione                                          *
      *    *-----------------------------------------------------------*
       exe-ini-000.
      *              *-------------------------------------------------*
      *              * JobInit                                         *
      *              *-------------------------------------------------*
           move      "JobInit"
                                          to   ps-tip-ope             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * JobStart                                        *
      *              *-------------------------------------------------*
           move      "JobStart"
                                          to   ps-tip-ope             .
           move      w-inp-sfl-stp        to   ps-cod-stp             .
           move      "A4"
                                          to   ps-pag-siz             .
           move      "Landscape"
                                          to   ps-pag-ori             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * JobPrologStart                                  *
      *              *-------------------------------------------------*
           move      "JobPrologStart"
                                          to   ps-tip-ope             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * JobPrologEnd                                    *
      *              *-------------------------------------------------*
           move      "JobPrologEnd"
                                          to   ps-tip-ope             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * JobSetupStart                                   *
      *              *-------------------------------------------------*
           move      "JobSetupStart"
                                          to   ps-tip-ope             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * SetHorizontalVerticalFactor : Mm                *
      *              *-------------------------------------------------*
           move      "SetHorizontalVerticalFactor"
                                          to   ps-tip-ope             .
           move      "Mm"
                                          to   ps-lit-scf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * JobSetupEnd                                     *
      *              *-------------------------------------------------*
           move      "JobSetupEnd"
                                          to   ps-tip-ope             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-ini-999.
           exit.

      *    *===========================================================*
      *    * Terminazione                                              *
      *    *-----------------------------------------------------------*
       exe-ter-000.
      *              *-------------------------------------------------*
      *              * JobEnd                                          *
      *              *-------------------------------------------------*
           move      "JobEnd"
                                          to   ps-tip-ope             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-ter-999.
           exit.

      *    *===========================================================*
      *    * Disegna modulo                                            *
      *    *-----------------------------------------------------------*
       exe-dis-mod-000.
      *              *-------------------------------------------------*
      *              * Rettangolo arrotondato superiore sinistro       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Rettangolo arrotondato                      *
      *                  *---------------------------------------------*
           move      "RoundRectStroke"
                                          to   ps-tip-ope             .
           move      010                  to   ps-coo-xxx             .
           move      160                  to   ps-coo-yyy             .
           move      250                  to   ps-coo-xto             .
           move      200                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-dis-mod-100.
      *                  *---------------------------------------------*
      *                  * Linea orizzontale superiore                 *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      010                  to   ps-coo-xxx             .
           move      190                  to   ps-coo-yyy             .
           move      250                  to   ps-coo-xto             .
           move      190                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale centrale                    *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      150                  to   ps-coo-xxx             .
           move      170                  to   ps-coo-yyy             .
           move      150                  to   ps-coo-xto             .
           move      190                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea orizzontale inferiore                 *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      010                  to   ps-coo-xxx             .
           move      170                  to   ps-coo-yyy             .
           move      250                  to   ps-coo-xto             .
           move      170                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Font : Helvetica-BoldOblique 6              *
      *                  *---------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica-BoldOblique"
                                          to   ps-fon-nam             .
           move      6                    to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Cliente                            *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      012                  to   ps-coo-xxx             .
           move      197                  to   ps-coo-yyy             .
           move      "Cliente"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Destinatario Merce                 *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      012                  to   ps-coo-xxx             .
           move      187                  to   ps-coo-yyy             .
           move      "Destinatario Merce"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Note                               *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      012                  to   ps-coo-xxx             .
           move      167                  to   ps-coo-yyy             .
           move      "Note"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Riferimenti Ordine                 *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      152                  to   ps-coo-xxx             .
           move      187                  to   ps-coo-yyy             .
           move      "Riferimenti Ordine"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-dis-mod-200.
      *              *-------------------------------------------------*
      *              * Rettangolo arrotondato superiore destro         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Rettangolo arrotondato                      *
      *                  *---------------------------------------------*
           move      "RoundRectStroke"
                                          to   ps-tip-ope             .
           move      250                  to   ps-coo-xxx             .
           move      160                  to   ps-coo-yyy             .
           move      290                  to   ps-coo-xto             .
           move      200                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea orizzontale centrale                  *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      250                  to   ps-coo-xxx             .
           move      180                  to   ps-coo-yyy             .
           move      290                  to   ps-coo-xto             .
           move      180                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura D.D.T.                             *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      252                  to   ps-coo-xxx             .
           move      197                  to   ps-coo-yyy             .
           move      "D.D.T."
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Data di Consegna                   *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      252                  to   ps-coo-xxx             .
           move      177                  to   ps-coo-yyy             .
           move      "Data di Consegna Generale"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-dis-mod-300.
      *              *-------------------------------------------------*
      *              * Rettangolo arrotondato centrale sinistro        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Rettangolo arrotondato                      *
      *                  *---------------------------------------------*
           move      "RoundRectStroke"
                                          to   ps-tip-ope             .
           move      010                  to   ps-coo-xxx             .
           move      030                  to   ps-coo-yyy             .
           move      250                  to   ps-coo-xto             .
           move      160                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea orizzontale per intestazione          *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      010                  to   ps-coo-xxx             .
           move      150                  to   ps-coo-yyy             .
           move      250                  to   ps-coo-xto             .
           move      150                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per u.m.                    *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      020                  to   ps-coo-xxx             .
           move      030                  to   ps-coo-yyy             .
           move      020                  to   ps-coo-xto             .
           move      160                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per quantita'               *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      050                  to   ps-coo-xxx             .
           move      030                  to   ps-coo-yyy             .
           move      050                  to   ps-coo-xto             .
           move      160                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per descrizione             *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      150                  to   ps-coo-xxx             .
           move      030                  to   ps-coo-yyy             .
           move      150                  to   ps-coo-xto             .
           move      160                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-dis-mod-350.
      *                  *---------------------------------------------*
      *                  * Linee orizzontali per materiale impiegato   *
      *                  *---------------------------------------------*
           move      "SaveGraphicsState"
                                          to   ps-tip-ope             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "SetLineWidth"
                                          to   ps-tip-ope             .
           move      0,5                  to   ps-lin-wid             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-dis-mod-360.
           move      zero                 to   w-fdl-dps-inx-lin      .
       exe-dis-mod-365.
           add       1                    to   w-fdl-dps-inx-lin      .
           if        w-fdl-dps-inx-lin    >    15
                     go to exe-dis-mod-375.
           move      "Line"
                                          to   ps-tip-ope             .
           move      150                  to   ps-coo-xxx             .
           move      w-fdl-dps-inx-lin    to   ps-coo-yyy             .
           multiply  7,5                  by   ps-coo-yyy             .
           add       30                   to   ps-coo-yyy             .
           move      250                  to   ps-coo-xto             .
           move      ps-coo-yyy           to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
           go to     exe-dis-mod-365.
       exe-dis-mod-375.
      *                  *---------------------------------------------*
      *                  * Font : Helvetica-BoldOblique 10             *
      *                  *---------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica-BoldOblique"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura U.M.                               *
      *                  *---------------------------------------------*
           move      "BoxCPrint"
                                          to   ps-tip-ope             .
           move      010                  to   ps-coo-xxx             .
           move      150                  to   ps-coo-yyy             .
           move      020                  to   ps-coo-xto             .
           move      160                  to   ps-coo-yto             .
           move      "UM"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Quantita'                          *
      *                  *---------------------------------------------*
           move      "BoxCPrint"
                                          to   ps-tip-ope             .
           move      020                  to   ps-coo-xxx             .
           move      150                  to   ps-coo-yyy             .
           move      050                  to   ps-coo-xto             .
           move      160                  to   ps-coo-yto             .
           move      "Quantita'"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Materiale Richiesto                *
      *                  *---------------------------------------------*
           move      "BoxCPrint"
                                          to   ps-tip-ope             .
           move      050                  to   ps-coo-xxx             .
           move      150                  to   ps-coo-yyy             .
           move      150                  to   ps-coo-xto             .
           move      160                  to   ps-coo-yto             .
           move      "Materiale Richiesto"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Materiale Impiegato                *
      *                  *---------------------------------------------*
           move      "BoxCPrint"
                                          to   ps-tip-ope             .
           move      150                  to   ps-coo-xxx             .
           move      150                  to   ps-coo-yyy             .
           move      250                  to   ps-coo-xto             .
           move      160                  to   ps-coo-yto             .
           move      "Materiale Impiegato"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Data di Consegna                   *
      *                  *---------------------------------------------*
           move      "BoxCPrint"
                                          to   ps-tip-ope             .
           move      250                  to   ps-coo-xxx             .
           move      150                  to   ps-coo-yyy             .
           move      290                  to   ps-coo-xto             .
           move      160                  to   ps-coo-yto             .
           move      "Data di Consegna"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-dis-mod-400.
      *              *-------------------------------------------------*
      *              * Rettangolo arrotondato centrale destro          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Rettangolo arrotondato                      *
      *                  *---------------------------------------------*
           move      "RoundRectStroke"
                                          to   ps-tip-ope             .
           move      250                  to   ps-coo-xxx             .
           move      030                  to   ps-coo-yyy             .
           move      290                  to   ps-coo-xto             .
           move      160                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea orizzontale per intestazione          *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      250                  to   ps-coo-xxx             .
           move      150                  to   ps-coo-yyy             .
           move      290                  to   ps-coo-xto             .
           move      150                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-dis-mod-500.
      *              *-------------------------------------------------*
      *              * Rettangolo arrotondato inferiore sinistro       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Rettangolo arrotondato                      *
      *                  *---------------------------------------------*
           move      "RoundRectStroke"
                                          to   ps-tip-ope             .
           move      010                  to   ps-coo-xxx             .
           move      008                  to   ps-coo-yyy             .
           move      150                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea orizzontale di suddivisione           *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      010                  to   ps-coo-xxx             .
           move      018                  to   ps-coo-yyy             .
           move      150                  to   ps-coo-xto             .
           move      018                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per data                    *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      035                  to   ps-coo-xxx             .
           move      008                  to   ps-coo-yyy             .
           move      035                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per dalle                   *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      050                  to   ps-coo-xxx             .
           move      008                  to   ps-coo-yyy             .
           move      050                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per alle                    *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      065                  to   ps-coo-xxx             .
           move      008                  to   ps-coo-yyy             .
           move      065                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per dalle                   *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      080                  to   ps-coo-xxx             .
           move      008                  to   ps-coo-yyy             .
           move      080                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per alle                    *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      095                  to   ps-coo-xxx             .
           move      008                 to   ps-coo-yyy              .
           move      095                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per tot                     *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      110                  to   ps-coo-xxx             .
           move      008                 to   ps-coo-yyy              .
           move      110                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Font : Helvetica-BoldOblique 6              *
      *                  *---------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica-BoldOblique"
                                          to   ps-fon-nam             .
           move      6                    to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Data                               *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      012                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Data"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Dalle                              *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      037                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Dalle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Alle                               *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      052                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Alle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Dalle                              *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      067                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Dalle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Alle                               *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      082                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Alle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Totale                             *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      097                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Totale"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Lavoro eseguito da                 *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      112                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Lavoro eseguito da"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Data                               *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      012                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Data"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Dalle                              *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      037                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Dalle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Alle                               *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      052                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Alle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Dalle                              *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      067                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Dalle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Alle                               *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      082                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Alle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Totale                             *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      097                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Totale"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Lavoro eseguito da                 *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      112                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Lavoro eseguito da"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-dis-mod-600.
      *              *-------------------------------------------------*
      *              * Rettangolo arrotondato inferiore destro         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Rettangolo arrotondato                      *
      *                  *---------------------------------------------*
           move      "RoundRectStroke"
                                          to   ps-tip-ope             .
           move      150                  to   ps-coo-xxx             .
           move      008                  to   ps-coo-yyy             .
           move      290                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea orizzontale di suddivisione           *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      150                  to   ps-coo-xxx             .
           move      018                  to   ps-coo-yyy             .
           move      290                  to   ps-coo-xto             .
           move      018                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per data                    *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      175                  to   ps-coo-xxx             .
           move      008                  to   ps-coo-yyy             .
           move      175                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per dalle                   *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      190                  to   ps-coo-xxx             .
           move      008                  to   ps-coo-yyy             .
           move      190                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per alle                    *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      205                  to   ps-coo-xxx             .
           move      008                  to   ps-coo-yyy             .
           move      205                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per dalle                   *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      220                  to   ps-coo-xxx             .
           move      008                  to   ps-coo-yyy             .
           move      220                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per alle                    *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      235                  to   ps-coo-xxx             .
           move      008                 to   ps-coo-yyy              .
           move      235                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Linea verticale per tot                     *
      *                  *---------------------------------------------*
           move      "Line"
                                          to   ps-tip-ope             .
           move      250                  to   ps-coo-xxx             .
           move      008                 to   ps-coo-yyy              .
           move      250                  to   ps-coo-xto             .
           move      028                  to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Data                               *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      152                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Data"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Dalle                              *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      177                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Dalle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Alle                               *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      192                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Alle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Dalle                              *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      207                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Dalle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Alle                               *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      222                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Alle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Totale                             *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      237                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Totale"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Lavoro eseguito da                 *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      252                  to   ps-coo-xxx             .
           move      025                  to   ps-coo-yyy             .
           move      "Lavoro eseguito da"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Data                               *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      152                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Data"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Dalle                              *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      177                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Dalle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Alle                               *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      192                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Alle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Dalle                              *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      207                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Dalle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Alle                               *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      222                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Alle"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Totale                             *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      237                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Totale"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *                  *---------------------------------------------*
      *                  * Dicitura Lavoro eseguito da                 *
      *                  *---------------------------------------------*
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      252                  to   ps-coo-xxx             .
           move      015                  to   ps-coo-yyy             .
           move      "Lavoro eseguito da"
                                          to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-dis-mod-999.
           exit.

      *    *===========================================================*
      *    * Intestazione modulo                                       *
      *    *-----------------------------------------------------------*
       exe-int-mod-000.
      *              *-------------------------------------------------*
      *              * Ragione sociale del cliente                     *
      *              *-------------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica-Bold"
                                          to   ps-fon-nam             .
           move      18                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "BoxCPrint"
                                          to   ps-tip-ope             .
           move      010                  to   ps-coo-xxx             .
           move      190                  to   ps-coo-yyy             .
           move      250                  to   ps-coo-xto             .
           move      200                  to   ps-coo-yto             .
           move      w-fdl-tes-rag-cli    to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * Nostro numero e data ordine                     *
      *              *-------------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "RPrint"
                                          to   ps-tip-ope             .
           move      248                  to   ps-coo-xxx             .
           move      192                  to   ps-coo-yyy             .
           move      spaces               to   ps-str-alf             .
           string    "[ "
                                delimited by   size
                     w-fdl-tes-nnu-ord
                                delimited by   spaces
                     " - "
                                delimited by   size
                     w-fdl-tes-nda-ord
                                delimited by   spaces
                     " ]"
                                delimited by   size
                                          into ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * Ragione sociale del destinatario merce          *
      *              *-------------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      020                  to   ps-coo-xxx             .
           move      182                  to   ps-coo-yyy             .
           move      w-fdl-tes-rag-dst    to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * Indirizzo del destinatario merce                *
      *              *-------------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      020                  to   ps-coo-xxx             .
           move      177                  to   ps-coo-yyy             .
           move      w-fdl-tes-via-dst    to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * Localita' del destinatario merce                *
      *              *-------------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      020                  to   ps-coo-xxx             .
           move      172                  to   ps-coo-yyy             .
           move      w-fdl-tes-loc-dst    to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * Riferimenti ordine riga 1                       *
      *              *-------------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      160                  to   ps-coo-xxx             .
           move      182                  to   ps-coo-yyy             .
           move      w-fdl-tes-rif-or1    to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * Riferimenti ordine riga 2                       *
      *              *-------------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      160                  to   ps-coo-xxx             .
           move      177                  to   ps-coo-yyy             .
           move      w-fdl-tes-rif-or2    to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-int-mod-100.
      *              *-------------------------------------------------*
      *              * Numero di telefono del cliente                  *
      *              *-------------------------------------------------*
           if        w-fdl-tes-tel-cli    =    spaces
                     go to exe-int-mod-150.
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      160                  to   ps-coo-xxx             .
           move      172                  to   ps-coo-yyy             .
           move      spaces               to   ps-str-alf             .
           string    "Tel: "
                                delimited by   size
                     w-fdl-tes-tel-cli
                                 delimited by   size
                                          into ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-int-mod-150.
      *              *-------------------------------------------------*
      *              * Data consegna generale                          *
      *              *-------------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica-Bold"
                                          to   ps-fon-nam             .
           move      14                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "BoxCPrint"
                                          to   ps-tip-ope             .
           move      250                  to   ps-coo-xxx             .
           move      160                  to   ps-coo-yyy             .
           move      290                  to   ps-coo-xto             .
           move      180                  to   ps-coo-yto             .
           move      w-fdl-tes-dat-cns    to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-int-mod-300.
      *              *-------------------------------------------------*
      *              * Numero pagina                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing numero attuale pagina               *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      3                    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-fdl-dps-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-fdl-dps-edt-npa      .
      *                  *---------------------------------------------*
      *                  * Editing numero totale pagine                *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      3                    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-fdl-dps-pag-tot    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-fdl-dps-edt-ntp      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "RPrint"
                                          to   ps-tip-ope             .
           move      248                  to   ps-coo-xxx             .
           move      172                  to   ps-coo-yyy             .
           move      spaces               to   ps-str-alf             .
           string    "Pagina "
                                delimited by   size
                     w-fdl-dps-edt-npa
                                delimited by   spaces
                     " di "
                                delimited by   size
                     w-fdl-dps-edt-ntp
                                delimited by   spaces
                                          into ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-int-mod-600.
      *              *-------------------------------------------------*
      *              * Annotazioni                                     *
      *              *-------------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      020                  to   ps-coo-xxx             .
           move      163                  to   ps-coo-yyy             .
           move      spaces               to   ps-str-alf             .
           string    w-fdl-tes-not-001
                                delimited by   size
                     " "
                                delimited by   size
                     w-fdl-tes-not-002
                                delimited by   size
                     " "
                                delimited by   size
                     w-fdl-tes-not-003
                                delimited by   size
                                          into ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-int-mod-999.
           exit.

      *    *===========================================================*
      *    * Stampa di una posizione                                   *
      *    *-----------------------------------------------------------*
       exe-stp-pos-000.
      *              *-------------------------------------------------*
      *              * Calcolo delle coordinate y superiore ed infe-   *
      *              * riore relative alla posizione da stampare       *
      *              *-------------------------------------------------*
           move      w-fdl-dps-num-rel    to   w-fdl-dps-yyy-inf      .
           multiply  -7,5                 by   w-fdl-dps-yyy-inf      .
           add       150                  to   w-fdl-dps-yyy-inf      .
      *
           move      w-fdl-dps-yyy-inf    to   w-fdl-dps-yyy-sup      .
           add       1                    to   w-fdl-dps-yyy-sup      .
       exe-stp-pos-100.
      *              *-------------------------------------------------*
      *              * UM                                              *
      *              *-------------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      012                  to   ps-coo-xxx             .
           move      w-fdl-dps-yyy-sup    to   ps-coo-yyy             .
           move      w-fdl-pos-uni-mis
                    (w-fdl-dps-num-pos)   to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-stp-pos-200.
      *              *-------------------------------------------------*
      *              * Quantita'                                       *
      *              *-------------------------------------------------*
           if        w-fdl-pos-qta-pos
                    (w-fdl-dps-num-pos)   =    spaces
                     go to exe-stp-pos-300.
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica-Bold"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "RPrint"
                                          to   ps-tip-ope             .
           move      045                  to   ps-coo-xxx             .
           move      w-fdl-dps-yyy-sup    to   ps-coo-yyy             .
           move      w-fdl-pos-qta-pos
                    (w-fdl-dps-num-pos)   to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-stp-pos-300.
      *              *-------------------------------------------------*
      *              * Codice prodotto                                 *
      *              *-------------------------------------------------*
           if        w-fdl-pos-cod-pro
                    (w-fdl-dps-num-pos)   =    spaces
                     go to exe-stp-pos-400.
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Courier-Bold"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      021                  to   ps-coo-xxx             .
           move      w-fdl-dps-yyy-sup    to   ps-coo-yyy             .
           move      w-fdl-pos-cod-pro
                    (w-fdl-dps-num-pos)   to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-stp-pos-400.
      *              *-------------------------------------------------*
      *              * Descrizione                                     *
      *              *-------------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica"
                                          to   ps-fon-nam             .
           move      10                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "LPrint"
                                          to   ps-tip-ope             .
           move      052                  to   ps-coo-xxx             .
           move      w-fdl-dps-yyy-sup    to   ps-coo-yyy             .
           move      w-fdl-pos-des-pos
                    (w-fdl-dps-num-pos)   to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *              *-------------------------------------------------*
      *              * Data consegna                                   *
      *              *-------------------------------------------------*
           move      "SelectFont"
                                          to   ps-tip-ope             .
           move      "Helvetica-Bold"
                                          to   ps-fon-nam             .
           move      12                   to   ps-fon-siz             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "CPrint"
                                          to   ps-tip-ope             .
           move      270                  to   ps-coo-xxx             .
           move      w-fdl-dps-yyy-sup    to   ps-coo-yyy             .
           move      w-fdl-pos-dat-cns
                    (w-fdl-dps-num-pos)   to   ps-str-alf             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-stp-pos-500.
      *              *-------------------------------------------------*
      *              * Se la posizione relativa e' la 16 non si esegue *
      *              * comunque la chiusura della linea                *
      *              *-------------------------------------------------*
           if        w-fdl-dps-num-rel    =    16
                     go to exe-stp-pos-900.
      *              *-------------------------------------------------*
      *              * Se e' l'ultima posizione si esegue in ogni caso *
      *              * la chiusura della linea                         *
      *              *-------------------------------------------------*
           if        w-fdl-dps-num-pos    =    w-fdl-dps-pos-tot
                     go to exe-stp-pos-600.
      *              *-------------------------------------------------*
      *              * Se la posizione successiva ha la quantita' si   *
      *              * esegue la chiusura della linea, altrimenti non  *
      *              * la si esegue                                    *
      *              *-------------------------------------------------*
           move      w-fdl-dps-num-pos    to   w-fdl-dps-inx-001      .
           add       1                    to   w-fdl-dps-inx-001      .
           if        w-fdl-pos-qta-pos
                    (w-fdl-dps-inx-001)   =    spaces
                     go to exe-stp-pos-900.
       exe-stp-pos-600.
      *              *-------------------------------------------------*
      *              * Linea di chiusura                               *
      *              *-------------------------------------------------*
           move      "SaveGraphicsState"
                                          to   ps-tip-ope             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "SetLineWidth"
                                          to   ps-tip-ope             .
           move      0,5                  to   ps-lin-wid             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "Line"
                                          to   ps-tip-ope             .
           move      010                  to   ps-coo-xxx             .
           move      w-fdl-dps-yyy-inf    to   ps-coo-yyy             .
           move      150                  to   ps-coo-xto             .
           move      w-fdl-dps-yyy-inf    to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "Line"
                                          to   ps-tip-ope             .
           move      250                  to   ps-coo-xxx             .
           move      w-fdl-dps-yyy-inf    to   ps-coo-yyy             .
           move      290                  to   ps-coo-xto             .
           move      w-fdl-dps-yyy-inf    to   ps-coo-yto             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
      *
           move      "RestoreGraphicsState"
                                          to   ps-tip-ope             .
           call      "swd/mod/prg/obj/mposts"
                                         using ps                     .
       exe-stp-pos-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-stp-pos-999.
       exe-stp-pos-999.
           exit.
