       Identification Division.
       Program-Id.                                 porc3100           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    orc                 *
      *                                Settore:    mov                 *
      *                                   Fase:    orc310              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 03/12/91    *
      *                       Ultima revisione:    NdK del 07/06/22    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Stampa conferme d'ordine clienti            *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "orc"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "mov"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "orc310"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "porc3100"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "    STAMPA CONFERME D'ORDINE CLIENTI    "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "msegrt" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mpslct" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/r"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                 "mbckgx" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mmessg" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine sel-prm-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-sel-prm-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste per programma di esecuzione       *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico                       *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No richiesta di selezione stampa               *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area per preparazione parametri selezione stampa      *
      *        *-------------------------------------------------------*
           05  w-cnt-stp.
               10  w-cnt-stp-tip-sel      pic  x(10)                  .
               10  w-cnt-stp-cod-stp      pic  x(08)                  .
               10  w-cnt-stp-tip-sta      pic  x(01)                  .
               10  w-cnt-stp-cod-mod      pic  x(08)                  .
               10  w-cnt-stp-tip-mod      pic  x(01)                  .
               10  w-cnt-stp-amp-lin      pic  9(03)                  .
               10  w-cnt-stp-top-lin      pic  9(04)                  .
               10  w-cnt-stp-lin-min      pic  9(02)                  .
               10  w-cnt-stp-bot-lin      pic  9(04)                  .
               10  w-cnt-stp-amp-car      pic  9(02)v9(02)            .
               10  w-cnt-stp-alt-int      pic  9(02)v9(02)            .
               10  w-cnt-stp-esp-fut      pic  x(99)                  .
               10  w-cnt-stp-fnz-spc      pic  x(99)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work-area per il controllo del modulo di stampa       *
      *        *-------------------------------------------------------*
           05  w-cnt-mst.
      *            *---------------------------------------------------*
      *            * Selezione stampa effettuata                       *
      *            * - S : Si                                          *
      *            * - N : No                                          *
      *            *---------------------------------------------------*
               10  w-cnt-mst-sel          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di documento da stampare                     *
      *            *---------------------------------------------------*
               10  w-cnt-mst-flg          pic  x(01)                  .

      *    *===========================================================*
      *    * Records files                                             *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [oct]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfoct"                          .
      *        *-------------------------------------------------------*
      *        * [zoc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfzoc"                          .

      *    *===========================================================*
      *    * Work-area richieste per stampa                            *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Codice dipendenza                                     *
      *        *-------------------------------------------------------*
           05  rr-cod-dpz                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Tipo stampa :                                         *
      *        * - 1 : Stampa definitiva                               *
      *        * - 2 : Stampa di prova                                 *
      *        * - 3 : Ristampa                                        *
      *        *-------------------------------------------------------*
           05  rr-tip-stp                 pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Tipo documento                                        *
      *        *-------------------------------------------------------*
           05  rr-tip-mov                 pic  x(05)                  .
           05  rr-tip-mov-des             pic  x(30)                  .
           05  rr-tip-mov-vld             pic  9(02)                  .
           05  rr-tip-mov-dpz             pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Data ordine min - max                                 *
      *        *-------------------------------------------------------*
           05  rr-dat-min                 pic  9(07)                  .
           05  rr-dat-max                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Numero ordine per accettazione min - max              *
      *        *-------------------------------------------------------*
           05  rr-num-min                 pic  9(09)                  .
           05  rr-num-max                 pic  9(09)                  .
      *        *-------------------------------------------------------*
      *        * Numero ordine interno min - max                       *
      *        *-------------------------------------------------------*
           05  rr-noc-min                 pic  9(11)                  .
           05  rr-noc-max                 pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Codice cliente min - max                              *
      *        *-------------------------------------------------------*
           05  rr-cli-min                 pic  9(07)                  .
           05  rr-cli-max                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Dipendenza del cliente min - max                      *
      *        *-------------------------------------------------------*
           05  rr-dpz-min                 pic  x(04)                  .
           05  rr-dpz-max                 pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Stato degli ordini                                    *
      *        *-------------------------------------------------------*
           05  rr-sts-orc                 pic  9(02)                  .

      *    *===========================================================*
      *    * Area di interfaccia per sottoprogramma         "pazi000d" *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/pazi000d.pgl"                   .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Tipo stampa                                *
      *        *-------------------------------------------------------*
           05  w-exp-tip-stp.
               10  w-exp-tip-stp-num      pic  9(02)       value 3    .
               10  w-exp-tip-stp-lun      pic  9(02)       value 20   .
               10  w-exp-tip-stp-tbl.
                   15  filler             pic  x(20) value
                            "Stampa Definitiva   "                    .
                   15  filler             pic  x(20) value
                            "Stampa di Prova     "                    .
                   15  filler             pic  x(20) value
                            "Ristampa            "                    .
      *        *-------------------------------------------------------*
      *        * Work per : Status ordini clienti                      *
      *        *-------------------------------------------------------*
           05  w-exp-sts-orc.
               10  w-exp-sts-orc-num      pic  9(02)       value 04   .
               10  w-exp-sts-orc-lun      pic  9(02)       value 20   .
               10  w-exp-sts-orc-tbl.
                   15  filler             pic  x(20) value
                            "Tutti               "                    .
                   15  filler             pic  x(20) value
                            "solo gli Inevasi    "                    .
                   15  filler             pic  x(20) value
                            "solo gli Evasi      "                    .
                   15  filler             pic  x(20) value
                            "solo quelli Chiusi  "                    .

      *    *===========================================================*
      *    * Work-area referenze                                       *
      *    *-----------------------------------------------------------*
       01  w-ref.
      *        *-------------------------------------------------------*
      *        * Referenza relativa default per il tipo movimento      *
      *        *-------------------------------------------------------*
           05  w-ref-cod-tmo.
      *            *---------------------------------------------------*
      *            * Modalita' di trattamento default                  *
      *            *                                                   *
      *            *  - ' ' : Nessun default                           *
      *            *  - 'I' : Default iniziale in entrata programma    *
      *            *  - 'C' : Default continuo, anche cioe' se valore  *
      *            *          successivamente variato                  *
      *            *  - 'O' : Default obbligatorio, cioe' valore non   *
      *            *          modificabile per nessun motivo           *
      *            *---------------------------------------------------*
               10  w-ref-cod-tmo-trt      pic  x(01)                  .
               10  filler                 pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice tipo movimento di default                  *
      *            *---------------------------------------------------*
               10  w-ref-cod-tmo-cod      pic  x(05)                  .

      *    *===========================================================*
      *    * Work per valori di default                                *
      *    *-----------------------------------------------------------*
       01  w-def.
      *        *-------------------------------------------------------*
      *        * Tipo movimento per ordine cliente                     *
      *        *-------------------------------------------------------*
           05  w-def-tmo-orc              pic  x(05)                  .
           05  w-def-tmo-orc-flg          pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zoc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zoc.
               10  w-let-arc-zoc-flg      pic  x(01)                  .
               10  w-let-arc-zoc-cod      pic  x(05)                  .
               10  w-let-arc-zoc-des      pic  x(30)                  .
               10  w-let-arc-zoc-vld      pic  9(02)                  .
               10  w-let-arc-zoc-dpz      pic  9(02)                  .
               10  w-let-arc-zoc-ord      pic  9(02)                  .
               10  w-let-arc-zoc-prd      pic  9(02)                  .
               10  w-let-arc-zoc-sgl      pic  x(03)                  .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err su controllo tasto Do non chiave         *
      *        *-------------------------------------------------------*
           05  w-box-msg-err.
               10  w-box-msg-err-msg      pic  x(56)                  .

      *    *===========================================================*
      *    * Work area locale                                          *
      *    *-----------------------------------------------------------*
       01  w-wrk.
      *        *-------------------------------------------------------*
      *        * Numero ordine per accettazione                        *
      *        *-------------------------------------------------------*
           05  w-wrk-nft-acc              pic  9(09)                  .
           05  w-wrk-nft-acc-r            redefines
               w-wrk-nft-acc.
               10  w-wrk-num-saa          pic  9(03)                  .
               10  w-wrk-num-npg          pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Numero ordine internamente                            *
      *        *-------------------------------------------------------*
           05  w-wrk-nft-int              pic  9(11)                  .
           05  w-wrk-nft-int-r            redefines
               w-wrk-nft-int.
               10  w-wrk-noc-saa          pic  9(03)                  .
               10  w-wrk-noc-dpz          pic  9(02)                  .
               10  w-wrk-noc-npg          pic  9(06)                  .

      *    *===========================================================*
      *    * Work-area per bufferizzazione tipi movimento              *
      *    *-----------------------------------------------------------*
       01  w-tmo.
      *        *-------------------------------------------------------*
      *        * Contatore di elementi                                 *
      *        *-------------------------------------------------------*
           05  w-tmo-ctr-ele              pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Codice di default                                     *
      *        *-------------------------------------------------------*
           05  w-tmo-cod-tmo              pic  x(05)                  .
      *        *-------------------------------------------------------*
      *        * Descrizione di default                                *
      *        *-------------------------------------------------------*
           05  w-tmo-des-tmo              pic  x(30)                  .

      *    *===========================================================*
      *    * Work-area per la ridefinizione della variabile di i.p.c.  *
      *    * in input  "inp-mst" e in output "out-mst"                 *
      *    *-----------------------------------------------------------*
           copy      "pgm/orc/prg/cpy/wieoorc0.wkl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice tipo movimento          *
      *    *-----------------------------------------------------------*
           copy      "pgm/orc/prg/cpy/acdezoc0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice cliente commerciale     *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmndcc0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice dipendenza del cliente  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoddcc0.acl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione stato ordine     *
      *    * cliente                                                   *
      *    *-----------------------------------------------------------*
           copy      "pgm/orc/prg/cpy/dstsorc0.dtl"                   .

      *    *===========================================================*
      *    * Work-area per ripristino Start                            *
      *    *-----------------------------------------------------------*
       01  w-rip-str.
      *        *-------------------------------------------------------*
      *        * Work-area per ripristino Start su [oct]               *
      *        *-------------------------------------------------------*
           05  w-rip-str-oct.
      *            *---------------------------------------------------*
      *            * Flag di End-of-file                               *
      *            *---------------------------------------------------*
               10  w-rip-str-oct-eof      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Parametri di Start                                *
      *            *---------------------------------------------------*
               10  w-rip-str-oct-ddo      pic  9(07)                  .
               10  w-rip-str-oct-dpz      pic  9(02)                  .
               10  w-rip-str-oct-ndo      pic  9(11)                  .
               10  w-rip-str-oct-tmo      pic  x(05)                  .
               10  w-rip-str-oct-prt      pic  9(11)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-800.
       main-250.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-800.
      *                  *---------------------------------------------*
      *                  * Se uscita per 'N'                           *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "N"
                     go to main-250.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-450.
      *              *-------------------------------------------------*
      *              * Esecuzione in foreground                        *
      *              *-------------------------------------------------*
           perform   exe-pgm-frg-000      thru exe-pgm-frg-999        .
       main-800.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Programma di esecuzione in foreground                     *
      *    *-----------------------------------------------------------*
       exe-pgm-frg-000.
      *              *-------------------------------------------------*
      *              * Apertura modulo di stampa documento             *
      *              *-------------------------------------------------*
           perform   opn-mod-stp-000      thru opn-mod-stp-999        .
      *              *-------------------------------------------------*
      *              * Se selezione non effettuata : uscita con flag   *
      *              * ad errore                                       *
      *              *-------------------------------------------------*
           if        w-cnt-mst-sel        =    "N"
                     go to exe-pgm-frg-999.
       exe-pgm-frg-100.
      *              *-------------------------------------------------*
      *              * Inizializzazione rullino messaggi di foreground *
      *              *-------------------------------------------------*
           move      "OF"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Se errore : uscita                          *
      *                  *---------------------------------------------*
            if       m-rsc                not  = spaces
                     go to exe-pgm-frg-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Esecuzione del programma                        *
      *              *-------------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione messaggio                         *
      *              *-------------------------------------------------*
           move      "XE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visual. eventuali errori di esecuzione      *
      *                  *---------------------------------------------*
           move      "VE"                 to   b-ope                  .
           move      "F"                  to   b-tfe                  .
           move      i-ide-des            to   b-chr                  .
           call      "swd/mod/prg/obj/mbckgv"
                                         using b                      .
           cancel    "swd/mod/prg/obj/mbckgv"                         .
       exe-pgm-frg-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600
           else      go to prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Visualizzazione titolo programma                *
      *              *-------------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *              *-------------------------------------------------*
      *              * Determinazione codici dipendenze per l'azienda  *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      "DA"                 to   w-dpz-tip-ope          .
           move      s-ter                to   w-dpz-ide-ter          .
           move      s-ute                to   w-dpz-ide-ute          .
           move      s-azi                to   w-dpz-ide-azi          .
           move      s-sap                to   w-dpz-ide-sap          .
           move      s-arg                to   w-dpz-ide-arg          .
           move      s-set                to   w-dpz-ide-set          .
           move      s-fas                to   w-dpz-ide-fas          .
           move      i-ide-des            to   w-dpz-ide-des          .
           move      s-pro                to   w-dpz-ide-pro          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
      *              *-------------------------------------------------*
      *              * Se zero dipendenze : errore ed uscita           *
      *              *-------------------------------------------------*
           if        w-dpz-ctr-dpz        >    zero
                     go to pre-exe-pgm-120.
           move      "EN"                 to   w-dpz-tip-ope          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
           move      "#"                  to   w-cnt-pre-exe-pgm      .
           go to     pre-exe-pgm-999.
       pre-exe-pgm-120.
      *              *-------------------------------------------------*
      *              * Selezione codice dipendenza per il programma    *
      *              *-------------------------------------------------*
           move      "SD"                 to   w-dpz-tip-ope          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
       pre-exe-pgm-180.
      *              *-------------------------------------------------*
      *              * Se scelta non effettuata : uscita               *
      *              *-------------------------------------------------*
           if        w-dpz-cod-prg        =    zero
                     move  "#"            to   w-cnt-pre-exe-pgm
                     go to pre-exe-pgm-999.
      *              *-------------------------------------------------*
      *              * Altrimenti memorizzazione in campo richieste    *
      *              *-------------------------------------------------*
           move      w-dpz-cod-prg        to   rr-cod-dpz             .
      *              *-------------------------------------------------*
      *              * Referenza per default tipo movimento            *
      *              *-------------------------------------------------*
           perform   ref-cod-tmo-000      thru ref-cod-tmo-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione default per tipo movimento      *
      *              *-------------------------------------------------*
           move      w-ref-cod-tmo-cod    to   w-def-tmo-orc          .
      *              *-------------------------------------------------*
      *              * Precaricamento tabella tipi movimento per de-   *
      *              * faults                                          *
      *              *-------------------------------------------------*
           perform   pre-tbl-tmo-000      thru pre-tbl-tmo-999        .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura delle referenze relative al default per il tipo   *
      *    * movimento                                                 *
      *    *-----------------------------------------------------------*
       ref-cod-tmo-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione work-area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-ref-cod-tmo-cod      .
           move      spaces               to   w-ref-cod-tmo-trt      .
       ref-cod-tmo-200.
      *              *-------------------------------------------------*
      *              * Lettura referenza                               *
      *              *-------------------------------------------------*
           move      "R:"                 to   s-ope                  .
           move      "pgm/orc/mov/orc300[def-tmo]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-ref-cod-tmo
           else      move  spaces         to   w-ref-cod-tmo          .
       ref-cod-tmo-400.
      *              *-------------------------------------------------*
      *              * Normalizzazione valori letti                    *
      *              *-------------------------------------------------*
           if        w-ref-cod-tmo-trt    not  = spaces and
                     w-ref-cod-tmo-trt    not  = "I"    and
                     w-ref-cod-tmo-trt    not  = "C"    and
                     w-ref-cod-tmo-trt    not  = "O"
                     move  spaces         to   w-ref-cod-tmo-trt      .
       ref-cod-tmo-420.
           if        w-ref-cod-tmo-trt    =    spaces
                     move  spaces         to   w-ref-cod-tmo-cod      .
       ref-cod-tmo-999.
           exit.

      *    *===========================================================*
      *    * Precaricamento tabella tipi movimento                     *
      *    *-----------------------------------------------------------*
       pre-tbl-tmo-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni iniziali                        *
      *              *-------------------------------------------------*
           move      zero                 to   w-tmo-ctr-ele          .
           move      spaces               to   w-tmo-cod-tmo          .
           move      spaces               to   w-tmo-des-tmo          .
       pre-tbl-tmo-100.
      *              *-------------------------------------------------*
      *              * Open file [zoc]                                 *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofzoc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zoc                 .
      *              *-------------------------------------------------*
      *              * Inizio ciclo di caricamento                     *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "CODTOC    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      spaces               to   rf-zoc-cod-toc         .
           move      "pgm/orc/fls/ioc/obj/iofzoc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zoc                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : uscita con flag di er- *
      *                  * rore                                        *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  pre-tbl-tmo-900.
       pre-tbl-tmo-200.
      *              *-------------------------------------------------*
      *              * Read-next su file [zoc]                         *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofzoc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zoc                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to pre-tbl-tmo-900.
      *              *-------------------------------------------------*
      *              * Incremento contatore                            *
      *              *-------------------------------------------------*
           add       1                    to   w-tmo-ctr-ele          .
      *              *-------------------------------------------------*
      *              * Bufferizzazioni                                 *
      *              *-------------------------------------------------*
           move      rf-zoc-cod-toc       to   w-tmo-cod-tmo          .
           move      rf-zoc-des-toc       to   w-tmo-des-tmo          .
      *              *-------------------------------------------------*
      *              * Riciclo a riga successiva                       *
      *              *-------------------------------------------------*
           go to     pre-tbl-tmo-200.
       pre-tbl-tmo-900.
      *              *-------------------------------------------------*
      *              * Close file [zoc]                                *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofzoc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zoc                 .
       pre-tbl-tmo-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione tipo movimento         *
      *              *-------------------------------------------------*
           perform   cod-des-zoc-opn-000  thru cod-des-zoc-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice cliente commer- *
      *              * ciale                                           *
      *              *-------------------------------------------------*
           perform   cod-mne-dcc-opn-000  thru cod-mne-dcc-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice dipendenza del  *
      *              * cliente                                         *
      *              *-------------------------------------------------*
           perform   cod-cod-dcc-opn-000  thru cod-cod-dcc-opn-999    .
      *              *-------------------------------------------------*
      *              * [oct]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *              *-------------------------------------------------*
      *              * [zoc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofzoc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zoc                 .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione status ordine     *
      *              *-------------------------------------------------*
           perform   det-sts-orc-opn-000  thru det-sts-orc-opn-999    .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione tipo movimento        *
      *              *-------------------------------------------------*
           perform   cod-des-zoc-cls-000  thru cod-des-zoc-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice cliente com-   *
      *              * merciale                                        *
      *              *-------------------------------------------------*
           perform   cod-mne-dcc-cls-000  thru cod-mne-dcc-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice dipendenza del *
      *              * cliente                                         *
      *              *-------------------------------------------------*
           perform   cod-cod-dcc-cls-000  thru cod-cod-dcc-cls-999    .
      *              *-------------------------------------------------*
      *              * [oct]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *              *-------------------------------------------------*
      *              * [zoc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofzoc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zoc                 .
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione status ordine    *
      *              *-------------------------------------------------*
           perform   det-sts-orc-cls-000  thru det-sts-orc-cls-999    .
       rou-cls-fls-900.
      *              *-------------------------------------------------*
      *              * Chiusura modulo di stampa documento             *
      *              *-------------------------------------------------*
           perform   cls-mod-stp-000      thru cls-mod-stp-999        .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Erase linee impegnate                       *
      *                  *---------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Tipo stampa                                 *
      *                  *---------------------------------------------*
           perform   acc-tip-stp-000      thru acc-tip-stp-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
       acc-ric-sel-150.
      *                  *---------------------------------------------*
      *                  * Tipo movimento                              *
      *                  *---------------------------------------------*
           perform   acc-tmo-orc-000      thru acc-tmo-orc-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-100.
       acc-ric-sel-200.
      *                  *---------------------------------------------*
      *                  * Data ordine minima                          *
      *                  *---------------------------------------------*
           perform   acc-dat-min-000      thru acc-dat-min-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-150.
       acc-ric-sel-250.
      *                  *---------------------------------------------*
      *                  * Data ordine massima                         *
      *                  *---------------------------------------------*
           perform   acc-dat-max-000      thru acc-dat-max-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-200.
       acc-ric-sel-300.
      *                  *---------------------------------------------*
      *                  * Numero ordine minimo                        *
      *                  *---------------------------------------------*
           perform   acc-nfa-min-000      thru acc-nfa-min-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-250.
       acc-ric-sel-350.
      *                  *---------------------------------------------*
      *                  * Numero ordine massimo                       *
      *                  *---------------------------------------------*
           perform   acc-nfa-max-000      thru acc-nfa-max-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-300.
       acc-ric-sel-400.
      *                  *---------------------------------------------*
      *                  * Codice cliente minimo                       *
      *                  *---------------------------------------------*
           perform   acc-cli-min-000      thru acc-cli-min-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-350.
       acc-ric-sel-450.
      *                  *---------------------------------------------*
      *                  * Codice cliente massimo                      *
      *                  *---------------------------------------------*
           perform   acc-cli-max-000      thru acc-cli-max-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-400.
       acc-ric-sel-500.
      *                  *---------------------------------------------*
      *                  * Codice dipendenza cliente minimo            *
      *                  *---------------------------------------------*
           perform   acc-dpz-min-000      thru acc-dpz-min-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-450.
       acc-ric-sel-550.
      *                  *---------------------------------------------*
      *                  * Codice dipendenza cliente massimo           *
      *                  *---------------------------------------------*
           perform   acc-dpz-max-000      thru acc-dpz-max-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-500.
       acc-ric-sel-600.
      *                  *---------------------------------------------*
      *                  * Stato degli ordini                          *
      *                  *---------------------------------------------*
           perform   acc-sts-orc-000      thru acc-sts-orc-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-550.
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#CNF"               to   v-not                  .
           move      "S"                  to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else if   v-key                =    "UP  "
                     go to acc-ric-sel-950
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-950.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazioni                         *
      *                      *-----------------------------------------*
           go to     acc-ric-sel-100.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo stampa                :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo documento             :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      45                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data emissione         dal :             al :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      45                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero ordine          dal :             al :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      45                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice cliente         dal :             al :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      45                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Dipendenza cliente     dal :             al :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Stato degli ordini         :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Tipo stampa                *
      *    *-----------------------------------------------------------*
       acc-tip-stp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-tip-stp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-stp-lun    to   v-car                  .
           move      w-exp-tip-stp-num    to   v-ldt                  .
           move      "DPR#"               to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      05                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-tip-stp-tbl    to   v-txt                  .
           move      rr-tip-stp           to   v-num                  .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-tip-stp-999.
       acc-tip-stp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-tip-stp             .
       acc-tip-stp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        rr-tip-stp           =    zero
                     go to acc-tip-stp-100.
       acc-tip-stp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-tip-stp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-tip-stp-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-tip-stp-100.
       acc-tip-stp-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Tipo movimento             *
      *    *-----------------------------------------------------------*
       acc-tmo-orc-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione valore di default              *
      *                  *---------------------------------------------*
           perform   acc-tmo-orc-def-000  thru acc-tmo-orc-def-999    .
           if        w-def-tmo-orc-flg    not  = spaces
                     go to acc-tmo-orc-400.
       acc-tmo-orc-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-des-zoc-ope      .
           move      rr-tip-mov           to   w-cod-des-zoc-cod      .
           move      08                   to   w-cod-des-zoc-lin      .
           move      30                   to   w-cod-des-zoc-pos      .
           move      08                   to   w-cod-des-zoc-dln      .
           move      37                   to   w-cod-des-zoc-dps      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   cod-des-zoc-cll-000  thru cod-des-zoc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-des-zoc-foi-000  thru cod-des-zoc-foi-999    .
       acc-tmo-orc-110.
           perform   cod-des-zoc-cll-000  thru cod-des-zoc-cll-999    .
           if        w-cod-des-zoc-ope    =    "F+"
                     go to acc-tmo-orc-115.
           if        w-cod-des-zoc-ope    =    "AC"
                     go to acc-tmo-orc-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-tmo-orc-115.
           perform   cod-des-zoc-foi-000  thru cod-des-zoc-foi-999    .
           go to     acc-tmo-orc-110.
       acc-tmo-orc-120.
           move      w-cod-des-zoc-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-tmo-orc-999.
       acc-tmo-orc-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-tip-mov             .
       acc-tmo-orc-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella [zoc]                       *
      *                  *---------------------------------------------*
           move      rr-tip-mov           to   w-let-arc-zoc-cod      .
           perform   let-arc-zoc-000      thru let-arc-zoc-999        .
           move      w-let-arc-zoc-des    to   rr-tip-mov-des         .
           move      w-let-arc-zoc-vld    to   rr-tip-mov-vld         .
           move      w-let-arc-zoc-dpz    to   rr-tip-mov-dpz         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-tmo-orc-des-000  thru vis-tmo-orc-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-zoc-flg    not  = spaces
                     go to acc-tmo-orc-100.
      *                  *---------------------------------------------*
      *                  * Se a spaces : reimpostazione                *
      *                  *---------------------------------------------*
           if        rr-tip-mov           =    spaces
                     go to acc-tmo-orc-100.
      *                  *---------------------------------------------*
      *                  * Test su codice dipendenza                   *
      *                  *---------------------------------------------*
           if        rr-tip-mov-vld       not  = 02
                     go to acc-tmo-orc-600.
           if        rr-cod-dpz           =    rr-tip-mov-dpz
                     go to acc-tmo-orc-600.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Tipo movimento incompatibile con il codice dipende
      -              "nza   "             to   w-box-msg-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-tmo-orc-100.
       acc-tmo-orc-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-tmo-orc-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-tmo-orc-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-tmo-orc-100.
       acc-tmo-orc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo chiave : Tipo movimento                *
      *    *                                                           *
      *    * Subroutine di trattamento del default                     *
      *    *-----------------------------------------------------------*
       acc-tmo-orc-def-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di obbligatorieta'         *
      *              *-------------------------------------------------*
           move      spaces               to   w-def-tmo-orc-flg      .
       acc-tmo-orc-def-100.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di trattamento  *
      *              * da referenza                                    *
      *              *-------------------------------------------------*
           if        w-ref-cod-tmo-trt    =    spaces
                     go to acc-tmo-orc-def-200
           else if   w-ref-cod-tmo-trt    =    "I"
                     go to acc-tmo-orc-def-300
           else if   w-ref-cod-tmo-trt    =    "C"
                     go to acc-tmo-orc-def-400
           else if   w-ref-cod-tmo-trt    =    "O"
                     go to acc-tmo-orc-def-500
           else      go to acc-tmo-orc-def-900.
       acc-tmo-orc-def-200.
      *              *-------------------------------------------------*
      *              * Se nessun default                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se default da utilizzare               *
      *                  *---------------------------------------------*
           if        rr-tip-mov           not  = spaces
                     go to acc-tmo-orc-def-900.
      *                  *---------------------------------------------*
      *                  * Utilizzo del default                        *
      *                  *---------------------------------------------*
           move      w-def-tmo-orc        to   rr-tip-mov             .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     acc-tmo-orc-def-900.
       acc-tmo-orc-def-300.
      *              *-------------------------------------------------*
      *              * Se default iniziale                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se default da utilizzare               *
      *                  *---------------------------------------------*
           if        rr-tip-mov           not  = spaces
                     go to acc-tmo-orc-def-900.
      *                  *---------------------------------------------*
      *                  * Utilizzo del default                        *
      *                  *---------------------------------------------*
           move      w-def-tmo-orc        to   rr-tip-mov             .
      *                  *---------------------------------------------*
      *                  * A lettura e visualizzazione                 *
      *                  *---------------------------------------------*
           go to     acc-tmo-orc-def-600.
       acc-tmo-orc-def-400.
      *              *-------------------------------------------------*
      *              * Se default continuo                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Utilizzo del default                        *
      *                  *---------------------------------------------*
           move      w-ref-cod-tmo-cod    to   rr-tip-mov             .
      *                  *---------------------------------------------*
      *                  * A lettura e visualizzazione                 *
      *                  *---------------------------------------------*
           go to     acc-tmo-orc-def-600.
       acc-tmo-orc-def-500.
      *              *-------------------------------------------------*
      *              * Se default obbligatorio                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Utilizzo del default                        *
      *                  *---------------------------------------------*
           move      w-def-tmo-orc        to   rr-tip-mov             .
      *                  *---------------------------------------------*
      *                  * Forzatura del flag di obbligatorieta'       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-def-tmo-orc-flg      .
      *                  *---------------------------------------------*
      *                  * A lettura e visualizzazione                 *
      *                  *---------------------------------------------*
           go to     acc-tmo-orc-def-600.
       acc-tmo-orc-def-600.
      *              *-------------------------------------------------*
      *              * Lettura descrizione tipo movimento              *
      *              *-------------------------------------------------*
           move      rr-tip-mov           to   w-let-arc-zoc-cod      .
           perform   let-arc-zoc-000      thru let-arc-zoc-999        .
      *              *-------------------------------------------------*
      *              * Bufferizzazione descrizione tipo movimento      *
      *              *-------------------------------------------------*
           move      w-let-arc-zoc-des    to   rr-tip-mov-des         .
      *              *-------------------------------------------------*
      *              * Visualizzazione tipo movimento                  *
      *              *-------------------------------------------------*
           perform   vis-tmo-orc-000      thru vis-tmo-orc-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione descrizione tipo movimento      *
      *              *-------------------------------------------------*
           perform   vis-tmo-orc-des-000  thru vis-tmo-orc-des-999    .
       acc-tmo-orc-def-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     acc-tmo-orc-def-999.
       acc-tmo-orc-def-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice tipo movimento                   *
      *    *-----------------------------------------------------------*
       vis-tmo-orc-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-tip-mov           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tmo-orc-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo selezione : descrizione tipo movi-  *
      *    *                                   mento                   *
      *    *-----------------------------------------------------------*
       vis-tmo-orc-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      30                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      37                   to   v-pos                  .
           move      rr-tip-mov-des       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tmo-orc-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Data ordine minima         *
      *    *-----------------------------------------------------------*
       acc-dat-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dat-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      11                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-dat-min           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dat-min-999.
       acc-dat-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dat-min             .
       acc-dat-min-300.
      *              *-------------------------------------------------*
      *              * Se Find                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "FIND"
                     go to acc-dat-min-400.
      *                  *---------------------------------------------*
      *                  * Find su ordini                              *
      *                  *---------------------------------------------*
           perform   fnd-arc-oct-000      thru fnd-arc-oct-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-dat-min-100.
       acc-dat-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dat-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dat-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dat-min-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dat-min-100.
       acc-dat-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Data ordine massima        *
      *    *-----------------------------------------------------------*
       acc-dat-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dat-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      11                   to   v-lin                  .
           move      47                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-dat-max           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dat-max-999.
       acc-dat-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dat-max             .
       acc-dat-max-300.
      *              *-------------------------------------------------*
      *              * Se Find                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "FIND"
                     go to acc-dat-max-400.
      *                  *---------------------------------------------*
      *                  * Find su ordini                              *
      *                  *---------------------------------------------*
           perform   fnd-arc-oct-000      thru fnd-arc-oct-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-dat-max-100.
       acc-dat-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dat-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dat-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dat-max-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dat-max-100.
       acc-dat-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Numero ordine minimo       *
      *    *-----------------------------------------------------------*
       acc-nfa-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-nfa-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      "<B"                 to   v-edm                  .
           move      13                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-num-min           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-nfa-min-999.
       acc-nfa-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-num-min             .
       acc-nfa-min-300.
      *              *-------------------------------------------------*
      *              * Se Find                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "FIND"
                     go to acc-nfa-min-400.
      *                  *---------------------------------------------*
      *                  * Find su ordini                              *
      *                  *---------------------------------------------*
           perform   fnd-arc-oct-000      thru fnd-arc-oct-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-nfa-min-100.
       acc-nfa-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-nfa-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-nfa-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-nfa-min-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-nfa-min-100.
       acc-nfa-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Numero ordine massimo      *
      *    *-----------------------------------------------------------*
       acc-nfa-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-nfa-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      "<B"                 to   v-edm                  .
           move      13                   to   v-lin                  .
           move      47                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-num-max           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-nfa-max-999.
       acc-nfa-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-num-max             .
       acc-nfa-max-300.
      *              *-------------------------------------------------*
      *              * Se Find                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "FIND"
                     go to acc-nfa-max-400.
      *                  *---------------------------------------------*
      *                  * Find su ordini                              *
      *                  *---------------------------------------------*
           perform   fnd-arc-oct-000      thru fnd-arc-oct-999        .
      *                  *---------------------------------------------*
      *                  * A reimpostazione                            *
      *                  *---------------------------------------------*
           go to     acc-nfa-max-100.
       acc-nfa-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-nfa-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-nfa-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-nfa-max-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-nfa-max-100.
       acc-nfa-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Codice cliente minimo      *
      *    *-----------------------------------------------------------*
       acc-cli-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cli-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-dcc-ope      .
           move      rr-cli-min           to   w-cod-mne-dcc-cod      .
           move      15                   to   w-cod-mne-dcc-lin      .
           move      30                   to   w-cod-mne-dcc-pos      .
           move      zero                 to   w-cod-mne-dcc-rln      .
           move      zero                 to   w-cod-mne-dcc-rps      .
           move      zero                 to   w-cod-mne-dcc-vln      .
           move      zero                 to   w-cod-mne-dcc-vps      .
           move      zero                 to   w-cod-mne-dcc-lln      .
           move      zero                 to   w-cod-mne-dcc-lps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
       acc-cli-min-110.
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           if        w-cod-mne-dcc-ope    =    "F+"
                     go to acc-cli-min-115.
           if        w-cod-mne-dcc-ope    =    "AC"
                     go to acc-cli-min-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cli-min-115.
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
           go to     acc-cli-min-110.
       acc-cli-min-120.
           move      w-cod-mne-dcc-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-cli-min-999.
       acc-cli-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-cli-min             .
       acc-cli-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cli-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cli-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-cli-min-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-cli-min-100.
       acc-cli-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Codice cliente massimo     *
      *    *-----------------------------------------------------------*
       acc-cli-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cli-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-dcc-ope      .
           move      rr-cli-max           to   w-cod-mne-dcc-cod      .
           move      15                   to   w-cod-mne-dcc-lin      .
           move      47                   to   w-cod-mne-dcc-pos      .
           move      zero                 to   w-cod-mne-dcc-rln      .
           move      zero                 to   w-cod-mne-dcc-rps      .
           move      zero                 to   w-cod-mne-dcc-vln      .
           move      zero                 to   w-cod-mne-dcc-vps      .
           move      zero                 to   w-cod-mne-dcc-lln      .
           move      zero                 to   w-cod-mne-dcc-lps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
       acc-cli-max-110.
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           if        w-cod-mne-dcc-ope    =    "F+"
                     go to acc-cli-max-115.
           if        w-cod-mne-dcc-ope    =    "AC"
                     go to acc-cli-max-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cli-max-115.
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
           go to     acc-cli-max-110.
       acc-cli-max-120.
           move      w-cod-mne-dcc-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-cli-max-999.
       acc-cli-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-cli-max             .
       acc-cli-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cli-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Trattamento dipendenze del cliente          *
      *                  *---------------------------------------------*
           if        rr-cli-min           =    zero
                     go to acc-cli-max-610.
           if        rr-cli-max           =    rr-cli-min or
                     rr-cli-max           =    zero
                     go to acc-cli-max-800.
       acc-cli-max-610.
           if        rr-dpz-min           =    spaces
                     go to acc-cli-max-620.
           move      spaces               to   rr-dpz-min             .
           perform   vis-dpz-min-000      thru vis-dpz-min-999        .
       acc-cli-max-620.
           if        rr-dpz-max           =    spaces
                     go to acc-cli-max-800.
           move      spaces               to   rr-dpz-max             .
           perform   vis-dpz-max-000      thru vis-dpz-max-999        .
       acc-cli-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-cli-max-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-cli-max-100.
       acc-cli-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Codice dipendenza minimo   *
      *    *-----------------------------------------------------------*
       acc-dpz-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        rr-cli-min           =    zero
                     go to acc-dpz-min-999.
           if        rr-cli-max           =    rr-cli-min or
                     rr-cli-max           =    zero
                     go to acc-dpz-min-100
           else      go to acc-dpz-min-999.
       acc-dpz-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-dcc-ope      .
           move      rr-cli-min           to   w-cod-cod-dcc-cli      .
           move      rr-dpz-min           to   w-cod-cod-dcc-cod      .
           move      17                   to   w-cod-cod-dcc-lin      .
           move      30                   to   w-cod-cod-dcc-pos      .
           move      zero                 to   w-cod-cod-dcc-rln      .
           move      zero                 to   w-cod-cod-dcc-rps      .
           move      zero                 to   w-cod-cod-dcc-vln      .
           move      zero                 to   w-cod-cod-dcc-vps      .
           move      zero                 to   w-cod-cod-dcc-lln      .
           move      zero                 to   w-cod-cod-dcc-lps      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-dcc-cll-000  thru cod-cod-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dcc-foi-000  thru cod-cod-dcc-foi-999    .
       acc-dpz-min-110.
           perform   cod-cod-dcc-cll-000  thru cod-cod-dcc-cll-999    .
           if        w-cod-cod-dcc-ope    =    "F+"
                     go to acc-dpz-min-115.
           if        w-cod-cod-dcc-ope    =    "AC"
                     go to acc-dpz-min-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-dpz-min-115.
           perform   cod-cod-dcc-foi-000  thru cod-cod-dcc-foi-999    .
           go to     acc-dpz-min-110.
       acc-dpz-min-120.
           move      w-cod-cod-dcc-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dpz-min-999.
       acc-dpz-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-dpz-min             .
       acc-dpz-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dpz-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dpz-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dpz-min-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dpz-min-100.
       acc-dpz-min-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo selezione : Dipendenza minima       *
      *    *-----------------------------------------------------------*
       vis-dpz-min-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-dpz-min           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Codice dipendenza massimo  *
      *    *-----------------------------------------------------------*
       acc-dpz-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        rr-cli-min           =    zero
                     go to acc-dpz-max-999.
           if        rr-cli-max           =    rr-cli-min or
                     rr-cli-max           =    zero
                     go to acc-dpz-max-100
           else      go to acc-dpz-max-999.
       acc-dpz-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-dcc-ope      .
           move      rr-cli-min           to   w-cod-cod-dcc-cli      .
           move      rr-dpz-max           to   w-cod-cod-dcc-cod      .
           move      17                   to   w-cod-cod-dcc-lin      .
           move      47                   to   w-cod-cod-dcc-pos      .
           move      zero                 to   w-cod-cod-dcc-rln      .
           move      zero                 to   w-cod-cod-dcc-rps      .
           move      zero                 to   w-cod-cod-dcc-vln      .
           move      zero                 to   w-cod-cod-dcc-vps      .
           move      zero                 to   w-cod-cod-dcc-lln      .
           move      zero                 to   w-cod-cod-dcc-lps      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-dcc-cll-000  thru cod-cod-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dcc-foi-000  thru cod-cod-dcc-foi-999    .
       acc-dpz-max-110.
           perform   cod-cod-dcc-cll-000  thru cod-cod-dcc-cll-999    .
           if        w-cod-cod-dcc-ope    =    "F+"
                     go to acc-dpz-max-115.
           if        w-cod-cod-dcc-ope    =    "AC"
                     go to acc-dpz-max-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-dpz-max-115.
           perform   cod-cod-dcc-foi-000  thru cod-cod-dcc-foi-999    .
           go to     acc-dpz-max-110.
       acc-dpz-max-120.
           move      w-cod-cod-dcc-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dpz-max-999.
       acc-dpz-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-dpz-max             .
       acc-dpz-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dpz-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dpz-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dpz-max-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dpz-max-100.
       acc-dpz-max-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo selezione : Dipendenza massima      *
      *    *-----------------------------------------------------------*
       vis-dpz-max-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      47                   to   v-pos                  .
           move      rr-dpz-max           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-max-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
           move      zero                 to   rr-tip-stp             .
           move      spaces               to   rr-tip-mov             .
           move      spaces               to   rr-tip-mov-des         .
           move      zero                 to   rr-tip-mov-vld         .
           move      zero                 to   rr-tip-mov-dpz         .
           move      zero                 to   rr-dat-min             .
           move      zero                 to   rr-dat-max             .
           move      zero                 to   rr-num-min             .
           move      zero                 to   rr-num-max             .
           move      zero                 to   rr-noc-min             .
           move      zero                 to   rr-noc-max             .
           move      zero                 to   rr-cli-min             .
           move      zero                 to   rr-cli-max             .
           move      spaces               to   rr-dpz-min             .
           move      spaces               to   rr-dpz-max             .
           move      zero                 to   rr-sts-orc             .
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Status ordini clienti                *
      *    *-----------------------------------------------------------*
       acc-sts-orc-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-sts-orc-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sts-orc-lun    to   v-car                  .
           move      w-exp-sts-orc-num    to   v-ldt                  .
           move      "TIEC#"              to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sts-orc-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      19                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-sts-orc           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-sts-orc-999.
       acc-sts-orc-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-sts-orc             .
       acc-sts-orc-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-sts-orc-425.
      *                  *---------------------------------------------*
      *                  * Test che il valore sia accettabile          *
      *                  *---------------------------------------------*
           if        rr-sts-orc           =    zero           or
                     rr-sts-orc           >    w-exp-sts-orc-num
                     go to acc-sts-orc-100.
       acc-sts-orc-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-sts-orc-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-sts-orc-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-sts-orc-100.
       acc-sts-orc-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Status ordini clienti             *
      *    *-----------------------------------------------------------*
       vis-sts-orc-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sts-orc-lun    to   v-car                  .
           move      w-exp-sts-orc-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-sts-orc-tbl    to   v-txt                  .
           move      19                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-sts-orc           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sts-orc-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Controlli                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo stampa                         *
      *                  *---------------------------------------------*
           if        rr-tip-stp           not  = zero
                     go to tdo-ric-sel-110.
           move      "Manca la selezione del tipo stampa !"
                                          to   w-box-msg-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-110.
      *                  *---------------------------------------------*
      *                  * Test su tipo movimento                      *
      *                  *---------------------------------------------*
           if        rr-tip-mov           not  = spaces
                     go to tdo-ric-sel-120.
           move      "Manca il tipo movimento !"
                                          to   w-box-msg-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-120.
      *                  *---------------------------------------------*
      *                  * Test su data ordine minima e massima        *
      *                  *---------------------------------------------*
           if        rr-dat-min           =    zero or
                     rr-dat-max           =    zero
                     go to tdo-ric-sel-130.
           if        rr-dat-min           not  > rr-dat-max
                     go to tdo-ric-sel-130.
           move      "Data ordine iniziale maggiore di quella finale !"
                                          to   w-box-msg-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-130.
      *                  *---------------------------------------------*
      *                  * Test su numero ordine minimo e massimo      *
      *                  *---------------------------------------------*
           if        rr-num-min           =    zero or
                     rr-num-max           =    zero
                     go to tdo-ric-sel-140.
           if        rr-num-min           not  > rr-num-max
                     go to tdo-ric-sel-140.
           move      "Numero ordine iniziale maggiore di quello finale !
      -              " "
                                          to   w-box-msg-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-140.
      *                  *---------------------------------------------*
      *                  * Test su codice cliente minimo e massimo     *
      *                  *---------------------------------------------*
           if        rr-cli-min           =    zero or
                     rr-cli-max           =    zero
                     go to tdo-ric-sel-150.
           if        rr-cli-min           not  > rr-cli-max
                     go to tdo-ric-sel-150.
           move      "Codice cliente iniziale maggiore di quella finale 
      -              "!"
                                          to   w-box-msg-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-150.
      *                  *---------------------------------------------*
      *                  * Test su dipendenza minima e massima         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se campo da accettare              *
      *                      *-----------------------------------------*
           if        rr-cli-min           =    zero
                     go to tdo-ric-sel-160.
           if        rr-cli-max           =    rr-cli-min or
                     rr-cli-max           =    zero
                     go to tdo-ric-sel-155
           else      go to tdo-ric-sel-160.
       tdo-ric-sel-155.
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        rr-dpz-min           =    spaces or
                     rr-dpz-max           =    spaces
                     go to tdo-ric-sel-160.
           if        rr-dpz-min           not  > rr-dpz-max
                     go to tdo-ric-sel-160.
           move      "Dipendenza cliente iniziale maggiore di quella fin
      -              "ale !"
                                          to   w-box-msg-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-160.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione messaggio                   *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Uscita con errore                           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Data ordine massima                             *
      *              *-------------------------------------------------*
           if        rr-dat-max           not  = zero
                     go to reg-ric-sel-100.
           if        rr-dat-min           =    zero
                     move  9999999        to   rr-dat-max
           else      move  rr-dat-min     to   rr-dat-max             .
       reg-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Numero ordine massimo                           *
      *              *-------------------------------------------------*
           if        rr-num-max           not  = zero
                     go to reg-ric-sel-200.
           if        rr-num-min           =    zero
                     move  999999999      to   rr-num-max
           else      move  rr-num-min     to   rr-num-max             .
       reg-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Regolarizzazione numero ordine interno minimo   *
      *              *-------------------------------------------------*
           move      rr-num-min           to   w-wrk-nft-acc          .
           move      w-wrk-num-saa        to   w-wrk-noc-saa          .
           move      rr-cod-dpz           to   w-wrk-noc-dpz          .
           move      w-wrk-num-npg        to   w-wrk-noc-npg          .
           move      w-wrk-nft-int        to   rr-noc-min             .
      *              *-------------------------------------------------*
      *              * Regolarizzazione numero ordine interno massimo  *
      *              *-------------------------------------------------*
           move      rr-num-max           to   w-wrk-nft-acc          .
           move      w-wrk-num-saa        to   w-wrk-noc-saa          .
           move      rr-cod-dpz           to   w-wrk-noc-dpz          .
           move      w-wrk-num-npg        to   w-wrk-noc-npg          .
           move      w-wrk-nft-int        to   rr-noc-max             .
      *              *-------------------------------------------------*
      *              * Codice cliente massimo                          *
      *              *-------------------------------------------------*
           if        rr-cli-max           not  = zero
                     go to reg-ric-sel-300.
           if        rr-cli-min           =    zero
                     move  9999999        to   rr-cli-max
           else      move  rr-cli-min     to   rr-cli-max             .
       reg-ric-sel-300.
      *              *-------------------------------------------------*
      *              * Codice dipendenza massimo                       *
      *              *-------------------------------------------------*
           if        rr-dpz-max           =    spaces
                     move  rr-dpz-min     to   rr-dpz-max             .
           move      rr-dpz-max           to   w-all-str-alf          .
           move      04                   to   w-all-str-lun          .
           perform   all-str-pad-000      thru all-str-pad-999        .
           move      w-all-str-alf        to   rr-dpz-max             .
      *              *-------------------------------------------------*
      *              * Normalizzazione status ordini clienti           *
      *              *-------------------------------------------------*
           if        rr-sts-orc           =    zero
                     move  01             to   rr-sts-orc             .
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      74                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      w-box-msg-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      70                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      71                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [zoc]                         *
      *    *-----------------------------------------------------------*
       let-arc-zoc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zoc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spazi                          *
      *              *-------------------------------------------------*
           if        w-let-arc-zoc-cod    =    spaces
                     go to let-arc-zoc-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODTMO"             to   f-key                  .
           move      w-let-arc-zoc-cod    to   rf-zoc-cod-toc         .
           move      "pgm/orc/fls/ioc/obj/iofzoc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zoc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zoc-400.
       let-arc-zoc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zoc-des-toc       to   w-let-arc-zoc-des      .
           move      rf-zoc-vld-dpz       to   w-let-arc-zoc-vld      .
           move      rf-zoc-cod-dpz       to   w-let-arc-zoc-dpz      .
           move      rf-zoc-org-doc       to   w-let-arc-zoc-ord      .
           move      rf-zoc-prv-doc       to   w-let-arc-zoc-prd      .
           move      rf-zoc-sgl-num       to   w-let-arc-zoc-sgl      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zoc-999.
       let-arc-zoc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zoc-flg      .
           move      all   "."            to   w-let-arc-zoc-des      .
           go to     let-arc-zoc-520.
       let-arc-zoc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zoc-des      .
       let-arc-zoc-520.
           move      zero                 to   w-let-arc-zoc-vld      .
           move      zero                 to   w-let-arc-zoc-dpz      .
           move      zero                 to   w-let-arc-zoc-ord      .
           move      zero                 to   w-let-arc-zoc-prd      .
           move      spaces               to   w-let-arc-zoc-sgl      .
       let-arc-zoc-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di End-of-file             *
      *              *-------------------------------------------------*
           move      spaces               to   w-rip-str-oct-eof      .
      *              *-------------------------------------------------*
      *              * Start su archivio [oct]                         *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "IDEDOC    "         to   f-key                  .
           move      rr-dat-min           to   rf-oct-dat-doc         .
           move      rr-cod-dpz           to   rf-oct-cod-dpz         .
           move      rr-noc-min           to   rf-oct-num-doc         .
           move      rr-tip-mov           to   rf-oct-tmo-orc         .
           move      zero                 to   rf-oct-num-prt         .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della Start     *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to prn-str-ini-300
           else      go to prn-str-ini-900.
       prn-str-ini-300.
      *              *-------------------------------------------------*
      *              * Se Start Ok                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to      prn-str-ini-999.
       prn-str-ini-900.
      *              *-------------------------------------------------*
      *              * Se Start errata                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-prn-flg-sub      .
      *                  *---------------------------------------------*
      *                  * Flag di End-of-file                         *
      *                  *---------------------------------------------*
           move      "#"                  to   w-rip-str-oct-eof      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-str-ini-999.
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessun documento da stampare !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio [oct]              *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to prn-let-seq-300
           else      go to prn-let-seq-900.
       prn-let-seq-300.
      *              *-------------------------------------------------*
      *              * Se lettura Ok                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to      prn-let-seq-999.
       prn-let-seq-900.
      *              *-------------------------------------------------*
      *              * Se fine file                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-prn-flg-sub      .
      *                  *---------------------------------------------*
      *                  * Flag di End-of-file                         *
      *                  *---------------------------------------------*
           move      "#"                  to   w-rip-str-oct-eof      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Test su data ordine                             *
      *              *-------------------------------------------------*
           if        rf-oct-dat-doc       >    rr-dat-max
                     go to prn-tst-max-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-tst-max-999.
       prn-tst-max-900.
      *              *-------------------------------------------------*
      *              * Se test non superato                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita                              *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-prn-flg-sub      .
      *                  *---------------------------------------------*
      *                  * Flag di End-of-file                         *
      *                  *---------------------------------------------*
           move      "#"                  to   w-rip-str-oct-eof      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-sel-rec-100.
      *              *-------------------------------------------------*
      *              * Test su tipo stampa                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo stampa      *
      *                  *---------------------------------------------*
           go to     prn-sel-rec-110
                     prn-sel-rec-120
                     prn-sel-rec-130
                     depending            on   rr-tip-stp             .
           go to     prn-sel-rec-110.
       prn-sel-rec-110.
      *                  *---------------------------------------------*
      *                  * Tipo stampa : definitiva                    *
      *                  *---------------------------------------------*
           if        rf-oct-ctr-stp       not  = zero
                     go to prn-sel-rec-900.
           go to     prn-sel-rec-200.
       prn-sel-rec-120.
      *                  *---------------------------------------------*
      *                  * Tipo stampa : di prova                      *
      *                  *---------------------------------------------*
           if        rf-oct-ctr-stp       not  = zero
                     go to prn-sel-rec-900.
           go to     prn-sel-rec-200.
       prn-sel-rec-130.
      *                  *---------------------------------------------*
      *                  * Tipo stampa : ristampa                      *
      *                  *---------------------------------------------*
           if        rf-oct-ctr-stp       not  > zero
                     go to prn-sel-rec-900.
           go to     prn-sel-rec-200.
       prn-sel-rec-200.
      *              *-------------------------------------------------*
      *              * Test su codice dipendenza                       *
      *              *-------------------------------------------------*
           if        rf-oct-cod-dpz       not  = rr-cod-dpz
                     go to prn-sel-rec-900.
      *              *-------------------------------------------------*
      *              * Test su numero ordine                           *
      *              *-------------------------------------------------*
           if        rf-oct-num-doc       <    rr-noc-min or
                     rf-oct-num-doc       >    rr-noc-max
                     go to prn-sel-rec-900.
      *              *-------------------------------------------------*
      *              * Test su tipo movimento                          *
      *              *-------------------------------------------------*
           if        rf-oct-tmo-orc       not  = rr-tip-mov
                     go to prn-sel-rec-900.
      *              *-------------------------------------------------*
      *              * Test su codice cliente                          *
      *              *-------------------------------------------------*
           if        rf-oct-cod-arc       <    rr-cli-min or
                     rf-oct-cod-arc       >    rr-cli-max
                     go to prn-sel-rec-900.
      *              *-------------------------------------------------*
      *              * Test su dipendenza del cliente                  *
      *              *-------------------------------------------------*
           if        rf-oct-dpz-arc       <    rr-dpz-min or
                     rf-oct-dpz-arc       >    rr-dpz-max
                     go to prn-sel-rec-900.
       prn-sel-rec-300.
      *              *-------------------------------------------------*
      *              * Selezione su status ordine                      *
      *              *-------------------------------------------------*
           if        rr-sts-orc           =    01
                     go to prn-sel-rec-800.
           if        rr-sts-orc           not  = 04 and
                     rf-oct-flg-och       not  = spaces
                     go to prn-sel-rec-900.
       prn-sel-rec-320.
      *              *-------------------------------------------------*
      *              * Determinazione status dell'ordine               *
      *              *-------------------------------------------------*
           move      "DT"                 to   d-sts-orc-tip-ope      .
           perform   det-sts-orc-cll-000  thru det-sts-orc-cll-999    .
       prn-sel-rec-400.
      *              *-------------------------------------------------*
      *              * Test su status dell'ordine                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione delle richieste      *
      *                  *---------------------------------------------*
           if        rr-sts-orc           =    02
                     go to prn-sel-rec-420
           else if   rr-sts-orc           =    03
                     go to prn-sel-rec-430
           else if   rr-sts-orc           =    04
                     go to prn-sel-rec-440.
       prn-sel-rec-420.
      *                      *-----------------------------------------*
      *                      * Se solo ordini inevasi                  *
      *                      *-----------------------------------------*
           if        d-sts-orc-sts-ord    =    02  or
                     d-sts-orc-sts-ord    =    04
                     go to prn-sel-rec-800
           else      go to prn-sel-rec-900.
       prn-sel-rec-430.
      *                      *-----------------------------------------*
      *                      * Se solo ordini evasi                    *
      *                      *-----------------------------------------*
           if        d-sts-orc-sts-ord    =    02  or
                     d-sts-orc-sts-ord    =    03
                     go to prn-sel-rec-800
           else      go to prn-sel-rec-900.
       prn-sel-rec-440.
      *                      *-----------------------------------------*
      *                      * Se solo ordini chiusi                   *
      *                      *-----------------------------------------*
           if        d-sts-orc-sts-ord    =    01
                     go to prn-sel-rec-800
           else      go to prn-sel-rec-900.
       prn-sel-rec-800.
      *              *-------------------------------------------------*
      *              * Uscita per selezione superata                   *
      *              *-------------------------------------------------*
           go to     prn-sel-rec-999.
       prn-sel-rec-900.
      *              *-------------------------------------------------*
      *              * Se selezione non superata                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita                              *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-prn-flg-sub      .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-liv-det-100.
      *              *-------------------------------------------------*
      *              * Salvataggio parametri per Start su [oct]        *
      *              *-------------------------------------------------*
           move      rf-oct-dat-doc       to   w-rip-str-oct-ddo      .
           move      rf-oct-cod-dpz       to   w-rip-str-oct-dpz      .
           move      rf-oct-num-doc       to   w-rip-str-oct-ndo      .
           move      rf-oct-tmo-orc       to   w-rip-str-oct-tmo      .
           move      rf-oct-num-prt       to   w-rip-str-oct-prt      .
       prn-liv-det-200.
      *              *-------------------------------------------------*
      *              * Esecuzione stampa documento                     *
      *              *-------------------------------------------------*
           perform   exe-mod-stp-000      thru exe-mod-stp-999        .
       prn-liv-det-300.
      *              *-------------------------------------------------*
      *              * Se errori in fase di stampa documento           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to prn-liv-det-400.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      "Attenzione : durante il programma e' intervenuto u
      -              "n errore di tipo grave."
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
           move      "WR"                 to   m-ope                  .
           move      "             La stampa richiesta pertanto e' stata
      -              " interrotta."
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita per errore                        *
      *                  *---------------------------------------------*
           go to     prn-liv-det-900.
       prn-liv-det-400.
      *              *-------------------------------------------------*
      *              * Aggiornamento contatore stampe se necessario    *
      *              *-------------------------------------------------*
       prn-liv-det-420.
      *                  *---------------------------------------------*
      *                  * Test a seconda del tipo stampa              *
      *                  *---------------------------------------------*
           go to     prn-liv-det-440
                     prn-liv-det-460
                     prn-liv-det-480
                     depending            on   rr-tip-stp             .
           go to     prn-liv-det-440.
       prn-liv-det-440.
      *                      *-----------------------------------------*
      *                      * Tipo stampa : definitiva                *
      *                      *-----------------------------------------*
           go to     prn-liv-det-500.
       prn-liv-det-460.
      *                      *-----------------------------------------*
      *                      * Tipo stampa : di prova                  *
      *                      *-----------------------------------------*
           go to     prn-liv-det-600.
       prn-liv-det-480.
      *                      *-----------------------------------------*
      *                      * Tipo stampa : ristampa                  *
      *                      *-----------------------------------------*
           if        rf-oct-ctr-stp       <    99
                     go to prn-liv-det-500
           else      go to prn-liv-det-600.
       prn-liv-det-500.
      *                  *---------------------------------------------*
      *                  * Aggiornamento effettivo contatore           *
      *                  *---------------------------------------------*
       prn-liv-det-520.
      *                      *-----------------------------------------*
      *                      * Rilettura record                        *
      *                      *-----------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-rip-str-oct-prt    to   rf-oct-num-prt         .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *                      *-----------------------------------------*
      *                      * Se record non trovato : non si esegue   *
      *                      * l'aggiornamento del contatore           *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to prn-liv-det-600.
       prn-liv-det-540.
      *                      *-----------------------------------------*
      *                      * Aggiornamento contatore                 *
      *                      *-----------------------------------------*
           add       1                    to   rf-oct-ctr-stp         .
       prn-liv-det-560.
      *                      *-----------------------------------------*
      *                      * Riscrittura record                      *
      *                      *-----------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *                      *-----------------------------------------*
      *                      * Se errore in riscrittura : non si ese-  *
      *                      * gue l'aggiornamento del contatore       *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to prn-liv-det-580.
       prn-liv-det-580.
      *                      *-----------------------------------------*
      *                      * Rilascio record                         *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
       prn-liv-det-600.
      *              *-------------------------------------------------*
      *              * Ripristino Start su [oct]                       *
      *              *-------------------------------------------------*
       prn-liv-det-620.
      *                  *---------------------------------------------*
      *                  * Re-start                                    *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "GT"                 to   f-cfr                  .
           move      "IDEDOC    "         to   f-key                  .
           move      w-rip-str-oct-ddo    to   rf-oct-dat-doc         .
           move      w-rip-str-oct-dpz    to   rf-oct-cod-dpz         .
           move      w-rip-str-oct-ndo    to   rf-oct-num-doc         .
           move      w-rip-str-oct-tmo    to   rf-oct-tmo-orc         .
           move      w-rip-str-oct-prt    to   rf-oct-num-prt         .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
       prn-liv-det-640.
      *                  *---------------------------------------------*
      *                  * Se errore in re-start                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        f-sts                =   e-not-err
                     go to prn-liv-det-700.
      *                      *-----------------------------------------*
      *                      * Ad uscita per errore                    *
      *                      *-----------------------------------------*
           go to     prn-liv-det-900.
       prn-liv-det-700.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-900.
      *              *-------------------------------------------------*
      *              * Uscita per errore                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di interruzione forzata                *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-prn-flg-int      .
      *                  *---------------------------------------------*
      *                  * Flag di End-of-file                         *
      *                  *---------------------------------------------*
           move      "#"                  to   w-rip-str-oct-eof      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Apertura modulo di stampa                                 *
      *    *-----------------------------------------------------------*
       opn-mod-stp-000.
      *              *-------------------------------------------------*
      *              * Preparazione variabile "inp-mst"                *
      *              *-------------------------------------------------*
           move      spaces               to   w-inp-mst              .
           move      "OP"                 to   w-inp-mst-ope          .
           move      "O"                  to   w-inp-mst-sel          .
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-azi                to   w-inp-mst-azi          .
           move      s-ter                to   w-inp-mst-ter          .
           move      s-ute                to   w-inp-mst-ute          .
           move      i-ide-sap            to   w-inp-mst-sap          .
           move      i-ide-arg            to   w-inp-mst-arg          .
           move      i-ide-set            to   w-inp-mst-set          .
           move      i-ide-fas            to   w-inp-mst-fas          .
           move      i-ide-des            to   w-inp-mst-dep          .
      *              *-------------------------------------------------*
      *              * Scrittura variabile "inp-mst"                   *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "inp-mst"            to   s-var                  .
           move      "="                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      80                   to   s-car                  .
           move      w-inp-mst            to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di stampa documento         *
      *              *-------------------------------------------------*
           move      "pgm/orc/prg/obj/porc300s"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
      *              *-------------------------------------------------*
      *              * Controllo esito operazione di Open              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura variabile di ritorno "out-mst"      *
      *                  *---------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "out-mst"            to   s-var                  .
           move      "="                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                not  = spaces
                     go to opn-mod-stp-500.
           move      s-alf                to   w-out-mst              .
           if        w-out-mst-opn        not  = spaces
                     go to opn-mod-stp-500.
      *                  *---------------------------------------------*
      *                  * Se variabile di ritorno "out-mst" esistente *
      *                  * ed indicante selezione effettuata           *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-mst-sel          .
           go to     opn-mod-stp-999.
       opn-mod-stp-500.
      *                  *---------------------------------------------*
      *                  * Se variabile di ritorno "out-mst" non esi-  *
      *                  * stente o se selezione non effettuata        *
      *                  *---------------------------------------------*
           move      "N"                  to   w-cnt-mst-sel          .
       opn-mod-stp-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione modulo di stampa documento                     *
      *    *-----------------------------------------------------------*
       exe-mod-stp-000.
      *              *-------------------------------------------------*
      *              * Preparazione variabile "inp-mst"                *
      *              *-------------------------------------------------*
           move      spaces               to   w-inp-mst              .
           move      "ST"                 to   w-inp-mst-ope          .
           move      rf-oct-num-prt       to   w-inp-mst-prt          .
           move      "N"                  to   w-inp-mst-ejc          .
      *              *-------------------------------------------------*
      *              * Scrittura variabile "inp-mst"                   *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "inp-mst"            to   s-var                  .
           move      "="                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      80                   to   s-car                  .
           move      w-inp-mst            to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di stampa documento         *
      *              *-------------------------------------------------*
           move      "pgm/orc/prg/obj/porc300s"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
      *              *-------------------------------------------------*
      *              * Controllo esito operazione di Stampa            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura variabile di ritorno "out-mst"      *
      *                  *---------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "out-mst"            to   s-var                  .
           move      "="                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                not  = spaces
                     go to exe-mod-stp-999.
           move      s-alf                to   w-out-mst              .
       exe-mod-stp-999.
           exit.

      *    *===========================================================*
      *    * Chiusura modulo di stampa                                 *
      *    *-----------------------------------------------------------*
       cls-mod-stp-000.
      *              *-------------------------------------------------*
      *              * Preparazione variabile "inp-mst"                *
      *              *-------------------------------------------------*
           move      spaces               to   w-inp-mst              .
           move      "CL"                 to   w-inp-mst-ope          .
      *              *-------------------------------------------------*
      *              * Scrittura variabile "inp-mst"                   *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "inp-mst"            to   s-var                  .
           move      "="                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      80                   to   s-car                  .
           move      w-inp-mst            to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di stampa documento         *
      *              *-------------------------------------------------*
           move      "pgm/orc/prg/obj/porc300s"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
      *              *-------------------------------------------------*
      *              * Cancellazione del modulo di stampa documento    *
      *              *-------------------------------------------------*
           cancel    s-pat                                            .
       cls-mod-stp-999.
           exit.

      *    *===========================================================*
      *    * Find su archivio [oct]                                    *
      *    *-----------------------------------------------------------*
       fnd-arc-oct-000.
      *              *-------------------------------------------------*
      *              * Test se programma di interrogazione gia' attivo *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "porc3010"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to  fnd-arc-oct-999.
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. per codice di- *
      *              * pendenza                                        *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "cod-dpz"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      02                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      rr-cod-dpz           to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo programma di interrogazione            *
      *              *-------------------------------------------------*
           move      "pgm/orc/prg/obj/porc3010"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
           cancel    s-pat                                            .
       fnd-arc-oct-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per l'accettazione tipo movimento             *
      *    *-----------------------------------------------------------*
           copy      "pgm/orc/prg/cpy/acdezoc0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione codice cliente commerciale *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmndcc0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione codice dipendenza cliente  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoddcc0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per determinazione stato ordine cliente       *
      *    *-----------------------------------------------------------*
           copy      "pgm/orc/prg/cpy/dstsorc0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

