       Identification Division.
       Program-Id.                                 pele8100           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    ele                 *
      *                        Area gestionale:    agb                 *
      *                                Settore:    imp                 *
      *                                   Fase:    ele810              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 22/12/08    *
      *                       Ultima revisione:    MB  del 22/12/08    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Generazione ordine cliente da export FM     *
      *                                                                *
      *                    File Maker --> Tangram                      *
      *                                                                *
      *                    /abd/asc/imp/....                           *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     d-K-b-Snc-PD .
       Object-Computer.     d-K-b-Snc-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "ele"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "agb"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "imp"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "ele810"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pele8100"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "    GENERAZIONE ORDINE CLIENTE DA FM    "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mmessg" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                 "mbckgx" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output su files *
      *    * di tipo line sequential                                   *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/g"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mopsys" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/o"                                  .
           
      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine qry-rou-pri-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-qry-rou-pri      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste pre esecuzione interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico interrogazione        *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento automatico interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-aut      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di Si/No primo giro di esecuzione            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-prm-gir      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento qry-routine       *
      *        *-------------------------------------------------------*
           05  w-cnt-qry.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-qry-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-liv.
                   15  w-cnt-qry-sav-l05  pic  x(64)                  .
                   15  w-cnt-qry-sav-l04  pic  x(64)                  .
                   15  w-cnt-qry-sav-l03  pic  x(64)                  .
                   15  w-cnt-qry-sav-l02  pic  x(64)                  .
                   15  w-cnt-qry-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Literals                                              *
      *        *-------------------------------------------------------*
           05  w-cnt-lit.
               10  w-cnt-lit-t80          pic  x(80) value all "="    .
      *        *-------------------------------------------------------*
      *        * Work per padding campi alfanumerici con 'z'           *
      *        *-------------------------------------------------------*
           05  w-pad-zzz.
               10  w-pad-zzz-alf.
                   15  w-pad-zzz-alf-chr
                                   occurs 20       
                                          pic  x(01)                  .
               10  w-pad-zzz-ctr          pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per trasformazioni in uppercase                 *
      *    *-----------------------------------------------------------*
       01  w-upp.
           05  w-upp-des.
               10  w-upp-chr occurs 40    pic  x(01)                  .
           05  w-ctr                      pic  9(02)                  .
           05  w-upp-car.
               10  filler                 pic  x(26) value
                     "ABCDEFGHIJKLMNOPQRSTUVWXYZ"                     .
           05  w-upp-crr redefines w-upp-car.
               10  w-upc occurs 26        pic  x(01)                  .
           05  w-low.
               10  filler                 pic  x(26) value
                     "abcdefghijklmnopqrstuvwxyz"                     .
           05  w-lor redefines w-low.
               10  w-loc occurs 26        pic  x(01)                  .
           05  w-ulc                      pic  9(02)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [oct]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfoct"                          .
      *        *-------------------------------------------------------*
      *        * [ocr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/fls/rec/rfocr"                          .
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [zfp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfzfp"                          .
      *        *-------------------------------------------------------*
      *        * [age]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/age/fls/rec/rfage"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [pdx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfpdx"                          .
      *        *-------------------------------------------------------*
      *        * [orcprt]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/num/rec/rnorcprt"                       .
      *        *-------------------------------------------------------*
      *        * [orcndo]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/orc/num/rec/rnorcndo"                       .
           
      *    *===========================================================*
      *    * Work area per definizione record di log                   *
      *    *-----------------------------------------------------------*
       01  w-rec-log.
      *        *-------------------------------------------------------*
      *        * Data evento                                           *
      *        *-------------------------------------------------------*
           05  w-rec-log-dat              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Filler 1                                              *
      *        *-------------------------------------------------------*
           05  w-rec-log-f01              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Ora evento                                            *
      *        *-------------------------------------------------------*
           05  w-rec-log-ora              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Filler 2                                              *
      *        *-------------------------------------------------------*
           05  w-rec-log-f02              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Descrizione evento                                    *
      *        *-------------------------------------------------------*
           05  w-rec-log-des              pic  x(82)                  .
           
      *    *===========================================================*
      *    * Work area per definizione record file guida               *
      *    *-----------------------------------------------------------*
       01  w-rec-gui.
      *        *-------------------------------------------------------*
      *        * Protocollo richiesta d'ordine                         *
      *        *-------------------------------------------------------*
           05  w-rec-gui-pro              pic  9(08)                  .
      *        *-------------------------------------------------------*
      *        * Filler 001                                            *
      *        *-------------------------------------------------------*
           05  w-rec-gui-f01              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Numero documento ordine cliente generato              *
      *        *-------------------------------------------------------*
           05  w-rec-gui-noc              pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Filler 002                                            *
      *        *-------------------------------------------------------*
           05  w-rec-gui-f02              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Exit status da generazione ordine                     *
      *        *-------------------------------------------------------*
           05  w-rec-gui-exi              pic  9(02)                  .
           
      *    *===========================================================*
      *    * Work area per definizione record testata                  *
      *    *-----------------------------------------------------------*
       01  w-rec-tes.
      *        *-------------------------------------------------------*
      *        * Protocollo FM                                         *
      *        *-------------------------------------------------------*
           05  w-rec-tes-prt              pic  9(08)                  .
      *        *-------------------------------------------------------*
      *        * Utente FM                                             *
      *        *-------------------------------------------------------*
           05  w-rec-tes-ute              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Codice cliente                                        *
      *        *-------------------------------------------------------*
           05  w-rec-tes-cli              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Dipendenza cliente                                    *
      *        *-------------------------------------------------------*
           05  w-rec-tes-dpz              pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Data ordine cliente                                   *
      *        *-------------------------------------------------------*
           05  w-rec-tes-doc              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Numero ordine cliente                                 *
      *        *-------------------------------------------------------*
           05  w-rec-tes-noc              pic  x(10)                  .
      *        *-------------------------------------------------------*
      *        * Data consegna richiesta                               *
      *        *-------------------------------------------------------*
           05  w-rec-tes-dcr              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Nota di testata                                       *
      *        *-------------------------------------------------------*
           05  w-rec-tes-not.
               10  w-rec-tes-not-rig occurs 3
                                          pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Numero righe che compongono la RDO                    *
      *        *-------------------------------------------------------*
           05  w-rec-tes-nrg              pic  9(05)                  .
           
      *    *===========================================================*
      *    * Work area per definizione record riga                     *
      *    *-----------------------------------------------------------*
       01  w-rec-rig.
      *        *-------------------------------------------------------*
      *        * Codice prodotto alfanumerico                          *
      *        *-------------------------------------------------------*
           05  w-rec-rig-cpa              pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Quantita' ordinata                                    *
      *        *-------------------------------------------------------*
           05  w-rec-rig-qta              pic  9(06)                  .
           
      *    *===========================================================*
      *    * Work-area per bufferizzazione righe record unico          *
      *    *-----------------------------------------------------------*
       01  w-buf-rig.
           05  w-buf-rig-rec.
               10  w-buf-rig-ele occurs 200.
                  15  w-buf-rig-cod       pic  x(14)                  .
                  15  w-buf-rig-qta       pic  9(06)                  .
           05  w-buf-rig-ctr              pic  9(03)                  .
           
      *    *===========================================================*
      *    * Work-area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Tipo esposizione prezzi e sconti                      *
      *        *-------------------------------------------------------*
           05  w-prs-epz-pes              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Personalizzazione relativa al tipo imponibile per lo  *
      *        * sconto di pagamento                                   *
      *        *-------------------------------------------------------*
           05  w-prs-tim-scp.
      *            *---------------------------------------------------*
      *            * Tipo di imponibile                                *
      *            *  - C : Comprendente le spese, normale             *
      *            *  - N : Non comprendente le spese                  *
      *            *---------------------------------------------------*
               10  w-prs-tim-scp-tip      pic  x(01)                  .

      *    *===========================================================*
      *    * Work generica per tutto il programma                      *
      *    *-----------------------------------------------------------*
       01  w-gen.
      *        *-------------------------------------------------------*
      *        * Data attuale                                          *
      *        *-------------------------------------------------------*
           05  w-gen-dat-att              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Exit status                                           *
      *        *                                                       *
      *        * 50 : errore in open file guida                        *
      *        * 51 : errore in read file guida                        *
      *        * 01 : file testata richiesta d'ordine non trovato      *
      *        * 02 : record testata richiesta d'ordine non trovato    *
      *        * 11 : file righe richiesta d'ordine non trovato        *
      *        * 12 : record righe richiesta d'ordine non trovato      *
      *        * 21 : file righe richiesta d'ordine non trovato in     *
      *        *      fase di rilettura                                *
      *        * 22 : record righe richiesta d'ordine non trovato in   *
      *        *      fase di rilettura                                *
      *        * 30 : errore di lettura record [dcp]: è stata ignorata *
      *        *      almeno una riga                                  *
      *        *-------------------------------------------------------*
           05  w-gen-exi-sts              pic  x(02)                  .
      *        *-------------------------------------------------------*
      *        * Protocollo richiesta d'ordine in trattamento          *
      *        *-------------------------------------------------------*
           05  w-gen-prt-roc              pic  9(08)                  .
      *        *-------------------------------------------------------*
      *        * Numero protocollo ordine cliente generato             *
      *        *-------------------------------------------------------*
           05  w-gen-prt-orc              pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Numero documento ordine cliente generato              *
      *        *-------------------------------------------------------*
           05  w-gen-ndo-orc              pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Numero progressivo riga                               *
      *        *-------------------------------------------------------*
           05  w-gen-num-prg              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Totalizzatori righe ordine                            *
      *        *-------------------------------------------------------*
           05  w-gen-tot-rig  occurs 09   pic s9(13)                  .
      *        *-------------------------------------------------------*
      *        * Totale documento lordo                                *
      *        *-------------------------------------------------------*
           05  w-gen-tot-lor              pic s9(13)                  .
      *        *-------------------------------------------------------*
      *        * Totale sconto pagamento                               *
      *        *-------------------------------------------------------*
           05  w-gen-tot-scp              pic s9(13)                  .
      *        *-------------------------------------------------------*
      *        * Descrizione evento per log                            *
      *        *-------------------------------------------------------*
           05  w-gen-des-log              pic  x(99)                  .
      *        *-------------------------------------------------------*
      *        * Flag di registrazione eseguita                        *
      *        *-------------------------------------------------------*
           05  w-gen-flg-exe              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di errori consecutivi                       *
      *        *-------------------------------------------------------*
           05  w-gen-ctr-err              pic  9(01)                  .
               
      *    *===========================================================*
      *    * Work per Let su archivio [dcp] e [pdx]                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/ldcppdx0.ltw"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione prezzo di vendi- *
      *    * ta                                                        *
      *    *-----------------------------------------------------------*
           copy      "pgm/fat/prg/cpy/dprzven0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione sconti in riga   *
      *    *-----------------------------------------------------------*
           copy      "pgm/fat/prg/cpy/dperscr0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione importo in riga  *
      *    *-----------------------------------------------------------*
           copy      "pgm/fat/prg/cpy/dimpven0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione provvigioni      *
      *    *-----------------------------------------------------------*
           copy      "pgm/age/prg/cpy/dpvgage0.dtl"                   .

      *    *===========================================================*
      *    * Work-area per determinazione prezzo netto                 *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wcalprz0.cpw"                   .

      *    *===========================================================*
      *    * Work per subroutines di Att                               *
      *    *-----------------------------------------------------------*
       01  w-att.
      *        *-------------------------------------------------------*
      *        * Work per Att numero documento ordini clienti          *
      *        *-------------------------------------------------------*
           05  w-att-orc-ndo.
               10  w-att-orc-ndo-flg      pic  x(01)                  .
               10  w-att-orc-ndo-dat      pic  9(07)                  .
               10  w-att-orc-ndo-saa      pic  9(03)                  .
               10  w-att-orc-ndo-dpz      pic  9(02)                  .
               10  w-att-orc-ndo-sgl      pic  x(03)                  .
               10  w-att-orc-ndo-num      pic  9(11)                  .
               10  w-att-orc-ndo-num-r    redefines
                   w-att-orc-ndo-num.
                   15  filler             pic  9(03)                  .
                   15  filler             pic  9(02)                  .
                   15  w-att-orc-ndo-prg  pic  9(06)                  .
               10  w-att-orc-ndo-wnu      pic  9(11)                  .
               10  w-att-orc-ndo-wnu-r    redefines
                   w-att-orc-ndo-wnu.
                   15  w-att-orc-ndo-wsa  pic  9(03)                  .
                   15  w-att-orc-ndo-wdz  pic  9(02)                  .
                   15  w-att-orc-ndo-wpr  pic  9(06)                  .
               10  w-att-orc-ndo-new      pic  9(11)                  .
               10  w-att-orc-ndo-nsv      pic  9(11)                  .
               10  w-att-orc-ndo-dsv      pic  9(07)                  .
               10  w-att-orc-ndo-wdf      pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Work per Att numero protocollo ordini clienti         *
      *        *-------------------------------------------------------*
           05  w-att-orc-prt.
               10  w-att-orc-prt-dat      pic  9(07)                  .
               10  w-att-orc-prt-saa      pic  9(03)                  .
               10  w-att-orc-prt-dpz      pic  9(02)                  .
               10  w-att-orc-prt-num      pic  9(11)                  .
               10  w-att-orc-prt-wnu      pic  9(11)                  .
               10  w-att-orc-prt-wnu-r    redefines
                   w-att-orc-prt-wnu.
                   15  w-att-orc-prt-wsa  pic  9(03)                  .
                   15  w-att-orc-prt-wdz  pic  9(02)                  .
                   15  w-att-orc-prt-wpr  pic  9(06)                  .

      *    *===========================================================*
      *    * Work per bufferizzazione dati relativi alla dipendenza    *
      *    * cliente                                                   *
      *    *-----------------------------------------------------------*
       01  w-dpz-cli.
           05  w-dpz-cli-cod-abi          pic  9(05)                  .
           05  w-dpz-cli-cod-cab          pic  9(05)                  .
           05  w-dpz-cli-ccc-app          pic  x(12)                  .
           05  w-dpz-cli-cod-age          pic  9(07)                  .
           05  w-dpz-cli-cat-pvg          pic  9(05)                  .
       
      *    *===========================================================*
      *    * Work per routine wrt-rec-oct-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-wrt-rec-oct.
      *        *-------------------------------------------------------*
      *        * Contatore di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-wrt-rec-oct-ctr          pic  9(03)                  .
               
      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Esecuzione registrazione ordine cliente         *
      *              *-------------------------------------------------*
           perform   exe-reg-orc-000      thru exe-reg-orc-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione campo alfanumerico con padding di "z"    *
      *    *-----------------------------------------------------------*
       pad-alf-zzz-000.
           move      20                   to   w-pad-zzz-ctr          .
       pad-alf-zzz-100.
           if        w-pad-zzz-ctr        >    zero
                     if    w-pad-zzz-alf-chr
                          (w-pad-zzz-ctr) =    spaces
                           move    "z"    to   w-pad-zzz-alf-chr
                                              (w-pad-zzz-ctr)
                           subtract 1     from w-pad-zzz-ctr
                           go to    pad-alf-zzz-100.
       pad-alf-zzz-999.
           exit.

      *    *===========================================================*
      *    * Trasformazione in uppercase                               *
      *    *-----------------------------------------------------------*
       trf-des-upp-000.
           move      zero                 to   w-ctr                  .
       trf-des-upp-100.
           add       1                    to   w-ctr                  .
           if        w-ctr                >    40
                     go to  trf-des-upp-999.
           move      zero                 to   w-ulc                  .
           inspect   w-low            tallying w-ulc
                     for characters     before initial w-upp-chr
                                                      (w-ctr)         .
           if        w-ulc                <    26
                     add     1            to   w-ulc
                     move    w-upc(w-ulc) to   w-upp-chr(w-ctr)       .
           go to     trf-des-upp-100.
       trf-des-upp-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
       pre-exe-pgm-100.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo esposizione prezzi e sconti            *
      *                  *---------------------------------------------*
           perform   prs-epz-pes-000      thru prs-epz-pes-999        .
      *                  *---------------------------------------------*
      *                  * Tipo imponibile per sconto pagamento        *
      *                  *                                             *
      *                  * NB: per il momento la leggo solo e calcolo  *
      *                  *     l'eventuale sconto pagamento sul totale *
      *                  *     lordo perchè attualmente non gestisco   *
      *                  *     ler spese di fatturazione               *
      *                  *---------------------------------------------*
           perform   prs-tim-scp-000      thru prs-tim-scp-999        .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Tipo esposizione prezzi e     *
      *    *                             sconti                        *
      *    *-----------------------------------------------------------*
       prs-epz-pes-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/dcc[epz-pes]"   to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-num          to   w-prs-epz-pes
           else      move  zero           to   w-prs-epz-pes          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-epz-pes        =    11 or
                     w-prs-epz-pes        =    21
                     go to prs-epz-pes-999.
           move      11                   to   w-prs-epz-pes          .
       prs-epz-pes-999.
           exit.

      *    *===========================================================*
      *    * Lettura della personalizzazione relativa al tipo di im-   *
      *    * ponibile per lo sconto pagamento                          *
      *    *-----------------------------------------------------------*
       prs-tim-scp-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione : Tipo accettazione   *
      *              * spesa                                           *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/fat/mov/fat300[tim-scp]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Test su esito operazione                        *
      *              *-------------------------------------------------*
           if        s-ves                not  = spaces
                     move  "C"            to   w-prs-tim-scp-tip
           else      move  s-alf          to   w-prs-tim-scp-tip      .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-tim-scp-tip    not  = "C" and
                     w-prs-tim-scp-tip    not  = "N"
                     move  "C"            to   w-prs-tim-scp-tip      .
       prs-tim-scp-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione registrazione ordine cliente                   *
      *    *-----------------------------------------------------------*
       exe-reg-orc-000.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [oct]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *                  *---------------------------------------------*
      *                  * [ocr]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *                  *---------------------------------------------*
      *                  * [orcndo]                                    *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-ndo             .
      *                  *---------------------------------------------*
      *                  * [orcprt]                                    *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-prt             .
      *                  *---------------------------------------------*
      *                  * [dcc]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * [zfp]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zfp                 .
      *                  *---------------------------------------------*
      *                  * [cli]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *                  *---------------------------------------------*
      *                  * [age]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *                  *---------------------------------------------*
      *                  * [dcp]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * [pdx]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *                  *---------------------------------------------*
      *                  * Open modulo determinazione prezzo vendita   *
      *                  *---------------------------------------------*
           move      "OP"                 to   d-prz-ven-tip-ope      .
           move      "pgm/fat/prg/obj/dprzven0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-prz-ven              .
      *                  *---------------------------------------------*
      *                  * Open modulo di determinazione sconti riga   *
      *                  *---------------------------------------------*
           move      "OP"                 to   d-per-scr-tip-ope      .
           move      "pgm/fat/prg/obj/dperscr0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-per-scr              .
      *                  *---------------------------------------------*
      *                  * Open modulo di determinazione importo in    *
      *                  * riga                                        *
      *                  *---------------------------------------------*
           move      "OP"                 to   d-imp-ven-tip-ope      .
           move      "pgm/fat/prg/obj/dimpven0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-imp-ven              .
      *                  *---------------------------------------------*
      *                  * Open modulo di determinazione provvigioni   *
      *                  *---------------------------------------------*
           move      "OP"                 to   d-pvg-age-tip-ope      .
           move      "pgm/age/prg/obj/dpvgage0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-pvg-age              .
      *                  *---------------------------------------------*
      *                  * Scrittura record log                        *
      *                  *---------------------------------------------*
           move      "Start daemon "      to   w-gen-des-log          .
           perform   wrt-rec-log-000      thru wrt-rec-log-999        .
      *                  *---------------------------------------------*
      *                  * Normalizzazione work componenti record      *
      *                  *---------------------------------------------*
           move      zero                 to   w-gen-prt-roc          .
           move      zero                 to   w-gen-ndo-orc          .
           move      zero                 to   w-gen-exi-sts          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di scrittura eseguita  *
      *                  *---------------------------------------------*
           move      spaces               to   w-gen-flg-exe          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore errori lettura    *
      *                  * file guida OFF                              *
      *                  *---------------------------------------------*
           move      zero                 to   w-gen-ctr-err          .
       exe-reg-orc-100.
      *              *-------------------------------------------------*
      *              * Ciclo di scansione file guida                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Wait di un secondo                          *
      *                  *---------------------------------------------*
           call      "swd/mod/prg/obj/mwait0"                         .
      *                  *---------------------------------------------*
      *                  * Open file guida ON                          *
      *                  *---------------------------------------------*
           move      "OI"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      "/abd/asc/imp/roc_guidaON.txt"
                                          to   g-pat                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se errore                                   *
      *                  *---------------------------------------------*
           if        g-sts                =     e-not-err
                     go to exe-reg-orc-120.
      *                      *-----------------------------------------*
      *                      * Scrittura record file guida OFF con er- *
      *                      * rore                                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Scrittura record log                *
      *                          *-------------------------------------*
           move      "Errore [50]: Open input file guida ON"                              
                                          to   w-gen-des-log          .
           perform   wrt-rec-log-000      thru wrt-rec-log-999        .
      *                      *-----------------------------------------*
      *                      * Incremento contatore errori consecutivi *
      *                      *-----------------------------------------*
           add       1                    to   w-gen-ctr-err          .
      *                      *-----------------------------------------*
      *                      * Se più di tre errori consecutivi: a     *
      *                      * scrittura file guida con errore         *
      *                      *-----------------------------------------*
           if        w-gen-ctr-err        >    3
                     move  50             to   w-gen-exi-sts
                     go to exe-reg-orc-800
           else      go to exe-reg-orc-100.
       exe-reg-orc-120.
      *                  *---------------------------------------------*
      *                  * Lettura primo record file guida             *
      *                  *---------------------------------------------*
           move      "GN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se errore                                   *
      *                  *---------------------------------------------*
           if        g-sts                =     e-not-err
                     go to exe-reg-orc-150.
      *                      *-----------------------------------------*
      *                      * Close file guida ON                     *
      *                      *-----------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                      *-----------------------------------------*
      *                      * Scrittura record log                    *
      *                      *-----------------------------------------*
           move      "Errore [51]: Lettura file guida ON"                              
                                          to   w-gen-des-log          .
           perform   wrt-rec-log-000      thru wrt-rec-log-999        .
      *                      *-----------------------------------------*
      *                      * Incremento contatore errori consecutivi *
      *                      *-----------------------------------------*
           add       1                    to   w-gen-ctr-err          .
      *                      *-----------------------------------------*
      *                      * Se più di tre errori consecutivi: a     *
      *                      * scrittura file guida con errore         *
      *                      *-----------------------------------------*
           if        w-gen-ctr-err        >    3
                     move  51             to   w-gen-exi-sts
                     go to exe-reg-orc-800
           else      go to exe-reg-orc-100.
       exe-reg-orc-150.
      *                  *---------------------------------------------*
      *                  * Scomposizione record file guida ON          *
      *                  *---------------------------------------------*
           move      g-rec                to   w-rec-gui              .
      *                  *---------------------------------------------*
      *                  * Close file guida ON                         *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Riazzeramento contatore di errori consecu-  *
      *                  * tivi                                        *
      *                  *---------------------------------------------*
           move      zero                 to   w-gen-ctr-err          .
      *                  *---------------------------------------------*
      *                  * Se protocollo richiesta d'ordine a          *
      *                  * 99999999: si intende che il ciclo deve es-  *
      *                  * sere interrotto, quindi si scrive il record *
      *                  * guida OFF normalizzato e si va a close fi-  *
      *                  * les                                         *
      *                  *---------------------------------------------*
           if        w-rec-gui-pro        not  = 99999999
                     go to exe-reg-orc-160.
      *                      *-----------------------------------------*
      *                      * Scrittura record file guida OFF norma-  *
      *                      * lizzato                                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Open output file guida              *
      *                          *-------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      "/abd/asc/imp/roc_guidaOFF.txt"
                                          to   g-pat                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                          *-------------------------------------*
      *                          * Composizione record normalizzato    *
      *                          *-------------------------------------*
           move      zero                 to   w-rec-gui-pro          .
           move      "."                  to   w-rec-gui-f01          .
           move      zero                 to   w-rec-gui-noc          .
           move      "."                  to   w-rec-gui-f02          .
           move      zero                 to   w-rec-gui-exi          .
      *                          *-------------------------------------*
      *                          * Scrittura record                    *
      *                          *-------------------------------------*
           move      "PN"                 to   g-ope                  .
           move      w-rec-gui            to   g-rec                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                          *-------------------------------------*
      *                          * Close file guida                    *
      *                          *-------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                          *-------------------------------------*
      *                          * A close files ed uscita             *
      *                          *-------------------------------------*
           go to     exe-reg-orc-900.
       exe-reg-orc-160.
      *                  *---------------------------------------------*
      *                  * Se protocollo richiesta d'ordine non a zero *
      *                  * ma flag di registrazione eseguita attivo,   *
      *                  * siamo ancora in attesa del record zero da   *
      *                  * FM e quindi si ricicla                      *
      *                  *---------------------------------------------*
           if        w-rec-gui-pro        not  = zero and
                     w-gen-flg-exe        not  = spaces
                     go to exe-reg-orc-100.
      *                  *---------------------------------------------*
      *                  * Se protocollo richiesta d'ordine a zero     *
      *                  *---------------------------------------------*
           if        w-rec-gui-pro        not  = zero
                     go to exe-reg-orc-200.
      *                  *---------------------------------------------*
      *                  * Test su flag di registrazione eseguita      *
      *                  *---------------------------------------------*
           if        w-gen-flg-exe        =    spaces
                     go to exe-reg-orc-180.
      *                      *-----------------------------------------*
      *                      * Normalizzazione flag di registrazione   *
      *                      * eseguita                                *
      *                      *-----------------------------------------*
           move      spaces               to   w-gen-flg-exe          .
      *                      *-----------------------------------------*
      *                      * Scrittura record file guida OFF norma-  *
      *                      * lizzato                                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Open output file guida              *
      *                          *-------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      "/abd/asc/imp/roc_guidaOFF.txt"
                                          to   g-pat                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                          *-------------------------------------*
      *                          * Composizione record normalizzato    *
      *                          *-------------------------------------*
           move      zero                 to   w-rec-gui-pro          .
           move      "."                  to   w-rec-gui-f01          .
           move      zero                 to   w-rec-gui-noc          .
           move      "."                  to   w-rec-gui-f02          .
           move      zero                 to   w-rec-gui-exi          .
      *                          *-------------------------------------*
      *                          * Scrittura record                    *
      *                          *-------------------------------------*
           move      "PN"                 to   g-ope                  .
           move      w-rec-gui            to   g-rec                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                          *-------------------------------------*
      *                          * Close file guida                    *
      *                          *-------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       exe-reg-orc-180.
      *                      *-----------------------------------------*
      *                      * Riciclo su scansione                    *
      *                      *-----------------------------------------*
           go to     exe-reg-orc-100.
       exe-reg-orc-200.
      *              *-------------------------------------------------*
      *              * Memorizzazione protocollo richiesta in corso    *
      *              * di trattamento                                  *
      *              *-------------------------------------------------*
           move      w-rec-gui-pro        to   w-gen-prt-roc          .
      *              *-------------------------------------------------*
      *              * Inizializzazione work-area generica             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Exit status                                 *
      *                  *---------------------------------------------*
           move      00                   to   w-gen-exi-sts          .
      *                  *---------------------------------------------*
      *                  * Numero protocollo ordine cliente generato   *
      *                  *---------------------------------------------*
           move      zero                 to   w-gen-prt-orc          .
      *                  *---------------------------------------------*
      *                  * Numero documento ordine cliente generato    *
      *                  *---------------------------------------------*
           move      zero                 to   w-gen-ndo-orc          .
      *                  *---------------------------------------------*
      *                  * Data attuale                                *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-gen-dat-att          .
      *              *-------------------------------------------------*
      *              * Controllo esistenza testata richiesta d'ordine  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open file sequenziale testata               *
      *                  *---------------------------------------------*
           move      "OI"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      spaces               to   g-pat                  .
           string    "/abd/asc/imp/"
                                delimited by   size
                     "roc_"     delimited by   size
                     w-gen-prt-roc
                                delimited by   size
                     "_tes.txt"
                                delimited by   size
                                          into g-pat                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se file non trovato                         *
      *                  *---------------------------------------------*
           if        g-sts                =    e-not-err
                     go to exe-reg-orc-210.
      *                      *-----------------------------------------*
      *                      * Set exit status                         *
      *                      *-----------------------------------------*
           move      01                   to   w-gen-exi-sts          .
      *                      *-----------------------------------------*
      *                      * Scrittura record log                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-gen-des-log          .
           string    "Errore [01]: Open file testata - ROC prot. "
                                delimited by   size
                     w-gen-prt-roc
                                delimited by   size
                                          into w-gen-des-log          .
           perform   wrt-rec-log-000      thru wrt-rec-log-999        .
      *                      *-----------------------------------------*
      *                      * A fine ciclo                            *
      *                      *-----------------------------------------*
           go to     exe-reg-orc-800.
       exe-reg-orc-210.
      *                  *---------------------------------------------*
      *                  * Lettura primo record testata richiesta      *
      *                  *---------------------------------------------*
           move      "GN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se errore                                   *
      *                  *---------------------------------------------*
           if        g-sts                =     e-not-err
                     go to exe-reg-orc-220.
      *                      *-----------------------------------------*
      *                      * Close file guida                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                      *-----------------------------------------*
      *                      * Set exit status                         *
      *                      *-----------------------------------------*
           move      02                   to   w-gen-exi-sts          .
      *                      *-----------------------------------------*
      *                      * Scrittura record log                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-gen-des-log          .
           string    "Errore [02]: Read record testata - ROC prot. "
                                delimited by   size
                     w-gen-prt-roc
                                delimited by   size
                                          into w-gen-des-log          .
           perform   wrt-rec-log-000      thru wrt-rec-log-999        .
      *                      *-----------------------------------------*
      *                      * A fine ciclo                            *
      *                      *-----------------------------------------*
           go to     exe-reg-orc-800.
       exe-reg-orc-220.
      *                  *---------------------------------------------*
      *                  * Scomposizione record file testata           *
      *                  *---------------------------------------------*
           move      g-rec                to   w-rec-tes              .
      *                  *---------------------------------------------*
      *                  * Close file testata                          *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
       exe-reg-orc-300.
      *              *-------------------------------------------------*
      *              * Controllo file righe richiesta d'ordine         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open file sequenziale righe                 *
      *                  *---------------------------------------------*
           move      "OI"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      spaces               to   g-pat                  .
           string    "/abd/asc/imp/"
                                delimited by   size
                     "roc_"     delimited by   size
                     w-gen-prt-roc
                                delimited by   size
                     "_rig.txt"
                                delimited by   size
                                          into g-pat                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se file non trovato                         *
      *                  *---------------------------------------------*
           if        g-sts                =    e-not-err
                     go to exe-reg-orc-310.
      *                      *-----------------------------------------*
      *                      * Set exit status                         *
      *                      *-----------------------------------------*
           move      11                   to   w-gen-exi-sts          .
      *                      *-----------------------------------------*
      *                      * Scrittura record log                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-gen-des-log          .
           string    "Errore [11]: Open file righe - ROC prot. "
                                delimited by   size
                     w-gen-prt-roc
                                delimited by   size
                                          into w-gen-des-log          .
           perform   wrt-rec-log-000      thru wrt-rec-log-999        .
      *                      *-----------------------------------------*
      *                      * A fine ciclo                            *
      *                      *-----------------------------------------*
           go to     exe-reg-orc-800.
       exe-reg-orc-310.
      *                  *---------------------------------------------*
      *                  * Lettura primo record righe                  *
      *                  *---------------------------------------------*
           move      "GN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se errore                                   *
      *                  *---------------------------------------------*
           if        g-sts                =     e-not-err
                     go to exe-reg-orc-320.
      *                      *-----------------------------------------*
      *                      * Close file guida                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                      *-----------------------------------------*
      *                      * Set exit status                         *
      *                      *-----------------------------------------*
           move      12                   to   w-gen-exi-sts          .
      *                      *-----------------------------------------*
      *                      * Scrittura record log                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-gen-des-log          .
           string    "Errore [12]: Read primo record righe - ROC prot. "
                                delimited by   size
                     w-gen-prt-roc
                                delimited by   size
                                          into w-gen-des-log          .
           perform   wrt-rec-log-000      thru wrt-rec-log-999        .
      *                      *-----------------------------------------*
      *                      * A fine ciclo                            *
      *                      *-----------------------------------------*
           go to     exe-reg-orc-800.
       exe-reg-orc-320.
      *                  *---------------------------------------------*
      *                  * Bubberizzazione record unico righe          *
      *                  *---------------------------------------------*
           move      g-rec                to   w-buf-rig-rec          .
      *                  *---------------------------------------------*
      *                  * Close file righe                            *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
       exe-reg-orc-330.
      *              *-------------------------------------------------*
      *              * Riscrittura file righe per lettura successiva   *
      *              *                                                 *
      *              * Operazione necessaria in quanto da FM (Mac) non *
      *              * si riesce a salvare con un carattere di fine    *
      *              * linea leggibile da Tangram per cui scompongo il *
      *              * record unico, lo bufferizzo e riscrivo il file  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open output file righe                      *
      *                  *---------------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           string    "/abd/asc/imp/"
                                delimited by   size
                     "roc_"     delimited by   size
                     w-gen-prt-roc
                                delimited by   size
                     "_rig.txt"
                                delimited by   size
                                          into g-pat                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione buffer                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-buf-rig-ctr          .
       exe-reg-orc-335.
           add       1                    to   w-buf-rig-ctr          .
           if        w-buf-rig-ctr        >    w-rec-tes-nrg
                     go to exe-reg-orc-340.
      *                  *---------------------------------------------*
      *                  * Composizione record                         *
      *                  *---------------------------------------------*
           move      w-buf-rig-cod
                    (w-buf-rig-ctr)       to   w-rec-rig-cpa          .
           move      w-buf-rig-qta
                    (w-buf-rig-ctr)       to   w-rec-rig-qta          .
      *                  *---------------------------------------------*
      *                  * Scrittura record                            *
      *                  *---------------------------------------------*
           move      "PN"                 to   g-ope                  .
           move      w-rec-rig            to   g-rec                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Riciclo su scansione buffer                 *
      *                  *---------------------------------------------*
           go to     exe-reg-orc-335.
       exe-reg-orc-340.
      *                  *---------------------------------------------*
      *                  * Close file righe                            *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       exe-reg-orc-350.
      *              *-------------------------------------------------*
      *              * Trattamento testata richiesta d'ordine          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Scrittura record [oct]                      *
      *                  *---------------------------------------------*
           perform   wrt-rec-oct-000      thru wrt-rec-oct-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione protocollo ordine cliente    *
      *                  *---------------------------------------------*
           move      rf-oct-num-prt       to   w-gen-prt-orc          .
      *                  *---------------------------------------------*
      *                  * Memorizzazione numero ordine cliente        *
      *                  *---------------------------------------------*
           move      rf-oct-num-doc       to   w-gen-ndo-orc          .
      *                  *---------------------------------------------*
      *                  * Scrittura record log                        *
      *                  *---------------------------------------------*
           move      spaces               to   w-gen-des-log          .
           string    "Scrittura testata ordine - prot. "
                                delimited by   size
                     w-gen-prt-orc
                                delimited by   size
                     " - num. "
                                delimited by   size
                     w-gen-ndo-orc
                                delimited by   size
                                          into w-gen-des-log          .
           perform   wrt-rec-log-000      thru wrt-rec-log-999        .
       exe-reg-orc-400.
      *              *-------------------------------------------------*
      *              * Trattamento righe richiesta d'ordine            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizializzazione progressivo riga           *
      *                  *---------------------------------------------*
           move      zero                 to   w-gen-num-prg          .
      *                  *---------------------------------------------*
      *                  * Inizializzazione totalizzatori righe        *
      *                  *---------------------------------------------*
           move      zero                 to   w-gen-tot-rig (01)     .
           move      zero                 to   w-gen-tot-rig (02)     .
           move      zero                 to   w-gen-tot-rig (03)     .
           move      zero                 to   w-gen-tot-rig (09)     .
      *                  *---------------------------------------------*
      *                  * Open file sequenziale righe                 *
      *                  *---------------------------------------------*
           move      "OI"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      spaces               to   g-pat                  .
           string    "/abd/asc/imp/"
                                delimited by   size
                     "roc_"     delimited by   size
                     w-gen-prt-roc
                                delimited by   size
                     "_rig.txt"
                                delimited by   size
                                          into g-pat                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se file non trovato                         *
      *                  *---------------------------------------------*
           if        g-sts                =    e-not-err
                     go to exe-reg-orc-420.
      *                      *-----------------------------------------*
      *                      * Set exit status                         *
      *                      *-----------------------------------------*
           move      21                   to   w-gen-exi-sts          .
      *                      *-----------------------------------------*
      *                      * Scrittura record log                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-gen-des-log          .
           string    "Errore [21]: Reopen file righe - ROC prot. "
                                delimited by   size
                     w-gen-prt-roc
                                delimited by   size
                     " - ORC num. "
                                delimited by   size
                     w-gen-ndo-orc
                                delimited by   size
                                          into w-gen-des-log          .
           perform   wrt-rec-log-000      thru wrt-rec-log-999        .
      *                      *-----------------------------------------*
      *                      * A fine ciclo                            *
      *                      *-----------------------------------------*
           go to     exe-reg-orc-800.
       exe-reg-orc-420.
      *                  *---------------------------------------------*
      *                  * Lettura record file sequenziale righe       *
      *                  *---------------------------------------------*
           move      "GN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se fine file                                *
      *                  *---------------------------------------------*
           if        g-sts                not  = e-end-fil
                     go to exe-reg-orc-440.
      *                      *-----------------------------------------*
      *                      * Close file righe                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                      *-----------------------------------------*
      *                      * A fine ciclo                            *
      *                      *-----------------------------------------*
            go to    exe-reg-orc-800.
       exe-reg-orc-440.
      *                  *---------------------------------------------*
      *                  * Se errore                                   *
      *                  *---------------------------------------------*
           if        g-sts                =    e-not-err
                     go to exe-reg-orc-460.
      *                      *-----------------------------------------*
      *                      * Set exit status                         *
      *                      *-----------------------------------------*
           move      22                   to   w-gen-exi-sts          .
      *                      *-----------------------------------------*
      *                      * Scrittura record log                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-gen-des-log          .
           string    "Errore [22]: Read record righe - ROC prot. "
                                delimited by   size
                     w-gen-prt-roc
                                delimited by   size
                     " - riga "
                                delimited by   size
                     w-gen-num-prg
                                delimited by   size
                     " - ORC num. "
                                delimited by   size
                     w-gen-ndo-orc
                                delimited by   size
                                          into w-gen-des-log          .
           perform   wrt-rec-log-000      thru wrt-rec-log-999        .
      *                      *-----------------------------------------*
      *                      * A fine ciclo                            *
      *                      *-----------------------------------------*
           go to     exe-reg-orc-800.
       exe-reg-orc-460.
      *                  *---------------------------------------------*
      *                  * Scomposizione record file riga              *
      *                  *---------------------------------------------*
           move      g-rec                to   w-rec-rig              .
      *                  *---------------------------------------------*
      *                  * Scrittura record [ocr]                      *
      *                  *---------------------------------------------*
           perform   wrt-rec-ocr-000      thru wrt-rec-ocr-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo su scansione file sequenziale righe *
      *                  * richiesta d'ordine                          *
      *                  *---------------------------------------------*
           go to     exe-reg-orc-420.
       exe-reg-orc-800.
      *              *-------------------------------------------------*
      *              * Se exit status in errore: oltre                 *
      *              *-------------------------------------------------*
           if        w-gen-exi-sts        not = 00
                     go to exe-reg-orc-850.
      *              *-------------------------------------------------*
      *              * Calcolo totali documento e riscrittura [oct]    *
      *              *-------------------------------------------------*
           perform   upd-rec-oct-000      thru upd-rec-oct-999        .
      *              *-------------------------------------------------*
      *              * Scrittura record log                            *
      *              *-------------------------------------------------*
           move      spaces               to   w-gen-des-log          .
           string    "Reg. ordine completa - prot. "
                                delimited by   size
                     w-gen-prt-orc
                                delimited by   size
                     " - num. "
                                delimited by   size
                     w-gen-ndo-orc
                                delimited by   size
                                
                     " - righe "
                                delimited by   size
                     w-gen-num-prg
                                delimited by   size
                                          into w-gen-des-log          .
           perform   wrt-rec-log-000      thru wrt-rec-log-999        .
       exe-reg-orc-850.
      *              *-------------------------------------------------*
      *              * Scrittura record in file guida OFF              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open output file guida OFF                  *
      *                  *---------------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      "/abd/asc/imp/roc_guidaOFF.txt"
                                          to   g-pat                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Composizione record                         *
      *                  *---------------------------------------------*
           move      w-gen-prt-roc        to   w-rec-gui-pro          .
           move      "."                  to   w-rec-gui-f01          .
           move      w-gen-ndo-orc        to   w-rec-gui-noc          .
           move      "."                  to   w-rec-gui-f02          .
           move      w-gen-exi-sts        to   w-rec-gui-exi          .
      *                  *---------------------------------------------*
      *                  * Scrittura record                            *
      *                  *---------------------------------------------*
           move      "PN"                 to   g-ope                  .
           move      w-rec-gui            to   g-rec                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Close file guida                            *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *              *-------------------------------------------------*
      *              * Cancellazione file sequenziali                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * File testata                                *
      *                  *---------------------------------------------*
           move      "PD"                 to   s-ope                  .
           move      spaces               to   s-pat                  .
           string    "/abd/asc/imp/"
                                delimited by   size
                     "roc_"     delimited by   size
                     w-gen-prt-roc
                                delimited by   size
                     "_tes.txt"
                                delimited by   size
                                          into s-pat                  .
           move      "S"                  to   s-sts                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * File righe                                  *
      *                  *---------------------------------------------*
           move      "PD"                 to   s-ope                  .
           move      spaces               to   s-pat                  .
           string    "/abd/asc/imp/"
                                delimited by   size
                     "roc_"     delimited by   size
                     w-gen-prt-roc
                                delimited by   size
                     "_rig.txt"
                                delimited by   size
                                          into s-pat                  .
           move      "S"                  to   s-sts                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Attivazione flag di registrazione eseguita      *
      *              *-------------------------------------------------*
           move      "#"                  to   w-gen-flg-exe          .
      *              *-------------------------------------------------*
      *              * Riciclo su scansione file guida                 *
      *              *-------------------------------------------------*
           go to     exe-reg-orc-100.
       exe-reg-orc-900.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [oct]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *                  *---------------------------------------------*
      *                  * [ocr]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *                  *---------------------------------------------*
      *                  * [orcndo]                                    *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-ndo             .
      *                  *---------------------------------------------*
      *                  * [orcprt]                                    *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-prt             .
      *                  *---------------------------------------------*
      *                  * [dcc]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * [zfp]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zfp                 .
      *                  *---------------------------------------------*
      *                  * [cli]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *                  *---------------------------------------------*
      *                  * [age]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *                  *---------------------------------------------*
      *                  * [dcp]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * [pdx]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *                  *---------------------------------------------*
      *                  * Close modulo di determinazione prezzo di    *
      *                  * vendita                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Chiusura modulo                         *
      *                      *-----------------------------------------*
           move      "CL"                 to   d-prz-ven-tip-ope      .
           move      "pgm/fat/prg/obj/dprzven0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-prz-ven              .
      *                      *-----------------------------------------*
      *                      * Test se cancellabile                    *
      *                      *-----------------------------------------*
           move      "C?"                 to   d-prz-ven-tip-ope      .
           move      "pgm/fat/prg/obj/dprzven0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-prz-ven              .
           if        d-prz-ven-exi-sts    not  = spaces
                     go to exe-reg-orc-930.
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           move      "pgm/fat/prg/obj/dprzven0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       exe-reg-orc-930.
      *                  *---------------------------------------------*
      *                  * Close modulo di determinazione sconti riga  *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-per-scr-tip-ope      .
           move      "pgm/fat/prg/obj/dperscr0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-per-scr              .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-per-scr-tip-ope      .
           move      "pgm/fat/prg/obj/dperscr0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-per-scr              .
           if        d-per-scr-exi-sts    not  = spaces
                     go to exe-reg-orc-940.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "pgm/fat/prg/obj/dperscr0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       exe-reg-orc-940.
      *                  *---------------------------------------------*
      *                  * Close modulo di determinazione importo in   *
      *                  * riga                                        *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-imp-ven-tip-ope      .
           move      "pgm/fat/prg/obj/dimpven0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-imp-ven              .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-imp-ven-tip-ope      .
           move      "pgm/fat/prg/obj/dimpven0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-imp-ven              .
           if        d-imp-ven-exi-sts    not  = spaces
                     go to exe-reg-orc-950.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "pgm/fat/prg/obj/dimpven0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       exe-reg-orc-950.
      *                  *---------------------------------------------*
      *                  * Close modulo di determinazione provvigioni  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Chiusura modulo                         *
      *                      *-----------------------------------------*
           move      "CL"                 to   d-pvg-age-tip-ope      .
           move      "pgm/age/prg/obj/dpvgage0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-pvg-age              .
      *                      *-----------------------------------------*
      *                      * Test se cancellabile                    *
      *                      *-----------------------------------------*
           move      "C?"                 to   d-pvg-age-tip-ope      .
           move      "pgm/age/prg/obj/dpvgage0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-pvg-age              .
           if        d-pvg-age-exi-sts    not  = spaces
                     go to exe-reg-orc-960.
      *                      *-----------------------------------------*
      *                      * Cancellazione modulo                    *
      *                      *-----------------------------------------*
           move      "pgm/age/prg/obj/dpvgage0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       exe-reg-orc-960.
      *                  *---------------------------------------------*
      *                  * Scrittura record log                        *
      *                  *---------------------------------------------*
           move      "Close daemon "      to   w-gen-des-log          .
           perform   wrt-rec-log-000      thru wrt-rec-log-999        .
       exe-reg-orc-999.
           exit.

      *    *===========================================================*
      *    * Scrittura testata ordine cliente                          *
      *    *-----------------------------------------------------------*
       wrt-rec-oct-000.
      *              *-------------------------------------------------*
      *              * Raccolta dati relativi al cliente contabile     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [cli]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [cli]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-rec-tes-cli        to   rf-cli-cod-cli         .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * Raccolta dati relativi alla dipendenza          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [dcc]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [dcc] principale             *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-rec-tes-cli        to   rf-dcc-cod-cli         .
           move      w-rec-tes-dpz        to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione in work di comodo           *
      *                  *---------------------------------------------*
           move      rf-dcc-cod-abi       to   w-dpz-cli-cod-abi      .
           move      rf-dcc-cod-cab       to   w-dpz-cli-cod-cab      .
           move      rf-dcc-ccc-app       to   w-dpz-cli-ccc-app      .
           move      rf-dcc-cod-age       to   w-dpz-cli-cod-age      .
           move      rf-dcc-cat-pvg       to   w-dpz-cli-cat-pvg      .
      *              *-------------------------------------------------*
      *              * Raccolta dati relativi all'agente               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record                      *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *                  *---------------------------------------------*
      *                  * Lettura record                              *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODAGE    "         to   f-key                  .
           move      w-dpz-cli-cod-age    to   rf-age-cod-age         .
           move      "pgm/age/fls/ioc/obj/iofage"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-age                 .
      *              *-------------------------------------------------*
      *              * Raccolta dati relativi al cliente commerciale   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [dcc]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [dcc] principale             *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-rec-tes-cli        to   rf-dcc-cod-cli         .
           move      spaces               to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
       wrt-rec-oct-100.
      *              *-------------------------------------------------*
      *              * Normalizzazione record [oct]                    *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *              *-------------------------------------------------*
      *              * Composizione record [oct]                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Dati identificativi                         *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   rf-oct-ide-dat         .
           move      w-rec-tes-ute        to   rf-oct-ide-ute         .
           move      s-fas                to   rf-oct-ide-fas         .
      *                  *---------------------------------------------*
      *                  * Numero protocollo                           *
      *                  *---------------------------------------------*
           move      w-gen-dat-att        to   w-att-orc-prt-dat      .
           move      01                   to   w-att-orc-prt-dpz      .
           perform   att-orc-prt-000      thru att-orc-prt-999        .
           move      w-att-orc-prt-num    to   rf-oct-num-prt         .
      *                  *---------------------------------------------*
      *                  * Tipo documento                              *
      *                  *---------------------------------------------*
           move      "OC   "              to   rf-oct-tmo-orc         .
      *                  *---------------------------------------------*
      *                  * Codice dipendenza                           *
      *                  *---------------------------------------------*
           move      01                   to   rf-oct-cod-dpz         .
      *                  *---------------------------------------------*
      *                  * Data documento                              *
      *                  *---------------------------------------------*
           move      w-gen-dat-att        to   rf-oct-dat-doc         .
      *                  *---------------------------------------------*
      *                  * Numero documento                            *
      *                  *---------------------------------------------*
           move      zero                 to   w-att-orc-ndo-num      .
           move      w-gen-dat-att        to   w-att-orc-ndo-dat      .
           move      01                   to   w-att-orc-ndo-dpz      .
           move      spaces               to   w-att-orc-ndo-sgl      .
           perform   att-orc-ndo-000      thru att-orc-ndo-999        .
           move      w-att-orc-ndo-num    to   rf-oct-num-doc         .
      *                  *---------------------------------------------*
      *                  * Secolo anno                                 *
      *                  *---------------------------------------------*
           move      w-gen-dat-att        to   s-dat                  .
           move      s-saa                to   rf-oct-scl-ann         .
      *                  *---------------------------------------------*
      *                  * Sigla numerazione                           *
      *                  *---------------------------------------------*
           move      spaces               to   rf-oct-sgl-num         .
      *                  *---------------------------------------------*
      *                  * Tipo archivio                               *
      *                  *---------------------------------------------*
           move      "C"                  to   rf-oct-tip-arc         .
      *                  *---------------------------------------------*
      *                  * Codice archivio                             *
      *                  *---------------------------------------------*
           move      w-rec-tes-cli        to   rf-oct-cod-arc         .
      *                  *---------------------------------------------*
      *                  * Dipendenza archivio                         *
      *                  *---------------------------------------------*
           move      w-rec-tes-dpz        to   rf-oct-dpz-arc         .
      *                  *---------------------------------------------*
      *                  * Tipo fornitura                              *
      *                  *---------------------------------------------*
           move      01                   to   rf-oct-tip-frn         .
      *                  *---------------------------------------------*
      *                  * Codice archivio per la fatturazione         *
      *                  *---------------------------------------------*
           move      w-rec-tes-cli        to   rf-oct-arc-plf         .
           move      w-rec-tes-dpz        to   rf-oct-dpz-plf         .
      *                  *---------------------------------------------*
      *                  * Tipo fatturazione : non gestito             *
      *                  *---------------------------------------------*
           move      zero                 to   rf-oct-tip-ftz         .
      *                  *---------------------------------------------*
      *                  * Tipo indirizzo di spedizione                *
      *                  *---------------------------------------------*
           if        w-rec-tes-dpz        =    spaces
                     move  03             to   rf-oct-tip-ids
           else      move  04             to   rf-oct-tip-ids         .
      *                  *---------------------------------------------*
      *                  * Data e numero ordine del cliente: da record *
      *                  *---------------------------------------------*
           move      w-rec-tes-doc        to   rf-oct-ocl-dat         .
           move      w-rec-tes-noc        to   rf-oct-ocl-num         .
      *                  *---------------------------------------------*
      *                  * Riferimenti del cliente                     *
      *                  *---------------------------------------------*
           move      spaces               to   rf-oct-ocl-rif         .
      *                  *---------------------------------------------*
      *                  * Codice responsabile                         *
      *                  *---------------------------------------------*
           move      zero                 to   rf-oct-cod-rsp         .
      *                  *---------------------------------------------*
      *                  * Data consegna : da record in input          *
      *                  *---------------------------------------------*
           move      w-rec-tes-dcr        to   rf-oct-dat-cns         .
      *                  *---------------------------------------------*
      *                  * Formato di stampa data consegna             *
      *                  *---------------------------------------------*
           move      01                   to   rf-oct-fds-dtc         .
      *                  *---------------------------------------------*
      *                  * Tipo di evasione richiesta                  *
      *                  *                                             *
      *                  * - 03 : Il parziale riga                     *
      *                  *---------------------------------------------*
           move      03                   to   rf-oct-tip-eva         .
      *                  *---------------------------------------------*
      *                  * Priorita' di evasione                       *
      *                  *---------------------------------------------*
           move      spaces               to   rf-oct-pri-eva         .
      *                  *---------------------------------------------*
      *                  * Codice condizioni di vendita                *
      *                  *---------------------------------------------*
           move      zero                 to   rf-oct-cod-cdv         .
      *                  *---------------------------------------------*
      *                  * Commento                                    *
      *                  *---------------------------------------------*
           move      w-rec-tes-not        to   rf-oct-com-int         .
      *                  *---------------------------------------------*
      *                  * Codice lingua                               *
      *                  *---------------------------------------------*
           move      "I  "                to   rf-oct-cod-lng         .
      *                  *---------------------------------------------*
      *                  * Valuta per la fatturazione : base           *
      *                  *---------------------------------------------*
           move      c-sgl                to   rf-oct-sgl-vpf         .
           move      c-dec                to   rf-oct-dec-vpf         .
           move      c-tdc                to   rf-oct-tdc-vpf         .
           move      c-cdc                to   rf-oct-cdc-vpf         .
      *                  *---------------------------------------------*
      *                  * Codice Iva : da [cli]                       *
      *                  *---------------------------------------------*
           move      rf-cli-cod-iva       to   rf-oct-ass-iva         .
      *                  *---------------------------------------------*
      *                  * Contropartita vendite : nessuna             *
      *                  *---------------------------------------------*
           move      zero                 to   rf-oct-ctp-ven         .
      *                  *---------------------------------------------*
      *                  * Fattura separata : No                       *
      *                  *---------------------------------------------*
           move      "N"                  to   rf-oct-fat-sep         .
      *                  *---------------------------------------------*
      *                  * Dati per l'inoltro : da [dcc]               *
      *                  *---------------------------------------------*
           move      rf-dcc-inl-dcm       to   rf-oct-inl-dcm         .
           move      rf-dcc-inl-pgt       to   rf-oct-inl-pgt         .
      *                  *---------------------------------------------*
      *                  * Listino : base                              *
      *                  *---------------------------------------------*
           move      spaces               to   rf-oct-cod-lst         .
      *                  *---------------------------------------------*
      *                  * Sconti cliente : da [dcc]                   *
      *                  *---------------------------------------------*
           move      rf-dcc-cat-scr       to   rf-oct-csr-aac         .
           move      rf-dcc-per-scr (1)   to   rf-oct-psr-aac (1)     .
           move      rf-dcc-per-scr (2)   to   rf-oct-psr-aac (2)     .
           move      rf-dcc-per-scr (3)   to   rf-oct-psr-aac (3)     .
           move      rf-dcc-per-scr (4)   to   rf-oct-psr-aac (4)     .
           move      rf-dcc-per-scr (5)   to   rf-oct-psr-aac (5)     .
      *                  *---------------------------------------------*
      *                  * Sconti cliente in chiusura : da [dcc]       *
      *                  *---------------------------------------------*
           move      rf-dcc-cat-scc       to   rf-oct-csc-aac         .
           move      rf-dcc-per-scc       to   rf-oct-psc-aac         .
      *                  *---------------------------------------------*
      *                  * Categoria provvigioni : da dipendenza       *
      *                  *---------------------------------------------*
           move      w-dpz-cli-cat-pvg    to   rf-oct-cpv-aac         .
      *                  *---------------------------------------------*
      *                  * Provvigioni cliente : da [dcc]              *
      *                  *---------------------------------------------*
           move      rf-dcc-per-pvg (1)   to   rf-oct-ppv-aac (1)     .
           move      rf-dcc-per-pvg (2)   to   rf-oct-ppv-aac (2)     .
           move      rf-dcc-per-pvg (3)   to   rf-oct-ppv-aac (3)     .
      *                  *---------------------------------------------*
      *                  * Voci descrittive cliente : da [dcc]         *
      *                  *---------------------------------------------*
           move      rf-dcc-vde-cod (1)   to   rf-oct-voc-des (1)     .
           move      rf-dcc-vde-cod (2)   to   rf-oct-voc-des (2)     .
           move      rf-dcc-vde-cod (3)   to   rf-oct-voc-des (3)     .
           move      rf-dcc-vde-cod (4)   to   rf-oct-voc-des (4)     .
           move      rf-dcc-vde-cod (5)   to   rf-oct-voc-des (5)     .
           move      rf-dcc-vde-cod (6)   to   rf-oct-voc-des (6)     .
      *                  *---------------------------------------------*
      *                  * Forma di pagamento : da [dcc]               *
      *                  *---------------------------------------------*
           move      rf-dcc-cod-fop       to   rf-oct-cod-fop         .
      *                  *---------------------------------------------*
      *                  * Lettura forma di pagamento                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [zfp]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zfp                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [zfp]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFOP"             to   f-key                  .
           move      rf-dcc-cod-fop       to   rf-zfp-cod-fop         .
           move      "pgm/dcc/fls/ioc/obj/iofzfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zfp                 .
      *                  *---------------------------------------------*
      *                  * Sconto associato alla forma di pagamento    *
      *                  *---------------------------------------------*
           move      rf-zfp-sco-fat       to   rf-oct-scp-aap         .
      *                  *---------------------------------------------*
      *                  * Dati per il pagamento : da dipendenza       *
      *                  *---------------------------------------------*
           move      w-dpz-cli-cod-abi    to   rf-oct-cod-abi         .
           move      w-dpz-cli-cod-cab    to   rf-oct-cod-cab         .
           move      w-dpz-cli-ccc-app    to   rf-oct-ccc-app         .
      *                  *---------------------------------------------*
      *                  * Altri dati per il pagamento : da [dcc]      *
      *                  *---------------------------------------------*
           move      rf-dcc-nos-ban       to   rf-oct-nos-ban         .
           move      rf-dcc-nos-ccp       to   rf-oct-nos-ccp         .
           move      rf-dcc-add-spi       to   rf-oct-add-spi         .
           move      rf-dcc-add-spb       to   rf-oct-add-spb         .
      *                  *---------------------------------------------*
      *                  * Campi non gestiti                           *
      *                  *---------------------------------------------*
           move      zero                 to   rf-oct-ipr-iel         .
           move      zero                 to   rf-oct-pag-dsm         .
           move      zero                 to   rf-oct-pag-qaf         .
           move      zero                 to   rf-oct-pag-act         .
      *                  *---------------------------------------------*
      *                  * Codice agente : da dipendenza               *
      *                  *---------------------------------------------*
           move      w-dpz-cli-cod-age    to   rf-oct-cod-age         .
      *                  *---------------------------------------------*
      *                  * Significativita' provvigioni                *
      *                  *---------------------------------------------*
           move      01                   to   rf-oct-fsp-doc         .
      *                  *---------------------------------------------*
      *                  * Provvigioni a forfait in testata            *
      *                  *---------------------------------------------*
           move      zero                 to   rf-oct-pvf-age         .
      *                  *---------------------------------------------*
      *                  * Tipo di vendita : Diretta                   *
      *                  *---------------------------------------------*
           move      01                   to   rf-oct-tip-vpa         .
      *                  *---------------------------------------------*
      *                  * Provvigioni agente : da [age]               *
      *                  *---------------------------------------------*
           move      rf-age-cat-pvg       to   rf-oct-cpv-aaa         .
           move      rf-age-per-pvg (1)   to   rf-oct-ppv-aaa (1)     .
           move      rf-age-per-pvg (2)   to   rf-oct-ppv-aaa (2)     .
           move      rf-age-per-pvg (3)   to   rf-oct-ppv-aaa (3)     .
      *                  *---------------------------------------------*
      *                  * Campi non gestiti                           *
      *                  *---------------------------------------------*
           move      zero                 to   rf-oct-cod-ime         .
           move      zero                 to   rf-oct-pvf-ime         .
       wrt-rec-oct-200.
      *                  *---------------------------------------------*
      *                  * Totali ordine : vengono aggiornati alla fi- *
      *                  * ne delle righe                              *
      *                  *---------------------------------------------*
           move      zero                 to   rf-oct-tot-rig (1)     .
           move      zero                 to   rf-oct-tot-rig (2)     .
           move      zero                 to   rf-oct-tot-rig (3)     .
           move      zero                 to   rf-oct-tot-rig (4)     .
           move      zero                 to   rf-oct-tot-rig (5)     .
           move      zero                 to   rf-oct-tot-rig (6)     .
           move      zero                 to   rf-oct-tot-rig (7)     .
           move      zero                 to   rf-oct-tot-rig (8)     .
           move      zero                 to   rf-oct-tot-rig (9)     .
           move      zero                 to   rf-oct-tot-scc         .
           move      zero                 to   rf-oct-per-scc         .
           move      zero                 to   rf-oct-tot-scp         .
      *                  *---------------------------------------------*
      *                  * Percentuale sconto pagamento                *
      *                  *---------------------------------------------*
           move      rf-zfp-sco-fat       to   rf-oct-per-scp         .
      *                  *---------------------------------------------*
      *                  * Spese ordine : normalizzazione              *
      *                  *---------------------------------------------*
           move      zero                 to   w-wrt-rec-oct-ctr      .
       wrt-rec-oct-220.
           add       1                    to   w-wrt-rec-oct-ctr      .
           if        w-wrt-rec-oct-ctr    >    6
                     go to wrt-rec-oct-240.
           move      zero                 to   rf-oct-spe-snx
                                              (w-wrt-rec-oct-ctr)     .
           move      zero                 to   rf-oct-spe-mad
                                              (w-wrt-rec-oct-ctr)     .
           move      zero                 to   rf-oct-spe-per
                                              (w-wrt-rec-oct-ctr)     .
           move      zero                 to   rf-oct-spe-ibl
                                              (w-wrt-rec-oct-ctr)     .
           move      spaces               to   rf-oct-ibt-spe
                                              (w-wrt-rec-oct-ctr)     .
           move      zero                 to   rf-oct-spe-imp
                                              (w-wrt-rec-oct-ctr)     .
           go to     wrt-rec-oct-220.
       wrt-rec-oct-240.
      *                  *---------------------------------------------*
      *                  * Totale documento                            *
      *                  *---------------------------------------------*
           move      zero                 to   rf-oct-tot-doc         .
      *                  *---------------------------------------------*
      *                  * Flags                                       *
      *                  *---------------------------------------------*
           move      zero                 to   rf-oct-ctr-stp         .
           move      spaces               to   rf-oct-flg-och         .
           move      spaces               to   rf-oct-flg-ela         .
           move      spaces               to   rf-oct-flg-pul         .
           move      spaces               to   rf-oct-tip-ord         .
           move      spaces               to   rf-oct-alx-exp         .
      *              *-------------------------------------------------*
      *              * Scrittura record [oct]                          *
      *              *-------------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
       wrt-rec-oct-999.
           exit.

      *    *===========================================================*
      *    * Scrittura riga ordine cliente                             *
      *    *-----------------------------------------------------------*
       wrt-rec-ocr-000.
      *              *-------------------------------------------------*
      *              * Letture preliminari                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Archivio [dcp]                              *
      *                  *                                             *
      *                  * NB: la lettura corretta dell'archivio dcp]  *
      *                  *     è imprescindibile, per cui qualora des- *
      *                  *     se esito negativo, si deve ignorare la  *
      *                  *     riga                                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Start su [dcp]                          *
      *                      *-----------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "ALFPRO    "         to   f-key                  .
           move      w-rec-rig-cpa        to   rf-dcp-alf-pro         .
           move      zero                 to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Se Start errata                         *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to wrt-rec-ocr-040.
       wrt-rec-ocr-020.
      *                      *-----------------------------------------*
      *                      * Read-next su archivio [dcp]             *
      *                      *-----------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Test se fine file                       *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to wrt-rec-ocr-040.
      *                      *-----------------------------------------*
      *                      * Test sul massimo                        *
      *                      *-----------------------------------------*
           if        rf-dcp-alf-pro       not  = w-rec-rig-cpa
                     go to wrt-rec-ocr-040.
      *                      *-----------------------------------------*
      *                      * Lettura record [dcp] eseguita: oltre    *
      *                      *-----------------------------------------*
           go to     wrt-rec-ocr-200.
       wrt-rec-ocr-040.
      *                      *-----------------------------------------*
      *                      * Se lettura record [dcp] con esito ne-   *
      *                      * gativo si salta la riga                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Set exit status                     *
      *                          *-------------------------------------*
           move      30                   to   w-gen-exi-sts          .
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     wrt-rec-ocr-999.
       wrt-rec-ocr-200.
      *              *-------------------------------------------------*
      *              * Normalizzazione record [ocr]                    *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
      *              *-------------------------------------------------*
      *              * Composizione record [ocr]                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Dati provenienti dalla testata              *
      *                  *---------------------------------------------*
           move      rf-oct-num-prt       to   rf-ocr-num-prt         .
           add       100                  to   w-gen-num-prg          .
           move      w-gen-num-prg        to   rf-ocr-num-prg         .
           move      rf-oct-tmo-orc       to   rf-ocr-tmo-orc         .
           move      rf-oct-cod-dpz       to   rf-ocr-cod-dpz         .
           move      rf-oct-dat-doc       to   rf-ocr-dat-doc         .
           move      rf-oct-num-doc       to   rf-ocr-num-doc         .
           move      rf-oct-tip-arc       to   rf-ocr-tip-arc         .
           move      rf-oct-cod-arc       to   rf-ocr-cod-arc         .
           move      rf-oct-dpz-arc       to   rf-ocr-dpz-arc         .
           move      rf-oct-cod-lng       to   rf-ocr-cod-lng         .
           move      rf-oct-ocl-dat       to   rf-ocr-ocl-dat         .
           move      rf-oct-ocl-num       to   rf-ocr-ocl-num         .
           move      rf-oct-pri-eva       to   rf-ocr-pri-eva         .
           move      rf-oct-sgl-vpf       to   rf-ocr-sgl-vpf         .
           move      rf-oct-dec-vpf       to   rf-ocr-dec-vpf         .
           move      rf-oct-tdc-vpf       to   rf-ocr-tdc-vpf         .
           move      rf-oct-cdc-vpf       to   rf-ocr-cdc-vpf         .
      *                  *---------------------------------------------*
      *                  * Blocchi                                     *
      *                  *---------------------------------------------*
           move      zero                 to   rf-ocr-bld-flb         .
           move      zero                 to   rf-ocr-bld-tpb         .
           move      zero                 to   rf-ocr-bld-rgb         .
      *                  *---------------------------------------------*
      *                  * Tipo riga: sempre 'P'                       *
      *                  *---------------------------------------------*
           move      "P"                  to   rf-ocr-tip-rig         .
      *                  *---------------------------------------------*
      *                  * Tipo magazzino: sempre 01, prodotti di ven- *
      *                  * dita                                        *
      *                  *---------------------------------------------*
           move      01                   to   rf-ocr-tip-mag         .
      *                  *---------------------------------------------*
      *                  * Codice prodotto numerico: da [dcp]          *
      *                  *---------------------------------------------*
           move      rf-dcp-num-pro       to   rf-ocr-num-pro         .
      *                  *---------------------------------------------*
      *                  * Codice prodotto alfanumerico                *
      *                  *---------------------------------------------*
           move      w-rec-rig-cpa        to   rf-ocr-alf-pro         .
      *                  *---------------------------------------------*
      *                  * Sigla variante                              *
      *                  *---------------------------------------------*
           move      spaces               to   rf-ocr-sgl-vrn         .
      *                  *---------------------------------------------*
      *                  * Codice prodotto secondo il cliente          *
      *                  *---------------------------------------------*
           move      rf-ocr-num-pro       to   w-let-dcp-pdx-cod      .
           move      rf-ocr-tip-arc       to   w-let-dcp-pdx-tar      .
           move      rf-ocr-cod-arc       to   w-let-dcp-pdx-arc      .
           move      rf-ocr-cod-lng       to   w-let-dcp-pdx-lng      .
           perform   let-dcp-pdx-000      thru let-dcp-pdx-999        .
           move      w-let-dcp-pdx-cpc    to   rf-ocr-cop-scl         .
      *                  *---------------------------------------------*
      *                  * Descrizione estesa: no                      *
      *                  *---------------------------------------------*
           move      zero                 to   rf-ocr-des-ext         .
      *                  *---------------------------------------------*
      *                  * Descrizione riga: da [dcp]                  *
      *                  *---------------------------------------------*
           move      rf-dcp-des-pro       to   rf-ocr-des-rig         .
      *                  *---------------------------------------------*
      *                  * Tipo prodotto: da [dcp]                     *
      *                  *---------------------------------------------*
           move      rf-dcp-tip-pro       to   rf-ocr-tip-pro         .
      *                  *---------------------------------------------*
      *                  * Codice iva: da [oct] se cliente non sogget- *
      *                  * to ad iva, altrimenti da [dcp]              *
      *                  *---------------------------------------------*
           if        rf-oct-ass-iva       not  = zero and
                     rf-dcp-cod-iva       <    00100 
                     move  rf-oct-ass-iva to   rf-ocr-cod-iva
           else      move  rf-dcp-cod-iva to   rf-ocr-cod-iva         .
      *                  *---------------------------------------------*
      *                  * Contropartita vendite: da [oct] se contro-  *
      *                  * partita in testata, altrimenti da [dcp]     *
      *                  *---------------------------------------------*
           if        rf-oct-ctp-ven       not  = zero
                     move rf-oct-ctp-ven  to   rf-ocr-ctp-ven
           else      move rf-dcp-ctp-ven  to   rf-ocr-ctp-ven         .
      *                  *---------------------------------------------*
      *                  * Unità di misura: da [dcp]                   *
      *                  *---------------------------------------------*
           move      rf-dcp-umi-ven       to   rf-ocr-umi-ven         .
      *                  *---------------------------------------------*
      *                  * Decimali quantità: da [dcp]                 *
      *                  *---------------------------------------------*
           move      rf-dcp-dec-qta       to   rf-ocr-dec-qta         .
      *                  *---------------------------------------------*
      *                  * Quantita' ordinata                          *
      *                  *---------------------------------------------*
           move      w-rec-rig-qta        to   rf-ocr-qta-ord         .
      *                  *---------------------------------------------*
      *                  * Campi non gestiti da Elettra                *
      *                  *---------------------------------------------*
           move      spaces               to   rf-ocr-sdr-ccs         .
           move      spaces               to   rf-ocr-cod-dsl         .
           move      zero                 to   rf-ocr-snx-2qt         .
           move      zero                 to   rf-ocr-dec-2qt         .
           move      zero                 to   rf-ocr-qta-a02         .
           move      zero                 to   rf-ocr-snx-3qt         .
           move      zero                 to   rf-ocr-dec-3qt         .
           move      zero                 to   rf-ocr-qta-a03         .
      *                  *---------------------------------------------*
      *                  * Decimali prezzo:  da [dcp]                  *
      *                  *---------------------------------------------*
           move      rf-dcp-dec-prz       to   rf-ocr-dec-prz         .
      *                  *---------------------------------------------*
      *                  * Prezzo di vendita                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione link-area                  *
      *                      *-----------------------------------------*
           move      "PV"                 to   d-prz-ven-tip-ope      .
           move      rf-oct-cod-arc       to   d-prz-ven-cod-cli      .
           move      rf-oct-sgl-vpf       to   d-prz-ven-sgl-vpp      .
           move      rf-oct-dec-vpf       to   d-prz-ven-dec-vpp      .
           move      rf-ocr-num-pro       to   d-prz-ven-num-pro      .
           move      rf-oct-cod-lst       to   d-prz-ven-cod-lst      .
           move      rf-dcp-prz-lst       to   d-prz-ven-prz-lsb      .
           move      rf-dcp-sgl-vlt       to   d-prz-ven-sgl-vlb      .
           move      rf-dcp-dec-vlt       to   d-prz-ven-dec-vlb      .
           move      spaces               to   d-prz-ven-tfu-prz      .
           move      rf-oct-ocl-dat       to   d-prz-ven-dat-rfp      .
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           move      "pgm/fat/prg/obj/dprzven0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-prz-ven              .
      *                      *-----------------------------------------*
      *                      * Memorizzazione                          *
      *                      *-----------------------------------------*
           move      d-prz-ven-prz-ven    to   rf-ocr-prz-ven         .
      *                  *---------------------------------------------*
      *                  * Valuta per il prezzo standard : base        *
      *                  *---------------------------------------------*
           move      rf-ocr-sgl-vpf       to   rf-ocr-sgl-vps         .
           move      rf-ocr-dec-vpf       to   rf-ocr-dec-vps         .
           move      rf-ocr-tdc-vpf       to   rf-ocr-tdc-vps         .
           move      rf-ocr-cdc-vpf       to   rf-ocr-cdc-vps         .
      *                  *---------------------------------------------*
      *                  * Prezzo lordo standard                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Determinazione                          *
      *                      *-----------------------------------------*
           move      d-prz-ven-prz-bas    to   rf-ocr-prz-lrs         .
      *                  *---------------------------------------------*
      *                  * Sconti in riga                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione link-area                  *
      *                      *-----------------------------------------*
           move      "SR"                 to   d-per-scr-tip-ope      .
           move      rf-dcp-per-scr (1)   to   d-per-scr-psr-pro (1)  .
           move      rf-dcp-per-scr (2)   to   d-per-scr-psr-pro (2)  .
           move      rf-dcp-per-scr (3)   to   d-per-scr-psr-pro (3)  .
           move      rf-dcp-per-scr (4)   to   d-per-scr-psr-pro (4)  .
           move      rf-dcp-per-scr (5)   to   d-per-scr-psr-pro (5)  .
           move      rf-dcp-cat-scr       to   d-per-scr-csr-pro      .
           move      rf-oct-psr-aac (1)   to   d-per-scr-psr-cli (1)  .
           move      rf-oct-psr-aac (2)   to   d-per-scr-psr-cli (2)  .
           move      rf-oct-psr-aac (3)   to   d-per-scr-psr-cli (3)  .
           move      rf-oct-psr-aac (4)   to   d-per-scr-psr-cli (4)  .
           move      rf-oct-psr-aac (5)   to   d-per-scr-psr-cli (5)  .
           move      rf-oct-csr-aac       to   d-per-scr-csr-cli      .
           move      rf-oct-cod-arc       to   d-per-scr-cod-cli      .
           move      rf-oct-cod-lst       to   d-per-scr-cod-lst      .
           move      rf-oct-sgl-vpf       to   d-per-scr-sgl-vpf      .
           move      rf-dcp-num-pro       to   d-per-scr-num-pro      .
           move      rf-oct-ocl-dat       to   d-per-scr-dat-rif      .
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           move      "pgm/fat/prg/obj/dperscr0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-per-scr              .
      *                      *-----------------------------------------*
      *                      * Memorizzazione                          *
      *                      *-----------------------------------------*
           move      d-per-scr-per-scr (1)
                                          to   rf-ocr-per-scr (1)     .
           move      d-per-scr-per-scr (2)
                                          to   rf-ocr-per-scr (2)     .
           move      d-per-scr-per-scr (3)
                                          to   rf-ocr-per-scr (3)     .
           move      d-per-scr-per-scr (4)
                                          to   rf-ocr-per-scr (4)     .
           move      d-per-scr-per-scr (5)
                                          to   rf-ocr-per-scr (5)     .
      *                  *---------------------------------------------*
      *                  * Prezzo netto standard                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Determinazione                          *
      *                      *-----------------------------------------*
           move      rf-ocr-prz-lrs       to   w-cal-prz-net-prz      .
           move      rf-ocr-per-scr (1)   to   w-cal-prz-net-psc (1)  .
           move      rf-ocr-per-scr (2)   to   w-cal-prz-net-psc (2)  .
           move      rf-ocr-per-scr (3)   to   w-cal-prz-net-psc (3)  .
           move      rf-ocr-per-scr (4)   to   w-cal-prz-net-psc (4)  .
           move      rf-ocr-per-scr (5)   to   w-cal-prz-net-psc (5)  .
           perform   cal-prz-net-000      thru cal-prz-net-999        .
           move      w-cal-prz-net-prz    to   rf-ocr-prz-nts         .
      *                  *---------------------------------------------*
      *                  * Prezzo netto                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Determinazione                          *
      *                      *-----------------------------------------*
           move      rf-ocr-prz-ven       to   w-cal-prz-net-prz      .
           move      rf-ocr-per-scr (1)   to   w-cal-prz-net-psc (1)  .
           move      rf-ocr-per-scr (2)   to   w-cal-prz-net-psc (2)  .
           move      rf-ocr-per-scr (3)   to   w-cal-prz-net-psc (3)  .
           move      rf-ocr-per-scr (4)   to   w-cal-prz-net-psc (4)  .
           move      rf-ocr-per-scr (5)   to   w-cal-prz-net-psc (5)  .
           perform   cal-prz-net-000      thru cal-prz-net-999        .
           move      w-cal-prz-net-prz    to   rf-ocr-prz-net         .
      *                  *---------------------------------------------*
      *                  * Dati per valuta: da [oct]                   *
      *                  *---------------------------------------------*
           move      rf-oct-sgl-vpf       to   rf-ocr-sgl-vpp         .
           move      rf-oct-dec-vpf       to   rf-ocr-dec-vpp         .
           move      rf-oct-tdc-vpf       to   rf-ocr-tdc-vpp         .
           move      rf-oct-cdc-vpf       to   rf-ocr-cdc-vpp         .
      *                  *---------------------------------------------*
      *                  * Flags e campi non gestiti                   *
      *                  *---------------------------------------------*
           move      zero                 to   rf-ocr-snx-2pz         .
           move      zero                 to   rf-ocr-dec-2pz         .
           move      zero                 to   rf-ocr-prz-a02         .
      *                  *---------------------------------------------*
      *                  * Valuta per il legame : non gestita          *
      *                  *---------------------------------------------*
           move      spaces               to   rf-ocr-sgl-vpl         .
           move      zero                 to   rf-ocr-dec-vpl         .
           move      spaces               to   rf-ocr-tdc-vpl         .
           move      zero                 to   rf-ocr-prz-vpl         .
           move      zero                 to   rf-ocr-cdc-vpl         .
           move      zero                 to   rf-ocr-ccr-vpl         .
           move      zero                 to   rf-ocr-plm-vpl         .
           move      spaces               to   rf-ocr-tlm-vpl         .
           move      spaces               to   rf-ocr-map-vpl         .
      *                  *---------------------------------------------*
      *                  * Esposizione in riga : da [dcp]              *
      *                  *---------------------------------------------*
           move      rf-dcp-epz-rgf       to   rf-ocr-epz-rgf         .
      *                  *---------------------------------------------*
      *                  * Categoria sconto prodotto : da [dcp]        *
      *                  *---------------------------------------------*
           move      rf-dcp-cat-scr       to   rf-ocr-csr-aap         .
      *                  *---------------------------------------------*
      *                  * % sconto prodotto : da [dcp]                *
      *                  *---------------------------------------------*
           move      rf-dcp-per-scr (1)   to   rf-ocr-psr-aap (1)     .
           move      rf-dcp-per-scr (2)   to   rf-ocr-psr-aap (2)     .
           move      rf-dcp-per-scr (3)   to   rf-ocr-psr-aap (3)     .
           move      rf-dcp-per-scr (4)   to   rf-ocr-psr-aap (4)     .
           move      rf-dcp-per-scr (5)   to   rf-ocr-psr-aap (5)     .
       cmp-rec-ocr-400.
      *                  *---------------------------------------------*
      *                  * Tipo esposizione prezzi                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Da cliente e personalizzazioni          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Deviazione a seconda del valore     *
      *                          * contenuto nel record [dcc]          *
      *                          *-------------------------------------*
           if        rf-dcc-epz-pes       =    01
                     go to cmp-rec-ocr-422
           else if   rf-dcc-epz-pes       =    11
                     go to cmp-rec-ocr-424
           else if   rf-dcc-epz-pes       =    21
                     go to cmp-rec-ocr-426
           else      go to cmp-rec-ocr-422.
       cmp-rec-ocr-422.
      *                          *-------------------------------------*
      *                          * Se tipo esposizione : Standard      *
      *                          *-------------------------------------*
           if        w-prs-epz-pes        =    11
                     move  11             to   rf-ocr-epz-pes
           else if   w-prs-epz-pes        =    21
                     move  21             to   rf-ocr-epz-pes         .
           go to     cmp-rec-ocr-430.
       cmp-rec-ocr-424.
      *                          *-------------------------------------*
      *                          * Se tipo esposizione: Prezzo e scon- *
      *                          * ti                                  *
      *                          *-------------------------------------*
           move      11                   to   rf-ocr-epz-pes         .
           go to     cmp-rec-ocr-430.
       cmp-rec-ocr-426.
      *                          *-------------------------------------*
      *                          * Se tipo esposizione: Prezzo netto   *
      *                          *-------------------------------------*
           move      21                   to   rf-ocr-epz-pes         .
           go to     cmp-rec-ocr-430.
       cmp-rec-ocr-430.
      *                  *---------------------------------------------*
      *                  * Valuta per il costo : base                  *
      *                  *---------------------------------------------*
           move      c-sgl                to   rf-ocr-sgl-vpc         .
           move      c-dec                to   rf-ocr-dec-vpc         .
           move      c-tdc                to   rf-ocr-tdc-vpc         .
           move      c-cdc                to   rf-ocr-cdc-vpc         .
      *                  *---------------------------------------------*
      *                  * Dati per il costo :  non gestiti            *
      *                  *---------------------------------------------*
           move      zero                 to   rf-ocr-dec-cos         .
           move      zero                 to   rf-ocr-cos-rif         .
      *                  *---------------------------------------------*
      *                  * Importo in riga                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione parametri per la determi-  *
      *                      * nazione                                 *
      *                      *-----------------------------------------*
           move      "IR"                 to   d-imp-ven-tip-ope      .
           move      rf-ocr-qta-ord       to   d-imp-ven-qta-ven      .
           move      rf-ocr-snx-2qt       to   d-imp-ven-snx-2qt      .
           move      rf-ocr-qta-a02       to   d-imp-ven-qta-a02      .
           move      rf-ocr-snx-3qt       to   d-imp-ven-snx-3qt      .
           move      rf-ocr-qta-a03       to   d-imp-ven-qta-a03      .
           move      rf-ocr-prz-net       to   d-imp-ven-prz-uni      .
           move      rf-ocr-prz-ven       to   d-imp-ven-prz-unl      .
           move      rf-ocr-per-scr (1)   to   d-imp-ven-per-scr (1)  .
           move      rf-ocr-per-scr (2)   to   d-imp-ven-per-scr (2)  .
           move      rf-ocr-per-scr (3)   to   d-imp-ven-per-scr (3)  .
           move      rf-ocr-per-scr (4)   to   d-imp-ven-per-scr (4)  .
           move      rf-ocr-per-scr (5)   to   d-imp-ven-per-scr (5)  .
           move      rf-ocr-dec-prz       to   d-imp-ven-dec-prz      .
      *                      *-----------------------------------------*
      *                      * Determinazione                          *
      *                      *-----------------------------------------*
           move      "pgm/fat/prg/obj/dimpven0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-imp-ven              .
      *                      *-----------------------------------------*
      *                      * In campo di uscita                      *
      *                      *-----------------------------------------*
           move      d-imp-ven-imp-rig    to   rf-ocr-imp-rig         .
      *                  *---------------------------------------------*
      *                  * Importo in riga ausiliario : non gestito    *
      *                  *---------------------------------------------*
           move      zero                 to   rf-ocr-iau-rig         .
      *                  *---------------------------------------------*
      *                  * Provvigioni prodotto : da [dcp]             *
      *                  *---------------------------------------------*
           move      rf-dcp-cat-pvg       to   rf-ocr-cpv-aap         .
           move      rf-dcp-per-pvg (1)   to   rf-ocr-ppv-aap (1)     .
           move      rf-dcp-per-pvg (2)   to   rf-ocr-ppv-aap (2)     .
           move      rf-dcp-per-pvg (3)   to   rf-ocr-ppv-aap (3)     .
      *                  *---------------------------------------------*
      *                  * Significativita' provvigioni in riga        *
      *                  *---------------------------------------------*
           move      01                   to   rf-ocr-fsp-rig         .
      *                  *---------------------------------------------*
      *                  * Categoria provvigioni in riga: non gestita  *
      *                  *---------------------------------------------*
           move      zero                 to   rf-ocr-cpv-rig         .
      *                  *---------------------------------------------*
      *                  * Determinazione provvigioni                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione link-area                  *
      *                      *-----------------------------------------*
           move      "PP"                 to   d-pvg-age-tip-ope      .
           move      rf-oct-cod-age       to   d-pvg-age-cod-age      .
           move      rf-oct-tip-vpa       to   d-pvg-age-tip-vpa      .
           move      rf-oct-cpv-aaa       to   d-pvg-age-cpv-aaa      .
           move      rf-oct-ppv-aaa (1)   to   d-pvg-age-ppv-aaa (1)  .
           move      rf-oct-ppv-aaa (2)   to   d-pvg-age-ppv-aaa (2)  .
           move      rf-oct-ppv-aaa (3)   to   d-pvg-age-ppv-aaa (3)  .
           move      rf-ocr-tip-mag       to   d-pvg-age-tip-mag      .
           move      rf-ocr-num-pro       to   d-pvg-age-num-mag      .
           move      rf-ocr-cpv-aap       to   d-pvg-age-cpv-aap      .
           move      rf-ocr-ppv-aap (1)   to   d-pvg-age-ppv-aap (1)  .
           move      rf-ocr-ppv-aap (2)   to   d-pvg-age-ppv-aap (2)  .
           move      rf-ocr-ppv-aap (3)   to   d-pvg-age-ppv-aap (3)  .
           move      rf-oct-arc-plf       to   d-pvg-age-cod-cli      .
           move      rf-oct-cpv-aac       to   d-pvg-age-cpv-aac      .
           move      rf-oct-ppv-aac (1)   to   d-pvg-age-ppv-aac (1)  .
           move      rf-oct-ppv-aac (2)   to   d-pvg-age-ppv-aac (2)  .
           move      rf-oct-ppv-aac (3)   to   d-pvg-age-ppv-aac (3)  .
           move      rf-ocr-sgl-vpp       to   d-pvg-age-sgl-vpp      .
           move      rf-ocr-per-scr (1)   to   d-pvg-age-per-scr (1)  .
           move      rf-ocr-per-scr (2)   to   d-pvg-age-per-scr (2)  .
           move      rf-ocr-per-scr (3)   to   d-pvg-age-per-scr (3)  .
           move      rf-ocr-per-scr (4)   to   d-pvg-age-per-scr (4)  .
           move      rf-ocr-per-scr (5)   to   d-pvg-age-per-scr (5)  .
           move      rf-oct-ocl-dat       to   d-pvg-age-dat-rif      .
           move      rf-ocr-prz-lrs       to   d-pvg-age-prz-lrs      .
           move      rf-ocr-prz-nts       to   d-pvg-age-prz-nts      .
           move      rf-ocr-prz-net       to   d-pvg-age-prz-net      .
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           move      "pgm/age/prg/obj/dpvgage0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-pvg-age              .
      *                      *-----------------------------------------*
      *                      * Memorizzazione                          *
      *                      *-----------------------------------------*
           move      d-pvg-age-per-pvg (1)
                                          to   rf-ocr-ppv-rig (1)     .
           move      d-pvg-age-per-pvg (2)
                                          to   rf-ocr-ppv-rig (2)     .
           move      d-pvg-age-per-pvg (3)
                                          to   rf-ocr-ppv-rig (3)     .
           if        d-pvg-age-flg-pvs    not  = spaces
                     move  03             to   rf-ocr-fsp-rig         .
      *                  *---------------------------------------------*
      *                  * Provvigioni a forfait in riga               *
      *                  *---------------------------------------------*
           move      zero                 to   rf-ocr-pvf-rig         .
      *                  *---------------------------------------------*
      *                  * Date di consegna : da [oct]                 *
      *                  *---------------------------------------------*
           move      rf-oct-dat-cns       to   rf-ocr-dcn-ric         .
           move      rf-oct-dat-cns       to   rf-ocr-dcn-prv         .
           move      zero                 to   rf-ocr-dcn-cnf         .
           move      spaces               to   rf-ocr-flg-cnf         .
      *                  *---------------------------------------------*
      *                  * Riferimenti a commessa : non gestiti        *
      *                  *---------------------------------------------*
           move      spaces               to   rf-ocr-cmc-tip         .
           move      zero                 to   rf-ocr-cmc-dat         .
           move      zero                 to   rf-ocr-cmc-num         .
      *                  *---------------------------------------------*
      *                  * Flags : normalizzati                        *
      *                  *---------------------------------------------*
           move      spaces               to   rf-ocr-flg-rch         .
           move      spaces               to   rf-ocr-flg-ela         .
           move      spaces               to   rf-ocr-flg-pul         .
           move      spaces               to   rf-ocr-flg-puq         .
           move      spaces               to   rf-ocr-tip-ord         .
           move      spaces               to   rf-ocr-alx-exp         .
      *              *-------------------------------------------------*
      *              * Aggiornamento totalizzatori per tipo prodotto   *
      *              *-------------------------------------------------*
           if        rf-ocr-tip-pro       =    01
                     add  rf-ocr-imp-rig  to   w-gen-tot-rig (01)
           else if   rf-ocr-tip-pro       =    02
                     add  rf-ocr-imp-rig  to   w-gen-tot-rig (02)
           else if   rf-ocr-tip-pro       =    03
                     add  rf-ocr-imp-rig  to   w-gen-tot-rig (03)
           else if   rf-ocr-tip-pro       =    09
                     add  rf-ocr-imp-rig  to   w-gen-tot-rig (09)  .
      *              *-------------------------------------------------*
      *              * Scrittura record [ocr]                          *
      *              *-------------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofocr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ocr                 .
       wrt-rec-ocr-999.
           exit.

      *    *===========================================================*
      *    * Update testata ordine per ricalcolo dei totali documento  *
      *    *-----------------------------------------------------------*
       upd-rec-oct-000.
      *              *-------------------------------------------------*
      *              * Update testata in corso di trattamento          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [oct]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *                  *---------------------------------------------*
      *                  * Ottenimento record [oct]                    *
      *                  *---------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-gen-prt-orc        to   rf-oct-num-prt         .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *                  *---------------------------------------------*
      *                  * Aggiornamento totali                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Totali per tipo prodotto                *
      *                      *-----------------------------------------*
           move      w-gen-tot-rig (1)    to   rf-oct-tot-rig (1)     .
           move      w-gen-tot-rig (2)    to   rf-oct-tot-rig (2)     .
           move      w-gen-tot-rig (3)    to   rf-oct-tot-rig (3)     .
           move      w-gen-tot-rig (9)    to   rf-oct-tot-rig (9)     .
      *                      *-----------------------------------------*
      *                      * Totale documento lordo                  *
      *                      *-----------------------------------------*
           move      zero                 to   w-gen-tot-lor          .
           add       w-gen-tot-rig (1)    to   w-gen-tot-lor          .
           add       w-gen-tot-rig (2)    to   w-gen-tot-lor          .
           add       w-gen-tot-rig (3)    to   w-gen-tot-lor          .
           add       w-gen-tot-rig (9)    to   w-gen-tot-lor          .
      *                      *-----------------------------------------*
      *                      * Sconto pagamento                        *
      *                      *-----------------------------------------*
           move      zero                 to   w-gen-tot-scp          .
           if        rf-oct-per-scp       not  = 0
                     multiply  rf-oct-per-scp
                                          by   w-gen-tot-lor
                                        giving w-gen-tot-scp          .
           divide    100                  into w-gen-tot-scp
                                       rounded                        .
      *                      *-----------------------------------------*
      *                      * Totale documento                        *
      *                      *-----------------------------------------*
           move      w-gen-tot-lor        to   rf-oct-tot-doc         .
           subtract  w-gen-tot-scp        from rf-oct-tot-doc         .
      *                  *---------------------------------------------*
      *                  * Update record [oct]                         *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
      *                  *---------------------------------------------*
      *                  * Rilascio record [oct]                       *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/orc/fls/ioc/obj/iofoct"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oct                 .
       upd-rec-oct-999.
           exit.

      *    *===========================================================*
      *    * Routine di attribuzione numero protocollo ordini clienti  *
      *    *-----------------------------------------------------------*
       att-orc-prt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-prt             .
      *              *-------------------------------------------------*
      *              * Preparazione chiave per lettura tabella numera- *
      *              * zioni [orcprt]                                  *
      *              *-------------------------------------------------*
           move      w-att-orc-prt-dat    to   s-dat                  .
           move      s-saa                to   w-att-orc-prt-saa      .
           move      w-att-orc-prt-saa    to   rn-orc-prt-scl-ann     .
           move      w-att-orc-prt-dpz    to   rn-orc-prt-cod-dpz     .
      *              *-------------------------------------------------*
      *              * Lettura tabella numerazioni [orcprt]            *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-prt             .
      *              *-------------------------------------------------*
      *              * Test su esito operazione                        *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to att-orc-prt-100.
      *                  *---------------------------------------------*
      *                  * Record non trovato                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Composizione record normalizzato        *
      *                      *-----------------------------------------*
           move      zero                 to   rn-orc-prt-num-prt     .
      *                      *-----------------------------------------*
      *                      * Scrittura record normalizzato           *
      *                      *-----------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-prt             .
      *                      *-----------------------------------------*
      *                      * Ripetizione dell'intera operazione      *
      *                      *-----------------------------------------*
           go to     att-orc-prt-000.
       att-orc-prt-100.
      *                  *---------------------------------------------*
      *                  * Record trovato                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Numero protocollo in work di comodo     *
      *                      *-----------------------------------------*
           move      rn-orc-prt-num-prt   to   w-att-orc-prt-wnu      .
      *                      *-----------------------------------------*
      *                      * Aggiornamento numero protocollo         *
      *                      *-----------------------------------------*
           add       1                    to   w-att-orc-prt-wpr      .
           if        w-att-orc-prt-wpr    =    zero
                     move  1              to   w-att-orc-prt-wpr      .
      *                      *-----------------------------------------*
      *                      * Forzatura secolo/anno                   *
      *                      *-----------------------------------------*
           move      w-att-orc-prt-saa    to   w-att-orc-prt-wsa      .
      *                      *-----------------------------------------*
      *                      * Forzatura dipendenza                    *
      *                      *-----------------------------------------*
           move      w-att-orc-prt-dpz    to   w-att-orc-prt-wdz      .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione numero protocollo       *
      *                      *-----------------------------------------*
           move      w-att-orc-prt-wnu    to   rn-orc-prt-num-prt     .
      *                      *-----------------------------------------*
      *                      * Update record                           *
      *                      *-----------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-prt             .
      *                      *-----------------------------------------*
      *                      * Se errori ripete l'intera operazione    *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to att-orc-prt-000.
      *                      *-----------------------------------------*
      *                      * Unlock record                           *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-prt             .
      *                      *-----------------------------------------*
      *                      * Valore in uscita                        *
      *                      *-----------------------------------------*
           move      rn-orc-prt-num-prt   to   w-att-orc-prt-num      .
       att-orc-prt-999.
           exit.

      *    *===========================================================*
      *    * Routine di attribuzione numero documento ordini clienti   *
      *    *-----------------------------------------------------------*
       att-orc-ndo-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-att-orc-ndo-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-ndo             .
      *              *-------------------------------------------------*
      *              * Composizione chiave per lettura                 *
      *              *-------------------------------------------------*
           move      w-att-orc-ndo-dat    to   s-dat                  .
           move      s-saa                to   w-att-orc-ndo-saa      .
           move      w-att-orc-ndo-saa    to   rn-orc-ndo-scl-ann     .
           move      w-att-orc-ndo-dpz    to   rn-orc-ndo-cod-dpz     .
           move      w-att-orc-ndo-sgl    to   rn-orc-ndo-sgl-num     .
      *              *-------------------------------------------------*
      *              * Lettura numerazione                             *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-ndo             .
           if        f-sts                =    e-not-err
                     go to att-orc-ndo-100.
      *              *-------------------------------------------------*
      *              * Se numerazione non esistente la si crea norma-  *
      *              * lizzata a zero                                  *
      *              *-------------------------------------------------*
           move      zero                 to   rn-orc-ndo-num-doc     .
           move      zero                 to   rn-orc-ndo-dat-doc     .
           move      "PT"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-ndo             .
           move      "RL"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-ndo             .
           go to     att-orc-ndo-000.
       att-orc-ndo-100.
      *              *-------------------------------------------------*
      *              * Se numerazione esistente                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valori originali            *
      *                  *---------------------------------------------*
           move      rn-orc-ndo-num-doc   to   w-att-orc-ndo-nsv      .
           move      rn-orc-ndo-dat-doc   to   w-att-orc-ndo-dsv      .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del numero documento   *
      *                  * impostato                                   *
      *                  *---------------------------------------------*
           if        w-att-orc-ndo-prg    =    zero
                     go to att-orc-ndo-200
           else      go to att-orc-ndo-300.
       att-orc-ndo-200.
      *                  *---------------------------------------------*
      *                  * Se numero documento passato a zero          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Valore record in comodo ridefinito      *
      *                      *-----------------------------------------*
           move      rn-orc-ndo-num-doc   to   w-att-orc-ndo-wnu      .
      *                      *-----------------------------------------*
      *                      * Incremento numero progressivo del comodo*
      *                      * ridefinito                              *
      *                      *-----------------------------------------*
           add       1                    to   w-att-orc-ndo-wpr      .
           if        w-att-orc-ndo-wpr    =    zero
                     move  1              to   w-att-orc-ndo-wpr      .
      *                      *-----------------------------------------*
      *                      * Forzatura secolo/anno                   *
      *                      *-----------------------------------------*
           move      w-att-orc-ndo-saa    to   w-att-orc-ndo-wsa      .
      *                      *-----------------------------------------*
      *                      * Forzatura dipendenza                    *
      *                      *-----------------------------------------*
           move      w-att-orc-ndo-dpz    to   w-att-orc-ndo-wdz      .
      *                      *-----------------------------------------*
      *                      * Movimento da comodo ridefinito a record *
      *                      *-----------------------------------------*
           move      w-att-orc-ndo-wnu    to   rn-orc-ndo-num-doc     .
      *                      *-----------------------------------------*
      *                      * Data documento                          *
      *                      *-----------------------------------------*
           move      w-att-orc-ndo-dat    to   rn-orc-ndo-dat-doc     .
      *                      *-----------------------------------------*
      *                      * Update record                           *
      *                      *-----------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-ndo             .
      *                      *-----------------------------------------*
      *                      * Se errori ripete l'intera operazione    *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to att-orc-ndo-000.
      *                      *-----------------------------------------*
      *                      * Unlock                                  *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/orc/num/ioc/obj/inorcndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-orc-ndo             .
      *                      *-----------------------------------------*
      *                      * Salvataggio nuovo valore                *
      *                      *-----------------------------------------*
           move      rn-orc-ndo-num-doc   to   w-att-orc-ndo-new      .
      *                      *-----------------------------------------*
      *                      * Valore in uscita                        *
      *                      *-----------------------------------------*
           move      rn-orc-ndo-num-doc   to   w-att-orc-ndo-num      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     att-orc-ndo-999.
       att-orc-ndo-300.
      *                  *---------------------------------------------*
      *                  * Se numero documento passato a non zero :    *
      *                  * uscita                                      *
      *                  *---------------------------------------------*
           go to     att-orc-ndo-999.
       att-orc-ndo-999.
           exit.
           
      *    *===========================================================*
      *    * Routine lettura archivio [dcp] e [pdx]                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/ldcppdx0.lts"                   .

      *    *===========================================================*
      *    * Calcolo prezzo netto                                      *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wcalprz0.cps"                   .

      *    *===========================================================*
      *    * Routine di scrittura record di log                        *
      *    *-----------------------------------------------------------*
       wrt-rec-log-000.
      *              *-------------------------------------------------*
      *              * Open extend file log                            *
      *              *-------------------------------------------------*
           move      "OE"                 to   g-ope                  .
           move      "log "               to   g-nam                  .
           move      "/abd/asc/imp/roc_log.txt"
                                          to   g-pat                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *              *-------------------------------------------------*
      *              * Composizione record log                         *
      *              *-------------------------------------------------*
           move      spaces               to   w-rec-log              .
      *                  *---------------------------------------------*
      *                  * Data e ora evento                           *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      s-dat                to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-rec-log-dat          .
      *                  *---------------------------------------------*
      *                  * Ora                                         *
      *                  *---------------------------------------------*
           move      spaces               to   w-rec-log-ora          .
           string    s-ora      delimited by   size
                     ":"        delimited by   size
                     s-min      delimited by   size
                     ":"        delimited by   size
                     s-scd      delimited by   size
                                          into w-rec-log-ora          .
      *                  *---------------------------------------------*
      *                  * Descrizione evento                          *
      *                  *---------------------------------------------*
           move      w-gen-des-log        to   w-rec-log-des          .
      *                  *---------------------------------------------*
      *                  * Scrittura record                            *
      *                  *---------------------------------------------*
           move      "PN"                 to   g-ope                  .
           move      w-rec-log            to   g-rec                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Close file log                              *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       wrt-rec-log-999.
           exit.
           

