       Identification Division.
       Program-Id.                                 porc500s           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    orc                 *
      *                                Settore:    ric                 *
      *                                   Fase:    orc500              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 22/05/95    *
      *                       Ultima revisione:    NdK del 28/02/24    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Supporto alla ricezione ordini clienti      *
      *                                                                *
      *                    Sottoprogramma per esecuzione funzione di : *
      *                                                                *
      *                    Quadro analitico disponibilita' prodotto    *
      *                                                                *
      *                    SU MISURA PER ELETTRA                       *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Filler                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Filler                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "orc"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "ric"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "orc500"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "porc500s"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "QUADRO ANALITICO DISPONIBILITA' PRODOTTO"       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine qry-rou-pri-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-qry-rou-pri      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste pre esecuzione interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico interrogazione        *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento automatico interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-aut      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di Si/No primo giro di esecuzione            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-prm-gir      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento qry-routine       *
      *        *-------------------------------------------------------*
           05  w-cnt-qry.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-qry-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-liv.
                   15  w-cnt-qry-sav-l05  pic  x(64)                  .
                   15  w-cnt-qry-sav-l04  pic  x(64)                  .
                   15  w-cnt-qry-sav-l03  pic  x(64)                  .
                   15  w-cnt-qry-sav-l02  pic  x(64)                  .
                   15  w-cnt-qry-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Literals                                              *
      *        *-------------------------------------------------------*
           05  w-cnt-lit.
               10  w-cnt-lit-t80          pic  x(80) value all "="    .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale                         *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .
               10  w-err-box-err-m02      pic  x(65)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [fbs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/fab/fls/rec/rffbs"                          .
      *        *-------------------------------------------------------*
      *        * [mau]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmau"                          .
      *        *-------------------------------------------------------*
      *        * [mms]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfmms"                          .
      *        *-------------------------------------------------------*
      *        * [bit]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bol/fls/rec/rfbit"                          .
      *        *-------------------------------------------------------*
      *        * [bir]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bol/fls/rec/rfbir"                          .
      *        *-------------------------------------------------------*
      *        * [fit]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/fat/fls/rec/rffit"                          .
      *        *-------------------------------------------------------*
      *        * [fir]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/fat/fls/rec/rffir"                          .
      *        *-------------------------------------------------------*
      *        * [hsp]                                                 *
      *        *-------------------------------------------------------*
           copy      "ele/agb/fls/rec/rfhsp"                          .

      *    *===========================================================*
      *    * Work-area richieste per interrogazione                    *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Codice dipendenza in uso                              *
      *        *-------------------------------------------------------*
           05  rr-dpz-inu                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice prodotto numerico                              *
      *        *-------------------------------------------------------*
           05  rr-cod-pro                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice prodotto alfanumerico                          *
      *        *-------------------------------------------------------*
           05  rr-alf-pro                 pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Codice prodotto, descrizione                          *
      *        *-------------------------------------------------------*
           05  rr-cod-pro-des             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Data elaborazione                                     *
      *        *-------------------------------------------------------*
           05  rr-dat-ela                 pic  9(07)                  .

      *    *===========================================================*
      *    * Work-area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Modalita' di espressione del tempo di consegna        *
      *        *                                                       *
      *        *  - 0 : In giorni                                      *
      *        *  - 1 : In settimane                                   *
      *        *-------------------------------------------------------*
           05  w-prs-mde-tdc              pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Mese di chiusura esercizio                            *
      *        *-------------------------------------------------------*
           05  w-prs-mes-chi              pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area referenze                                       *
      *    *-----------------------------------------------------------*
       01  w-ref.
      *        *-------------------------------------------------------*
      *        * Numero giorni da considerare per la visualizzazione   *
      *        * quantita' disponibili                                 *
      *        *-------------------------------------------------------*
           05  w-ref-nrg-fod              pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per variabili di i.p.c. eventualmente passate   *
      *    * dal chiamante                                             *
      *    *-----------------------------------------------------------*
       01  w-ipc.
      *        *-------------------------------------------------------*
      *        * Per codice dipendenza in uso                          *
      *        *-------------------------------------------------------*
           05  w-ipc-cod-dpz.
      *            *---------------------------------------------------*
      *            * Si/No variabile di i.p.c.                         *
      *            *---------------------------------------------------*
               10  w-ipc-cod-dpz-snx      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Valore della variabile di i.p.c.                  *
      *            *---------------------------------------------------*
               10  w-ipc-cod-dpz-val      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Per codice prodotto                                   *
      *        *-------------------------------------------------------*
           05  w-ipc-cod-pro.
      *            *---------------------------------------------------*
      *            * Si/No variabile di i.p.c.                         *
      *            *---------------------------------------------------*
               10  w-ipc-cod-pro-snx      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Valore della variabile di i.p.c.                  *
      *            *---------------------------------------------------*
               10  w-ipc-cod-pro-val      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Per data elaborazione                                 *
      *        *-------------------------------------------------------*
           05  w-ipc-dat-ela.
      *            *---------------------------------------------------*
      *            * Si/No variabile di i.p.c.                         *
      *            *---------------------------------------------------*
               10  w-ipc-dat-ela-snx      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Valore della variabile di i.p.c.                  *
      *            *---------------------------------------------------*
               10  w-ipc-dat-ela-val      pic  9(07)                  .

      *    *===========================================================*
      *    * Work generica per tutto il programma                      *
      *    *-----------------------------------------------------------*
       01  w-gen.
      *        *-------------------------------------------------------*
      *        * Data attuale                                          *
      *        *-------------------------------------------------------*
           05  w-gen-dat-att              pic  9(07)                  .
               
      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcp.
               10  w-let-arc-dcp-flg      pic  x(01)                  .
               10  w-let-arc-dcp-num      pic  9(07)                  .
               10  w-let-arc-dcp-alf      pic  x(14)                  .
               10  w-let-arc-dcp-des      pic  x(40)                  .
               10  w-let-arc-dcp-umi      pic  x(03)                  .
               10  w-let-arc-dcp-ndq      pic  9(01)                  .
               10  w-let-arc-dcp-sts      pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per ridefinizione contenuto del mark-point      *
      *    *-----------------------------------------------------------*
       01  w-mpn.
      *        *-------------------------------------------------------*
      *        * Tipo di dettaglio da espandere                        *
      *        *-------------------------------------------------------*
           05  w-mpn-tip-det              pic  x(03)                  .

      *    *===========================================================*
      *    * Work per routine det-qfd-dav-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-det-qfd-dav.
      *        *-------------------------------------------------------*
      *        * Data base per calcolo                         [Input] *
      *        *-------------------------------------------------------*
           05  w-det-qfd-dav-dtb          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Numero giorni di incremento                   [Input] *
      *        *-------------------------------------------------------*
           05  w-det-qfd-dav-ngi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Tabella delle disponibilita'                 [Output] *
      *        *-------------------------------------------------------*
           05  w-det-qfd-dav-tbl.
               10  w-det-qfd-dav-ele occurs 15.
                   15  w-det-qfd-dav-dfd  pic  9(07)                  .
                   15  w-det-qfd-dav-qfd  pic s9(06)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Comodo per data base per incremento date       [Work] *
      *        *-------------------------------------------------------*
           05  w-det-qfd-dav-wdb          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo                            [Work] *
      *        *-------------------------------------------------------*
           05  w-det-qfd-dav-c01          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det su giacenze per ubicazione               *
      *        *-------------------------------------------------------*
           05  w-det-gia-ubi.
      *            *---------------------------------------------------*
      *            * Contatori di comodo                               *
      *            *---------------------------------------------------*
               10  w-det-gia-ubi-ctr      pic  9(02)                  .
               10  w-det-gia-ubi-lin      pic  9(02)                  .

      *    *===========================================================*
      *    * Work per routine det-scm-mes-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-det-scm-mes.
      *        *-------------------------------------------------------*
      *        * Data base per calcolo                         [Input] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-dtb          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Mese di chiusura esercizio                    [Input] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-mce          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza in uso                      [Input] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-dpz          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Tipo codice di magazzino                      [Input] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-tpm          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice numerico di magazzino                  [Input] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-cnm          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Tabella scarichi per mese                    [Output] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-max          pic  9(02)       value 15   .
           05  w-det-scm-mes-tbl.
               10  w-det-scm-mes-ele occurs 15.
                   15  w-det-scm-mes-tan  pic  9(02)                  .
                   15  w-det-scm-mes-tme  pic  9(02)                  .
                   15  w-det-scm-mes-tqu  pic s9(06)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Totale acquisti anno in corso                [Output] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-taa          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Totale vendite anno in corso                 [Output] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-tva          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Totale carichi anno in corso                 [Output] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-tca          pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Comodo per anno di esercizio                   [Work] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-wes          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per mese di esercizio                   [Work] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-wme          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per data ridefinita                     [Work] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-wdt          pic  9(07)                  .
           05  w-det-scm-mes-wdt-r redefines
               w-det-scm-mes-wdt.
               10  w-det-scm-mes-wda      pic  9(03)                  .
               10  w-det-scm-mes-wdm      pic  9(02)                  .
               10  w-det-scm-mes-wdg      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo                            [Work] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-c01          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodi                                         [Work] *
      *        *-------------------------------------------------------*
           05  w-det-scm-mes-sca          pic  9(02)                  .
           05  w-det-scm-saa-sca          pic  9(03)                  .
           05  w-det-scm-mes-sat          pic  9(03)                  .

      *    *===========================================================*
      *    * Work area per ciclo di Query-Program                      *
      *    *-----------------------------------------------------------*
       01  w-qry.
      *        *-------------------------------------------------------*
      *        * Flag di primo passaggio                               *
      *        *-------------------------------------------------------*
           05  w-qry-flg-uno              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Tabella delle disponibilita' da visualizzare          *
      *        *-------------------------------------------------------*
           05  w-qry-tbl-fod.
               10  w-qry-sng-ele occurs 15.
                   15  w-qry-dat-fod      pic  9(07)                  .
                   15  w-qry-qta-fod      pic s9(06)v9(03)            .

      *    *===========================================================*
      *    * Work per routine qry-liv-det-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-qry-liv-det.
           05  w-qry-liv-det-nli          pic  9(03)                  .
           05  w-qry-liv-det-ctr          pic  9(03)                  .

      *    *===========================================================*
      *    * Area di interfaccia per sottoprogramma         "pazi000d" *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/pazi000d.pgl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice prodotto 'dcp'          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acoddcp0.acl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione prezzo di vendi- *
      *    * ta                                                        *
      *    *-----------------------------------------------------------*
           copy      "pgm/fat/prg/cpy/dprzven0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione buffer dei fab-  *
      *    * bisogni/disponibilita' per un prodotto                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/fab/prg/cpy/dbuffod0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione saldi magazzino  *
      *    * per ubicazione                                            *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldubi0.dtl"                   .

      *    *===========================================================*
      *    * Work-area per operazioni sulle date                       *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wnrgdat0.cpw"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  filler                 pic  x(01)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Segnale primo giro di esecuzione                *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-prm-gir      .
      *              *-------------------------------------------------*
      *              * Se no richieste : a esecuzione interrogazione   *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-500.
       main-250.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-500.
      *              *-------------------------------------------------*
      *              * Esecuzione interrogazione                       *
      *              *-------------------------------------------------*
           perform   exe-int-err-000      thru exe-int-err-999        .
      *              *-------------------------------------------------*
      *              * Se no richieste : a fine programma              *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Test se fine esecuzione da operatore            *
      *              *-------------------------------------------------*
           if        w-cnt-qry-rou-pri    not  = spaces
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Segnale non piu' primo giro di esecuzione       *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-prm-gir      .
      *              *-------------------------------------------------*
      *              * Test se tipo esecuzione ciclico                 *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S" or
                     w-cnt-fun-snx-cic    not  = "S"
                     go to main-750
           else      go to main-250.
       main-750.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione interrogazione                                 *
      *    *-----------------------------------------------------------*
       exe-int-err-000.
      *              *-------------------------------------------------*
      *              * Open files per interrogazione                   *
      *              *-------------------------------------------------*
           perform   qry-opn-fls-000      thru qry-opn-fls-999        .
       exe-int-err-100.
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito           *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to exe-int-err-200
           else      go to exe-int-err-300.
       exe-int-err-200.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di interrogazione vero e proprio      *
      *                  *---------------------------------------------*
           perform   qry-rou-pri-000      thru qry-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * A chiusura files per interrogazione         *
      *                  *---------------------------------------------*
           go to     exe-int-err-900.
       exe-int-err-300.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * A chiusura files per interrogazione         *
      *                  *---------------------------------------------*
           go to     exe-int-err-900.
       exe-int-err-900.
      *              *-------------------------------------------------*
      *              * Close files per interrogazione                  *
      *              *-------------------------------------------------*
           perform   qry-cls-fls-000      thru qry-cls-fls-999        .
       exe-int-err-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Routine principale                       *
      *    *-----------------------------------------------------------*
       qry-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-rou-pri      .
      *              *-------------------------------------------------*
      *              * Determinazione function-keys in Mark-points     *
      *              *-------------------------------------------------*
           perform   qry-det-fky-000      thru qry-det-fky-999        .
      *              *-------------------------------------------------*
      *              * Begin o Begin Automatico                        *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-aut    =    "S"
                     move   "BA"          to   v-ope
           else      move   "BE"          to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Inizializzazione marker di primo giro           *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   qry-str-ini-000      thru qry-str-ini-999        .
           if        w-cnt-qry-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-qry-flg-sub
                     go to  qry-rou-pri-600.
       qry-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-qry-sav-l05      .
           move      w-rot-l04            to   w-cnt-qry-sav-l04      .
           move      w-rot-l03            to   w-cnt-qry-sav-l03      .
           move      w-rot-l02            to   w-cnt-qry-sav-l02      .
           move      w-rot-l01            to   w-cnt-qry-sav-l01      .
       qry-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   qry-let-seq-000      thru qry-let-seq-999        .
           if        w-cnt-qry-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-qry-flg-sub
                     go to  qry-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   qry-tst-max-000      thru qry-tst-max-999        .
           if        w-cnt-qry-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-qry-flg-sub
                     go to  qry-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   qry-sel-rec-000      thru qry-sel-rec-999        .
           if        w-cnt-qry-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-qry-flg-sub
                     go to  qry-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   qry-cmp-rot-000      thru qry-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-qry-mrk-uno    not  = spaces
                     go to qry-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   qry-rou-pri-790      thru qry-rou-pri-791        .
           perform   qry-rou-pri-750      thru qry-rou-pri-751        .
           perform   qry-rou-pri-740      thru qry-rou-pri-741        .
           perform   qry-rou-pri-730      thru qry-rou-pri-731        .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-qry-sav-l05
                     go to qry-rou-pri-310.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l05    to   w-rot-l05              .
           move      w-cnt-qry-sav-l04    to   w-rot-l04              .
           move      w-cnt-qry-sav-l03    to   w-rot-l03              .
           move      w-cnt-qry-sav-l02    to   w-rot-l02              .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           perform   qry-rou-pri-830      thru qry-rou-pri-831        .
           perform   qry-rou-pri-840      thru qry-rou-pri-841        .
           perform   qry-rou-pri-850      thru qry-rou-pri-851        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-750      thru qry-rou-pri-751        .
           perform   qry-rou-pri-740      thru qry-rou-pri-741        .
           perform   qry-rou-pri-730      thru qry-rou-pri-731        .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-qry-sav-l04
                     go to qry-rou-pri-320.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l04    to   w-rot-l04              .
           move      w-cnt-qry-sav-l03    to   w-rot-l03              .
           move      w-cnt-qry-sav-l02    to   w-rot-l02              .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           perform   qry-rou-pri-830      thru qry-rou-pri-831        .
           perform   qry-rou-pri-840      thru qry-rou-pri-841        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-740      thru qry-rou-pri-741        .
           perform   qry-rou-pri-730      thru qry-rou-pri-731        .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-qry-sav-l03
                     go to qry-rou-pri-330.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l03    to   w-rot-l03              .
           move      w-cnt-qry-sav-l02    to   w-rot-l02              .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           perform   qry-rou-pri-830      thru qry-rou-pri-831        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-730      thru qry-rou-pri-731        .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-qry-sav-l02
                     go to qry-rou-pri-340.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l02    to   w-rot-l02              .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-qry-sav-l01
                     go to qry-rou-pri-400.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
       qry-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Livello di dettaglio                            *
      *              *-------------------------------------------------*
           perform   qry-liv-det-000      thru qry-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione : fine ciclo         *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-qry-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     qry-rou-pri-100.
       qry-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-mrk-uno    =    spaces
                     go to qry-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Fine di tutti i livelli                         *
      *              *-------------------------------------------------*
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           perform   qry-rou-pri-830      thru qry-rou-pri-831        .
           perform   qry-rou-pri-840      thru qry-rou-pri-841        .
           perform   qry-rou-pri-850      thru qry-rou-pri-851        .
           perform   qry-rou-pri-890      thru qry-rou-pri-891        .
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Stop                                            *
      *              *-------------------------------------------------*
           move      "ST"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Subroutine di avanzamento pagina                *
      *              *-------------------------------------------------*
           perform   qry-pag-adv-000      thru qry-pag-adv-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     qry-rou-pri-900.
       qry-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   qry-nes-ela-000      thru qry-nes-ela-999        .
           go to     qry-rou-pri-900.
       qry-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-711.
           perform   qry-ini-lr1-000      thru qry-ini-lr1-999        .
       qry-rou-pri-711.
           exit.
       qry-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-721.
           perform   qry-ini-lr2-000      thru qry-ini-lr2-999        .
       qry-rou-pri-721.
           exit.
       qry-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-731.
           perform   qry-ini-lr3-000      thru qry-ini-lr3-999        .
       qry-rou-pri-731.
           exit.
       qry-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-741.
           perform   qry-ini-lr4-000      thru qry-ini-lr4-999        .
       qry-rou-pri-741.
           exit.
       qry-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-751.
           perform   qry-ini-lr5-000      thru qry-ini-lr5-999        .
       qry-rou-pri-751.
           exit.
       qry-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-791.
           perform   qry-ini-cic-000      thru qry-ini-cic-999        .
       qry-rou-pri-791.
           exit.
       qry-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-811.
           perform   qry-fin-lr1-000      thru qry-fin-lr1-999        .
       qry-rou-pri-811.
           exit.
       qry-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-821.
           perform   qry-fin-lr2-000      thru qry-fin-lr2-999        .
       qry-rou-pri-821.
           exit.
       qry-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-831.
           perform   qry-fin-lr3-000      thru qry-fin-lr3-999        .
       qry-rou-pri-831.
           exit.
       qry-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-841.
           perform   qry-fin-lr4-000      thru qry-fin-lr4-999        .
       qry-rou-pri-841.
           exit.
       qry-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-851.
           perform   qry-fin-lr5-000      thru qry-fin-lr5-999        .
       qry-rou-pri-851.
           exit.
       qry-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-891.
           perform   qry-fin-cic-000      thru qry-fin-cic-999        .
       qry-rou-pri-891.
           exit.
       qry-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Subroutine di avanzamento pagina         *
      *    *-----------------------------------------------------------*
       qry-pag-adv-000.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Test su esito interazione con operatore         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se continuazione normale                    *
      *                  *---------------------------------------------*
           if        v-key                =    spaces
                     go to qry-pag-adv-999.
      *                  *---------------------------------------------*
      *                  * Se interruzione forzata da operatore        *
      *                  *---------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "#"            to   w-cnt-qry-flg-int
                     go to qry-pag-adv-999.
      *                  *---------------------------------------------*
      *                  * Se function-key prevista                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Trattamento function-key                *
      *                      *-----------------------------------------*
           perform   qry-trt-fun-000      thru qry-trt-fun-999        .
      *                      *-----------------------------------------*
      *                      * Test su rientro da trattamento f-key    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se fine ciclo interrogazione   *
      *                          *-------------------------------------*
           if        w-cnt-qry-flg-int    =    spaces
                     go to qry-pag-adv-000.
       qry-pag-adv-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Determinazione codice dipendenza in uso         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura della variabile eventuale di i.p.c. *
      *                  * per il codice dipendenza                    *
      *                  *---------------------------------------------*
           perform   ipc-cod-dpz-000      thru ipc-cod-dpz-999        .
      *                      *-----------------------------------------*
      *                      * Se lettura errata : oltre               *
      *                      *-----------------------------------------*
           if        w-ipc-cod-dpz-snx    not  = "S"
                     go to pre-exe-pgm-100.
      *                      *-----------------------------------------*
      *                      * Bufferizzazione valore                  *
      *                      *-----------------------------------------*
           move      w-ipc-cod-dpz-val    to   rr-dpz-inu             .
      *                      *-----------------------------------------*
      *                      * A lettura personalizzazioni             *
      *                      *-----------------------------------------*
           go to     pre-exe-pgm-200.
       pre-exe-pgm-100.
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Determinazione codici dipendenze per l'a-   *
      *                  * zienda                                      *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      "DA"                 to   w-dpz-tip-ope          .
           move      s-ter                to   w-dpz-ide-ter          .
           move      s-ute                to   w-dpz-ide-ute          .
           move      s-azi                to   w-dpz-ide-azi          .
           move      s-sap                to   w-dpz-ide-sap          .
           move      s-arg                to   w-dpz-ide-arg          .
           move      s-set                to   w-dpz-ide-set          .
           move      s-fas                to   w-dpz-ide-fas          .
           move      i-ide-des            to   w-dpz-ide-des          .
           move      s-pro                to   w-dpz-ide-pro          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
      *                  *---------------------------------------------*
      *                  * Se zero dipendenze : errore ed uscita       *
      *                  *---------------------------------------------*
           if        w-dpz-ctr-dpz        >    zero
                     go to pre-exe-pgm-120.
           move      "EN"                 to   w-dpz-tip-ope          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
           move      "#"                  to   w-cnt-pre-exe-pgm      .
           go to     pre-exe-pgm-999.
       pre-exe-pgm-120.
      *                  *---------------------------------------------*
      *                  * Selezione codice dipendenza per il program- *
      *                  * ma                                          *
      *                  *---------------------------------------------*
           move      "SD"                 to   w-dpz-tip-ope          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
       pre-exe-pgm-180.
      *                  *---------------------------------------------*
      *                  * Se scelta non effettuata : uscita           *
      *                  *---------------------------------------------*
           if        w-dpz-cod-prg        =    zero
                     move  "#"            to   w-cnt-pre-exe-pgm
                     go to pre-exe-pgm-999.
      *                  *---------------------------------------------*
      *                  * Altrimenti bufferizzazione                  *
      *                  *---------------------------------------------*
           move      w-dpz-cod-prg        to   rr-dpz-inu             .
       pre-exe-pgm-200.
      *              *-------------------------------------------------*
      *              * Lettura altre variabili di i.p.c.               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura della variabile eventuale di i.p.c. *
      *                  * per il codice prodotto numerico             *
      *                  *---------------------------------------------*
           perform   ipc-cod-pro-000      thru ipc-cod-pro-999        .
      *                  *---------------------------------------------*
      *                  * Lettura della variabile eventuale di i.p.c. *
      *                  * per la data elaborazione                    *
      *                  *---------------------------------------------*
           perform   ipc-dat-ela-000      thru ipc-dat-ela-999        .
       pre-exe-pgm-300.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione relativa alla modali- *
      *              * ta' di espressione del tempo di consegna        *
      *              *-------------------------------------------------*
           perform   prs-mde-tdc-000      thru prs-mde-tdc-999        .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione relativa al mese di   *
      *              * chiusura esercizio                              *
      *              *-------------------------------------------------*
           perform   prs-mes-chi-000      thru prs-mes-chi-999        .
      *              *-------------------------------------------------*
      *              * Lettura referenza per numero giorni da conside- *
      *              * rare per la visualizzazione quantita' disponi-  *
      *              * bili                                            *
      *              *-------------------------------------------------*
           perform   ref-nrg-fod-000      thru ref-nrg-fod-999        .
      *              *-------------------------------------------------*
      *              * Determinazione data attuale                     *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-gen-dat-att          .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura della variabile di i.p.c. per il codice dopenden- *
      *    * za in uso                                                 *
      *    *-----------------------------------------------------------*
       ipc-cod-dpz-000.
      *              *-------------------------------------------------*
      *              * Estrazione della variabile 'cod-dpz' dal livel- *
      *              * lo di profondita' precedente                    *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "cod-dpz"            to   s-var                  .
           move      "-"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito dell'operazione *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     go to ipc-cod-dpz-200
           else      go to ipc-cod-dpz-400.
       ipc-cod-dpz-200.
      *              *-------------------------------------------------*
      *              * Se variabile esistente                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile esistente              *
      *                  *---------------------------------------------*
           move      "S"                  to   w-ipc-cod-dpz-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile                      *
      *                  *---------------------------------------------*
           move      s-num                to   w-ipc-cod-dpz-val      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-cod-dpz-999.
       ipc-cod-dpz-400.
      *              *-------------------------------------------------*
      *              * Se variabile non esistente                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile non esistente          *
      *                  *---------------------------------------------*
           move      "N"                  to   w-ipc-cod-dpz-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile a spaces             *
      *                  *---------------------------------------------*
           move      zero                 to   w-ipc-cod-dpz-val      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-cod-dpz-999.
       ipc-cod-dpz-999.
           exit.

      *    *===========================================================*
      *    * Lettura della variabile di i.p.c. per il codice prodotto  *
      *    * numerico                                                  *
      *    *-----------------------------------------------------------*
       ipc-cod-pro-000.
      *              *-------------------------------------------------*
      *              * Estrazione della variabile 'num-pro' dal livel- *
      *              * lo di profondita' precedente                    *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "cod-pro"            to   s-var                  .
           move      "-"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito dell'operazione *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     go to ipc-cod-pro-200
           else      go to ipc-cod-pro-400.
       ipc-cod-pro-200.
      *              *-------------------------------------------------*
      *              * Se variabile esistente                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile esistente              *
      *                  *---------------------------------------------*
           move      "S"                  to   w-ipc-cod-pro-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile                      *
      *                  *---------------------------------------------*
           move      s-num                to   w-ipc-cod-pro-val      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-cod-pro-999.
       ipc-cod-pro-400.
      *              *-------------------------------------------------*
      *              * Se variabile non esistente                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile non esistente          *
      *                  *---------------------------------------------*
           move      "N"                  to   w-ipc-cod-pro-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile a spaces             *
      *                  *---------------------------------------------*
           move      zero                 to   w-ipc-cod-pro-val      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-cod-pro-999.
       ipc-cod-pro-999.
           exit.

      *    *===========================================================*
      *    * Lettura della variabile di i.p.c. per la data elaborazio- *
      *    * ne                                                        *
      *    *-----------------------------------------------------------*
       ipc-dat-ela-000.
      *              *-------------------------------------------------*
      *              * Estrazione della variabile 'dat-ela' dal livel- *
      *              * lo di profondita' precedente                    *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "dat-ela"            to   s-var                  .
           move      "-"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito dell'operazione *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     go to ipc-dat-ela-200
           else      go to ipc-dat-ela-400.
       ipc-dat-ela-200.
      *              *-------------------------------------------------*
      *              * Se variabile esistente                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile esistente              *
      *                  *---------------------------------------------*
           move      "S"                  to   w-ipc-dat-ela-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile                      *
      *                  *---------------------------------------------*
           move      s-dat                to   w-ipc-dat-ela-val      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-dat-ela-999.
       ipc-dat-ela-400.
      *              *-------------------------------------------------*
      *              * Se variabile non esistente                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile non esistente          *
      *                  *---------------------------------------------*
           move      "N"                  to   w-ipc-dat-ela-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile a spaces             *
      *                  *---------------------------------------------*
           move      zero                 to   w-ipc-dat-ela-val      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-dat-ela-999.
       ipc-dat-ela-999.
           exit.

      *    *===========================================================*
      *    * Lettura della personalizzazione relativa alla modalita'   *
      *    * di espressione del tempo di consegna per l'acquisto       *
      *    *-----------------------------------------------------------*
       prs-mde-tdc-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/dcf[mde-tdc]"   to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-num          to   w-prs-mde-tdc
           else      move  0              to   w-prs-mde-tdc          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-mde-tdc        not  = 1
                     move  0              to   w-prs-mde-tdc          .
       prs-mde-tdc-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Mese di chiusura esercizio    *
      *    *-----------------------------------------------------------*
       prs-mes-chi-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/cge[mes-chi]"   to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-num          to   w-prs-mes-chi
           else      move  zero           to   w-prs-mes-chi          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-mes-chi        <    01 or
                     w-prs-mes-chi        >    12
                     move  12             to   w-prs-mes-chi          .
       prs-mes-chi-999.
           exit.

      *    *===========================================================*
      *    * Lettura referenza : Numero giorni da considerare per la   *
      *    *                     visualizzazione quantita' disponibili *
      *    *-----------------------------------------------------------*
       ref-nrg-fod-000.
      *              *-------------------------------------------------*
      *              * Lettura referenza                               *
      *              *-------------------------------------------------*
           move      "R:"                 to   s-ope                  .
           move      "pgm/orc/ric/orc500s[nrg-fod]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-num          to   w-ref-nrg-fod
           else      move  zero           to   w-ref-nrg-fod          .
      *              *-------------------------------------------------*
      *              * Controllo referenza                             *
      *              *-------------------------------------------------*
           if        w-ref-nrg-fod        =    zero
                     go to ref-nrg-fod-900.
      *              *-------------------------------------------------*
      *              * A uscita                                        *
      *              *-------------------------------------------------*
           go to     ref-nrg-fod-999.
       ref-nrg-fod-900.
      *              *-------------------------------------------------*
      *              * Normalizzazione referenza                       *
      *              *-------------------------------------------------*
           move      20                   to   w-ref-nrg-fod          .
       ref-nrg-fod-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda che esistano o no le va-   *
      *              * riabili di i.p.c. per le richieste              *
      *              *-------------------------------------------------*
           if        w-ipc-cod-dpz-snx    =    "S" and
                     w-ipc-cod-pro-snx    =    "S" and
                     w-ipc-dat-ela-snx    =    "S"
                     go to pre-tip-fun-100
           else      go to pre-tip-fun-200.
       pre-tip-fun-100.
      *              *-------------------------------------------------*
      *              * Se variabili di i.p.c. per le richieste esi-    *
      *              * stenti                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Controllo formale valori                    *
      *                  *---------------------------------------------*
           if        w-ipc-cod-dpz-val    =    zero or
                     w-ipc-cod-pro-val    =    zero or
                     w-ipc-dat-ela-val    =    zero
                     go to pre-tip-fun-200.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione richieste                   *
      *                  *---------------------------------------------*
           move      w-ipc-cod-pro-val    to   rr-cod-pro             .
           move      w-ipc-dat-ela-val    to   rr-dat-ela             .
      *                  *---------------------------------------------*
      *                  * Si/No richieste ad utente : No              *
      *                  *---------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-ric      .
      *                  *---------------------------------------------*
      *                  * Si/No funzionamento ciclico : No            *
      *                  *---------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-cic      .
      *                  *---------------------------------------------*
      *                  * Si/No funzionamento automatico : Si         *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-aut      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pre-tip-fun-999.
       pre-tip-fun-200.
      *              *-------------------------------------------------*
      *              * Se variabili di i.p.c. per le richieste non     *
      *              * esistenti                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Si/No richieste ad utente : Si              *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *                  *---------------------------------------------*
      *                  * Si/No funzionamento ciclico : Si            *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-cic      .
      *                  *---------------------------------------------*
      *                  * Si/No funzionamento automatico : Si         *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-aut      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pre-tip-fun-999.
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice prodotto 'dcp'  *
      *              *-------------------------------------------------*
           perform   cod-cod-dcp-opn-000  thru cod-cod-dcp-opn-999    .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [fbs]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/fab/fls/ioc/obj/ioffbs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fbs                 .
      *              *-------------------------------------------------*
      *              * [mms]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmms"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mms                 .
      *              *-------------------------------------------------*
      *              * [bit]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
      *              *-------------------------------------------------*
      *              * [bir]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bir                 .
      *              *-------------------------------------------------*
      *              * [fit]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *              *-------------------------------------------------*
      *              * [fir]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/fat/fls/ioc/obj/ioffir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fir                 .
      *              *-------------------------------------------------*
      *              * [hsp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "ele/agb/fls/ioc/obj/iofhsp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-hsp                 .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione buffer dei fabbi- *
      *              * sogni/disponibilita'                            *
      *              *-------------------------------------------------*
           perform   det-buf-fod-opn-000  thru det-buf-fod-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione prezzo di vendita *
      *              *-------------------------------------------------*
           perform   det-prz-ven-opn-000  thru det-prz-ven-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione saldo di magaz-   *
      *              * zino per ubicazione                             *
      *              *-------------------------------------------------*
           perform   det-sld-ubi-opn-000  thru det-sld-ubi-opn-999    .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice prodotto 'dcp' *
      *              *-------------------------------------------------*
           perform   cod-cod-dcp-cls-000  thru cod-cod-dcp-cls-999    .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [fbs]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/fab/fls/ioc/obj/ioffbs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fbs                 .
      *              *-------------------------------------------------*
      *              * [mau]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmau"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mau                 .
      *              *-------------------------------------------------*
      *              * [mms]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofmms"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-mms                 .
      *              *-------------------------------------------------*
      *              * [bit]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
      *              *-------------------------------------------------*
      *              * [bir]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bir                 .
      *              *-------------------------------------------------*
      *              * [fit]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *              *-------------------------------------------------*
      *              * [fir]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/fat/fls/ioc/obj/ioffir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fir                 .
      *              *-------------------------------------------------*
      *              * [hsp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "ele/agb/fls/ioc/obj/iofhsp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-hsp                 .
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione buffer dei fab-  *
      *              * bisogni/disponibilita'                          *
      *              *-------------------------------------------------*
           perform   det-buf-fod-cls-000  thru det-buf-fod-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione prezzo di vendi- *
      *              * ta                                              *
      *              *-------------------------------------------------*
           perform   det-prz-ven-cls-000  thru det-prz-ven-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione saldo di magaz-  *
      *              * zino per ubicazione                             *
      *              *-------------------------------------------------*
           perform   det-sld-ubi-cls-000  thru det-sld-ubi-cls-999    .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Codice prodotto                             *
      *                  *---------------------------------------------*
           perform   acc-cod-pro-000      thru acc-cod-pro-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
       acc-ric-sel-200.
      *                  *---------------------------------------------*
      *                  * Data elaborazione                           *
      *                  *---------------------------------------------*
           perform   acc-dat-ela-000      thru acc-dat-ela-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-100.
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#CNF"               to   v-not                  .
           move      "S"                  to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else if   v-key                =    "UP  "
                     go to acc-ric-sel-950
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-950.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazioni                         *
      *                      *-----------------------------------------*
           go to     acc-ric-sel-100.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice prodotto                             *
      *                  *---------------------------------------------*
           perform   pmt-cod-pro-000      thru pmt-cod-pro-999        .
      *                  *---------------------------------------------*
      *                  * Data elaborazione                           *
      *                  *---------------------------------------------*
           perform   pmt-dat-ela-000      thru pmt-dat-ela-999        .
       pmt-ric-sel-500.
      *              *-------------------------------------------------*
      *              * Preparazione e visualizzazione defaults         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Data elaborazione                           *
      *                  *---------------------------------------------*
           move      w-gen-dat-att        to   rr-dat-ela             .
           perform   vis-dat-ela-000      thru vis-dat-ela-999        .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Prompt codice prodotto                                    *
      *    *-----------------------------------------------------------*
       pmt-cod-pro-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice prodotto       :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cod-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts : Data elaborazione               *
      *    *-----------------------------------------------------------*
       pmt-dat-ela-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data di elaborazione  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dat-ela-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Codice prodotto                            *
      *    *-----------------------------------------------------------*
       acc-cod-pro-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-pro-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-dcp-ope      .
           move      "A"                  to   w-cod-cod-dcp-tac      .
           move      rr-cod-pro           to   w-cod-cod-dcp-num      .
           move      rr-alf-pro           to   w-cod-cod-dcp-alf      .
           move      05                   to   w-cod-cod-dcp-lin      .
           move      25                   to   w-cod-cod-dcp-pos      .
           move      05                   to   w-cod-cod-dcp-dln      .
           move      41                   to   w-cod-cod-dcp-dps      .
           move      spaces               to   v-edm                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-dcp-cll-000  thru cod-cod-dcp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dcp-foi-000  thru cod-cod-dcp-foi-999    .
       acc-cod-dcp-110.
           perform   cod-cod-dcp-cll-000  thru cod-cod-dcp-cll-999    .
           if        w-cod-cod-dcp-ope    =    "F+"
                     go to acc-cod-dcp-115.
           if        w-cod-cod-dcp-ope    =    "AC"
                     go to acc-cod-dcp-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-dcp-115.
           perform   cod-cod-dcp-foi-000  thru cod-cod-dcp-foi-999    .
           go to     acc-cod-dcp-110.
       acc-cod-dcp-120.
           move      w-cod-cod-dcp-alf    to   v-alf                  .
           move      w-cod-cod-dcp-num    to   v-num                  .
       acc-cod-dcp-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-cod-pro-999.
       acc-cod-pro-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-cod-pro             .
           move      v-alf                to   rr-alf-pro             .
       acc-cod-pro-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-pro-410.
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcp]                      *
      *                  *---------------------------------------------*
           move      rr-cod-pro           to   w-let-arc-dcp-num      .
           move      rr-alf-pro           to   w-let-arc-dcp-alf      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione prodotto         *
      *                  *---------------------------------------------*
           move      w-let-arc-dcp-des    to   rr-cod-pro-des         .
       acc-cod-pro-420.
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione prodotto        *
      *                  *---------------------------------------------*
           perform   vis-cod-pro-des-000  thru vis-cod-pro-des-999    .
       acc-cod-pro-430.
      *                  *---------------------------------------------*
      *                  * Se lettura errata : reimpostazione          *
      *                  *---------------------------------------------*
           if        w-let-arc-dcp-flg    not  = spaces
                     go to acc-cod-pro-100.
      *                  *---------------------------------------------*
      *                  * Se codice a zero : reimpostazione           *
      *                  *---------------------------------------------*
           if        rr-cod-pro           =    zero
                     go to acc-cod-pro-100.
       acc-cod-pro-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-pro-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-cod-pro-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-cod-pro-100.
       acc-cod-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice Prodotto                   *
      *    *-----------------------------------------------------------*
       vis-cod-pro-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      14                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      25                   to   v-pos                  .
           move      rr-alf-pro           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Descrizione Prodotto finito       *
      *    *-----------------------------------------------------------*
       vis-cod-pro-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-cod-pro-des       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-pro-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Data elaborazione                          *
      *    *-----------------------------------------------------------*
       acc-dat-ela-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dat-ela-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      07                   to   v-lin                  .
           move      25                   to   v-pos                  .
           move      rr-dat-ela           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-dat-ela-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dat-ela-999.
       acc-dat-ela-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dat-ela             .
       acc-dat-ela-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore zero non ammesso, ameno che non si   *
      *                  * sia in Up                                   *
      *                  *---------------------------------------------*
           if        rr-dat-ela           not  = zero
                     go to acc-dat-ela-600.
           if        v-key                =    "UP  "
                     go to acc-dat-ela-600
           else      go to acc-dat-ela-100.
       acc-dat-ela-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dat-ela-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dat-ela-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dat-ela-100.
       acc-dat-ela-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Data elaborazione                       *
      *    *-----------------------------------------------------------*
       vis-dat-ela-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      07                   to   v-lin                  .
           move      25                   to   v-pos                  .
           move      rr-dat-ela           to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dat-ela-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
      *              *-------------------------------------------------*
      *              * Controllo su codice prodotto                    *
      *              *-------------------------------------------------*
           if        rr-cod-pro           not  = zero
                     go to tdo-ric-sel-100.
           move      "Manca il codice prodotto !"
                                          to   w-err-box-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Controllo su data elaborazione                  *
      *              *-------------------------------------------------*
           if        rr-dat-ela           not  = zero
                     go to tdo-ric-sel-200.
           move      "Manca la data di elaborazione !"
                                          to   w-err-box-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Uscita per controlli tutti superati             *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Emissione messaggio di errore e set del flag di *
      *              * uscita ad errore                                *
      *              *-------------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di errore in uscita                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-ric-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
           move      zero                 to   rr-cod-pro             .
           move      spaces               to   rr-alf-pro             .
           move      spaces               to   rr-cod-pro-des         .
           move      zero                 to   rr-dat-ela             .
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Open files                               *
      *    *-----------------------------------------------------------*
       qry-opn-fls-000.
       qry-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Close files                              *
      *    *-----------------------------------------------------------*
       qry-cls-fls-000.
       qry-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : No                    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-exe-rou-srt      .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       int-srt-inp-000.
       int-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Determinazione quantita' di fabbisogno/disponibilita' da  *
      *    * visualizzare nell'interrogazione                          *
      *    *-----------------------------------------------------------*
       det-qfd-dav-000.
      *              *-------------------------------------------------*
      *              * Determinazione date per tabella disponibilita'  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione data primo elemento         *
      *                  *---------------------------------------------*
           move      w-det-qfd-dav-dtb    to   w-det-qfd-dav-dfd (1)  .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione elementi successivi      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Inizializzazione data base per calcolo  *
      *                      *-----------------------------------------*
           move      w-det-qfd-dav-dtb    to   w-det-qfd-dav-wdb      .
      *                      *-----------------------------------------*
      *                      * Ciclo di scansione                      *
      *                      *-----------------------------------------*
           move      1                    to   w-det-qfd-dav-c01      .
       det-qfd-dav-020.
           add       1                    to   w-det-qfd-dav-c01      .
           if        w-det-qfd-dav-c01    >    15
                     go to det-qfd-dav-100.
      *                      *-----------------------------------------*
      *                      * Determinazione data incrementata        *
      *                      *-----------------------------------------*
           move      w-det-qfd-dav-wdb    to   w-det-dat-nrg-dtb      .
           move      w-det-qfd-dav-ngi    to   w-det-dat-nrg-ngi      .
           perform   det-dat-nrg-000      thru det-dat-nrg-999        .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione in tabella data incre-  *
      *                      * mentata                                 *
      *                      *-----------------------------------------*
           move      w-det-dat-nrg-dti    to   w-det-qfd-dav-dfd
                                              (w-det-qfd-dav-c01)     .
      *                      *-----------------------------------------*
      *                      * Aggiornamento data base per prossimo    *
      *                      * calcolo                                 *
      *                      *-----------------------------------------*
           move      w-det-dat-nrg-dti    to   w-det-qfd-dav-wdb      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     det-qfd-dav-020.
       det-qfd-dav-100.
      *              *-------------------------------------------------*
      *              * Determinazione quantita' per tabella disponibi- *
      *              * lita'                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizializzazione contatore per scansione    *
      *                  * buffer dei fabbisogni/disponibilita'        *
      *                  *---------------------------------------------*
           move      1                    to   d-buf-fod-ctr-001      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione tabella disponibilita'   *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-qfd-dav-c01      .
       det-qfd-dav-120.
           add       1                    to   w-det-qfd-dav-c01      .
           if        w-det-qfd-dav-c01    >    15
                     go to det-qfd-dav-200.
      *                  *---------------------------------------------*
      *                  * Determinazione fabbisogno/disponibilita'    *
      *                  * alla data in esame                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se data in esame superiore alla data    *
      *                      * consegna prevista dell'ultimo elemento, *
      *                      * bufferizzazione quantita' dell'ultimo   *
      *                      * elemento                                *
      *                      *-----------------------------------------*
           if        w-det-qfd-dav-dfd
                    (w-det-qfd-dav-c01)   >    d-buf-fod-dcn-prv
                                              (d-buf-fod-num-ele)
                     move  d-buf-fod-qta-fod
                          (d-buf-fod-num-ele)
                                          to   w-det-qfd-dav-qfd
                                              (w-det-qfd-dav-c01)
                     go to det-qfd-dav-160.
      *                      *-----------------------------------------*
      *                      * Continuazione scansione buffer delle    *
      *                      * quantita' di fabbisogno/disponibilita'  *
      *                      *-----------------------------------------*
       det-qfd-dav-140.
           add       1                    to   d-buf-fod-ctr-001      .
      *                      *-----------------------------------------*
      *                      * Se raggiunto l'ultimo elemento : buffe- *
      *                      * rizzazione quantita' dell'ultimo ele-   *
      *                      * mento                                   *
      *                      *-----------------------------------------*
           if        d-buf-fod-ctr-001    >    d-buf-fod-num-ele
                     move  d-buf-fod-qta-fod
                          (d-buf-fod-num-ele)
                                          to   w-det-qfd-dav-qfd
                                              (w-det-qfd-dav-c01)
                     go to det-qfd-dav-160.
      *                      *-----------------------------------------*
      *                      * Finche' la data in esame e' superiore   *
      *                      * alla data consegna prevista dell'ele-   *
      *                      * mento : riciclo                         *
      *                      *-----------------------------------------*
           if        w-det-qfd-dav-dfd
                    (w-det-qfd-dav-c01)   >    d-buf-fod-dcn-prv
                                              (d-buf-fod-ctr-001)
                     go to det-qfd-dav-140.
      *                      *-----------------------------------------*
      *                      * Determinazione indice elemento su cui   *
      *                      * posizionarsi                            *
      *                      *-----------------------------------------*
           if        w-det-qfd-dav-dfd
                    (w-det-qfd-dav-c01)   <    d-buf-fod-dcn-prv
                                              (d-buf-fod-ctr-001)
                     subtract  1          from d-buf-fod-ctr-001      .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione quantita' di fabbiso-   *
      *                      * gno/disponibilita' dell'elemento su cui *
      *                      * si e' posizionati                       *
      *                      *-----------------------------------------*
           move      d-buf-fod-qta-fod
                    (d-buf-fod-ctr-001)   to   w-det-qfd-dav-qfd
                                              (w-det-qfd-dav-c01)     .
       det-qfd-dav-160.
      *                  *---------------------------------------------*
      *                  * Riciclo su scansione tabella delle disponi- *
      *                  * bilita'                                     *
      *                  *---------------------------------------------*
           go to     det-qfd-dav-120.
       det-qfd-dav-200.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-qfd-dav-999.
       det-qfd-dav-999.
           exit.

      *    *===========================================================*
      *    * Determinazione quantita' di magazzino per mese            *
      *    *-----------------------------------------------------------*
       det-scm-mes-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-scm-mes-taa      .
           move      zero                 to   w-det-scm-mes-tva      .
           move      zero                 to   w-det-scm-mes-tca      .
      *              *-------------------------------------------------*
      *              * Determinazione secolo anno attuale              *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-saa                to   w-det-scm-mes-sat      .
       det-scm-mes-100.
      *              *-------------------------------------------------*
      *              * Determinazione mese ed anno di partenza         *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *
           subtract  1                    from s-saa                  .
           move      1                    to   s-gio                  .
      *
           if        s-mes                >    2
                     subtract  2          from s-mes
           else      add       10         to   s-mes
                     subtract  1          from s-saa                  .
      *
           move      s-mes                to   w-det-scm-mes-sca      .
           move      s-saa                to   w-det-scm-saa-sca      .
      *              *-------------------------------------------------*
      *              * Ciclo di scansione                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-scm-mes-c01      .
       det-scm-mes-120.
           add       1                    to   w-det-scm-mes-c01      .
           if        w-det-scm-mes-c01    >    w-det-scm-mes-max
                     go to det-scm-mes-400.
      *                  *---------------------------------------------*
      *                  * Anno                                        *
      *                  *---------------------------------------------*
           move      w-det-scm-saa-sca    to   w-det-scm-mes-tan
                                              (w-det-scm-mes-c01)     .
      *                  *---------------------------------------------*
      *                  * Mese                                        *
      *                  *---------------------------------------------*
           move      w-det-scm-mes-sca    to   w-det-scm-mes-tme
                                              (w-det-scm-mes-c01)     .
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [hsp]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "ele/agb/fls/ioc/obj/iofhsp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-hsp                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [hsp]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "DPZPRO    "         to   f-key                  .
           move      w-det-scm-saa-sca    to   rf-hsp-ann-ese         .
           move      01                   to   rf-hsp-cod-dpz         .
           move      w-det-scm-mes-cnm    to   rf-hsp-num-pro         .
           move      spaces               to   rf-hsp-var-mag         .
           move      "ele/agb/fls/ioc/obj/iofhsp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-hsp                 .
      *                  *---------------------------------------------*
      *                  * Quantita' vendita                           *
      *                  *---------------------------------------------*
           move      rf-hsp-qta-ven
                    (w-det-scm-mes-sca)   to   w-det-scm-mes-tqu
                                              (w-det-scm-mes-c01)     .
      *                  *---------------------------------------------*
      *                  * Quantita' acquisto                          *
      *                  *---------------------------------------------*
           add       rf-hsp-qta-acq
                    (w-det-scm-mes-sca)   to   w-det-scm-mes-tqu
                                              (w-det-scm-mes-c01)     .
      *                  *---------------------------------------------*
      *                  * Eventuale aggiornamento totali anno attuale *
      *                  *---------------------------------------------*
           if        rf-hsp-ann-ese       not  = w-det-scm-mes-sat
                     go to det-scm-mes-180.
      *                  *---------------------------------------------*
      *                  * Aggiornamento totale vendita                *
      *                  *---------------------------------------------*
           add       rf-hsp-qta-ven
                    (w-det-scm-mes-sca)   to   w-det-scm-mes-tva      .
      *                  *---------------------------------------------*
      *                  * Aggiornamento totale acquisto               *
      *                  *---------------------------------------------*
           add       rf-hsp-qta-acq
                    (w-det-scm-mes-sca)   to   w-det-scm-mes-taa      .
      *                  *---------------------------------------------*
      *                  * Aggiornamento totale carichi anno in corso  *
      *                  *---------------------------------------------*
           move      rf-hsp-prg-car       to   w-det-scm-mes-tca      .
       det-scm-mes-180.
      *                  *---------------------------------------------*
      *                  * Incremento mese e anno                      *
      *                  *---------------------------------------------*
           add       1                    to   w-det-scm-mes-sca      .
      *
           if        w-det-scm-mes-sca    >    12
                     move  01             to   w-det-scm-mes-sca
                     add   01             to   w-det-scm-saa-sca      .
      *                  *---------------------------------------------*
      *                  * Riciclo su scansione                        *
      *                  *---------------------------------------------*
           go to     det-scm-mes-120.
       det-scm-mes-400.
      *              *-------------------------------------------------*
      *              * Scansione bolle da fatturare con data odierna   *
      *              *-------------------------------------------------*
           perform   det-scm-mes-bit-000  thru det-scm-mes-bit-999    .
       det-scm-mes-600.
      *              *-------------------------------------------------*
      *              * Scansione fatture con data odierna              *
      *              *-------------------------------------------------*
           perform   det-scm-mes-fit-000  thru det-scm-mes-fit-999    .
       det-scm-mes-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-scm-mes-999.
       det-scm-mes-999.
           exit.

      *    *===========================================================*
      *    * Determinazione scarichi di magazzino per mese             *
      *    *                                                           *
      *    * Ciclo per [bit]                                           *
      *    *-----------------------------------------------------------*
       det-scm-mes-bit-000.
      *              *-------------------------------------------------*
      *              * Start su file [bit]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "FATARC     "        to   f-key                  .
           move      "S"                  to   rf-bit-fat-snx         .
           move      zero                 to   rf-bit-fat-dat         .
           move      zero                 to   rf-bit-fat-num         .
           move      zero                 to   rf-bit-fat-npb         .
           move      "C"                  to   rf-bit-tip-arc         .
           move      zero                 to   rf-bit-arc-plf         .
           move      zero                 to   rf-bit-num-prt         .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
       det-scm-mes-bit-200.
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Read-next su archivio [bit]                     *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
      *                  *---------------------------------------------*
      *                  * Se at end : uscita                          *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-scm-mes-bit-900.
       det-scm-mes-bit-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-bit-fat-snx       not  = "S"  or
                     rf-bit-fat-dat       not  = zero or
                     rf-bit-fat-num       not  = zero or
                     rf-bit-fat-npb       not  = zero or
                     rf-bit-tip-arc       not  = "C"
                     go to det-scm-mes-bit-900.
       det-scm-mes-bit-400.
      *              *-------------------------------------------------*
      *              * Selezioni sul record [bit]                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su data documento                      *
      *                  *---------------------------------------------*
           if        rf-bit-dat-doc       not  = w-gen-dat-att
                     go to det-scm-mes-bit-200.
       det-scm-mes-bit-600.
      *              *-------------------------------------------------*
      *              * Start su [bir]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NUMPRT    "         to   f-key                  .
           move      rf-bit-num-prt       to   rf-bir-num-prt         .
           move      zero                 to   rf-bir-num-prg         .
           move      "pgm/bol/fls/ioc/obj/iofbir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bir                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : ad uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-scm-mes-bit-800.
       det-scm-mes-bit-620.
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Read next su [bir]                              *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bir                 .
      *                  *---------------------------------------------*
      *                  * Se At end : ad uscita                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-scm-mes-bit-800.
       det-scm-mes-bit-630.
      *              *-------------------------------------------------*
      *              * Max su [bir]                                    *
      *              *-------------------------------------------------*
           if        rf-bir-num-prt       not  = rf-bit-num-prt
                     go to det-scm-mes-bit-800.
       det-scm-mes-bit-640.
      *              *-------------------------------------------------*
      *              * Sel su [bir]                                    *
      *              *-------------------------------------------------*
           if        rf-bir-tip-rig       not  = "P    "
                     go to det-scm-mes-bit-620.
           if        rf-bir-tip-mag       not  = 01
                     go to det-scm-mes-bit-620.
           if        rf-bir-num-pro       not  = w-det-scm-mes-cnm
                     go to det-scm-mes-bit-620.
       det-scm-mes-bit-650.
      *              *-------------------------------------------------*
      *              * Aggiornamento ultimo elemento                   *
      *              *-------------------------------------------------*
           add       rf-bir-qta-ven       to   w-det-scm-mes-tqu (15) .
       det-scm-mes-bit-680.
      *              *-------------------------------------------------*
      *              * Riciclo su [bir]                                *
      *              *-------------------------------------------------*
           go to     det-scm-mes-bit-620.
       det-scm-mes-bit-800.
      *              *-------------------------------------------------*
      *              * Riciclo su [bit]                                *
      *              *-------------------------------------------------*
           go to     det-scm-mes-bit-200.
       det-scm-mes-bit-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-scm-mes-bit-999.
       det-scm-mes-bit-999.
           exit.
      
      *    *===========================================================*
      *    * Determinazione scarichi di magazzino per mese             *
      *    *                                                           *
      *    * Ciclo per [fit]                                           *
      *    *-----------------------------------------------------------*
       det-scm-mes-fit-000.
      *              *-------------------------------------------------*
      *              * Start su archivio [fit]                         *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "IDEDOC    "         to   f-key                  .
           move      w-gen-dat-att        to   rf-fit-dat-doc         .
           move      zero                 to   rf-fit-cod-dpz         .
           move      zero                 to   rf-fit-num-doc         .
           move      spaces               to   rf-fit-cod-tmo         .
           move      zero                 to   rf-fit-num-prt         .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-scm-mes-fit-900.
       det-scm-mes-fit-200.
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Read-next su archivio [fit]                     *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/fat/fls/ioc/obj/ioffit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fit                 .
      *                  *---------------------------------------------*
      *                  * Se at end : uscita                          *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-scm-mes-fit-900.
       det-scm-mes-fit-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-fit-dat-doc       not  = w-gen-dat-att
                     go to det-scm-mes-bit-900.
       det-scm-mes-fit-400.
      *              *-------------------------------------------------*
      *              * Selezioni sul record [fit]                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo documento                      *
      *                  *---------------------------------------------*
           if        rf-fit-tip-doc       =    04
                     go to det-scm-mes-fit-200.
      *                  *---------------------------------------------*
      *                  * Test se movimento escluso da statistiche    *
      *                  *---------------------------------------------*
           if        rf-fit-flg-nbx (1)   not  = spaces
                     go to det-scm-mes-fit-200.
      *                  *---------------------------------------------*
      *                  * Test su data documento                      *
      *                  *---------------------------------------------*
           if        rf-fit-dat-doc       not  = w-gen-dat-att
                     go to det-scm-mes-bit-200.
       det-scm-mes-fit-600.
      *              *-------------------------------------------------*
      *              * Start su [fir]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NUMPRT    "         to   f-key                  .
           move      rf-fit-num-prt       to   rf-fir-num-prt         .
           move      zero                 to   rf-fir-num-prg         .
           move      "pgm/fat/fls/ioc/obj/ioffir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fir                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : ad uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-scm-mes-fit-800.
       det-scm-mes-fit-620.
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Read next su [fir]                              *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/fat/fls/ioc/obj/ioffir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fir                 .
      *                  *---------------------------------------------*
      *                  * Se At end : ad uscita                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-scm-mes-fit-800.
       det-scm-mes-fit-630.
      *              *-------------------------------------------------*
      *              * Max su [fir]                                    *
      *              *-------------------------------------------------*
           if        rf-fir-num-prt       not  = rf-fit-num-prt
                     go to det-scm-mes-fit-800.
       det-scm-mes-fit-640.
      *              *-------------------------------------------------*
      *              * Sel su [fir]                                    *
      *              *-------------------------------------------------*
           if        rf-fir-tip-rig       not  = "P    "
                     go to det-scm-mes-fit-620.
           if        rf-fir-num-pro       not  = w-det-scm-mes-cnm
                     go to det-scm-mes-fit-620.
       det-scm-mes-fit-650.
      *              *-------------------------------------------------*
      *              * Aggiornamento ultimo elemento                   *
      *              *-------------------------------------------------*
           add       rf-fir-qta-ven       to   w-det-scm-mes-tqu (15) .
       det-scm-mes-fit-680.
      *              *-------------------------------------------------*
      *              * Riciclo su [fir]                                *
      *              *-------------------------------------------------*
           go to     det-scm-mes-fit-620.
       det-scm-mes-fit-800.
      *                  *---------------------------------------------*
      *                  * Riciclo a record [fit] successivo           *
      *                  *---------------------------------------------*
           go to     det-scm-mes-fit-200.
       det-scm-mes-fit-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-scm-mes-fit-999.
       det-scm-mes-fit-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Start iniziale                           *
      *    *-----------------------------------------------------------*
       qry-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-sub      .
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di primo passaggio         *
      *              *-------------------------------------------------*
           move      spaces               to   w-qry-flg-uno          .
       qry-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Messaggio per nessuna registrazione      *
      *    *-----------------------------------------------------------*
       qry-nes-ela-000.
           move      "ME"                 to   v-ope                  .
           move      "Nessuna registrazione entro i limiti assegnati !"
                                          to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Lettura sequenziale                      *
      *    *-----------------------------------------------------------*
       qry-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-sub      .
      *              *-------------------------------------------------*
      *              * Test su flag di primo passaggio                 *
      *              *-------------------------------------------------*
           if        w-qry-flg-uno        =    spaces
                     move  "#"            to   w-qry-flg-uno
                     go to qry-let-seq-999
           else      move  "#"            to   w-cnt-qry-flg-sub      .
       qry-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Test se superamento limiti massimi       *
      *    *-----------------------------------------------------------*
       qry-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-sub      .
       qry-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Selezione su record letto                *
      *    *-----------------------------------------------------------*
       qry-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-sub      .
      *              *-------------------------------------------------*
      *              * Lettura record [dcp]                            *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      rr-cod-pro           to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Test se lettura errata                      *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-cnt-qry-flg-sub
                     go to qry-sel-rec-999.
       qry-sel-rec-100.
      *              *-------------------------------------------------*
      *              * Determinazione buffer dei fabbisogni/disponibi- *
      *              * lita'                                           *
      *              *-------------------------------------------------*
           move      "DT"                 to   d-buf-fod-tip-ope      .
           move      rr-dat-ela           to   d-buf-fod-dat-ela      .
           move      rr-dpz-inu           to   d-buf-fod-cod-dpz      .
           move      01                   to   d-buf-fod-tip-mag      .
           move      rf-dcp-num-pro       to   d-buf-fod-num-mag      .
           move      01                   to   d-buf-fod-tip-crg      .
           move      01                   to   d-buf-fod-snx-oav      .
           perform   det-buf-fod-cll-000  thru det-buf-fod-cll-999    .
      *              *-------------------------------------------------*
      *              * Determinazione quantita' di fabbisogno/disponi- *
      *              * bilita' da visualizzare nell'interrogazione     *
      *              *-------------------------------------------------*
           move      rr-dat-ela           to   w-det-qfd-dav-dtb      .
           move      w-ref-nrg-fod        to   w-det-qfd-dav-ngi      .
           perform   det-qfd-dav-000      thru det-qfd-dav-999        .
           move      w-det-qfd-dav-tbl    to   w-qry-tbl-fod          .
       qry-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Composizione area per tests di rottura   *
      *    *-----------------------------------------------------------*
       qry-cmp-rot-000.
       qry-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Esecuzione per inizio ciclo              *
      *    *-----------------------------------------------------------*
       qry-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                  *---------------------------------------------*
      *                  * Test se interruzione forzata                *
      *                  *---------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-ini-cic-999.
       qry-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Esecuzione per fine ciclo                *
      *    *-----------------------------------------------------------*
       qry-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 5. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 5. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 4. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 4. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 3. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 3. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 2. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 2. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 1. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 1. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Livello di dettaglio                     *
      *    *-----------------------------------------------------------*
       qry-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
      *              *-------------------------------------------------*
      *              * Stampa barre verticali di separazione           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizializzazione numero linea               *
      *                  *---------------------------------------------*
           move      5                    to   w-qry-liv-det-nli      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione                          *
      *                  *---------------------------------------------*
           move      zero                 to   w-qry-liv-det-ctr      .
       qry-liv-det-020.
           add       1                    to   w-qry-liv-det-ctr      .
           if        w-qry-liv-det-ctr    >    16
                     go to qry-liv-det-100.
      *                      *-----------------------------------------*
      *                      * Prima barra                             *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           add       w-qry-liv-det-nli
                     w-qry-liv-det-ctr  giving v-lin                  .
           move      37                   to   v-pos                  .
           move      "|"                  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Seconda barra                           *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           add       w-qry-liv-det-nli
                     w-qry-liv-det-ctr  giving v-lin                  .
           move      61                   to   v-pos                  .
           move      "|"                  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Riciclo su scansione                    *
      *                      *-----------------------------------------*
           go to     qry-liv-det-020.
       qry-liv-det-100.
      *              *-------------------------------------------------*
      *              * Visualizzazione informazioni sul prodotto       *
      *              *-------------------------------------------------*
       qry-liv-det-110.
      *                  *---------------------------------------------*
      *                  * Giacenza iniziale                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Giacenza iniziale ...:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      06                   to   v-lin                  .
           move      24                   to   v-pos                  .
           move      d-buf-fod-gia-ian    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-120.
      *                  *---------------------------------------------*
      *                  * Determinazione scarichi di magazzino per    *
      *                  * mese                                        *
      *                  *---------------------------------------------*
           move      rr-dat-ela           to   w-det-scm-mes-dtb      .
           move      w-prs-mes-chi        to   w-det-scm-mes-mce      .
           move      rr-dpz-inu           to   w-det-scm-mes-dpz      .
           move      01                   to   w-det-scm-mes-tpm      .
           move      rf-dcp-num-pro       to   w-det-scm-mes-cnm      .
           perform   det-scm-mes-000      thru det-scm-mes-999        .
       qry-liv-det-125.
      *                  *---------------------------------------------*
      *                  * Progressivo carichi da inizio anno          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Carichi .............:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      07                   to   v-lin                  .
           move      24                   to   v-pos                  .
_____*     move      d-buf-fod-pca-ian    to   v-num                  .
_____*     move      w-det-scm-mes-tva    to   v-num                  .
           move      w-det-scm-mes-tca    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-130.
      *                  *---------------------------------------------*
      *                  * Progressivo scarichi da inizio anno         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Scarichi ............:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      08                   to   v-lin                  .
           move      24                   to   v-pos                  .
_____*     move      d-buf-fod-psc-ian    to   v-num                  .
           move      w-det-scm-mes-taa    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-140.
      *                  *---------------------------------------------*
      *                  * Giacenza alla data base                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Editing data elaborazione           *
      *                          *-------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      rr-dat-ela           to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Composizione stringa in v-alf       *
      *                          *-------------------------------------*
           move      spaces               to   v-alf                  .
           string    "Giacenza al "
                                delimited by   size
                     v-edt      delimited by   spaces
                     " :"       delimited by   size
                                          into v-alf                  .
      *                          *-------------------------------------*
      *                          * Stampa stringa in v-alf             *
      *                          *-------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      01                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      09                   to   v-lin                  .
           move      24                   to   v-pos                  .
           move      d-buf-fod-qta-gia    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-150.
      *                  *---------------------------------------------*
      *                  * Quantita' in ordine a fornitori             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "+"                  to   v-edm                  .
           move      "ORF"                to   w-mpn-tip-det          .
           move      w-mpn                to   v-cnt                  .
           move      "Ordini Fornitori .....:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      11                   to   v-lin                  .
           move      24                   to   v-pos                  .
           move      d-buf-fod-qta-oaf    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-160.
      *                  *---------------------------------------------*
      *                  * Quantita' in ordine da clienti              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "+"                  to   v-edm                  .
           move      "ORC"                to   w-mpn-tip-det          .
           move      w-mpn                to   v-cnt                  .
           move      "Ordini Clienti ......:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      12                   to   v-lin                  .
           move      24                   to   v-pos                  .
           move      d-buf-fod-qta-idc    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-170.
      *                  *---------------------------------------------*
      *                  * Quantita' in corso di spedizione            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "+"                  to   v-edm                  .
           move      "ODS"                to   w-mpn-tip-det          .
           move      w-mpn                to   v-cnt                  .
           move      "In Spedizione .......:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      13                   to   v-lin                  .
           move      24                   to   v-pos                  .
           move      d-buf-fod-qta-ics    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-180.
      *                  *---------------------------------------------*
      *                  * Disponibilita' assoluta                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Disponib. assoluta ..:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      15                   to   v-lin                  .
           move      24                   to   v-pos                  .
           move      d-buf-fod-qta-gia    to   v-num                  .
           add       d-buf-fod-qta-oaf    to   v-num                  .
           subtract  d-buf-fod-qta-idc    from v-num                  .
           subtract  d-buf-fod-qta-ics    from v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-185.
      *                  *---------------------------------------------*
      *                  * Codici ubicazione                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Determinazione buffer giacenze per      *
      *                      * ubicazione                              *
      *                      *-----------------------------------------*
           move      "PU"                 to   d-sld-ubi-tip-ope      .
           move      rr-dat-ela           to   d-sld-ubi-dat-ela      .
           move      rr-dpz-inu           to   d-sld-ubi-cod-dpz      .
           move      01                   to   d-sld-ubi-tip-mag      .
           move      rf-dcp-num-pro       to   d-sld-ubi-num-mag      .
           move      spaces               to   d-sld-ubi-cod-ubi      .
           move      spaces               to   d-sld-ubi-lit-ubi      .
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           perform   det-sld-ubi-cll-000  thru det-sld-ubi-cll-999    .
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      01                   to   v-pos                  .
      *
           move      "+"                  to   v-edm                  .
           move      "UBI"                to   w-mpn-tip-det          .
           move      w-mpn                to   v-cnt                  .
      *
           if        d-sld-ubi-num-ele    <    2
                     move  "Ubicazione ..........:"
                                          to   v-alf
           else      move  "Ubicazioni ..........:"
                                          to   v-alf                  .
      *
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Ubicazione                              *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      12                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      24                   to   v-pos                  .
           move      d-sld-ubi-lit-ubi    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Eventuale segnale di piu' ubicazioni    *
      *                      *-----------------------------------------*
           move      d-sld-ubi-lit-ubi    to   w-all-str-alf          .
           perform   all-str-lun-000      thru all-str-lun-999        .
           if        w-all-str-lun        not > 14
                     go to qry-liv-det-190.
      *                      *-----------------------------------------*
      *                      * Visualizzazione segnale                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      36                   to   v-pos                  .
           move      "+"                  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-190.
      *                  *---------------------------------------------*
      *                  * Prezzo di listino base                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione link-area                  *
      *                      *-----------------------------------------*
           move      "PV"                 to   d-prz-ven-tip-ope      .
           move      zero                 to   d-prz-ven-cod-cli      .
           move      c-sgl                to   d-prz-ven-sgl-vpp      .
           move      c-dec                to   d-prz-ven-dec-vpp      .
           move      rf-dcp-num-pro       to   d-prz-ven-num-pro      .
           move      spaces               to   d-prz-ven-cod-lst      .
           move      rf-dcp-prz-lst       to   d-prz-ven-prz-lsb      .
           move      c-sgl                to   d-prz-ven-sgl-vlb      .
           move      c-dec                to   d-prz-ven-dec-vlb      .
           move      spaces               to   d-prz-ven-tfu-prz      .
      *
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   d-prz-ven-dat-rfp      .
           move      zero                 to   d-prz-ven-qta-rif      .
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           perform   det-prz-ven-cll-000  thru det-prz-ven-cll-999    .
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Listino base ........:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Eventuale data riferimento              *
      *                      *-----------------------------------------*
           if        d-prz-ven-dat-rfp    =    zero
                     go to   qry-liv-det-195.                             
      *
           move      "PF"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      17                   to   v-lin                  .
           move      14                   to   v-pos                  .
           move      d-prz-ven-dat-rfp    to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-195.
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           add       rf-dcp-dec-prz       to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "G<"                 to   v-edm                  .
           move      17                   to   v-lin                  .
           move      24                   to   v-pos                  .
           move      d-prz-ven-prz-ven    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-200.
      *                  *---------------------------------------------*
      *                  * Tempo di approvigionamento                  *
      *                  *                                             *
      *                  * ELE (NO)                                    *
      *                  *---------------------------------------------*
           go to     qry-liv-det-208.
      *                      *-----------------------------------------*
      *                      * Test se da visualizzare                 *
      *                      *-----------------------------------------*
           if        d-buf-fod-tmp-apv    =    zero
                     go to qry-liv-det-210.
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Composizione stringa in v-alf       *
      *                          *-------------------------------------*
           move      all "."              to   v-alf                  .
           move      1                    to   w-qry-liv-det-ctr      .
      *                              *---------------------------------*
      *                              * Literal                         *
      *                              *---------------------------------*
           string    "Consegna ("
                                delimited by   size
                                          into v-alf
                                  with pointer w-qry-liv-det-ctr      .
      *                              *---------------------------------*
      *                              * Editing numero giorni/settimane *
      *                              *---------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      d-buf-fod-tmp-apv    to   v-num                  .
           if        w-prs-mde-tdc        =    1
                     divide   7           into v-num
                                               rounded                .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * String numero giorni/settimane  *
      *                              *---------------------------------*
           string    v-edt
                                delimited by   spaces
                                          into v-alf
                                  with pointer w-qry-liv-det-ctr      .
      *                              *---------------------------------*
      *                              * Literal per giorni/settimane    *
      *                              *---------------------------------*
           if        w-prs-mde-tdc        =    zero
                     go to qry-liv-det-202
           else      go to qry-liv-det-204.
       qry-liv-det-202.
      *                                  *-----------------------------*
      *                                  * String per giorni           *
      *                                  *-----------------------------*
           string    " gg.)"
                                delimited by   size                                          into v-alf
                                          into v-alf
                                  with pointer w-qry-liv-det-ctr      .
           go to     qry-liv-det-206.
       qry-liv-det-204.
      *                                  *-----------------------------*
      *                                  * String per settimane        *
      *                                  *-----------------------------*
           string    " s.)"
                                delimited by   size
                                          into v-alf
                                  with pointer w-qry-liv-det-ctr      .
           go to     qry-liv-det-206.
       qry-liv-det-206.
      *                          *-------------------------------------*
      *                          * Due punti finale                    *
      *                          *-------------------------------------*
           move      ":"                  to   v-alf (22 : 1)         .
      *                          *-------------------------------------*
      *                          * Stampa stringa in v-alf             *
      *                          *-------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      18                   to   v-lin                  .
           move      24                   to   v-pos                  .
           move      d-buf-fod-dot-teo    to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-208.
      *                  *---------------------------------------------*
      *                  * Status prodotto                             *
      *                  *                                             *
      *                  * ELE                                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Status prodotto......:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Lettura archivio [dcp]                  *
      *                      *-----------------------------------------*
           move      rr-cod-pro           to   w-let-arc-dcp-num      .
           move      rr-alf-pro           to   w-let-arc-dcp-alf      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      12                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      24                   to   v-pos                  .
      *
           if        w-let-arc-dcp-sts    =    01
                     move  "Normale     " to   v-alf
           else if   w-let-arc-dcp-sts    =    11
                     move  "Cessato     " to   v-alf
           else if   w-let-arc-dcp-sts    =    21
                     move  "Sostituito  " to   v-alf
           else if   w-let-arc-dcp-sts    =    51 or
                     w-let-arc-dcp-sts    =    52
                     move  "Fuori METEL " to   v-alf
           else if   w-let-arc-dcp-sts    =    71 or
                     w-let-arc-dcp-sts    =    72
                     move  "Obsoleto    " to   v-alf
           else      move  "???"          to   v-alf                  .
      *
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-210.
      *                  *---------------------------------------------*
      *                  * Scorta minima                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Scorta minima .......:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Lettura record [fbs]                *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "MAGDPZ    "         to   f-key                  .
           move      01                   to   rf-fbs-tip-mag         .
           move      rf-dcp-num-pro       to   rf-fbs-num-mag         .
           move      spaces               to   rf-fbs-var-mag         .
           move      rr-dpz-inu           to   rf-fbs-cod-dpz         .
           move      "pgm/fab/fls/ioc/obj/ioffbs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fbs                 .
      *                          *-------------------------------------*
      *                          * Se lettura errata : normalizzazione *
      *                          * valore                              *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     move  zero           to   rf-fbs-sco-min (1)     .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      19                   to   v-lin                  .
           move      24                   to   v-pos                  .
           move      rf-fbs-sco-min (1)   to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-220.
      *                  *---------------------------------------------*
      *                  * Lotto di vendita                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Lotto di vendita ....:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      20                   to   v-lin                  .
           move      24                   to   v-pos                  .
           move      rf-dcp-lot-ven       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-240.
      *                  *---------------------------------------------*
      *                  * Lotto di acquisto                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      22                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Lotto di acquisto ...:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      21                   to   v-lin                  .
           move      24                   to   v-pos                  .
           move      d-buf-fod-lot-acq    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-300.
      *              *-------------------------------------------------*
      *              * Ciclo di visualizzazione tabella disponibilita' *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizializzazione numero linea               *
      *                  *---------------------------------------------*
           move      5                    to   w-qry-liv-det-nli      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione                          *
      *                  *---------------------------------------------*
           move      zero                 to   w-qry-liv-det-ctr      .
       qry-liv-det-320.
           add       1                    to   w-qry-liv-det-ctr      .
           if        w-qry-liv-det-ctr    >    15
                     go to qry-liv-det-400.
      *                      *-----------------------------------------*
      *                      * Data disponibilita'                     *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           add       w-qry-liv-det-nli
                     w-qry-liv-det-ctr  giving v-lin                  .
           move      39                   to   v-pos                  .
           move      w-qry-dat-fod
                    (w-qry-liv-det-ctr)   to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Quantita' disponibile                   *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           add       w-qry-liv-det-nli
                     w-qry-liv-det-ctr  giving v-lin                  .
           move      48                   to   v-pos                  .
           move      w-qry-qta-fod
                    (w-qry-liv-det-ctr)   to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     qry-liv-det-320.
       qry-liv-det-400.
      *              *-------------------------------------------------*
      *              * Ciclo di visualizzazione scarichi ultimi mesi   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizializzazione numero linea               *
      *                  *---------------------------------------------*
           move      5                    to   w-qry-liv-det-nli      .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione                          *
      *                  *---------------------------------------------*
           move      zero                 to   w-qry-liv-det-ctr      .
       qry-liv-det-420.
           add       1                    to   w-qry-liv-det-ctr      .
           if        w-qry-liv-det-ctr    >    15
                     go to qry-liv-det-500.
      *                      *-----------------------------------------*
      *                      * Se quantita' a zero : riciclo           *
      *                      *-----------------------------------------*
           if        w-det-scm-mes-tqu
                    (w-qry-liv-det-ctr)   =    zero
                     go to qry-liv-det-420.
      *                      *-----------------------------------------*
      *                      * Mese                                    *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9"                  to   v-edm                  .
           add       w-qry-liv-det-nli
                     w-qry-liv-det-ctr  giving v-lin                  .
           move      63                   to   v-pos                  .
           move      w-det-scm-mes-tme
                    (w-qry-liv-det-ctr)   to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Barra di separazione                    *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           add       w-qry-liv-det-nli
                     w-qry-liv-det-ctr  giving v-lin                  .
           move      65                   to   v-pos                  .
           move      "/"                  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Anno                                    *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9"                  to   v-edm                  .
           add       w-qry-liv-det-nli
                     w-qry-liv-det-ctr  giving v-lin                  .
           move      66                   to   v-pos                  .
           move      w-det-scm-mes-tan
                    (w-qry-liv-det-ctr)   to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Quantita'                               *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           add       w-qry-liv-det-nli
                     w-qry-liv-det-ctr  giving v-lin                  .
           move      69                   to   v-pos                  .
           move      w-det-scm-mes-tqu
                    (w-qry-liv-det-ctr)   to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     qry-liv-det-420.
       qry-liv-det-500.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     qry-liv-det-999.
       qry-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Function-keys previste in Mark-points    *
      *    *-----------------------------------------------------------*
       qry-det-fky-000.
      *              *-------------------------------------------------*
      *              * Determinazione eventuale function key Slct      *
      *              *-------------------------------------------------*
           move      "GV"                 to   s-ope                  .
           move      "fkselect"           to   s-var                  .
           move      "-"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces and
                     s-alf                =    "SLCT"
                     move   "SLCT"        to   v-pfk(01)
           else      move   spaces        to   v-pfk(01)              .
      *              *-------------------------------------------------*
      *              * Function key Expd                               *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "porc500u"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                =    zero
                     move  "EXPD"         to   v-pfk(02)
           else      move  spaces         to   v-pfk(02)              .
      *              *-------------------------------------------------*
      *              * Altre function keys                             *
      *              *-------------------------------------------------*
           move      spaces               to   v-pfk(03)              .
           move      spaces               to   v-pfk(04)              .
           move      spaces               to   v-pfk(05)              .
           move      spaces               to   v-pfk(06)              .
           move      spaces               to   v-pfk(07)              .
           move      spaces               to   v-pfk(08)              .
           move      spaces               to   v-pfk(09)              .
           move      spaces               to   v-pfk(10)              .
       qry-det-fky-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Trattamento Function-key selezionata     *
      *    *-----------------------------------------------------------*
       qry-trt-fun-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
      *              *-------------------------------------------------*
      *              * Trattamento function-key Slct                   *
      *              *-------------------------------------------------*
           if        v-key                not  = "SLCT"
                     go to qry-trt-fun-500.
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Put della variabile di i.p.c.: 'num-pro'    *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "num-pro"            to   s-var                  .
           move      "-"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      07                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      rf-dcp-num-pro       to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Segnale di interruzione interrogazione      *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-qry-flg-int      .
      *                  *---------------------------------------------*
      *                  * Segnale di uscita dal programma             *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-qry-rou-pri      .
           go to     qry-trt-fun-999.
       qry-trt-fun-500.
      *              *-------------------------------------------------*
      *              * Trattamento function-key Expd                   *
      *              *-------------------------------------------------*
           if        v-key                not  = "EXPD"
                     go to qry-trt-fun-999.
      *                  *---------------------------------------------*
      *                  * Normalizzazione function-key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Estrazione contenuto del mark-point         *
      *                  *---------------------------------------------*
           move      v-cnt                to   w-mpn                  .
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del contenuto del    *
      *                  * mark-point                                  *
      *                  *---------------------------------------------*
           if        w-mpn-tip-det        =    "ORC"
                     go to qry-trt-fun-510
           else if   w-mpn-tip-det        =    "ORF"
                     go to qry-trt-fun-510
           else if   w-mpn-tip-det        =    "ODS"
                     go to qry-trt-fun-520
           else if   w-mpn-tip-det        =    "UBI"
                     go to qry-trt-fun-530
           else      go to qry-trt-fun-999.
       qry-trt-fun-510.
      *                  *---------------------------------------------*
      *                  * Se selezionato dettaglio : Ordini clienti e *
      *                  * fornitori                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se programma di interrogazione     *
      *                      * gia' attivo                             *
      *                      *-----------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "porc500u"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to qry-trt-fun-999.
      *                      *-----------------------------------------*
      *                      * Scrittura della variabile di i.p.c. per *
      *                      * codice dipendenza                       *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "cod-dpz"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      02                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      rr-dpz-inu           to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Scrittura della variabile di i.p.c. per *
      *                      * codice prodotto                         *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "cod-pro"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      07                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      rf-dcp-num-pro       to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Scrittura della variabile di i.p.c. per *
      *                      * data elaborazione                       *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "dat-ela"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "D"                  to   s-tip                  .
           move      rr-dat-ela           to   s-dat                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Richiamo programma di interrogazione        *
      *                  *---------------------------------------------*
           move      "pgm/orc/prg/obj/porc500u"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
           cancel    s-pat                                            .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-520.
      *                  *---------------------------------------------*
      *                  * Se selezionato dettaglio : Ordini di spedi- *
      *                  * zione                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se programma di interrogazione su  *
      *                      * ordini di spedizione gia' attivo        *
      *                      *-----------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pods3010"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to qry-trt-fun-999.
      *                      *-----------------------------------------*
      *                      * Scrittura della variabile di i.p.c. per *
      *                      * codice dipendenza                       *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "cod-dpz"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      02                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      rr-dpz-inu           to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Scrittura della variabile di i.p.c. per *
      *                      * ammissibilita' del tasto Slct           *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "snx-slc"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      01                   to   s-car                  .
           move      "N"                  to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Scrittura della variabile di i.p.c. per *
      *                      * tipo di interrogazione                  *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "tip-int"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      10                   to   s-car                  .
           move      "INTDPV    "         to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Scrittura della variabile di i.p.c. per *
      *                      * codice prodotto                         *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "cod-pro"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      07                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      rf-dcp-num-pro       to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Scrittura della variabile di i.p.c. per *
      *                      * data emissione minima                   *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "dem-min"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "D"                  to   s-tip                  .
           move      zero                 to   s-dat                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Scrittura della variabile di i.p.c. per *
      *                      * data emissione massima                  *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "dem-max"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "D"                  to   s-tip                  .
           move      rr-dat-ela           to   s-dat                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Scrittura della variabile di i.p.c. per *
      *                      * stato degli ordini : solo quelli ineva- *
      *                      * si                                      *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "sts-ods"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      02                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      02                   to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Richiamo del programma di interrogazio- *
      *                      * ne                                      *
      *                      *-----------------------------------------*
           move      "pgm/ods/prg/obj/pods3010"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
           cancel    s-pat                                            .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-530.
      *                  *---------------------------------------------*
      *                  * Se selezionato dettaglio : Ubicazioni       *
      *                  *---------------------------------------------*
           perform   box-exp-ubi-000      thru box-exp-ubi-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-999.
           exit.

      *    *===========================================================*
      *    * Intestazione per interrogazione                           *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Subroutine di avanzamento pagina                *
      *              *-------------------------------------------------*
           perform   qry-pag-adv-000      thru qry-pag-adv-999        .
      *                  *---------------------------------------------*
      *                  * Se interruzione forzata : uscita            *
      *                  *---------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to int-pag-sta-999.
      *              *-------------------------------------------------*
      *              * Linea di trattini                               *
      *              *-------------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-cnt-lit-t80        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      21                   to   v-pos                  .
           move      "QUADRO ANALITICO DISPONIBILITA' PRODOTTO"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Linea di trattini                               *
      *              *-------------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-cnt-lit-t80        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       int-pag-sta-200.
      *              *-------------------------------------------------*
      *              * Intestazione prodotto                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione stringa in v-alf               *
      *                  *---------------------------------------------*
           move      spaces               to   v-alf                  .
           string    "Prodotto : "
                                delimited by   size
                     rf-dcp-alf-pro
                                delimited by   spaces
                     "  "
                                delimited by   size
                     rf-dcp-des-pro
                                delimited by   size
                                          into v-alf                  .
      *                  *---------------------------------------------*
      *                  * Stampa stringa                              *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Unita' di misura                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      72                   to   v-pos                  .
           move      "U.M.:"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      78                   to   v-pos                  .
           move      rf-dcp-umi-ven       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura                                  *
      *              *-------------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "----------------------------------------  DISPONIB
      -              "ILITA'  ------  VENDITE  -----"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Box per expand ubicazioni e giacenza                      *
      *    *-----------------------------------------------------------*
       box-exp-ubi-000.
      *              *-------------------------------------------------*
      *              * Test preliminare                                *
      *              *-------------------------------------------------*
           if        d-sld-ubi-num-ele    not  > zero
                     go to box-exp-ubi-900.
       box-exp-ubi-050.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      10                   to   v-lin                  .
           move      22                   to   v-pos                  .
      *
           move      10                   to   v-lto                  .
           add       01                   to   v-lto                  .
           add       d-sld-ubi-num-ele    to   v-lto                  .
           if        v-lto                >    21
                     move  21             to   v-lto                  .
      *
           move      53                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-exp-ubi-100.
      *              *-------------------------------------------------*
      *              * Ciclo di stampa in base al numero di elementi   *
      *              * determinati                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizio ciclo                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-gia-ubi-ctr      .
           move      zero                 to   w-det-gia-ubi-lin      .
       box-exp-ubi-200.
           add       1                    to   w-det-gia-ubi-ctr      .
           if        w-det-gia-ubi-ctr    >    d-sld-ubi-num-ele
                     go to box-exp-ubi-800.
      *                  *---------------------------------------------*
      *                  * Test se ubicazione a spazi                  *
      *                  *---------------------------------------------*
           if        d-sld-ubi-ubi-gia
                    (w-det-gia-ubi-ctr)   =    spaces
                     go to box-exp-ubi-200.
       box-exp-ubi-300.
      *                  *---------------------------------------------*
      *                  * Aggiornamento linea di visualizzazione      *
      *                  *---------------------------------------------*
           add       1                    to   w-det-gia-ubi-lin      .
      *                  *---------------------------------------------*
      *                  * Ubicazione                                  *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      10                   to   v-lin                  .
           add       w-det-gia-ubi-lin    to   v-lin                  .
           move      24                   to   v-pos                  .
           move      d-sld-ubi-ubi-gia
                    (w-det-gia-ubi-ctr)   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Giacenza                                    *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      rf-dcp-dec-qta       to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      10                   to   v-lin                  .
           add       w-det-gia-ubi-lin    to   v-lin                  .
           move      33                   to   v-pos                  .
           move      d-sld-ubi-qta-gia
                    (w-det-gia-ubi-ctr)   to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-exp-ubi-700.
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     box-exp-ubi-200.
       box-exp-ubi-800.
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
      *
           move      10                   to   v-lin                  .
           add       d-sld-ubi-num-ele    to   v-lin                  .
           if        v-lto                >    21
                     move  21             to   v-lin                  .
      *
           move      50                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
      *
           move      10                   to   v-lin                  .
           add       d-sld-ubi-num-ele    to   v-lin                  .
           if        v-lto                >    21
                     move  21             to   v-lin                  .
      *
           move      51                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-exp-ubi-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     box-exp-ubi-999.
       box-exp-ubi-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [dcp]                            *
      *    *-----------------------------------------------------------*
       let-arc-dcp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice Prodotto di vendita a zero       *
      *              *-------------------------------------------------*
           if        w-let-arc-dcp-num    =    zero
                     go to let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      w-let-arc-dcp-num    to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcp-400.
       let-arc-dcp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcp-alf-pro       to   w-let-arc-dcp-alf      .
           move      rf-dcp-des-pro       to   w-let-arc-dcp-des      .
           move      rf-dcp-umi-ven       to   w-let-arc-dcp-umi      .
           move      rf-dcp-dec-qta       to   w-let-arc-dcp-ndq      .
           move      rf-dcp-sta-tus       to   w-let-arc-dcp-sts      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcp-999.
       let-arc-dcp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcp-flg      .
           move      all   "."            to   w-let-arc-dcp-des      .
           go to     let-arc-dcp-600.
       let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-des      .
       let-arc-dcp-600.
           move      spaces               to   w-let-arc-dcp-alf      .
           move      spaces               to   w-let-arc-dcp-umi      .
           move      zero                 to   w-let-arc-dcp-ndq      .
           move      zero                 to   w-let-arc-dcp-sts      .
       let-arc-dcp-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per determinazione buffer dei fabbisogni/dis- *
      *    * ponibilita' per un prodotto                               *
      *    *-----------------------------------------------------------*
           copy      "pgm/fab/prg/cpy/dbuffod0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per determinazione prezzo di vendita          *
      *    *-----------------------------------------------------------*
           copy      "pgm/fat/prg/cpy/dprzven0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per determinazione saldo di magazzino per     *
      *    * ubicazione                                                *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldubi0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per operazioni sulle date                     *
      *    *                                                           *
      *    * 'det-dat-nrg-000/999'                                     *
      *    *                                                           *
      *    * Routines per l'aumento di una data in giorni              *
      *    *                                                           *
      *    * Input  : w-det-dat-nrg-dtb = Data iniziale                *
      *    *                                                           *
      *    *          w-det-dat-nrg-ngi = nr. giorni di incremento     *
      *    *                                                           *
      *    *                                                           *
      *    * Output : w-det-dat-nrg-dti = Data incrementata            *
      *    *                                                           *
      *    *-----------------------------------------------------------*
      *    *                                                           *
      *    * 'det-nrg-dat-000/999'                                     *
      *    *                                                           *
      *    * Routines per la diminuzione di una data in giorni         *
      *    *                                                           *
      *    * Input  : w-det-nrg-dat-dtb = Data iniziale                *
      *    *                                                           *
      *    *          w-det-nrg-dat-ngd = nr. giorni di decremento     *
      *    *                                                           *
      *    *                                                           *
      *    * Output : w-det-nrg-dat-dtd = Data decrementata            *
      *    *                                                           *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wnrgdat0.cps"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

      *    *===========================================================*
      *    * Subroutines per accettazione codice prodotto 'dcp'        *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acoddcp0.acs"                   .

