       Identification Division.
       Program-Id.                                 pcdp3000           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    cdp                 *
      *                                Settore:    mov                 *
      *                                   Fase:    cdp300              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 12/10/92    *
      *                       Ultima revisione:    NdK del 30/04/10    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Gestione commesse di produzione             *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "cdp"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "mov"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "cdp300"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pcdp3000"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "         COMMESSE DI PRODUZIONE         "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pos-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pos-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-let-reg-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-let-reg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-ins-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-ins      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-mod-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-mod      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-vis-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-vis      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-snx-del      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pos-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pos-snx-del      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-tus.
      *            *---------------------------------------------------*
      *            * Da accettazione campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-nok      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione testata                           *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-tes      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-key-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per controllo se chiave vuota                     *
      *            *---------------------------------------------------*
               10  w-cnt-key-vuo-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-nok-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su modalita' di funzionamento      *
      *        *-------------------------------------------------------*
           05  w-cnt-mfu.
      *            *---------------------------------------------------*
      *            * Tipo impostazione                                 *
      *            * - K : Impostazione campi chiave                   *
      *            * - T : Impostazione campi testata                  *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-imp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo funzione                                     *
      *            * - I : Inserimento                                 *
      *            * - M : Modifica                                    *
      *            * - V : Visualizzazione                             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-fun      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione forzata da segreteria             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-vis-sgr      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flag di controllo su status visualizzazione titolo    *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis-tit          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione chiave                               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina testata in corso di trattamento     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-npt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Salvataggio per il campo precedente               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-svp      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Si/No pagina testata in corso di trattamento      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-snp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagine componenti la testata               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-mpt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Impostazione testata                              *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione pagine di testata                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-pte.
                   15  w-cnt-sts-imp-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Ingresso in pagine di testata                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-ing-pte.
                   15  w-cnt-sts-ing-ptx  occurs 9
                                          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts chiave                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts testata                   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts pagine di testata         *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-pte.
                   15  w-cnt-sts-pmt-ptx  occurs 9
                                          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati chiave                       *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati testata                      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati pagine di testata            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-pte.
                   15  w-cnt-sts-vis-ptx  occurs 9
                                          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per accettazioni singoli campi      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
               10  w-cnt-acc-flg-aum      pic  x(01)                  .
               10  w-cnt-acc-sav-tip      pic  x(01)                  .
               10  w-cnt-acc-sav-car      pic  9(02)                  .
               10  w-cnt-acc-sav-ldt      pic  9(02)                  .
               10  w-cnt-acc-sav-dec      pic  9(01)                  .
               10  w-cnt-acc-sav-sgn      pic  x(01)                  .
               10  w-cnt-acc-sav-edm      pic  x(10)                  .
               10  w-cnt-acc-sav-msk      pic  x(24)                  .
               10  w-cnt-acc-sav-lin      pic  9(02)                  .
               10  w-cnt-acc-sav-pos      pic  9(02)                  .
               10  w-cnt-acc-sav-alf      pic  x(80)                  .
               10  w-cnt-acc-sav-txt.
                   15  filler occurs 400  pic  x(01)                  .
               10  w-cnt-acc-sav-num      pic s9(13)v9(05)  trailing
                                                            separate
                                                            character .
               10  w-cnt-acc-sav-dat      pic  9(07)                  .
               10  w-cnt-acc-sav-ufk      pic  x(80)                  .
               10  w-cnt-acc-sav-mod      pic  x(01)                  .
               10  w-cnt-acc-sav-l23      pic  x(80)                  .
               10  w-cnt-acc-sav-l24      pic  x(80)                  .
      *        *-------------------------------------------------------*
      *        * Work area                                             *
      *        *-------------------------------------------------------*
           05  w-cnt-wrk.
               10  w-cnt-wrk-ctr-001      pic  9(05)                  .
               10  w-cnt-wrk-ctr-002      pic  9(05)                  .
               10  w-cnt-wrk-ctr-008      pic  9(05)                  .
               10  w-cnt-wrk-ctr-009      pic  9(05)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [cdp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cdp/fls/rec/rfcdp"                          .
      *        *-------------------------------------------------------*
      *        * [ycp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cdp/fls/rec/rfycp"                          .
      *        *-------------------------------------------------------*
      *        * [cdpprt]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/cdp/num/rec/rncdpprt"                       .
      *        *-------------------------------------------------------*
      *        * [cdpndo]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/cdp/num/rec/rncdpndo"                       .
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .
      *        *-------------------------------------------------------*
      *        * [dcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfdcc"                          .
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [dps]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dps/fls/rec/rfdps"                          .

      *    *===========================================================*
      *    * Work-area per bufferizzazione testata                     *
      *    *-----------------------------------------------------------*
       01  w-tes.
      *        *-------------------------------------------------------*
      *        * Valori chiave                                         *
      *        *-------------------------------------------------------*
           05  w-tes-val-key.
      *            *---------------------------------------------------*
      *            * Codice dipendenza                                 *
      *            *---------------------------------------------------*
               10  w-tes-cod-dpz          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Numero protocollo                                 *
      *            *---------------------------------------------------*
               10  w-tes-num-prt          pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Tipo movimento ordini fornitori                   *
      *            *---------------------------------------------------*
               10  w-tes-tmo-cdp          pic  x(05)                  .
               10  w-tes-tmo-cdp-des      pic  x(30)                  .
               10  w-tes-tmo-cdp-vld      pic  9(02)                  .
               10  w-tes-tmo-cdp-dpz      pic  9(02)                  .
               10  w-tes-tmo-cdp-ord      pic  9(02)                  .
               10  w-tes-tmo-cdp-prd      pic  9(02)                  .
               10  w-tes-tmo-cdp-sgl      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Data documento                                    *
      *            *---------------------------------------------------*
               10  w-tes-dat-doc          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero documento                                  *
      *            *---------------------------------------------------*
               10  w-tes-num-doc          pic  9(11)                  .
               10  w-tes-num-doc-r redefines
                   w-tes-num-doc.
                   15  w-tes-num-doc-saa  pic  9(03)                  .
                   15  w-tes-num-doc-dpz  pic  9(02)                  .
                   15  w-tes-num-doc-prg  pic  9(06)                  .
      *            *---------------------------------------------------*
      *            * Sigla numerazione                                 *
      *            *---------------------------------------------------*
               10  w-tes-sgl-num          pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Valori attuali e precedenti                           *
      *        *-------------------------------------------------------*
           05  w-tes-val-aep occurs 2.
      *            *---------------------------------------------------*
      *            * Destinazione della produzione                     *
      *            * - 01 : Per il magazzino                           *
      *            * - 02 : Per un cliente                             *
      *            *---------------------------------------------------*
               10  w-tes-dsz-prd          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice per la destinazione della produzione       *
      *            *---------------------------------------------------*
               10  w-tes-dsz-cod          pic  9(07)                  .
               10  w-tes-dsz-cod-rag      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza per la destinazione della pro-  *
      *            * duzione                                           *
      *            *---------------------------------------------------*
               10  w-tes-dsz-dpz          pic  x(04)                  .
               10  w-tes-dsz-dpz-rag      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Esecuzione della produzione                       *
      *            * - 01 : Lavorazione interna                        *
      *            * - 02 : Lavorazione esterna                        *
      *            *---------------------------------------------------*
               10  w-tes-esz-prd          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice per l'esecuzione della produzione          *
      *            *---------------------------------------------------*
               10  w-tes-esz-cod          pic  9(07)                  .
               10  w-tes-esz-cod-rag      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice dipendenza per l'esecuzione della produ-   *
      *            * zione                                             *
      *            *---------------------------------------------------*
               10  w-tes-esz-dpz          pic  x(04)                  .
               10  w-tes-esz-dpz-rag      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Data consegna prevista                            *
      *            *---------------------------------------------------*
               10  w-tes-dat-cns          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Priorita' di produzione richiesta                 *
      *            *---------------------------------------------------*
               10  w-tes-pri-prd          pic  x(02)                  .
      *            *---------------------------------------------------*
      *            * Commento alla commessa ad uso interno             *
      *            *---------------------------------------------------*
               10  w-tes-com-int.
                   15  w-tes-com-rig occurs 03
                                          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Voci descrittive in commessa                      *
      *            *                                                   *
      *            * N.B. : Campo attualmente non gestito              *
      *            *---------------------------------------------------*
               10  w-tes-voc-des occurs 06
                                          pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Tipo codice di magazzino                          *
      *            * - 01 : Prodotto di vendita                        *
      *            * - 02 : Semilavorato                               *
      *            *---------------------------------------------------*
               10  w-tes-tip-mag          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice numerico di magazzino                      *
      *            *---------------------------------------------------*
               10  w-tes-num-mag          pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice alfanumerico di magazzino                  *
      *            *---------------------------------------------------*
               10  w-tes-alf-mag          pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Descrizione di magazzino                          *
      *            *---------------------------------------------------*
               10  w-tes-des-mag          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Sigla della variante per il codice magazzino      *
      *            *                                                   *
      *            * N.B. : Campo attualmente non gestito              *
      *            *---------------------------------------------------*
               10  w-tes-sgl-vrn          pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Unita' di misura per la produzione                *
      *            *---------------------------------------------------*
               10  w-tes-umi-prd          pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Numero decimali quantita' per la produzione       *
      *            *---------------------------------------------------*
               10  w-tes-dec-qta          pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Quantita' da produrre                             *
      *            *---------------------------------------------------*
               10  w-tes-qta-dap          pic s9(06)v9(03)            .
      *            *---------------------------------------------------*
      *            * Codice dislocazione effettivo                     *
      *            *                                                   *
      *            * N.B. : Questo campo non e' gestito                *
      *            *---------------------------------------------------*
               10  w-tes-cod-dsl          pic  x(07)                  .
      *            *---------------------------------------------------*
      *            * Segnale di gestione della seconda quantita'       *
      *            *                                                   *
      *            * N.B. : Questo campo non e' gestito                *
      *            *---------------------------------------------------*
               10  w-tes-snx-2qt          pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Numero decimali per la seconda quantita'          *
      *            *                                                   *
      *            * N.B. : Questo campo non e' gestito                *
      *            *---------------------------------------------------*
               10  w-tes-dec-2qt          pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Seconda quantita'                                 *
      *            *                                                   *
      *            * N.B. : Questo campo non e' gestito                *
      *            *---------------------------------------------------*
               10  w-tes-qta-a02          pic s9(06)v9(03)            .
      *            *---------------------------------------------------*
      *            * Segnale di gestione della terza quantita'         *
      *            *                                                   *
      *            * N.B. : Questo campo non e' gestito                *
      *            *---------------------------------------------------*
               10  w-tes-snx-3qt          pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Numero decimali per la terza quantita'            *
      *            *                                                   *
      *            * N.B. : Questo campo non e' gestito                *
      *            *---------------------------------------------------*
               10  w-tes-dec-3qt          pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Terza quantita'                                   *
      *            *                                                   *
      *            * N.B. : Questo campo non e' gestito                *
      *            *---------------------------------------------------*
               10  w-tes-qta-a03          pic s9(06)v9(03)            .
      *            *---------------------------------------------------*
      *            * Numero di stampe eseguite per il documento        *
      *            *---------------------------------------------------*
               10  w-tes-ctr-stp          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Segnale di commessa comunque considerata saldata  *
      *            * - Spaces : Non considerata saldata                *
      *            * - #      : Considerata saldata                    *
      *            *---------------------------------------------------*
               10  w-tes-sdc-ccs          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di commessa completamente chiusa             *
      *            * - Spaces : Non ancora completamente chiusa        *
      *            * - #      : Completamente chiusa                   *
      *            *---------------------------------------------------*
               10  w-tes-flg-cch          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flags di elaborazione                             *
      *            *---------------------------------------------------*
               10  w-tes-flg-ela.
      *                *-----------------------------------------------*
      *                * Flags di elaborazione bloccanti               *
      *                *-----------------------------------------------*
                   15  w-tes-flg-blo.
                       20  w-tes-flg-blx occurs 07
                                          pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Flags di elaborazione non bloccanti           *
      *                *-----------------------------------------------*
                   15  w-tes-flg-nbl.
                       20  w-tes-flg-nbx occurs 03
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di sottoponibilita' a pulizia                *
      *            *---------------------------------------------------*
               10  w-tes-flg-pul          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area libera per espansioni speciali               *
      *            *---------------------------------------------------*
               10  w-tes-alx-exp.
                   15  filler  occurs 80  pic  x(01)                  .

      *    *===========================================================*
      *    * Work area per controllo di congruenza fra data e numero   *
      *    * su [cdp]                                                  *
      *    *-----------------------------------------------------------*
       01  w-cdn-cdp.
      *        *-------------------------------------------------------*
      *        * Parametri in input                                    *
      *        *-------------------------------------------------------*
           05  w-cdn-cdp-inp.
      *            *---------------------------------------------------*
      *            * Codice dipendenza                                 *
      *            *---------------------------------------------------*
               10  w-cdn-cdp-inp-dpz      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Sigla numerazione                                 *
      *            *---------------------------------------------------*
               10  w-cdn-cdp-inp-sgl      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Data                                              *
      *            *---------------------------------------------------*
               10  w-cdn-cdp-inp-dat      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero                                            *
      *            *---------------------------------------------------*
               10  w-cdn-cdp-inp-num      pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Parametri in output                                   *
      *        *-------------------------------------------------------*
           05  w-cdn-cdp-out.
      *            *---------------------------------------------------*
      *            * Flag di uscita                                    *
      *            *  - Spaces : Controllo superato                    *
      *            *  - '#'    : Incongruenza tra date e numero        *
      *            *---------------------------------------------------*
               10  w-cdn-cdp-out-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work area locale                                      *
      *        *-------------------------------------------------------*
           05  w-cdn-cdp-wax.
      *            *---------------------------------------------------*
      *            * Comodo di ridefinizione per una data              *
      *            *---------------------------------------------------*
               10  w-cdn-cdp-wad-dat      pic  9(07)                  .
               10  w-cdn-cdp-wad-r01 redefines
                   w-cdn-cdp-wad-dat.
                   15  w-cdn-cdp-wad-saa  pic  9(03)                  .
                   15  w-cdn-cdp-wad-mes  pic  9(02)                  .
                   15  w-cdn-cdp-wad-gio  pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Comodo di ridefinizione per un numero             *
      *            *---------------------------------------------------*
               10  w-cdn-cdp-wan-num      pic  9(11)                  .
               10  w-cdn-cdp-wan-r01 redefines
                   w-cdn-cdp-wan-num.
                   15  w-cdn-cdp-wan-saa  pic  9(03)                  .
                   15  w-cdn-cdp-wan-dpz  pic  9(02)                  .
                   15  w-cdn-cdp-wan-prg  pic  9(06)                  .
      *            *---------------------------------------------------*
      *            * Comodo per la sola componente 'secolo e anno'     *
      *            * della data passata come parametro in input        *
      *            *---------------------------------------------------*
               10  w-cdn-cdp-was-saa      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Comodo per la sola componente 'progressivo' del   *
      *            * numero passato come parametro in input            *
      *            *---------------------------------------------------*
               10  w-cdn-cdp-wap-prg      pic  9(06)                  .
      *            *---------------------------------------------------*
      *            * Comodo per ricostruzione completa del numero      *
      *            * numero passato come parametro in input            *
      *            *---------------------------------------------------*
               10  w-cdn-cdp-wat-num      pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Comodo per editing numero progressivo             *
      *            *---------------------------------------------------*
               10  w-cdn-cdp-wae-e01      pic  x(11)                  .
      *            *---------------------------------------------------*
      *            * Comodo per editing numero progressivo             *
      *            *---------------------------------------------------*
               10  w-cdn-cdp-wae-e02      pic  x(08)                  .

      *    *===========================================================*
      *    * Area di interfaccia per sottoprogramma         "pazi000d" *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/pazi000d.pgl"                   .

      *    *===========================================================*
      *    * Work-area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Si/No gestione semilavorati attiva                    *
      *        *-------------------------------------------------------*
           05  w-prs-dps-snx              pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Find                              *
      *    *-----------------------------------------------------------*
       01  w-fnd.
      *        *-------------------------------------------------------*
      *        * Work per Find su archivio [cdp]                       *
      *        *-------------------------------------------------------*
           05  w-fnd-arc-cdp.
               10  w-fnd-arc-cdp-sel      pic  x(01)                  .
               10  w-fnd-arc-cdp-tcp      pic  x(05)                  .
               10  w-fnd-arc-cdp-dat      pic  9(07)                  .
               10  w-fnd-arc-cdp-num      pic  9(11)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [ycp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-ycp.
               10  w-let-arc-ycp-flg      pic  x(01)                  .
               10  w-let-arc-ycp-cod      pic  x(05)                  .
               10  w-let-arc-ycp-des      pic  x(30)                  .
               10  w-let-arc-ycp-vld      pic  9(02)                  .
               10  w-let-arc-ycp-dpz      pic  9(02)                  .
               10  w-let-arc-ycp-ord      pic  9(02)                  .
               10  w-let-arc-ycp-prd      pic  9(02)                  .
               10  w-let-arc-ycp-sgl      pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [cli]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-cli.
               10  w-let-arc-cli-flg      pic  x(01)                  .
               10  w-let-arc-cli-cod      pic  9(07)                  .
               10  w-let-arc-cli-rag      pic  x(40)                  .
               10  w-let-arc-cli-via      pic  x(40)                  .
               10  w-let-arc-cli-loc      pic  x(40)                  .
               10  w-let-arc-cli-cge      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcc.
               10  w-let-arc-dcc-flg      pic  x(01)                  .
               10  w-let-arc-dcc-tle      pic  x(01)                  .
               10  w-let-arc-dcc-cod      pic  9(07)                  .
               10  w-let-arc-dcc-dpz      pic  x(04)                  .
               10  w-let-arc-dcc-rag      pic  x(40)                  .
               10  w-let-arc-dcc-via      pic  x(40)                  .
               10  w-let-arc-dcc-loc      pic  x(40)                  .
               10  w-let-arc-dcc-abi      pic  9(05)                  .
               10  w-let-arc-dcc-cab      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [fnt]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-fnt.
               10  w-let-arc-fnt-flg      pic  x(01)                  .
               10  w-let-arc-fnt-cod      pic  9(07)                  .
               10  w-let-arc-fnt-rag      pic  x(40)                  .
               10  w-let-arc-fnt-via      pic  x(40)                  .
               10  w-let-arc-fnt-loc      pic  x(40)                  .
               10  w-let-arc-fnt-piv      pic  9(11)                  .
               10  w-let-arc-fnt-stc      pic  9(07)                  .
               10  w-let-arc-fnt-ass      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcf]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcf.
               10  w-let-arc-dcf-flg      pic  x(01)                  .
               10  w-let-arc-dcf-tle      pic  x(01)                  .
               10  w-let-arc-dcf-cod      pic  9(07)                  .
               10  w-let-arc-dcf-dpz      pic  x(04)                  .
               10  w-let-arc-dcf-rag      pic  x(40)                  .
               10  w-let-arc-dcf-via      pic  x(40)                  .
               10  w-let-arc-dcf-loc      pic  x(40)                  .
               10  w-let-arc-dcf-abi      pic  9(05)                  .
               10  w-let-arc-dcf-cab      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcp.
               10  w-let-arc-dcp-flg      pic  x(01)                  .
               10  w-let-arc-dcp-cod      pic  9(07)                  .
               10  w-let-arc-dcp-des      pic  x(40)                  .
               10  w-let-arc-dcp-umi      pic  x(03)                  .
               10  w-let-arc-dcp-deq      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dps]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dps.
               10  w-let-arc-dps-flg      pic  x(01)                  .
               10  w-let-arc-dps-cod      pic  9(07)                  .
               10  w-let-arc-dps-des      pic  x(40)                  .
               10  w-let-arc-dps-umi      pic  x(03)                  .
               10  w-let-arc-dps-deq      pic  9(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det documento gia' esistente oppure no       *
      *        *-------------------------------------------------------*
           05  w-det-doc-ges.
      *            *---------------------------------------------------*
      *            * Esito della determinazione                        *
      *            * - S : Si, documento del tipo movimento cercato e  *
      *            *       e con data e numero cercato esistente in    *
      *            *       archivio                                    *
      *            * - N : No, documento del tipo movimento cercato e  *
      *            *       e con data e numero cercato non esistente   *
      *            *       in archivio                                 *
      *            * - X : No, documento del tipo movimento cercato e  *
      *            *       e con data e numero cercato non esistente   *
      *            *       in archivio, ma esistenza di un documento   *
      *            *       con data e numero cercato, con stesso co-   *
      *            *       dice numerazione, ma con diverso tipo mo-   *
      *            *       vimento da quello cercato                   *
      *            *---------------------------------------------------*
               10  w-det-doc-ges-snx      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo movimento trovato per valore precedente de-  *
      *            * terminato a 'X'                                   *
      *            *---------------------------------------------------*
               10  w-det-doc-ges-tmt      pic  x(05)                  .

      *    *===========================================================*
      *    * Work per subroutines di Att                               *
      *    *-----------------------------------------------------------*
       01  w-att.
      *        *-------------------------------------------------------*
      *        * Work per Att numero documento commesse di produzione  *
      *        *-------------------------------------------------------*
           05  w-att-cdp-ndo.
               10  w-att-cdp-ndo-flg      pic  x(01)                  .
               10  w-att-cdp-ndo-dat      pic  9(07)                  .
               10  w-att-cdp-ndo-saa      pic  9(03)                  .
               10  w-att-cdp-ndo-dpz      pic  9(02)                  .
               10  w-att-cdp-ndo-sgl      pic  x(03)                  .
               10  w-att-cdp-ndo-num      pic  9(11)                  .
               10  w-att-cdp-ndo-num-r    redefines
                   w-att-cdp-ndo-num.
                   15  filler             pic  9(03)                  .
                   15  filler             pic  9(02)                  .
                   15  w-att-cdp-ndo-prg  pic  9(06)                  .
               10  w-att-cdp-ndo-wnu      pic  9(11)                  .
               10  w-att-cdp-ndo-wnu-r    redefines
                   w-att-cdp-ndo-wnu.
                   15  w-att-cdp-ndo-wsa  pic  9(03)                  .
                   15  w-att-cdp-ndo-wdz  pic  9(02)                  .
                   15  w-att-cdp-ndo-wpr  pic  9(06)                  .
               10  w-att-cdp-ndo-new      pic  9(11)                  .
               10  w-att-cdp-ndo-nsv      pic  9(11)                  .
               10  w-att-cdp-ndo-dsv      pic  9(07)                  .
               10  w-att-cdp-ndo-wdf      pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Work per Att numero protocollo commesse di produzione *
      *        *-------------------------------------------------------*
           05  w-att-cdp-prt.
               10  w-att-cdp-prt-dat      pic  9(07)                  .
               10  w-att-cdp-prt-saa      pic  9(03)                  .
               10  w-att-cdp-prt-dpz      pic  9(02)                  .
               10  w-att-cdp-prt-num      pic  9(11)                  .
               10  w-att-cdp-prt-wnu      pic  9(11)                  .
               10  w-att-cdp-prt-wnu-r    redefines
                   w-att-cdp-prt-wnu.
                   15  w-att-cdp-prt-wsa  pic  9(03)                  .
                   15  w-att-cdp-prt-wdz  pic  9(02)                  .
                   15  w-att-cdp-prt-wpr  pic  9(06)                  .

      *    *===========================================================*
      *    * Work-area per salvataggi                                  *
      *    *-----------------------------------------------------------*
       01  w-sav.
           05  w-sav-dsz-prd              pic  9(02)                  .
           05  w-sav-dsz-cod              pic  9(07)                  .
           05  w-sav-esz-prd              pic  9(02)                  .
           05  w-sav-esz-cod              pic  9(07)                  .
           05  w-sav-tip-mag              pic  9(02)                  .
           05  w-sav-val-key.
               10  filler occurs 200      pic  x(01)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Messaggio per ratifica numero documento    *
      *        *-------------------------------------------------------*
           05  w-exp-rat-ndo.
               10  w-exp-rat-ndo-num      pic  9(02)       value 2    .
               10  w-exp-rat-ndo-lun      pic  9(02)       value 02   .
               10  w-exp-rat-ndo-tbl.
                   15  filler             pic  x(02) value
                            "Si"                                      .
                   15  filler             pic  x(02) value
                            "No"                                      .
               10  w-exp-rat-ndo-sce      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per : Destinazione della produzione              *
      *        *-------------------------------------------------------*
           05  w-exp-dsz-prd.
               10  w-exp-dsz-prd-num      pic  9(02)       value 2    .
               10  w-exp-dsz-prd-lun      pic  9(02)       value 20   .
               10  w-exp-dsz-prd-tbl.
                   15  filler             pic  x(20) value
                            "Per il magazzino    "                    .
                   15  filler             pic  x(20) value
                            "Per un cliente      "                    .
      *        *-------------------------------------------------------*
      *        * Work per : Destinazione della produzione              *
      *        *-------------------------------------------------------*
           05  w-exp-esz-prd.
               10  w-exp-esz-prd-num      pic  9(02)       value 2    .
               10  w-exp-esz-prd-lun      pic  9(02)       value 20   .
               10  w-exp-esz-prd-tbl.
                   15  filler             pic  x(20) value
                            "Lavorazione interna "                    .
                   15  filler             pic  x(20) value
                            "Lavorazione esterna "                    .
      *        *-------------------------------------------------------*
      *        * Work per : Tipo prodotto                              *
      *        *-------------------------------------------------------*
           05  w-exp-tip-mag.
               10  w-exp-tip-mag-num      pic  9(02)       value 02   .
               10  w-exp-tip-mag-lun      pic  9(02)       value 20   .
               10  w-exp-tip-mag-tbl.
                   15  filler             pic  x(20) value
                            "Prodotto di vendita "                    .
                   15  filler             pic  x(20) value
                            "Semilavorato        "                    .

      *    *===========================================================*
      *    * Work-area per valori di default                           *
      *    *-----------------------------------------------------------*
       01  w-def.
      *        *-------------------------------------------------------*
      *        * Data documento                                        *
      *        *-------------------------------------------------------*
           05  w-def-dat-doc              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Tipo movimento                                        *
      *        *-------------------------------------------------------*
           05  w-def-tmo-cdp              pic  x(05)                  .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale                         *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .

      *    *===========================================================*
      *    * Link-area per accettazione tipo movimento commesse di     *
      *    * produzione                                                *
      *    *-----------------------------------------------------------*
           copy      "pgm/cdp/prg/cpy/acdeycp0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice cliente commerciale     *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmndcc0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice dipendenza del cliente  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoddcc0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice fornitore commerciale   *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/acmndcf0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice dipendenza fornitore    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/acoddcf0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice prodotto 'dcp'          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acoddcp0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice semilavorato            *
      *    *-----------------------------------------------------------*
           copy      "pgm/dps/prg/cpy/acoddps0.acl"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di visualizzazione titolo  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-tit      .
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
       main-050.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-800.
       main-100.
      *              *-------------------------------------------------*
      *              * Accettazione campi chiave                       *
      *              *-------------------------------------------------*
           perform   acc-key-reg-000      thru acc-key-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita "E" : fine programma         *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-key    =    "E"
                     go to main-800.
      *              *-------------------------------------------------*
      *              * Lettura registrazione pre-esistente             *
      *              *-------------------------------------------------*
           perform   rou-let-reg-000      thru rou-let-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se esito negativo : riciclo su chiave       *
      *                  *---------------------------------------------*
           if        w-cnt-rou-let-reg    not  = spaces
                     go to main-100.
      *              *-------------------------------------------------*
      *              * Routine pre-accettazione campi non chiave       *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     go to main-130
           else if   w-cnt-mfu-tip-fun    =    "M"
                     go to main-140
           else if   w-cnt-mfu-tip-fun    =    "V"
                     go to main-150
           else      go to main-100.
       main-130.
           move      spaces               to   w-cnt-pre-acc-ins      .
           perform   pre-acc-ins-000      thru pre-acc-ins-999        .
           if        w-cnt-pre-acc-ins    =    spaces
                     go to main-180
           else      go to main-100.
       main-140.
           move      spaces               to   w-cnt-pre-acc-mod      .
           perform   pre-acc-mod-000      thru pre-acc-mod-999        .
           if        w-cnt-pre-acc-mod    =    spaces
                     go to main-180
           else      go to main-100.
       main-150.
           move      spaces               to   w-cnt-pre-acc-vis      .
           perform   pre-acc-vis-000      thru pre-acc-vis-999        .
           if        w-cnt-pre-acc-vis    =    spaces
                     go to main-180
           else      go to main-100.
       main-180.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di modifica di almeno un   *
      *              * campo non chiave                                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-flg-aum      .
      *              *-------------------------------------------------*
      *              * Accettazione campi non chiave                   *
      *              *-------------------------------------------------*
           perform   acc-nok-reg-000      thru acc-nok-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "E"
                     go to main-200.
      *                      *-----------------------------------------*
      *                      * Routine post-exit su campi non chiave   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se Inserimento                      *
      *                          *-------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-exi-ins-000
                                          thru pos-exi-ins-999
      *                          *-------------------------------------*
      *                          * Se Modifica                         *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-exi-mod-000
                                          thru pos-exi-mod-999
      *                          *-------------------------------------*
      *                          * Se Visualizzazione                  *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "V"
                     perform   pos-exi-vis-000
                                          thru pos-exi-vis-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-200.
      *                  *---------------------------------------------*
      *                  * Se uscita per annullamento                  *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "X"
                     go to main-300.
      *                      *-----------------------------------------*
      *                      * Routine post-conferma di annullamento   *
      *                      *-----------------------------------------*
           perform   pos-cnf-ann-000      thru pos-cnf-ann-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-300.
      *                  *---------------------------------------------*
      *                  * Se uscita per conferma                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Routine post-conferma                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se post-conferma di Inserimento     *
      *                          *-------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-cnf-ins-000
                                          thru pos-cnf-ins-999
      *                          *-------------------------------------*
      *                          * Se post-conferma di Modifica        *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-cnf-mod-000
                                          thru pos-cnf-mod-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-800.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione routine post-esecuzione programma    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pos-exe-pgm      .
           perform   pos-exe-pgm-000      thru pos-exe-pgm-999        .
           if        w-cnt-pos-exe-pgm    not  = spaces
                     go to main-050.
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Prsc :                        *
      *              * - se in tipo impostazione testata e su pagina   *
      *              *   maggiore di 1 : abilitato                     *
      *              * - altrimenti    : invariato                     *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "T" and
                     w-cnt-sts-imp-npt    >    1
                     move  "PRSC"         to   v-pfk (07)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Nxsc :                        *
      *              * - se in tipo impostazione testata e se pagina   *
      *              *   gia' completamente impostata o testata gia'   *
      *              *   completamente impostata : abilitato           *
      *              *  - altrimenti             : invariato           *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    not  = "T"
                     go to exe-acc-cmp-050.
           if        w-cnt-sts-imp-tes    not  = spaces or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     move  "NXSC"         to   v-pfk (08)             .
       exe-acc-cmp-050.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Delt :                        *
      *              *  - se Impostazione chiave    : non abilitato    *
      *              *  - se Inserimento            : non abilitato    *
      *              *  - se Visualizzazione        : non abilitato    *
      *              *  - se Almeno una modifica    : non abilitato    *
      *              *  - altrimenti                : abilitato        *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "K"   or
                     w-cnt-mfu-tip-fun    =    "I"   or
                     w-cnt-mfu-tip-fun    =    "V"   or
                     w-cnt-acc-flg-aum    not  = spaces
                     go to exe-acc-cmp-100.
           move      "DELT"               to   v-pfk (19)             .
       exe-acc-cmp-100.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Do :                          *
      *              *  - se Visualizzazione     : disabilitati        *
      *              *  - altrimenti             : inalterati          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     move  spaces         to   v-pfk (05)             .
      *              *-------------------------------------------------*
      *              * Salvataggio parametri di accettazione           *
      *              *-------------------------------------------------*
           move      v-tip                to   w-cnt-acc-sav-tip      .
           move      v-car                to   w-cnt-acc-sav-car      .
           move      v-lin                to   w-cnt-acc-sav-lin      .
           move      v-pos                to   w-cnt-acc-sav-pos      .
           if        v-tip                =    "A" or
                     v-tip                =    "U" or
                     v-tip                =    "L" or
                     v-tip                =    "E"
                     move  v-alf          to   w-cnt-acc-sav-alf      .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  v-dec          to   w-cnt-acc-sav-dec
                     move  v-sgn          to   w-cnt-acc-sav-sgn
                     move  v-edm          to   w-cnt-acc-sav-edm
                     move  v-msk          to   w-cnt-acc-sav-msk
                     move  v-num          to   w-cnt-acc-sav-num      .
           if        v-tip                =    "D"
                     move  v-dat          to   w-cnt-acc-sav-dat      .
           if        v-tip                =    "T" or
                     v-tip                =    "E"
                     move  v-ldt          to   w-cnt-acc-sav-ldt
                     move  v-txt          to   w-cnt-acc-sav-txt      .
           move      v-ufk                to   w-cnt-acc-sav-ufk      .
       exe-acc-cmp-200.
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Memorizzazione segnale di campo modificato      *
      *              *-------------------------------------------------*
           move      v-mod                to   w-cnt-acc-sav-mod      .
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "DELT"
                     go to exe-acc-cmp-800.
      *              *-------------------------------------------------*
      *              * Se il campo impostato ha modificato il valore   *
      *              * precedente : ripetizione impostazione           *
      *              *-------------------------------------------------*
           if        w-cnt-acc-sav-mod    not  = spaces
                     go to exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Routine pre-richiesta di ratifica tasto Delete  *
      *              *-------------------------------------------------*
           perform   pre-snx-del-000      thru pre-snx-del-999        .
      *              *-------------------------------------------------*
      *              * Se errore : a ripristino                        *
      *              *-------------------------------------------------*
           if        w-cnt-pre-snx-del    not  = spaces
                     go to exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Salvataggio linee 23 e 24 di note operative     *
      *              *-------------------------------------------------*
           move      "GL"                 to   v-ope                  .
           move      23                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l23      .
           move      "GL"                 to   v-ope                  .
           move      24                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l24      .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative attuali            *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      spaces               to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Richiesta conferma annullamento                 *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#DEL"               to   v-not                  .
           move      "N"                  to   v-alf                  .
           move      "SN"                 to   v-msk                  .
           move      "DELT"               to   v-pfk (19)             .
           move      "UP  "               to   v-pfk (02)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                =    spaces
                     if      v-alf        =    "S"
                             move  "DELT" to   v-key
                     else    move  "UP  " to   v-key                  .
      *              *-------------------------------------------------*
      *              * Se non function key DELT si ripristina          *
      *              *-------------------------------------------------*
           if        v-key                not  = "DELT"
                     go to exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Routine post-richiesta di ratifica tasto Delete *
      *              *-------------------------------------------------*
           perform   pos-snx-del-000      thru pos-snx-del-999        .
      *              *-------------------------------------------------*
      *              * Se errore : a ripristino                        *
      *              *-------------------------------------------------*
           if        w-cnt-pos-snx-del    not  = spaces
                     go to exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Altrimenti : uscita                             *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-999.
       exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Ripristino linee 23 e 24 di note operative      *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      w-cnt-acc-sav-l23    to   v-nt1                  .
           move      w-cnt-acc-sav-l24    to   v-nt2                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Ripristino parametri di impostazione            *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      w-cnt-acc-sav-tip    to   v-tip                  .
           move      w-cnt-acc-sav-car    to   v-car                  .
           move      w-cnt-acc-sav-lin    to   v-lin                  .
           move      w-cnt-acc-sav-pos    to   v-pos                  .
           if        v-tip                =    "A" or
                     v-tip                =    "U" or
                     v-tip                =    "L" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-alf
                                          to   v-alf                  .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-dec
                                          to   v-dec
                     move  w-cnt-acc-sav-sgn
                                          to   v-sgn
                     move  w-cnt-acc-sav-edm
                                          to   v-edm
                     move  w-cnt-acc-sav-msk
                                          to   v-msk
                     move  w-cnt-acc-sav-num
                                          to   v-num                  .
           if        v-tip                =    "D"
                     move  w-cnt-acc-sav-dat
                                          to   v-dat                  .
           if        v-tip                =    "T" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-ldt
                                          to   v-ldt
                     move  w-cnt-acc-sav-txt
                                          to   v-txt                  .
           move      w-cnt-acc-sav-ufk    to   v-ufk                  .
      *              *-------------------------------------------------*
      *              * Ritorno alla impostazione                       *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-200.
       exe-acc-cmp-800.
      *              *-------------------------------------------------*
      *              * Flag globale di avvenuta almeno una modifica    *
      *              *-------------------------------------------------*
           if        w-cnt-acc-sav-mod    not  = spaces
                     move  "#"            to   w-cnt-acc-flg-aum      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Flag di eventuale visualizzazione forzata       *
      *              *-------------------------------------------------*
           move      s-sts                to   w-cnt-mfu-vis-sgr      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Test su flag di visualizzazione titolo          *
      *              *-------------------------------------------------*
           if        w-cnt-sts-vis-tit    not  = spaces
                     move  spaces         to   w-cnt-sts-vis-tit
                     go to vis-tit-pgm-999.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione tipo funzionamento                        *
      *    *-----------------------------------------------------------*
       vis-tip-fun-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      66                   to   v-pos                  .
           if        w-cnt-mfu-tip-fun    =    "I"
                     move  "    Inserimento"
                                          to   v-alf
           else if   w-cnt-mfu-tip-fun    =    "M"
                     move  "       Modifica"
                                          to   v-alf
           else if   w-cnt-mfu-tip-fun    =    "V"
                     move  "Visualizzazione"
                                          to   v-alf
           else      move  spaces         to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Visualizzazione titolo programma                *
      *              *-------------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
           move      "#"                  to   w-cnt-sts-vis-tit      .
      *              *-------------------------------------------------*
      *              * Determinazione codici dipendenze per l'azienda  *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      "DA"                 to   w-dpz-tip-ope          .
           move      s-ter                to   w-dpz-ide-ter          .
           move      s-ute                to   w-dpz-ide-ute          .
           move      s-azi                to   w-dpz-ide-azi          .
           move      s-sap                to   w-dpz-ide-sap          .
           move      s-arg                to   w-dpz-ide-arg          .
           move      s-set                to   w-dpz-ide-set          .
           move      s-fas                to   w-dpz-ide-fas          .
           move      i-ide-des            to   w-dpz-ide-des          .
           move      s-pro                to   w-dpz-ide-pro          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
      *              *-------------------------------------------------*
      *              * Se zero dipendenze : errore ed uscita           *
      *              *-------------------------------------------------*
           if        w-dpz-ctr-dpz        >    zero
                     go to pre-exe-pgm-120.
           move      "EN"                 to   w-dpz-tip-ope          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
           move      "#"                  to   w-cnt-pre-exe-pgm      .
           go to     pre-exe-pgm-999.
       pre-exe-pgm-120.
      *              *-------------------------------------------------*
      *              * Selezione codice dipendenza per il programma    *
      *              *-------------------------------------------------*
           move      "SD"                 to   w-dpz-tip-ope          .
           call      "pgm/azi/prg/obj/pazi000d"
                                         using w-dpz                  .
           cancel    "pgm/azi/prg/obj/pazi000d"                       .
       pre-exe-pgm-180.
      *              *-------------------------------------------------*
      *              * Se scelta non effettuata : uscita               *
      *              *-------------------------------------------------*
           if        w-dpz-cod-prg        =    zero
                     move  "#"            to   w-cnt-pre-exe-pgm
                     go to pre-exe-pgm-999.
      *              *-------------------------------------------------*
      *              * Altrimenti memorizzazione in campo testata      *
      *              *-------------------------------------------------*
           move      w-dpz-cod-prg        to   w-tes-cod-dpz          .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Si/No gestione semilavorati attiva          *
      *                  *---------------------------------------------*
           perform   prs-dps-snx-000      thru prs-dps-snx-999        .
      *              *-------------------------------------------------*
      *              * Preparazione data documento                     *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-def-dat-doc          .
      *              *-------------------------------------------------*
      *              * Normalizzazione default per tipo movimento      *
      *              * ___ PERFEZIONARE ___                            *
      *              *-------------------------------------------------*
           move      "PC"                 to   w-def-tmo-cdp          .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione tipo movimento per le  *
      *              * commesse di produzione                          *
      *              *-------------------------------------------------*
           perform   cod-des-ycp-opn-000  thru cod-des-ycp-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice cliente commer- *
      *              * ciale                                           *
      *              *-------------------------------------------------*
           perform   cod-mne-dcc-opn-000  thru cod-mne-dcc-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice dipendenza del  *
      *              * cliente                                         *
      *              *-------------------------------------------------*
           perform   cod-cod-dcc-opn-000  thru cod-cod-dcc-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice fornitore com-  *
      *              * merciale                                        *
      *              *-------------------------------------------------*
           perform   cod-mne-dcf-opn-000  thru cod-mne-dcf-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice dipendenza del  *
      *              * fornitore                                       *
      *              *-------------------------------------------------*
           perform   cod-cod-dcf-opn-000  thru cod-cod-dcf-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice prodotto 'dcp'  *
      *              *-------------------------------------------------*
           perform   cod-cod-dcp-opn-000  thru cod-cod-dcp-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice prodotto 'dps'  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione semilavorati attiva        *
      *                  *---------------------------------------------*
           if        w-prs-dps-snx        not  = "S"
                     go to pre-exe-pgm-999.
      *                  *---------------------------------------------*
      *                  * Open modulo                                 *
      *                  *---------------------------------------------*
           perform   cod-cod-dps-opn-000  thru cod-cod-dps-opn-999    .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Routine post-esecuzione programma                         *
      *    *-----------------------------------------------------------*
       pos-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione tipo movimento per le *
      *              * commesse di produzione                          *
      *              *-------------------------------------------------*
           perform   cod-des-ycp-cls-000  thru cod-des-ycp-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice cliente com-   *
      *              * merciale                                        *
      *              *-------------------------------------------------*
           perform   cod-mne-dcc-cls-000  thru cod-mne-dcc-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice dipendenza del *
      *              * cliente                                         *
      *              *-------------------------------------------------*
           perform   cod-cod-dcc-cls-000  thru cod-cod-dcc-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice fornitore com- *
      *              * merciale                                        *
      *              *-------------------------------------------------*
           perform   cod-mne-dcf-cls-000  thru cod-mne-dcf-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice dipendenza del *
      *              * fornitore                                       *
      *              *-------------------------------------------------*
           perform   cod-cod-dcf-cls-000  thru cod-cod-dcf-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice prodotto 'dcp' *
      *              *-------------------------------------------------*
           perform   cod-cod-dcp-cls-000  thru cod-cod-dcp-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice prodotto 'dps' *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione semilavorati attiva        *
      *                  *---------------------------------------------*
           if        w-prs-dps-snx        not  = "S"
                     go to pos-exe-pgm-999.
      *                  *---------------------------------------------*
      *                  * Close modulo                                *
      *                  *---------------------------------------------*
           perform   cod-cod-dps-cls-000  thru cod-cod-dps-cls-999    .
       pos-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Si/No gestione semilavorati   *
      *    *                             attiva                        *
      *    *-----------------------------------------------------------*
       prs-dps-snx-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/dps[snx]"       to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-alf          to   w-prs-dps-snx
           else      move  spaces         to   w-prs-dps-snx          .
      *              *-------------------------------------------------*
      *              * Normalizzazione personalizzazione               *
      *              *-------------------------------------------------*
           if        w-prs-dps-snx        =    "S" or
                     w-prs-dps-snx        =    "N"
                     go to prs-dps-snx-999.
           move      "N"                  to   w-prs-dps-snx          .
       prs-dps-snx-999.
           exit.

      *    *===========================================================*
      *    * Open files                                                *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [cdp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
      *              *-------------------------------------------------*
      *              * [ycp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofycp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ycp                 .
      *              *-------------------------------------------------*
      *              * [cdpndo]                                        *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
      *              *-------------------------------------------------*
      *              * [cdpprt]                                        *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-prt             .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [dps]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione semilavorati attiva        *
      *                  *---------------------------------------------*
           if        w-prs-dps-snx        not  = "S"
                     go to rou-opn-fls-999.
      *                  *---------------------------------------------*
      *                  * Open file                                   *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files                                               *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [cdp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
      *              *-------------------------------------------------*
      *              * [ycp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofycp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ycp                 .
      *              *-------------------------------------------------*
      *              * [cdpndo]                                        *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
      *              *-------------------------------------------------*
      *              * [cdpprt]                                        *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-prt             .
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [dcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [dps]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se gestione semilavorati attiva        *
      *                  *---------------------------------------------*
           if        w-prs-dps-snx        not  = "S"
                     go to rou-cls-fls-999.
      *                  *---------------------------------------------*
      *                  * Open file                                   *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi chiave della registrazione             *
      *    *-----------------------------------------------------------*
       acc-key-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-fun      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo impostazione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-sts-imp-npt      .
           move      spaces               to   w-cnt-sts-imp-key
                                               w-cnt-sts-imp-tes
                                               w-cnt-sts-imp-pte
                                               w-cnt-sts-ing-pte      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key
                                               w-cnt-sts-pmt-tes
                                               w-cnt-sts-pmt-pte      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-key
                                               w-cnt-sts-vis-tes
                                               w-cnt-sts-vis-pte      .
      *              *-------------------------------------------------*
      *              * Normalizzazione registrazione                   *
      *              *-------------------------------------------------*
           perform   nor-key-nok-000      thru nor-key-nok-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           perform   pmt-key-reg-000      thru pmt-key-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per prima pagina testata            *
      *                  *---------------------------------------------*
           perform   pmt-tes-reg-000      thru pmt-tes-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : chiave                      *
      *              *-------------------------------------------------*
           move      "K"                  to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Visualizzazione data documento                  *
      *              *-------------------------------------------------*
           perform   vis-dat-doc-000      thru vis-dat-doc-999        .
       acc-key-reg-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Tipo movimento commesse di produzione       *
      *                  *---------------------------------------------*
           perform   acc-tmo-cdp-000      thru acc-tmo-cdp-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
       acc-key-reg-200.
      *                  *---------------------------------------------*
      *                  * Data documento                              *
      *                  *---------------------------------------------*
           perform   acc-dat-doc-000      thru acc-dat-doc-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-100.
       acc-key-reg-300.
      *                  *---------------------------------------------*
      *                  * Numero documento                            *
      *                  *---------------------------------------------*
           perform   acc-num-doc-000      thru acc-num-doc-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-200.
       acc-key-reg-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-key      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visual. dati chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-key      .
      *              *-------------------------------------------------*
      *              * Test se chiave vuota                            *
      *              *-------------------------------------------------*
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-key-reg-999.
      *              *-------------------------------------------------*
      *              * Controllo globale su tasto Do su chiave         *
      *              *-------------------------------------------------*
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-key-reg-100.
           move      "S"                  to   w-cnt-tus-acc-key      .
       acc-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campi chiave della registrazione          *
      *    *-----------------------------------------------------------*
       vis-key-reg-000.
      *              *-------------------------------------------------*
      *              * Tipo movimento                                  *
      *              *-------------------------------------------------*
           perform   vis-tmo-cdp-000      thru vis-tmo-cdp-999        .
           perform   vis-tmo-cdp-des-000  thru vis-tmo-cdp-des-999    .
      *              *-------------------------------------------------*
      *              * Data documento                                  *
      *              *-------------------------------------------------*
           perform   vis-dat-doc-000      thru vis-dat-doc-999        .
      *              *-------------------------------------------------*
      *              * Numero documento                                *
      *              *-------------------------------------------------*
           perform   vis-num-doc-000      thru vis-num-doc-999        .
       vis-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per campi chiave                  *
      *    *-----------------------------------------------------------*
       pmt-key-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate dalla chiave              *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      06                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Visualizzazioni prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo movimento                              *
      *                  *---------------------------------------------*
           perform   pmt-tmo-cdp-000      thru pmt-tmo-cdp-999        .
      *                  *---------------------------------------------*
      *                  * Data documento                              *
      *                  *---------------------------------------------*
           perform   pmt-dat-doc-000      thru pmt-dat-doc-999        .
      *                  *---------------------------------------------*
      *                  * Numero documento                            *
      *                  *---------------------------------------------*
           perform   pmt-num-doc-000      thru pmt-num-doc-999        .
      *              *-------------------------------------------------*
      *              * Linea di trattini di separazione                *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per tipo movimento                *
      *    *-----------------------------------------------------------*
       pmt-tmo-cdp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      16                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo movimento :"   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-tmo-cdp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per data documento                *
      *    *-----------------------------------------------------------*
       pmt-dat-doc-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      16                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      56                   to   v-pos                  .
           move      "Data documento :"   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-dat-doc-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per numero documento              *
      *    *-----------------------------------------------------------*
       pmt-num-doc-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      16                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      56                   to   v-pos                  .
           move      "Nr.  documento :"   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-num-doc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo chiave : Tipo movimento per commesse   *
      *    * di produzione                                             *
      *    *-----------------------------------------------------------*
       acc-tmo-cdp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione valore di default              *
      *                  *---------------------------------------------*
           if        w-tes-tmo-cdp        not  = spaces
                     go to acc-tmo-cdp-100.
           move      w-def-tmo-cdp        to   w-tes-tmo-cdp          .
       acc-tmo-cdp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-des-ycp-ope      .
           move      w-tes-tmo-cdp        to   w-cod-des-ycp-cod      .
           move      04                   to   w-cod-des-ycp-lin      .
           move      18                   to   w-cod-des-ycp-pos      .
           move      04                   to   w-cod-des-ycp-dln      .
           move      24                   to   w-cod-des-ycp-dps      .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-des-ycp-cll-000  thru cod-des-ycp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-des-ycp-foi-000  thru cod-des-ycp-foi-999    .
       acc-tmo-cdp-110.
           perform   cod-des-ycp-cll-000  thru cod-des-ycp-cll-999    .
           if        w-cod-des-ycp-ope    =    "F+"
                     go to acc-tmo-cdp-115.
           if        w-cod-des-ycp-ope    =    "AC"
                     go to acc-tmo-cdp-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-tmo-cdp-115.
           perform   cod-des-ycp-foi-000  thru cod-des-ycp-foi-999    .
           go to     acc-tmo-cdp-110.
       acc-tmo-cdp-120.
           move      w-cod-des-ycp-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-tmo-cdp-999.
       acc-tmo-cdp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-tmo-cdp          .
       acc-tmo-cdp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test che non ci siano blanks embedded       *
      *                  *---------------------------------------------*
           move      w-tes-tmo-cdp        to   w-all-str-alf          .
           move      05                   to   w-all-str-lun          .
           perform   all-str-ble-000      thru all-str-ble-999        .
           if        w-all-str-flg        not  = spaces
                     go to acc-tmo-cdp-100.
      *                  *---------------------------------------------*
      *                  * Lettura archivio [ycp]                      *
      *                  *---------------------------------------------*
           move      w-tes-tmo-cdp        to   w-let-arc-ycp-cod      .
           perform   let-arc-ycp-000      thru let-arc-ycp-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valori associati al tipo    *
      *                  * movimento ordini fornitori                  *
      *                  *---------------------------------------------*
           move      w-let-arc-ycp-des    to   w-tes-tmo-cdp-des      .
           move      w-let-arc-ycp-vld    to   w-tes-tmo-cdp-vld      .
           move      w-let-arc-ycp-dpz    to   w-tes-tmo-cdp-dpz      .
           move      w-let-arc-ycp-ord    to   w-tes-tmo-cdp-ord      .
           move      w-let-arc-ycp-prd    to   w-tes-tmo-cdp-prd      .
           move      w-let-arc-ycp-sgl    to   w-tes-tmo-cdp-sgl      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-tmo-cdp-des-000  thru vis-tmo-cdp-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-ycp-flg    not  = spaces
                     go to acc-tmo-cdp-100.
      *                  *---------------------------------------------*
      *                  * Se a spaces : reimpostazione                *
      *                  *---------------------------------------------*
           if        w-tes-tmo-cdp        =    spaces
                     go to acc-tmo-cdp-100.
      *                  *---------------------------------------------*
      *                  * Test su codice dipendenza                   *
      *                  *---------------------------------------------*
           if        w-tes-tmo-cdp-vld    not  = 02
                     go to acc-tmo-cdp-420.
           if        w-tes-cod-dpz        =    w-tes-tmo-cdp-dpz
                     go to acc-tmo-cdp-420.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Tipo movimento incompatibile con il codice dipende
      -              "nza ! "             to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-tmo-cdp-100.
       acc-tmo-cdp-420.
      *                  *---------------------------------------------*
      *                  * Controllo tipo origine del documento        *
      *                  *---------------------------------------------*
           if        w-tes-tmo-cdp-ord    =   01
                     go to acc-tmo-cdp-600.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Tipo movimento non gestibile da questo programma !
      -              "      "             to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-tmo-cdp-100.
       acc-tmo-cdp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-tmo-cdp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-tmo-cdp-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-tmo-cdp-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-tmo-cdp-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-tmo-cdp-999.
       acc-tmo-cdp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo chiave : tipo movimento per commes- *
      *    * se di produzione                                          *
      *    *-----------------------------------------------------------*
       vis-tmo-cdp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      18                   to   v-pos                  .
           move      w-tes-tmo-cdp        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tmo-cdp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo chiave : descrizione tipo movimento *
      *    * per commesse di produzione                                *
      *    *-----------------------------------------------------------*
       vis-tmo-cdp-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      30                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      24                   to   v-pos                  .
           move      w-tes-tmo-cdp-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tmo-cdp-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo chiave : Data documento                *
      *    *-----------------------------------------------------------*
       acc-dat-doc-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Eventuale preparazione del valore di de-    *
      *                  * fault                                       *
      *                  *---------------------------------------------*
           if        w-tes-dat-doc        =    zero
                     move  w-def-dat-doc  to   w-tes-dat-doc          .
       acc-dat-doc-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      04                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-dat-doc        to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dat-doc-999.
       acc-dat-doc-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   w-tes-dat-doc          .
      *              *-------------------------------------------------*
      *              * Se Find                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "FIND"
                     go to acc-dat-doc-400.
      *                  *---------------------------------------------*
      *                  * Find su archivio [cdp]                      *
      *                  *---------------------------------------------*
           perform   fnd-arc-cdp-000      thru fnd-arc-cdp-999        .
           if        w-fnd-arc-cdp-sel    not  = spaces
                     go to acc-dat-doc-100.
      *                  *---------------------------------------------*
      *                  * Forzatura function-key Do                   *
      *                  *---------------------------------------------*
           move      "DO  "               to   v-key                  .
       acc-dat-doc-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore a zero : reimpostazione, a meno   *
      *                  * che non si sia su Up                        *
      *                  *---------------------------------------------*
           if        w-tes-dat-doc        not  = zero
                     go to acc-dat-doc-600.
           if        v-key                =    "UP  "
                     go to acc-dat-doc-600
           else      go to acc-dat-doc-100.
       acc-dat-doc-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dat-doc-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-dat-doc-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-dat-doc-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-dat-doc-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-dat-doc-999.
       acc-dat-doc-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo chiave : Data documento             *
      *    *-----------------------------------------------------------*
       vis-dat-doc-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      04                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      w-tes-dat-doc        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dat-doc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo chiave : Numero documento              *
      *    *-----------------------------------------------------------*
       acc-num-doc-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-num-doc-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      05                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           move      w-tes-num-doc-prg    to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-num-doc-999.
       acc-num-doc-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-num-doc-prg      .
      *              *-------------------------------------------------*
      *              * Se Find                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "FIND"
                     go to acc-num-doc-400.
      *                  *---------------------------------------------*
      *                  * Find su archivio [cdp]                      *
      *                  *---------------------------------------------*
           perform   fnd-arc-cdp-000      thru fnd-arc-cdp-999        .
           if        w-fnd-arc-cdp-sel    not  = spaces
                     go to acc-num-doc-100.
      *                  *---------------------------------------------*
      *                  * Forzatura function-key Do                   *
      *                  *---------------------------------------------*
           move      "DO  "               to   v-key                  .
       acc-num-doc-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-num-doc-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-num-doc-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-num-doc-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-num-doc-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-num-doc-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-num-doc-999.
       acc-num-doc-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo chiave : Numero documento           *
      *    *-----------------------------------------------------------*
       vis-num-doc-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      05                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      w-tes-num-doc-prg    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-num-doc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi non chiave della registrazione         *
      *    *-----------------------------------------------------------*
       acc-nok-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-nok      .
      *              *-------------------------------------------------*
      *              * Visualizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           perform   vis-tip-fun-000      thru vis-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione se in modi- *
      *              * fica o visualizzazione, per testata             *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M" or
                     w-cnt-mfu-tip-fun    =    "V"
                     move  "#"            to   w-cnt-sts-imp-tes
                     move  all "#"        to   w-cnt-sts-imp-pte
                     move  all "#"        to   w-cnt-sts-ing-pte      .
       acc-nok-reg-200.
      *              *-------------------------------------------------*
      *              * Trattamento testata                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione del numero di pagine che     *
      *                  * compongono la testata                       *
      *                  *---------------------------------------------*
           perform   dmp-tes-reg-000      thru dmp-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-key    =    spaces
                     perform pmt-key-reg-000
                                          thru pmt-key-reg-999
                     move    "#"          to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati campi chiave           *
      *                  *---------------------------------------------*
           if        w-cnt-sts-vis-key    =    spaces
                     perform vis-key-reg-000
                                          thru vis-key-reg-999
                     move    "#"          to   w-cnt-sts-vis-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per pagina di testata               *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-ptx
                    (w-cnt-sts-imp-npt)   =    spaces
                     perform pmt-tes-reg-000
                                          thru pmt-tes-reg-999
                     move    "#"          to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati pagina testata         *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M"      or
                     w-cnt-mfu-tip-fun    =    "V"      or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces or
                     w-cnt-sts-ing-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     if    w-cnt-sts-vis-ptx
                          (w-cnt-sts-imp-npt)
                                          =    spaces
                           perform vis-tes-reg-000
                                          thru vis-tes-reg-999
                           move    "#"    to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Flag di ingresso in pagina di testata       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-ing-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Accettazione dati testata                   *
      *                  *---------------------------------------------*
           perform   acc-tes-reg-000      thru acc-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita definitivo                   *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "S" or
                     w-cnt-tus-acc-tes    =    "X" or
                     w-cnt-tus-acc-tes    =    "E"
                     move  w-cnt-tus-acc-tes
                                          to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999.
      *                  *---------------------------------------------*
      *                  * Se spostamento di pagina                    *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "-"
                     go to acc-nok-reg-300
           else      go to acc-nok-reg-400.
       acc-nok-reg-300.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina precedente      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' 1 si ignora *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  > 1
                     go to acc-nok-reg-200.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina attuale a : no    *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
       acc-nok-reg-325.
      *                          *-------------------------------------*
      *                          * Decremento numero pagina attuale    *
      *                          *-------------------------------------*
           subtract  1                    from w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : decremento ulteriore        *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces and
                     w-cnt-sts-imp-npt    >    1
                     go to acc-nok-reg-325.
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-400.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina successiva      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Salvataggio numero pagina attuale   *
      *                          *-------------------------------------*
           move      w-cnt-sts-imp-npt    to   w-cnt-sts-imp-svp      .
       acc-nok-reg-425.
      *                          *-------------------------------------*
      *                          * Status di impostazione dati della   *
      *                          * della pagina attuale a : si'        *
      *                          *-------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si pone lo status di impostazione   *
      *                          * dati generale testata a si'         *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  "#"            to   w-cnt-sts-imp-tes      .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si va' a conferma impostazioni      *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  w-cnt-sts-imp-svp
                                          to   w-cnt-sts-imp-npt
                     go to acc-nok-reg-800.
      *                          *-------------------------------------*
      *                          * Incremento numero pagina attuale    *
      *                          *-------------------------------------*
           add       1                    to   w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : a re-incremento             *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces
                     go to acc-nok-reg-425.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina impostata a : no  *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-svp)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-svp)     .
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-800.
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-nok-reg-810.
      *                  *---------------------------------------------*
      *                  * Test se sola visualizzazione                *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to acc-nok-reg-820
           else      go to acc-nok-reg-830.
       acc-nok-reg-820.
      *                      *-----------------------------------------*
      *                      * Accettazione se sola visualizzazione    *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#VIS"               to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "E"                  to   v-msk                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "E"
                     move  "EXIT"         to   v-key                  .
           go to     acc-nok-reg-840.
       acc-nok-reg-830.
      *                      *-----------------------------------------*
      *                      * Accettazione se inserimento o modifica  *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#SAV"               to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-nok-reg-840.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-nok-reg-850
           else if   v-key                =    "EXIT"
                     go to acc-nok-reg-860
           else if   v-key                =    "UP  "
                     go to acc-nok-reg-870
           else      go to acc-nok-reg-810.
       acc-nok-reg-850.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   cnt-tdo-nok-000      thru cnt-tdo-nok-999        .
           if        w-cnt-tdo-nok-flg    =    spaces
                     move  "S"            to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999
           else      move  spaces         to   w-cnt-tdo-nok-flg
                     go to acc-nok-reg-800.
       acc-nok-reg-860.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-nok      .
           go to     acc-nok-reg-999.
       acc-nok-reg-870.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazione testata                 *
      *                      *-----------------------------------------*
           move      spaces               to   v-key                  .
           go to     acc-nok-reg-200.
       acc-nok-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione numero pagine che compongono la testata    *
      *    *-----------------------------------------------------------*
       dmp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * La testata e' composta di nr. 4 pagine          *
      *              *-------------------------------------------------*
           move      4                    to   w-cnt-sts-imp-mpt      .
       dmp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione si/no pagina w-cnt-sts-imp-npt da trattare *
      *    *-----------------------------------------------------------*
       snp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Flag di uscita a Si                             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-snp      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del numero pagina        *
      *              *-------------------------------------------------*
           go to     snp-tes-reg-100
                     snp-tes-reg-200
                     snp-tes-reg-300
                     snp-tes-reg-400
                     depending            on   w-cnt-sts-imp-npt      .
           go to     snp-tes-reg-999.
       snp-tes-reg-100.
      *              *-------------------------------------------------*
      *              * Pagina 1 : sempre accettata                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-snp      .
           go to     snp-tes-reg-999.
       snp-tes-reg-200.
      *              *-------------------------------------------------*
      *              * Pagina 2 : attualmente non accettata            *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-snp      .
           go to     snp-tes-reg-999.
       snp-tes-reg-300.
      *              *-------------------------------------------------*
      *              * Pagina 3 : attualmente non accettata            *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-snp      .
           go to     snp-tes-reg-999.
       snp-tes-reg-400.
      *              *-------------------------------------------------*
      *              * Pagina 4 : sempre accettata                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-snp      .
           go to     snp-tes-reg-999.
       snp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione testata registrazione                        *
      *    *-----------------------------------------------------------*
       acc-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-tes      .
      *              *-------------------------------------------------*
      *              * Normalizzazione function-key                    *
      *              *-------------------------------------------------*
           move      spaces               to   v-key                  .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : testata                     *
      *              *-------------------------------------------------*
           move      "T"                  to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del numero pagina    *
      *                  *---------------------------------------------*
           go to     acc-tes-reg-100
                     acc-tes-reg-200
                     acc-tes-reg-300
                     acc-tes-reg-400
                     depending            on   w-cnt-sts-imp-npt      .
           go to     acc-tes-reg-999.
       acc-tes-reg-100.
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Destinazione della produzione               *
      *                  *---------------------------------------------*
           perform   acc-dsz-prd-000      thru acc-dsz-prd-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
       acc-tes-reg-110.
      *                  *---------------------------------------------*
      *                  * Codice per la destinazione della produzione *
      *                  *---------------------------------------------*
           perform   acc-dsz-cod-000      thru acc-dsz-cod-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-100.
       acc-tes-reg-120.
      *                  *---------------------------------------------*
      *                  * Codice dipendenza per la destinazione della *
      *                  * produzione                                  *
      *                  *---------------------------------------------*
           perform   acc-dsz-dpz-000      thru acc-dsz-dpz-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-110.
       acc-tes-reg-130.
      *                  *---------------------------------------------*
      *                  * Esecuzione della produzione                 *
      *                  *---------------------------------------------*
           perform   acc-esz-prd-000      thru acc-esz-prd-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-120.
       acc-tes-reg-140.
      *                  *---------------------------------------------*
      *                  * Codice per l'esecuzione della produzione    *
      *                  *---------------------------------------------*
           perform   acc-esz-cod-000      thru acc-esz-cod-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-130.
       acc-tes-reg-150.
      *                  *---------------------------------------------*
      *                  * Codice dipendenza per l'esecuzione della    *
      *                  * produzione                                  *
      *                  *---------------------------------------------*
           perform   acc-esz-dpz-000      thru acc-esz-dpz-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-140.
       acc-tes-reg-160.
      *                  *---------------------------------------------*
      *                  * Data consegna prevista                      *
      *                  *---------------------------------------------*
           perform   acc-dat-cns-000      thru acc-dat-cns-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-150.
       acc-tes-reg-170.
      *                  *---------------------------------------------*
      *                  * Priorita' di produzione richiesta           *
      *                  *---------------------------------------------*
           perform   acc-pri-prd-000      thru acc-pri-prd-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-160.
      *                  *---------------------------------------------*
      *                  * Presa visione per pagina 1                  *
      *                  *---------------------------------------------*
           perform   acc-pre-vpg-000      thru acc-pre-vpg-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "PRSC"
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-170.
      *                  *---------------------------------------------*
      *                  * Fine Pagina                                 *
      *                  *---------------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-tes      .
           go to     acc-tes-reg-999.
       acc-tes-reg-200.
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
       acc-tes-reg-300.
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
       acc-tes-reg-400.
      *                  *---------------------------------------------*
      *                  * Tipo codice di magazzino                    *
      *                  *---------------------------------------------*
           perform   acc-tip-mag-000      thru acc-tip-mag-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "PRSC"
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     move  "-"            to   w-cnt-tus-acc-tes
                     go to acc-tes-reg-999.
       acc-tes-reg-410.
      *                  *---------------------------------------------*
      *                  * Codice di magazzino                         *
      *                  *---------------------------------------------*
           perform   acc-cod-mag-000      thru acc-cod-mag-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "PRSC"
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-400.
       acc-tes-reg-420.
      *                  *---------------------------------------------*
      *                  * Quantita' da produrre                       *
      *                  *---------------------------------------------*
           perform   acc-qta-dap-000      thru acc-qta-dap-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "PRSC"
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-410.
       acc-tes-reg-430.
      *                  *---------------------------------------------*
      *                  * Commento alla commessa ad uso interno       *
      *                  *---------------------------------------------*
           perform   acc-com-int-000      thru acc-com-int-999        .
           if        v-key                =    "NXSC"
                     move  "+"            to   w-cnt-tus-acc-tes      .
           if        v-key                =    "PRSC"
                     move  "-"            to   w-cnt-tus-acc-tes      .
           if        w-cnt-tus-acc-tes    not  = spaces
                     go to acc-tes-reg-999.
           if        v-key                =    "UP  "
                     go to acc-tes-reg-420.
       acc-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione testata registrazione                     *
      *    *-----------------------------------------------------------*
       vis-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del numero pagina        *
      *              *-------------------------------------------------*
           go to     vis-tes-reg-100
                     vis-tes-reg-200
                     vis-tes-reg-300
                     vis-tes-reg-400
                     depending            on   w-cnt-sts-imp-npt      .
           go to     vis-tes-reg-999.
       vis-tes-reg-100.
      *              *-------------------------------------------------*
      *              * Destinazione della produzione                   *
      *              *-------------------------------------------------*
           perform   vis-dsz-prd-000      thru vis-dsz-prd-999        .
      *              *-------------------------------------------------*
      *              * Codice per la destinazione della produzione     *
      *              *-------------------------------------------------*
           perform   vis-dsz-cod-000      thru vis-dsz-cod-999        .
           perform   vis-dsz-cod-rag-000  thru vis-dsz-cod-rag-999    .
      *              *-------------------------------------------------*
      *              * Codice dipendenza per la destinazione della     *
      *              * produzione                                      *
      *              *-------------------------------------------------*
           perform   vis-dsz-dpz-000      thru vis-dsz-dpz-999        .
           perform   vis-dsz-dpz-rag-000  thru vis-dsz-dpz-rag-999    .
      *              *-------------------------------------------------*
      *              * Esecuzione della produzione                     *
      *              *-------------------------------------------------*
           perform   vis-esz-prd-000      thru vis-esz-prd-999        .
      *              *-------------------------------------------------*
      *              * Codice per l'esecuzione della produzione        *
      *              *-------------------------------------------------*
           perform   vis-esz-cod-000      thru vis-esz-cod-999        .
           perform   vis-esz-cod-rag-000  thru vis-esz-cod-rag-999    .
      *              *-------------------------------------------------*
      *              * Codice dipendenza per l'esecuzione della produ- *
      *              * zione                                           *
      *              *-------------------------------------------------*
           perform   vis-esz-dpz-000      thru vis-esz-dpz-999        .
           perform   vis-esz-dpz-rag-000  thru vis-esz-dpz-rag-999    .
      *              *-------------------------------------------------*
      *              * Data consegna prevista                          *
      *              *-------------------------------------------------*
           perform   vis-dat-cns-000      thru vis-dat-cns-999        .
      *              *-------------------------------------------------*
      *              * Priorita' di produzione richiesta               *
      *              *-------------------------------------------------*
           perform   vis-pri-prd-000      thru vis-pri-prd-999        .
           go to     vis-tes-reg-999.
       vis-tes-reg-200.
           go to     vis-tes-reg-999.
       vis-tes-reg-300.
           go to     vis-tes-reg-999.
       vis-tes-reg-400.
      *              *-------------------------------------------------*
      *              * Tipo codice di magazzino                        *
      *              *-------------------------------------------------*
           perform   vis-tip-mag-000      thru vis-tip-mag-999        .
      *              *-------------------------------------------------*
      *              * Codice di magazzino                             *
      *              *-------------------------------------------------*
           perform   vis-cod-mag-000      thru vis-cod-mag-999        .
           perform   vis-des-mag-000      thru vis-des-mag-999        .
      *              *-------------------------------------------------*
      *              * Unita' di misura per la produzione              *
      *              *-------------------------------------------------*
           perform   vis-umi-prd-000      thru vis-umi-prd-999        .
      *              *-------------------------------------------------*
      *              * Quantita' da produrre                           *
      *              *-------------------------------------------------*
           perform   vis-qta-dap-000      thru vis-qta-dap-999        .
      *              *-------------------------------------------------*
      *              * Commento alla commessa ad uso interno           *
      *              *-------------------------------------------------*
           perform   vis-com-int-000      thru vis-com-int-999        .
           go to     vis-tes-reg-999.
       vis-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts testata                           *
      *    *-----------------------------------------------------------*
       pmt-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate                           *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      07                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del numero pagina        *
      *              *-------------------------------------------------*
           go to     pmt-tes-reg-100
                     pmt-tes-reg-200
                     pmt-tes-reg-300
                     pmt-tes-reg-400
                     depending            on   w-cnt-sts-imp-npt      .
           go to     pmt-tes-reg-999.
       pmt-tes-reg-100.
      *              *-------------------------------------------------*
      *              * Destinazione della produzione                   *
      *              *-------------------------------------------------*
           perform   pmt-dsz-prd-000      thru pmt-dsz-prd-999        .
      *              *-------------------------------------------------*
      *              * Codice per la destinazione della produzione     *
      *              *-------------------------------------------------*
           perform   pmt-dsz-cod-000      thru pmt-dsz-cod-999        .
      *              *-------------------------------------------------*
      *              * Codice dipendenza per la destinazione della     *
      *              * produzione                                      *
      *              *-------------------------------------------------*
           perform   pmt-dsz-dpz-000      thru pmt-dsz-dpz-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione della produzione                     *
      *              *-------------------------------------------------*
           perform   pmt-esz-prd-000      thru pmt-esz-prd-999        .
      *              *-------------------------------------------------*
      *              * Codice per l'esecuzione della produzione        *
      *              *-------------------------------------------------*
           perform   pmt-esz-cod-000      thru pmt-esz-cod-999        .
      *              *-------------------------------------------------*
      *              * Codice dipendenza per l'esecuzione della produ- *
      *              * zione                                           *
      *              *-------------------------------------------------*
           perform   pmt-esz-dpz-000      thru pmt-esz-dpz-999        .
      *              *-------------------------------------------------*
      *              * Data consegna prevista                          *
      *              *-------------------------------------------------*
           perform   pmt-dat-cns-000      thru pmt-dat-cns-999        .
      *              *-------------------------------------------------*
      *              * Priorita' di produzione richiesta               *
      *              *-------------------------------------------------*
           perform   pmt-pri-prd-000      thru pmt-pri-prd-999        .
           go to     pmt-tes-reg-999.
       pmt-tes-reg-200.
           go to     pmt-tes-reg-999.
       pmt-tes-reg-300.
           go to     pmt-tes-reg-999.
       pmt-tes-reg-400.
      *              *-------------------------------------------------*
      *              * Tipo codice di magazzino                        *
      *              *-------------------------------------------------*
           perform   pmt-tip-mag-000      thru pmt-tip-mag-999        .
      *              *-------------------------------------------------*
      *              * Codice di magazzino                             *
      *              *-------------------------------------------------*
           perform   pmt-cod-mag-000      thru pmt-cod-mag-999        .
      *              *-------------------------------------------------*
      *              * Quantita' da produrre                           *
      *              *-------------------------------------------------*
           perform   pmt-qta-dap-000      thru pmt-qta-dap-999        .
      *              *-------------------------------------------------*
      *              * Commento alla commessa ad uso interno           *
      *              *-------------------------------------------------*
           perform   pmt-com-int-000      thru pmt-com-int-999        .
           go to     pmt-tes-reg-999.
       pmt-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Destinazione produzione          *
      *    *-----------------------------------------------------------*
       pmt-dsz-prd-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Destinazione produzione    :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dsz-prd-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice per la destinazione della *
      *    * produzione                                                *
      *    *-----------------------------------------------------------*
       pmt-dsz-cod-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Cliente                    :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dsz-cod-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice dipendenza per la desti-  *
      *    * nazione della produzione                                  *
      *    *-----------------------------------------------------------*
       pmt-dsz-dpz-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Sua dipendenza             :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dsz-dpz-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Esecuzione della produzione      *
      *    *-----------------------------------------------------------*
       pmt-esz-prd-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Esecuzione produzione      :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-esz-prd-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice per l'esecuzione della    *
      *    * produzione                                                *
      *    *-----------------------------------------------------------*
       pmt-esz-cod-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Fornitore                  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-esz-cod-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice dipendenza per l'esecu-   *
      *    * zione della produzione                                    *
      *    *-----------------------------------------------------------*
       pmt-esz-dpz-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Sua dipendenza             :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-esz-dpz-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Data consegna prevista           *
      *    *-----------------------------------------------------------*
       pmt-dat-cns-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data consegna prevista     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dat-cns-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Priorita' di produzione richie-  *
      *    * sta                                                       *
      *    *-----------------------------------------------------------*
       pmt-pri-prd-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Priorita' di produzione    :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-pri-prd-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Tipo codice di magazzino         *
      *    *-----------------------------------------------------------*
       pmt-tip-mag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      24                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo   prodotto        :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-tip-mag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice di magazzino              *
      *    *-----------------------------------------------------------*
       pmt-cod-mag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      24                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice prodotto        :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cod-mag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Quantita' da produrre            *
      *    *-----------------------------------------------------------*
       pmt-qta-dap-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      24                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Quantita' da produrre  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-qta-dap-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Commento ad uso interno          *
      *    *-----------------------------------------------------------*
       pmt-com-int-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      26                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Commento               :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-com-int-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Presa visione per pagina     *
      *    *-----------------------------------------------------------*
       acc-pre-vpg-000.
      *              *-------------------------------------------------*
      *              * Se non esiste alcuna pagina attiva successiva   *
      *              * alla pagina attuale : uscita                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio numero pagina attuale           *
      *                  *---------------------------------------------*
           move      w-cnt-sts-imp-npt    to   w-cnt-sts-imp-svp      .
       acc-pre-vpg-100.
      *                  *---------------------------------------------*
      *                  * Se all'ultima pagina : ripristino pagina    *
      *                  * salvata ed uscita                           *
      *                  *---------------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  w-cnt-sts-imp-svp
                                          to   w-cnt-sts-imp-npt
                     go to acc-pre-vpg-999.
      *                  *---------------------------------------------*
      *                  * Incremento numero pagina                    *
      *                  *---------------------------------------------*
           add       1                    to   w-cnt-sts-imp-npt      .
      *                  *---------------------------------------------*
      *                  * Test se pagina da trattare                  *
      *                  *---------------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se no : a re-incremento                     *
      *                  *---------------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces
                     go to acc-pre-vpg-100.
      *                  *---------------------------------------------*
      *                  * Se si : ripristino pagina salvata e accet-  *
      *                  * tazione presa visione                       *
      *                  *---------------------------------------------*
           move      w-cnt-sts-imp-svp    to   w-cnt-sts-imp-npt      .
       acc-pre-vpg-200.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      spaces               to   v-msk                  .
           move      spaces               to   v-alf                  .
           move      spaces               to   v-not                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-pre-vpg-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-pre-vpg-000.
       acc-pre-vpg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Destinazione della produzio- *
      *    * ne                                                        *
      *    *-----------------------------------------------------------*
       acc-dsz-prd-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-tes-dsz-prd (1)    to   w-sav-dsz-prd          .
       acc-dsz-prd-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-dsz-prd-lun    to   v-car                  .
           move      w-exp-dsz-prd-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      07                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-dsz-prd-tbl    to   v-txt                  .
           move      w-tes-dsz-prd (1)    to   v-num                  .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-dsz-prd-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-dsz-prd-999.
       acc-dsz-prd-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-dsz-prd (1)      .
       acc-dsz-prd-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore a zero non ammesso                   *
      *                  *---------------------------------------------*
           if        w-tes-dsz-prd (1)    =    zero
                     go to acc-dsz-prd-100.
       acc-dsz-prd-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore attuale come precedente : oltre   *
      *                  *---------------------------------------------*
           if        w-tes-dsz-prd (1)    =    w-sav-dsz-prd
                     go to acc-dsz-prd-800.
      *                  *---------------------------------------------*
      *                  * Se valore attuale a 02 : oltre              *
      *                  *---------------------------------------------*
           if        w-tes-dsz-prd (1)    =    02
                     go to acc-dsz-prd-800.
      *                  *---------------------------------------------*
      *                  * Normalizzazione codice cliente              *
      *                  *---------------------------------------------*
           move      zero                 to   w-tes-dsz-cod (1)      .
           move      spaces               to   w-tes-dsz-cod-rag (1)  .
           perform   vis-dsz-cod-000      thru vis-dsz-cod-999        .
           perform   vis-dsz-cod-rag-000  thru vis-dsz-cod-rag-999    .
      *                  *---------------------------------------------*
      *                  * Normalizzazione dipendenza cliente          *
      *                  *---------------------------------------------*
           move      spaces               to   w-tes-dsz-dpz (1)      .
           move      spaces               to   w-tes-dsz-dpz-rag (1)  .
           perform   vis-dsz-dpz-000      thru vis-dsz-dpz-999        .
           perform   vis-dsz-dpz-rag-000  thru vis-dsz-dpz-rag-999    .
       acc-dsz-prd-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-dsz-prd-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-dsz-prd-100.
       acc-dsz-prd-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Destinazione della produ- *
      *    * zione                                                     *
      *    *-----------------------------------------------------------*
       vis-dsz-prd-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-dsz-prd-lun    to   v-car                  .
           move      w-exp-dsz-prd-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      07                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-dsz-prd-tbl    to   v-txt                  .
           move      w-tes-dsz-prd (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dsz-prd-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice per la destinazione   *
      *    * della produzione                                          *
      *    *-----------------------------------------------------------*
       acc-dsz-cod-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se valore da accettare                 *
      *                  *---------------------------------------------*
           if        w-tes-dsz-prd (1)    not  = 02
                     go to acc-dsz-cod-999.
       acc-dsz-cod-100.
      *              *-------------------------------------------------*
      *              * Salvataggio valore precedente                   *
      *              *-------------------------------------------------*
           move      w-tes-dsz-cod (1)    to   w-sav-dsz-cod          .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-dcc-ope      .
           move      w-tes-dsz-cod (1)    to   w-cod-mne-dcc-cod      .
           move      09                   to   w-cod-mne-dcc-lin      .
           move      30                   to   w-cod-mne-dcc-pos      .
           move      09                   to   w-cod-mne-dcc-rln      .
           move      41                   to   w-cod-mne-dcc-rps      .
           move      zero                 to   w-cod-mne-dcc-vln      .
           move      zero                 to   w-cod-mne-dcc-vps      .
           move      zero                 to   w-cod-mne-dcc-lln      .
           move      zero                 to   w-cod-mne-dcc-lps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
       acc-dsz-cod-110.
           perform   cod-mne-dcc-cll-000  thru cod-mne-dcc-cll-999    .
           if        w-cod-mne-dcc-ope    =    "F+"
                     go to acc-dsz-cod-115.
           if        w-cod-mne-dcc-ope    =    "AC"
                     go to acc-dsz-cod-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-dsz-cod-115.
           perform   cod-mne-dcc-foi-000  thru cod-mne-dcc-foi-999    .
           go to     acc-dsz-cod-110.
       acc-dsz-cod-120.
           move      w-cod-mne-dcc-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-dsz-cod-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-dsz-cod-999.
       acc-dsz-cod-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-dsz-cod (1)      .
       acc-dsz-cod-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dsz-cod-410.
      *                  *---------------------------------------------*
      *                  * Lettura file [cli]                          *
      *                  *---------------------------------------------*
           move      w-tes-dsz-cod (1)    to   w-let-arc-cli-cod      .
           perform   let-arc-cli-000      thru let-arc-cli-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione ragione sociale, indirizzo,  *
      *                  * localita', e sottoconto associato da ana-   *
      *                  * grafica contabile                           *
      *                  *---------------------------------------------*
           move      w-let-arc-cli-rag    to   w-tes-dsz-cod-rag (1)  .
       acc-dsz-cod-420.
      *                  *---------------------------------------------*
      *                  * Visualizzazione ragione sociale da anagra-  *
      *                  * fica contabile                              *
      *                  *---------------------------------------------*
           perform   vis-dsz-cod-rag-000  thru vis-dsz-cod-rag-999    .
       acc-dsz-cod-430.
      *                  *---------------------------------------------*
      *                  * Se cliente non esistente                    *
      *                  *---------------------------------------------*
           if        w-let-arc-cli-flg    =    spaces
                     go to acc-dsz-cod-440.
       acc-dsz-cod-432.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione di-   *
      *                      * pendenza del cliente                    *
      *                      *-----------------------------------------*
           if        w-tes-dsz-dpz (1)    =    spaces and
                     w-tes-dsz-dpz-rag (1)
                                          =    spaces
                     go to acc-dsz-cod-434.
           move      spaces               to   w-tes-dsz-dpz (1)      .
           move      spaces               to   w-tes-dsz-dpz-rag (1)  .
           perform   vis-dsz-dpz-000      thru vis-dsz-dpz-999        .
           perform   vis-dsz-dpz-rag-000  thru vis-dsz-dpz-rag-999    .
       acc-dsz-cod-434.
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-dsz-cod-100.
       acc-dsz-cod-440.
      *                  *---------------------------------------------*
      *                  * Se codice a zero                            *
      *                  *---------------------------------------------*
           if        w-tes-dsz-cod (1)    not  = zero
                     go to acc-dsz-cod-450.
       acc-dsz-cod-442.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione di-   *
      *                      * pendenza del cliente                    *
      *                      *-----------------------------------------*
           if        w-tes-dsz-dpz (1)    =    spaces and
                     w-tes-dsz-dpz-rag (1)
                                          =    spaces
                     go to acc-dsz-cod-444.
           move      spaces               to   w-tes-dsz-dpz (1)      .
           move      spaces               to   w-tes-dsz-dpz-rag (1)  .
           perform   vis-dsz-dpz-000      thru vis-dsz-dpz-999        .
           perform   vis-dsz-dpz-rag-000  thru vis-dsz-dpz-rag-999    .
       acc-dsz-cod-444.
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-dsz-cod-100.
       acc-dsz-cod-450.
      *                  *---------------------------------------------*
      *                  * Se codice diverso da zero                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda del confronto con  *
      *                      * il valore precedente                    *
      *                      *-----------------------------------------*
           if        w-tes-dsz-cod (1)    =    w-sav-dsz-cod
                     go to acc-dsz-cod-455
           else      go to acc-dsz-cod-480.
       acc-dsz-cod-455.
      *                      *-----------------------------------------*
      *                      * Se valore impostato pari al valore pre- *
      *                      * cedente                                 *
      *                      *-----------------------------------------*
       acc-dsz-cod-457.
      *                          *-------------------------------------*
      *                          * Lettura anagrafica commerciale del  *
      *                          * cliente principale                  *
      *                          *-------------------------------------*
           move      "C"                  to   w-let-arc-dcc-tle      .
           move      w-tes-dsz-cod (1)    to   w-let-arc-dcc-cod      .
           move      spaces               to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                          *-------------------------------------*
      *                          * Deviazione a seconda dell'esito     *
      *                          * della lettura                       *
      *                          *-------------------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     go to acc-dsz-cod-467.
       acc-dsz-cod-459.
      *                          *-------------------------------------*
      *                          * Se anagrafica commerciale del cli-  *
      *                          * ente principale non esistente       *
      *                          *-------------------------------------*
       acc-dsz-cod-461.
      *                              *---------------------------------*
      *                              * Normalizzazione e visualizza-   *
      *                              * zione dei dati relativi alla    *
      *                              * dipendenza                      *
      *                              *---------------------------------*
           if        w-tes-dsz-dpz (1)    =    spaces and
                     w-tes-dsz-dpz-rag (1)
                                          =    spaces
                     go to acc-dsz-cod-463.
           move      spaces               to   w-tes-dsz-dpz (1)      .
           move      spaces               to   w-tes-dsz-dpz-rag (1)  .
           perform   vis-dsz-dpz-000      thru vis-dsz-dpz-999        .
           perform   vis-dsz-dpz-rag-000  thru vis-dsz-dpz-rag-999    .
       acc-dsz-cod-463.
      *                              *---------------------------------*
      *                              * Messaggio di errore             *
      *                              *---------------------------------*
           move      "Manca l'anagrafica commerciale per il cliente     
      -              "      "             to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
       acc-dsz-cod-465.
      *                              *---------------------------------*
      *                              * A reimpostazione                *
      *                              *---------------------------------*
           go to     acc-dsz-cod-100.
       acc-dsz-cod-467.
      *                          *-------------------------------------*
      *                          * Se anagrafica commerciale del cli-  *
      *                          * ente principale esistente           *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Memorizzazione valori letti da  *
      *                              * anagrafica commerciale cliente  *
      *                              * principale in dati per la di-   *
      *                              * pendenza                        *
      *                              *---------------------------------*
           move      w-let-arc-dcc-rag    to   w-tes-dsz-dpz-rag (1)  .
      *                              *---------------------------------*
      *                              * Deviazione a seconda se il co-  *
      *                              * dice dipendenza e' a spaces op- *
      *                              * pure diverso da spaces          *
      *                              *---------------------------------*
           if        w-tes-dsz-dpz (1)    =    spaces
                     go to acc-dsz-cod-469
           else      go to acc-dsz-cod-471.
       acc-dsz-cod-469.
      *                              *---------------------------------*
      *                              * Se codice dipendenza a spaces   *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Visualizzazione valori re-  *
      *                                  * lativi alla dipendenza      *
      *                                  *-----------------------------*
           perform   vis-dsz-dpz-000      thru vis-dsz-dpz-999        .
           perform   vis-dsz-dpz-rag-000  thru vis-dsz-dpz-rag-999    .
      *                                  *-----------------------------*
      *                                  * A dipendenze dall'imposta-  *
      *                                  * zione                       *
      *                                  *-----------------------------*
           go to     acc-dsz-cod-600.
       acc-dsz-cod-471.
      *                              *---------------------------------*
      *                              * Se codice dipendenza diverso da *
      *                              * spaces                          *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Lettura anagrafica commer-  *
      *                                  * ciale della dipendenza      *
      *                                  *-----------------------------*
           move      "D"                  to   w-let-arc-dcc-tle      .
           move      w-tes-dsz-cod (1)    to   w-let-arc-dcc-cod      .
           move      w-tes-dsz-dpz (1)    to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                                  *-----------------------------*
      *                                  * Deviazione a seconda del-   *
      *                                  * l'esito della lettura       *
      *                                  *-----------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     go to acc-dsz-cod-473
           else      go to acc-dsz-cod-475.
       acc-dsz-cod-473.
      *                                  *-----------------------------*
      *                                  * Se anagrafica commerciale   *
      *                                  * della dipendenza esistente  *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Memorizzazione valori   *
      *                                      * letti da anagrafica     *
      *                                      * commerciale della di-   *
      *                                      * pendenza                *
      *                                      *-------------------------*
           move      w-let-arc-dcc-rag    to   w-tes-dsz-dpz-rag (1)  .
      *                                      *-------------------------*
      *                                      * Visualizzazione valori  *
      *                                      * relativi alla dipenden- *
      *                                      * za                      *
      *                                      *-------------------------*
           perform   vis-dsz-dpz-000      thru vis-dsz-dpz-999        .
           perform   vis-dsz-dpz-rag-000  thru vis-dsz-dpz-rag-999    .
      *                                      *-------------------------*
      *                                      * A dipendenze dall'impo- *
      *                                      * stazione                *
      *                                      *-------------------------*
           go to     acc-dsz-cod-600.
       acc-dsz-cod-475.
      *                                  *-----------------------------*
      *                                  * Se anagrafica commerciale   *
      *                                  * della dipendenza non esi-   *
      *                                  * stente                      *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Memorizzazione valori   *
      *                                      * letti da anagrafica     *
      *                                      * commerciale della di-   *
      *                                      * pendenza                *
      *                                      *-------------------------*
           move      w-let-arc-dcc-rag    to   w-tes-dsz-dpz-rag (1)  .
      *                                      *-------------------------*
      *                                      * Visualizzazione valori  *
      *                                      * relativi alla dipenden- *
      *                                      * za                      *
      *                                      *-------------------------*
           perform   vis-dsz-dpz-000      thru vis-dsz-dpz-999        .
           perform   vis-dsz-dpz-rag-000  thru vis-dsz-dpz-rag-999    .
      *                                      *-------------------------*
      *                                      * Messaggio di errore     *
      *                                      *-------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "Manca l'anagrafica commerciale per la dipendenza "
                                delimited by   size
                     "'"        delimited by   size
                     w-tes-dsz-dpz (1)
                                delimited by spaces
                     "'"        delimited by   size
                                          into w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                                      *-------------------------*
      *                                      * A reimpostazione        *
      *                                      *-------------------------*
           go to     acc-dsz-cod-100.
       acc-dsz-cod-480.
      *                      *-----------------------------------------*
      *                      * Se valore impostato diverso dal valore  *
      *                      * precedente                              *
      *                      *-----------------------------------------*
       acc-dsz-cod-482.
      *                              *---------------------------------*
      *                              * Normalizzazione e visualizza-   *
      *                              * zione dei dei dati relativi     *
      *                              * alla dipendenza                 *
      *                              *---------------------------------*
           if        w-tes-dsz-dpz (1)    =    spaces and
                     w-tes-dsz-dpz-rag (1)
                                          =    spaces
                     go to acc-dsz-cod-484.
           move      spaces               to   w-tes-dsz-dpz (1)      .
           move      spaces               to   w-tes-dsz-dpz-rag (1)  .
           perform   vis-dsz-dpz-000      thru vis-dsz-dpz-999        .
           perform   vis-dsz-dpz-rag-000  thru vis-dsz-dpz-rag-999    .
       acc-dsz-cod-484.
      *                              *---------------------------------*
      *                              * Riaggancio                      *
      *                              *---------------------------------*
           go to     acc-dsz-cod-457.
       acc-dsz-cod-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dsz-cod-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-dsz-cod-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-dsz-cod-100.
       acc-dsz-cod-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Codice per la destinazio- *
      *    * ne della produzione                                       *
      *    *-----------------------------------------------------------*
       vis-dsz-cod-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      09                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-dsz-cod (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dsz-cod-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Descrizione per la desti- *
      *    * nazione della produzione                                  *
      *    *-----------------------------------------------------------*
       vis-dsz-cod-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-dsz-cod-rag (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dsz-cod-rag-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice dipendenza per la de- *
      *    * stinazione della produzione                               *
      *    *-----------------------------------------------------------*
       acc-dsz-dpz-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dsz-dpz-025.
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-tes-dsz-cod (1)    =    zero
                     go to acc-dsz-dpz-999.
       acc-dsz-dpz-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "A*"                 to   w-cod-cod-dcc-ope      .
           move      w-tes-dsz-cod (1)    to   w-cod-cod-dcc-cli      .
           move      w-tes-dsz-dpz (1)    to   w-cod-cod-dcc-cod      .
           move      10                   to   w-cod-cod-dcc-lin      .
           move      30                   to   w-cod-cod-dcc-pos      .
           move      10                   to   w-cod-cod-dcc-rln      .
           move      41                   to   w-cod-cod-dcc-rps      .
           move      zero                 to   w-cod-cod-dcc-vln      .
           move      zero                 to   w-cod-cod-dcc-vps      .
           move      zero                 to   w-cod-cod-dcc-lln      .
           move      zero                 to   w-cod-cod-dcc-lps      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-dcc-cll-000  thru cod-cod-dcc-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dcc-foi-000  thru cod-cod-dcc-foi-999    .
       acc-dsz-dpz-110.
           perform   cod-cod-dcc-cll-000  thru cod-cod-dcc-cll-999    .
           if        w-cod-cod-dcc-ope    =    "F+"
                     go to acc-dsz-dpz-115.
           if        w-cod-cod-dcc-ope    =    "AC"
                     go to acc-dsz-dpz-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-dsz-dpz-115.
           perform   cod-cod-dcc-foi-000  thru cod-cod-dcc-foi-999    .
           go to     acc-dsz-dpz-110.
       acc-dsz-dpz-120.
           move      w-cod-cod-dcc-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-dsz-dpz-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-dsz-dpz-999.
       acc-dsz-dpz-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-dsz-dpz (1)      .
       acc-dsz-dpz-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dsz-dpz-410.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se codice dipendenza   *
      *                  * a spaces oppure no                          *
      *                  *---------------------------------------------*
           if        w-tes-dsz-dpz (1)    =    spaces
                     go to acc-dsz-dpz-420
           else      go to acc-dsz-dpz-440.
       acc-dsz-dpz-420.
      *                  *---------------------------------------------*
      *                  * Se codice dipendenza a spaces               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica commerciale del cli- *
      *                      * ente principale                         *
      *                      *-----------------------------------------*
           move      "C"                  to   w-let-arc-dcc-tle      .
           move      w-tes-dsz-cod (1)    to   w-let-arc-dcc-cod      .
           move      spaces               to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori letti da anagra-  *
      *                      * fica commerciale cliente principale in  *
      *                      * dati per la dipendenza                  *
      *                      *-----------------------------------------*
           move      w-let-arc-dcc-rag    to   w-tes-dsz-dpz-rag (1)  .
      *                      *-----------------------------------------*
      *                      * Visualizzazione valori relativi alla    *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           perform   vis-dsz-dpz-000      thru vis-dsz-dpz-999        .
           perform   vis-dsz-dpz-rag-000  thru vis-dsz-dpz-rag-999    .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda dell'esito della   *
      *                      * lettura                                 *
      *                      *-----------------------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     go to acc-dsz-dpz-425
           else      go to acc-dsz-dpz-430.
       acc-dsz-dpz-425.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale del cliente   *
      *                      * principale esistente                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * A dipendenze dall'impostazione      *
      *                          *-------------------------------------*
           go to     acc-dsz-dpz-600.
       acc-dsz-dpz-430.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale del cliente   *
      *                      * principale non esistente                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      "Manca l'anagrafica commerciale per il cliente !   
      -              "      "             to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                          *-------------------------------------*
      *                          * A reimpostazione                    *
      *                          *-------------------------------------*
           go to     acc-dsz-dpz-100.
       acc-dsz-dpz-440.
      *                  *---------------------------------------------*
      *                  * Se codice dipendenza diverso da spaces      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica commerciale per la   *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           move      "D"                  to   w-let-arc-dcc-tle      .
           move      w-tes-dsz-cod (1)    to   w-let-arc-dcc-cod      .
           move      w-tes-dsz-dpz (1)    to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori letti da anagra-  *
      *                      * fica commerciale della dipendenza in    *
      *                      * dati per la dipendenza                  *
      *                      *-----------------------------------------*
           move      w-let-arc-dcc-rag    to   w-tes-dsz-dpz-rag (1)  .
      *                      *-----------------------------------------*
      *                      * Visualizzazione valori relativi alla    *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           perform   vis-dsz-dpz-000      thru vis-dsz-dpz-999        .
           perform   vis-dsz-dpz-rag-000  thru vis-dsz-dpz-rag-999    .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda dell'esito della   *
      *                      * lettura                                 *
      *                      *-----------------------------------------*
           if        w-let-arc-dcc-flg    =    spaces
                     go to acc-dsz-dpz-445
           else      go to acc-dsz-dpz-450.
       acc-dsz-dpz-445.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale della dipen-  *
      *                      * denza esistente                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * A dipendenze dall'impostazione      *
      *                          *-------------------------------------*
           go to     acc-dsz-dpz-600.
       acc-dsz-dpz-450.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale della dipen-  *
      *                      * denza non esistente                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "Manca l'anagrafica commerciale per la dipendenza "
                                delimited by   size
                     "'"        delimited by   size
                     w-tes-dsz-dpz (1)
                                delimited by spaces
                     "'"        delimited by   size
                                          into w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                          *-------------------------------------*
      *                          * A reimpostazione                    *
      *                          *-------------------------------------*
           go to     acc-dsz-dpz-100.
       acc-dsz-dpz-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dsz-dpz-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-dsz-dpz-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-dsz-dpz-100.
       acc-dsz-dpz-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Codice dipendenza per la  *
      *    * destinazione della produzione                             *
      *    *-----------------------------------------------------------*
       vis-dsz-dpz-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-dsz-dpz (1)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dsz-dpz-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Descrizione dipendenza    *
      *    * per la destinazione della produzione                      *
      *    *-----------------------------------------------------------*
       vis-dsz-dpz-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-dsz-dpz-rag (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dsz-dpz-rag-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Esecuzione della produzione  *
      *    *-----------------------------------------------------------*
       acc-esz-prd-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-tes-esz-prd (1)    to   w-sav-esz-prd          .
       acc-esz-prd-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-esz-prd-lun    to   v-car                  .
           move      w-exp-esz-prd-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      12                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-esz-prd-tbl    to   v-txt                  .
           move      w-tes-esz-prd (1)    to   v-num                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-esz-prd-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-esz-prd-999.
       acc-esz-prd-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-esz-prd (1)      .
       acc-esz-prd-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore zero non ammesso, a meno che non si  *
      *                  * sia in Up                                   *
      *                  *---------------------------------------------*
           if        w-tes-esz-prd (1)    not  = zero
                     go to acc-esz-prd-600.
           if        v-key                =    "UP  "
                     go to acc-esz-prd-600
           else      go to acc-esz-prd-100.
       acc-esz-prd-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore attuale come precedente : oltre   *
      *                  *---------------------------------------------*
           if        w-tes-esz-prd (1)    =    w-sav-esz-prd
                     go to acc-esz-prd-800.
      *                  *---------------------------------------------*
      *                  * Se valore attuale a 02 : oltre              *
      *                  *---------------------------------------------*
           if        w-tes-esz-prd (1)    =    02
                     go to acc-esz-prd-800.
      *                  *---------------------------------------------*
      *                  * Normalizzazione codice fornitore            *
      *                  *---------------------------------------------*
           move      zero                 to   w-tes-esz-cod (1)      .
           move      spaces               to   w-tes-esz-cod-rag (1)  .
           perform   vis-esz-cod-000      thru vis-esz-cod-999        .
           perform   vis-esz-cod-rag-000  thru vis-esz-cod-rag-999    .
      *                  *---------------------------------------------*
      *                  * Normalizzazione dipendenza fornitore        *
      *                  *---------------------------------------------*
           move      spaces               to   w-tes-esz-dpz (1)      .
           move      spaces               to   w-tes-esz-dpz-rag (1)  .
           perform   vis-esz-dpz-000      thru vis-esz-dpz-999        .
           perform   vis-esz-dpz-rag-000  thru vis-esz-dpz-rag-999    .
       acc-esz-prd-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-esz-prd-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-esz-prd-100.
       acc-esz-prd-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Esecuzione della produ-   *
      *    * zione                                                     *
      *    *-----------------------------------------------------------*
       vis-esz-prd-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-esz-prd-lun    to   v-car                  .
           move      w-exp-esz-prd-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      12                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-esz-prd-tbl    to   v-txt                  .
           move      w-tes-esz-prd (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-esz-prd-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice per l'esecuzione del- *
      *    * la produzione                                             *
      *    *-----------------------------------------------------------*
       acc-esz-cod-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se valore da accettare                 *
      *                  *---------------------------------------------*
           if        w-tes-esz-prd (1)    not  = 02
                     go to acc-esz-cod-999.
       acc-esz-cod-100.
      *              *-------------------------------------------------*
      *              * Salvataggio valore precedente                   *
      *              *-------------------------------------------------*
           move      w-tes-esz-cod (1)    to   w-sav-esz-cod          .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-dcf-ope      .
           move      w-tes-esz-cod (1)    to   w-cod-mne-dcf-cod      .
           move      14                   to   w-cod-mne-dcf-lin      .
           move      30                   to   w-cod-mne-dcf-pos      .
           move      14                   to   w-cod-mne-dcf-rln      .
           move      41                   to   w-cod-mne-dcf-rps      .
           move      zero                 to   w-cod-mne-dcf-vln      .
           move      zero                 to   w-cod-mne-dcf-vps      .
           move      zero                 to   w-cod-mne-dcf-lln      .
           move      zero                 to   w-cod-mne-dcf-lps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-dcf-cll-000  thru cod-mne-dcf-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-dcf-foi-000  thru cod-mne-dcf-foi-999    .
       acc-esz-cod-110.
           perform   cod-mne-dcf-cll-000  thru cod-mne-dcf-cll-999    .
           if        w-cod-mne-dcf-ope    =    "F+"
                     go to acc-esz-cod-115.
           if        w-cod-mne-dcf-ope    =    "AC"
                     go to acc-esz-cod-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-esz-cod-115.
           perform   cod-mne-dcf-foi-000  thru cod-mne-dcf-foi-999    .
           go to     acc-esz-cod-110.
       acc-esz-cod-120.
           move      w-cod-mne-dcf-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-esz-cod-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-esz-cod-999.
       acc-esz-cod-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-esz-cod (1)      .
       acc-esz-cod-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-esz-cod-410.
      *                  *---------------------------------------------*
      *                  * Lettura file [fnt]                          *
      *                  *---------------------------------------------*
           move      w-tes-esz-cod (1)    to   w-let-arc-fnt-cod      .
           perform   let-arc-fnt-000      thru let-arc-fnt-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione ragione sociale, indirizzo,  *
      *                  * localita', e sottoconto associato da ana-   *
      *                  * grafica contabile                           *
      *                  *---------------------------------------------*
           move      w-let-arc-fnt-rag    to   w-tes-esz-cod-rag (1)  .
       acc-esz-cod-420.
      *                  *---------------------------------------------*
      *                  * Visualizzazione ragione sociale da anagra-  *
      *                  * fica contabile                              *
      *                  *---------------------------------------------*
           perform   vis-esz-cod-rag-000  thru vis-esz-cod-rag-999    .
       acc-esz-cod-430.
      *                  *---------------------------------------------*
      *                  * Se fornitore non esistente                  *
      *                  *---------------------------------------------*
           if        w-let-arc-fnt-flg    =    spaces
                     go to acc-esz-cod-440.
       acc-esz-cod-432.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione di-   *
      *                      * pendenza del fornitore                  *
      *                      *-----------------------------------------*
           if        w-tes-esz-dpz (1)    =    spaces and
                     w-tes-esz-dpz-rag (1)
                                          =    spaces
                     go to acc-esz-cod-434.
           move      spaces               to   w-tes-esz-dpz (1)      .
           move      spaces               to   w-tes-esz-dpz-rag (1)  .
           perform   vis-esz-dpz-000      thru vis-esz-dpz-999        .
           perform   vis-esz-dpz-rag-000  thru vis-esz-dpz-rag-999    .
       acc-esz-cod-434.
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-esz-cod-100.
       acc-esz-cod-440.
      *                  *---------------------------------------------*
      *                  * Se codice a zero                            *
      *                  *---------------------------------------------*
           if        w-tes-esz-cod (1)    not  = zero
                     go to acc-esz-cod-450.
       acc-esz-cod-442.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione di-   *
      *                      * pendenza del fornitore                  *
      *                      *-----------------------------------------*
           if        w-tes-esz-dpz (1)    =    spaces and
                     w-tes-esz-dpz-rag (1)
                                          =    spaces
                     go to acc-esz-cod-444.
           move      spaces               to   w-tes-esz-dpz (1)      .
           move      spaces               to   w-tes-esz-dpz-rag (1)  .
           perform   vis-esz-dpz-000      thru vis-esz-dpz-999        .
           perform   vis-esz-dpz-rag-000  thru vis-esz-dpz-rag-999    .
       acc-esz-cod-444.
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-esz-cod-100.
       acc-esz-cod-450.
      *                  *---------------------------------------------*
      *                  * Se codice diverso da zero                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda del confronto con  *
      *                      * il valore precedente                    *
      *                      *-----------------------------------------*
           if        w-tes-esz-cod (1)    =    w-sav-esz-cod
                     go to acc-esz-cod-455
           else      go to acc-esz-cod-480.
       acc-esz-cod-455.
      *                      *-----------------------------------------*
      *                      * Se valore impostato pari al valore pre- *
      *                      * cedente                                 *
      *                      *-----------------------------------------*
       acc-esz-cod-457.
      *                          *-------------------------------------*
      *                          * Lettura anagrafica commerciale del  *
      *                          * fornitore principale                *
      *                          *-------------------------------------*
           move      "F"                  to   w-let-arc-dcf-tle      .
           move      w-tes-esz-cod (1)    to   w-let-arc-dcf-cod      .
           move      spaces               to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                          *-------------------------------------*
      *                          * Deviazione a seconda dell'esito     *
      *                          * della lettura                       *
      *                          *-------------------------------------*
           if        w-let-arc-dcf-flg    =    spaces
                     go to acc-esz-cod-467.
       acc-esz-cod-459.
      *                          *-------------------------------------*
      *                          * Se anagrafica commerciale del for-  *
      *                          * nitore principale non esistente     *
      *                          *-------------------------------------*
       acc-esz-cod-461.
      *                              *---------------------------------*
      *                              * Normalizzazione e visualizza-   *
      *                              * zione dei dati relativi alla    *
      *                              * dipendenza                      *
      *                              *---------------------------------*
           if        w-tes-esz-dpz (1)    =    spaces and
                     w-tes-esz-dpz-rag (1)
                                          =    spaces
                     go to acc-esz-cod-463.
           move      spaces               to   w-tes-esz-dpz (1)      .
           move      spaces               to   w-tes-esz-dpz-rag (1)  .
           perform   vis-esz-dpz-000      thru vis-esz-dpz-999        .
           perform   vis-esz-dpz-rag-000  thru vis-esz-dpz-rag-999    .
       acc-esz-cod-463.
      *                              *---------------------------------*
      *                              * Messaggio di errore             *
      *                              *---------------------------------*
           move      "Manca l'anagrafica commerciale per il fornitore ! 
      -              "      "             to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
       acc-esz-cod-465.
      *                              *---------------------------------*
      *                              * A reimpostazione                *
      *                              *---------------------------------*
           go to     acc-esz-cod-100.
       acc-esz-cod-467.
      *                          *-------------------------------------*
      *                          * Se anagrafica commerciale del for-  *
      *                          * nitore principale esistente         *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Memorizzazione valori letti da  *
      *                              * anagrafica commerciale fornito- *
      *                              * re principale in dati per la    *
      *                              * dipendenza                      *
      *                              *---------------------------------*
           move      w-let-arc-dcf-rag    to   w-tes-esz-dpz-rag (1)  .
      *                              *---------------------------------*
      *                              * Deviazione a seconda se il co-  *
      *                              * dice dipendenza e' a spaces op- *
      *                              * pure diverso da spaces          *
      *                              *---------------------------------*
           if        w-tes-esz-dpz (1)    =    spaces
                     go to acc-esz-cod-469
           else      go to acc-esz-cod-471.
       acc-esz-cod-469.
      *                              *---------------------------------*
      *                              * Se codice dipendenza a spaces   *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Visualizzazione valori re-  *
      *                                  * lativi alla dipendenza      *
      *                                  *-----------------------------*
           perform   vis-esz-dpz-000      thru vis-esz-dpz-999        .
           perform   vis-esz-dpz-rag-000  thru vis-esz-dpz-rag-999    .
      *                                  *-----------------------------*
      *                                  * A dipendenze dall'imposta-  *
      *                                  * zione                       *
      *                                  *-----------------------------*
           go to     acc-esz-cod-600.
       acc-esz-cod-471.
      *                              *---------------------------------*
      *                              * Se codice dipendenza diverso da *
      *                              * spaces                          *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Lettura anagrafica commer-  *
      *                                  * ciale della dipendenza      *
      *                                  *-----------------------------*
           move      "D"                  to   w-let-arc-dcf-tle      .
           move      w-tes-esz-cod (1)    to   w-let-arc-dcf-cod      .
           move      w-tes-esz-dpz (1)    to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                                  *-----------------------------*
      *                                  * Deviazione a seconda del-   *
      *                                  * l'esito della lettura       *
      *                                  *-----------------------------*
           if        w-let-arc-dcf-flg    =    spaces
                     go to acc-esz-cod-473
           else      go to acc-esz-cod-475.
       acc-esz-cod-473.
      *                                  *-----------------------------*
      *                                  * Se anagrafica commerciale   *
      *                                  * della dipendenza esistente  *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Memorizzazione valori   *
      *                                      * letti da anagrafica     *
      *                                      * commerciale della di-   *
      *                                      * pendenza                *
      *                                      *-------------------------*
           move      w-let-arc-dcf-rag    to   w-tes-esz-dpz-rag (1)  .
      *                                      *-------------------------*
      *                                      * Visualizzazione valori  *
      *                                      * relativi alla dipenden- *
      *                                      * za                      *
      *                                      *-------------------------*
           perform   vis-esz-dpz-000      thru vis-esz-dpz-999        .
           perform   vis-esz-dpz-rag-000  thru vis-esz-dpz-rag-999    .
      *                                      *-------------------------*
      *                                      * A dipendenze dall'impo- *
      *                                      * stazione                *
      *                                      *-------------------------*
           go to     acc-esz-cod-600.
       acc-esz-cod-475.
      *                                  *-----------------------------*
      *                                  * Se anagrafica commerciale   *
      *                                  * della dipendenza non esi-   *
      *                                  * stente                      *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Memorizzazione valori   *
      *                                      * letti da anagrafica     *
      *                                      * commerciale della di-   *
      *                                      * pendenza                *
      *                                      *-------------------------*
           move      w-let-arc-dcf-rag    to   w-tes-esz-dpz-rag (1)  .
      *                                      *-------------------------*
      *                                      * Visualizzazione valori  *
      *                                      * relativi alla dipenden- *
      *                                      * za                      *
      *                                      *-------------------------*
           perform   vis-esz-dpz-000      thru vis-esz-dpz-999        .
           perform   vis-esz-dpz-rag-000  thru vis-esz-dpz-rag-999    .
      *                                      *-------------------------*
      *                                      * Messaggio di errore     *
      *                                      *-------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "Manca l'anagrafica commerciale per la dipendenza "
                                delimited by   size
                     "'"        delimited by   size
                     w-tes-esz-dpz (1)
                                delimited by spaces
                     "'"        delimited by   size
                                          into w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                                      *-------------------------*
      *                                      * A reimpostazione        *
      *                                      *-------------------------*
           go to     acc-esz-cod-100.
       acc-esz-cod-480.
      *                      *-----------------------------------------*
      *                      * Se valore impostato diverso dal valore  *
      *                      * precedente                              *
      *                      *-----------------------------------------*
       acc-esz-cod-482.
      *                              *---------------------------------*
      *                              * Normalizzazione e visualizza-   *
      *                              * zione dei dei dati relativi     *
      *                              * alla dipendenza                 *
      *                              *---------------------------------*
           if        w-tes-esz-dpz (1)    =    spaces and
                     w-tes-esz-dpz-rag (1)
                                          =    spaces
                     go to acc-esz-cod-484.
           move      spaces               to   w-tes-esz-dpz (1)      .
           move      spaces               to   w-tes-esz-dpz-rag (1)  .
           perform   vis-esz-dpz-000      thru vis-esz-dpz-999        .
           perform   vis-esz-dpz-rag-000  thru vis-esz-dpz-rag-999    .
       acc-esz-cod-484.
      *                              *---------------------------------*
      *                              * Riaggancio                      *
      *                              *---------------------------------*
           go to     acc-esz-cod-457.
       acc-esz-cod-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-esz-cod-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-esz-cod-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-esz-cod-100.
       acc-esz-cod-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Codice per l'esecuzione   *
      *    * della produzione                                          *
      *    *-----------------------------------------------------------*
       vis-esz-cod-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      14                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-esz-cod (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-esz-cod-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Descrizione per l'esecu-  *
      *    * zione della produzione                                    *
      *    *-----------------------------------------------------------*
       vis-esz-cod-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-esz-cod-rag (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-esz-cod-rag-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice dipendenza per l'ese- *
      *    * cuzione della produzione                                  *
      *    *-----------------------------------------------------------*
       acc-esz-dpz-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-esz-dpz-025.
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-tes-esz-cod (1)    =    zero
                     go to acc-esz-dpz-999.
       acc-esz-dpz-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "A*"                 to   w-cod-cod-dcf-ope      .
           move      w-tes-esz-cod (1)    to   w-cod-cod-dcf-fnt      .
           move      w-tes-esz-dpz (1)    to   w-cod-cod-dcf-cod      .
           move      15                   to   w-cod-cod-dcf-lin      .
           move      30                   to   w-cod-cod-dcf-pos      .
           move      15                   to   w-cod-cod-dcf-rln      .
           move      41                   to   w-cod-cod-dcf-rps      .
           move      zero                 to   w-cod-cod-dcf-vln      .
           move      zero                 to   w-cod-cod-dcf-vps      .
           move      zero                 to   w-cod-cod-dcf-lln      .
           move      zero                 to   w-cod-cod-dcf-lps      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-dcf-cll-000  thru cod-cod-dcf-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dcf-foi-000  thru cod-cod-dcf-foi-999    .
       acc-esz-dpz-110.
           perform   cod-cod-dcf-cll-000  thru cod-cod-dcf-cll-999    .
           if        w-cod-cod-dcf-ope    =    "F+"
                     go to acc-esz-dpz-115.
           if        w-cod-cod-dcf-ope    =    "AC"
                     go to acc-esz-dpz-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-esz-dpz-115.
           perform   cod-cod-dcf-foi-000  thru cod-cod-dcf-foi-999    .
           go to     acc-esz-dpz-110.
       acc-esz-dpz-120.
           move      w-cod-cod-dcf-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-esz-dpz-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-esz-dpz-999.
       acc-esz-dpz-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-esz-dpz (1)      .
       acc-esz-dpz-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-esz-dpz-410.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se codice dipendenza   *
      *                  * a spaces oppure no                          *
      *                  *---------------------------------------------*
           if        w-tes-esz-dpz (1)    =    spaces
                     go to acc-esz-dpz-420
           else      go to acc-esz-dpz-440.
       acc-esz-dpz-420.
      *                  *---------------------------------------------*
      *                  * Se codice dipendenza a spaces               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica commerciale del for- *
      *                      * nitore principale                       *
      *                      *-----------------------------------------*
           move      "F"                  to   w-let-arc-dcf-tle      .
           move      w-tes-esz-cod (1)    to   w-let-arc-dcf-cod      .
           move      spaces               to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori letti da anagra-  *
      *                      * fica commerciale fornitore principale   *
      *                      * in dati per la dipendenza               *
      *                      *-----------------------------------------*
           move      w-let-arc-dcf-rag    to   w-tes-esz-dpz-rag (1)  .
      *                      *-----------------------------------------*
      *                      * Visualizzazione valori relativi alla    *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           perform   vis-esz-dpz-000      thru vis-esz-dpz-999        .
           perform   vis-esz-dpz-rag-000  thru vis-esz-dpz-rag-999    .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda dell'esito della   *
      *                      * lettura                                 *
      *                      *-----------------------------------------*
           if        w-let-arc-dcf-flg    =    spaces
                     go to acc-esz-dpz-425
           else      go to acc-esz-dpz-430.
       acc-esz-dpz-425.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale del fornitore *
      *                      * principale esistente                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * A dipendenze dall'impostazione      *
      *                          *-------------------------------------*
           go to     acc-esz-dpz-600.
       acc-esz-dpz-430.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale del fornitore *
      *                      * principale non esistente                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      "Manca l'anagrafica commerciale per il fornitore ! 
      -              "      "             to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                          *-------------------------------------*
      *                          * A reimpostazione                    *
      *                          *-------------------------------------*
           go to     acc-esz-dpz-100.
       acc-esz-dpz-440.
      *                  *---------------------------------------------*
      *                  * Se codice dipendenza diverso da spaces      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica commerciale per la   *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           move      "D"                  to   w-let-arc-dcf-tle      .
           move      w-tes-esz-cod (1)    to   w-let-arc-dcf-cod      .
           move      w-tes-esz-dpz (1)    to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori letti da anagra-  *
      *                      * fica commerciale della dipendenza in    *
      *                      * dati per la dipendenza                  *
      *                      *-----------------------------------------*
           move      w-let-arc-dcf-rag    to   w-tes-esz-dpz-rag (1)  .
      *                      *-----------------------------------------*
      *                      * Visualizzazione valori relativi alla    *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           perform   vis-esz-dpz-000      thru vis-esz-dpz-999        .
           perform   vis-esz-dpz-rag-000  thru vis-esz-dpz-rag-999    .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda dell'esito della   *
      *                      * lettura                                 *
      *                      *-----------------------------------------*
           if        w-let-arc-dcf-flg    =    spaces
                     go to acc-esz-dpz-445
           else      go to acc-esz-dpz-450.
       acc-esz-dpz-445.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale della dipen-  *
      *                      * denza esistente                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * A dipendenze dall'impostazione      *
      *                          *-------------------------------------*
           go to     acc-esz-dpz-600.
       acc-esz-dpz-450.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale della dipen-  *
      *                      * denza non esistente                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "Manca l'anagrafica commerciale per la dipendenza "
                                delimited by   size
                     "'"        delimited by   size
                     w-tes-esz-dpz (1)
                                delimited by spaces
                     "'"        delimited by   size
                                          into w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                          *-------------------------------------*
      *                          * A reimpostazione                    *
      *                          *-------------------------------------*
           go to     acc-esz-dpz-100.
       acc-esz-dpz-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-esz-dpz-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-esz-dpz-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-esz-dpz-100.
       acc-esz-dpz-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Codice dipendenza per la  *
      *    * esecuzione della produzione                               *
      *    *-----------------------------------------------------------*
       vis-esz-dpz-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-esz-dpz (1)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-esz-dpz-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Descrizione dipendenza    *
      *    * per la esecuzione della produzione                        *
      *    *-----------------------------------------------------------*
       vis-esz-dpz-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-esz-dpz-rag (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-esz-dpz-rag-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Data consegna prevista       *
      *    *-----------------------------------------------------------*
       acc-dat-cns-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dat-cns-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      17                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      ">"                  to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      w-tes-dat-cns (1)    to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-dat-cns-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-dat-cns-999.
       acc-dat-cns-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   w-tes-dat-cns (1)      .
       acc-dat-cns-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore a zero                            *
      *                  *---------------------------------------------*
           if        w-tes-dat-cns (1)    not  = zero
                     go to acc-dat-cns-600.
      *                      *-----------------------------------------*
      *                      * Forzatura da data documento             *
      *                      *-----------------------------------------*
           move      w-tes-dat-doc        to   w-tes-dat-cns (1)      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione                         *
      *                      *-----------------------------------------*
           perform   vis-dat-cns-000      thru vis-dat-cns-999        .
       acc-dat-cns-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dat-cns-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-dat-cns-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-dat-cns-100.
       acc-dat-cns-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Data consegna prevista    *
      *    *-----------------------------------------------------------*
       vis-dat-cns-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      17                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-dat-cns (1)    to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dat-cns-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Priorita' di produzione      *
      *    *-----------------------------------------------------------*
       acc-pri-prd-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-pri-prd-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      w-tes-pri-prd (1)    to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-pri-prd-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-pri-prd-999.
       acc-pri-prd-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-pri-prd (1)      .
       acc-pri-prd-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-pri-prd-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-pri-prd-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-pri-prd-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-pri-prd-100.
       acc-pri-prd-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Priorita' di produzione   *
      *    *-----------------------------------------------------------*
       vis-pri-prd-000.
           move      "DS"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-pri-prd (1)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-pri-prd-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Tipo codice di magazzino     *
      *    *-----------------------------------------------------------*
       acc-tip-mag-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-prs-dps-snx        =    "S"
                     go to acc-tip-mag-050.
      *                      *-----------------------------------------*
      *                      * Se gestione semilavorati non attiva     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Forzatura tipo prodotto             *
      *                          *-------------------------------------*
           move      01                   to   w-tes-tip-mag (1)      .
      *                          *-------------------------------------*
      *                          * Visualizzazione tipo prodotto       *
      *                          *-------------------------------------*
           perform   vis-tip-mag-000      thru vis-tip-mag-999        .
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     acc-tip-mag-999.
       acc-tip-mag-050.
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-tes-tip-mag (1)    to   w-sav-tip-mag          .
       acc-tip-mag-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-mag-lun    to   v-car                  .
           move      w-exp-tip-mag-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-tip-mag-tbl    to   v-txt                  .
           move      08                   to   v-lin                  .
           move      26                   to   v-pos                  .
           if        w-tes-tip-mag (1)    =    01
                     move  01             to   v-num
           else if   w-tes-tip-mag (1)    =    02
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-tip-mag-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-tip-mag-999.
       acc-tip-mag-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  01             to   w-tes-tip-mag (1)
           else if   v-num                =    02
                     move  02             to   w-tes-tip-mag (1)
           else      move  zero           to   w-tes-tip-mag (1)      .
       acc-tip-mag-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore zero non ammesso, a meno che non si  *
      *                  * sia in Up                                   *
      *                  *---------------------------------------------*
           if        w-tes-tip-mag (1)    not  = zero
                     go to acc-tip-mag-600.
           if        v-key                =    "UP  "
                     go to acc-tip-mag-600
           else      go to acc-tip-mag-100.
       acc-tip-mag-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore attuale come precedente : oltre   *
      *                  *---------------------------------------------*
           if        w-tes-tip-mag (1)    =    w-sav-tip-mag
                     go to acc-tip-mag-800.
      *                  *---------------------------------------------*
      *                  * Normalizzazione codice e descrizione del    *
      *                  * prodotto                                    *
      *                  *---------------------------------------------*
           if        w-tes-num-mag (1)    =    zero
                     go to acc-tip-mag-800.
           move      zero                 to   w-tes-num-mag (1)      .
           move      spaces               to   w-tes-alf-mag (1)      .
           move      spaces               to   w-tes-des-mag (1)      .
           perform   vis-cod-mag-000      thru vis-cod-mag-999        .
           perform   vis-des-mag-000      thru vis-des-mag-999        .
       acc-tip-mag-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-tip-mag-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-tip-mag-100.
       acc-tip-mag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Tipo codice di magazzino  *
      *    *-----------------------------------------------------------*
       vis-tip-mag-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-mag-lun    to   v-car                  .
           move      w-exp-tip-mag-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-exp-tip-mag-tbl    to   v-txt                  .
           move      08                   to   v-lin                  .
           move      26                   to   v-pos                  .
           if        w-tes-tip-mag (1)    =    01
                     move  01             to   v-num
           else if   w-tes-tip-mag (1)    =    02
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-mag-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice magazzino                     *
      *    *-----------------------------------------------------------*
       acc-cod-mag-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-mag-100.
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo di prodotto *
      *                  *---------------------------------------------*
           if        w-tes-tip-mag (1)    =    01
                     go to acc-cod-mag-110
           else if   w-tes-tip-mag (1)    =    02
                     go to acc-cod-mag-120
           else      go to acc-cod-mag-999.
       acc-cod-mag-110.
      *                  *---------------------------------------------*
      *                  * Se Prodotto di vendita                      *
      *                  *---------------------------------------------*
           perform   acc-cod-dcp-000      thru acc-cod-dcp-999        .
           go to     acc-cod-mag-400.
       acc-cod-mag-120.
      *                  *---------------------------------------------*
      *                  * Se Semilavorato                             *
      *                  *---------------------------------------------*
           perform   acc-cod-dps-000      thru acc-cod-dps-999        .
           go to     acc-cod-mag-400.
       acc-cod-mag-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-mag-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-mag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo chiave : Codice magazzino           *
      *    *-----------------------------------------------------------*
       vis-cod-mag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      14                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      w-tes-alf-mag (1)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-mag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Descrizione magazzino     *
      *    *-----------------------------------------------------------*
       vis-des-mag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-des-mag (1)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-des-mag-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice prodotto [dcp]        *
      *    *-----------------------------------------------------------*
       acc-cod-dcp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-dcp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-dcp-ope      .
           move      "A"                  to   w-cod-cod-dcp-tac      .
           move      w-tes-num-mag (1)    to   w-cod-cod-dcp-num      .
           move      w-tes-alf-mag (1)    to   w-cod-cod-dcp-alf      .
           move      10                   to   w-cod-cod-dcp-lin      .
           move      26                   to   w-cod-cod-dcp-pos      .
           move      10                   to   w-cod-cod-dcp-dln      .
           move      26                   to   w-cod-cod-dcp-dps      .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           if        w-cnt-sts-imp-tes    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   cod-cod-dcp-cll-000  thru cod-cod-dcp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dcp-foi-000  thru cod-cod-dcp-foi-999    .
       acc-cod-dcp-110.
           perform   cod-cod-dcp-cll-000  thru cod-cod-dcp-cll-999    .
           if        w-cod-cod-dcp-ope    =    "F+"
                     go to acc-cod-dcp-115.
           if        w-cod-cod-dcp-ope    =    "AC"
                     go to acc-cod-dcp-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-dcp-115.
           perform   cod-cod-dcp-foi-000  thru cod-cod-dcp-foi-999    .
           go to     acc-cod-dcp-110.
       acc-cod-dcp-120.
           move      w-cod-cod-dcp-alf    to   v-alf                  .
           move      w-cod-cod-dcp-num    to   v-num                  .
       acc-cod-dcp-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-cod-dcp-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-cod-dcp-999.
       acc-cod-dcp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato                                *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-alf-mag (1)      .
           move      v-num                to   w-tes-num-mag (1)      .
       acc-cod-dcp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcp]                      *
      *                  *---------------------------------------------*
           move      w-tes-num-mag (1)    to   w-let-arc-dcp-cod      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
           move      w-let-arc-dcp-des    to   w-tes-des-mag (1)      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione magazzino       *
      *                  *---------------------------------------------*
           perform   vis-des-mag-000      thru vis-des-mag-999        .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-dcp-flg    not  = spaces
                     go to acc-cod-dcp-100.
      *                  *---------------------------------------------*
      *                  * Se codice a zero : reimpostazione, a meno   *
      *                  * che non si sia in Up                        *
      *                  *---------------------------------------------*
           if        w-tes-num-mag (1)    not  = zero
                     go to acc-cod-dcp-600.
           if        v-key                =    "UP  "
                     go to acc-cod-dcp-600
           else      go to acc-cod-dcp-100.
       acc-cod-dcp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione unita' di misura            *
      *                  *---------------------------------------------*
           move      w-let-arc-dcp-umi    to   w-tes-umi-prd (1)      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione unita' di misura            *
      *                  *---------------------------------------------*
           perform   vis-umi-prd-000      thru vis-umi-prd-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione decimali quantita'          *
      *                  *---------------------------------------------*
           move      w-let-arc-dcp-deq    to   w-tes-dec-qta (1)      .
       acc-cod-dcp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-cod-dcp-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-cod-dcp-100.
       acc-cod-dcp-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Codice prodotto [dps]        *
      *    *-----------------------------------------------------------*
       acc-cod-dps-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-dps-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-dps-ope      .
           move      "A"                  to   w-cod-cod-dps-tac      .
           move      w-tes-num-mag (1)    to   w-cod-cod-dps-num      .
           move      w-tes-alf-mag (1)    to   w-cod-cod-dps-alf      .
           move      10                   to   w-cod-cod-dps-lin      .
           move      26                   to   w-cod-cod-dps-pos      .
           move      10                   to   w-cod-cod-dps-dln      .
           move      26                   to   w-cod-cod-dps-dps      .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           if        w-cnt-sts-imp-tes    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   cod-cod-dps-cll-000  thru cod-cod-dps-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dps-foi-000  thru cod-cod-dps-foi-999    .
       acc-cod-dps-110.
           perform   cod-cod-dps-cll-000  thru cod-cod-dps-cll-999    .
           if        w-cod-cod-dps-ope    =    "F+"
                     go to acc-cod-dps-115.
           if        w-cod-cod-dps-ope    =    "AC"
                     go to acc-cod-dps-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-dps-115.
           perform   cod-cod-dps-foi-000  thru cod-cod-dps-foi-999    .
           go to     acc-cod-dps-110.
       acc-cod-dps-120.
           move      w-cod-cod-dps-alf    to   v-alf                  .
           move      w-cod-cod-dps-num    to   v-num                  .
       acc-cod-dps-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-cod-dps-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-cod-dps-999.
       acc-cod-dps-200.
      *              *-------------------------------------------------*
      *              * Valore impostato                                *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-alf-mag (1)      .
           move      v-num                to   w-tes-num-mag (1)      .
       acc-cod-dps-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dps]                      *
      *                  *---------------------------------------------*
           move      w-tes-num-mag (1)    to   w-let-arc-dps-cod      .
           perform   let-arc-dps-000      thru let-arc-dps-999        .
           move      w-let-arc-dps-des    to   w-tes-des-mag (1)      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione magazzino       *
      *                  *---------------------------------------------*
           perform   vis-des-mag-000      thru vis-des-mag-999        .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-dps-flg    not  = spaces
                     go to acc-cod-dps-100.
      *                  *---------------------------------------------*
      *                  * Se codice a zero : reimpostazione, a meno   *
      *                  * che non si sia in Up                        *
      *                  *---------------------------------------------*
           if        w-tes-num-mag (1)    not  = zero
                     go to acc-cod-dps-600.
           if        v-key                =    "UP  "
                     go to acc-cod-dps-600
           else      go to acc-cod-dps-100.
       acc-cod-dps-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione unita' di misura            *
      *                  *---------------------------------------------*
           move      w-let-arc-dps-umi    to   w-tes-umi-prd (1)      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione unita' di misura            *
      *                  *---------------------------------------------*
           perform   vis-umi-prd-000      thru vis-umi-prd-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione decimali quantita'          *
      *                  *---------------------------------------------*
           move      w-let-arc-dps-deq    to   w-tes-dec-qta (1)      .
       acc-cod-dps-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-cod-dps-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-cod-dps-100.
       acc-cod-dps-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Unita' di misura per la   *
      *    * produzione                                                *
      *    *-----------------------------------------------------------*
       vis-umi-prd-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      w-tes-umi-prd (1)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-umi-prd-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Quantita' da produrre        *
      *    *-----------------------------------------------------------*
       acc-qta-dap-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-qta-dap-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      w-tes-dec-qta (1)    to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB<"                to   v-edm                  .
           move      12                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      w-tes-qta-dap (1)    to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-qta-dap-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-qta-dap-999.
       acc-qta-dap-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-qta-dap (1)      .
       acc-qta-dap-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore zero non ammesso, a meno che non si  *
      *                  * sia in Up                                   *
      *                  *---------------------------------------------*
           if        w-tes-qta-dap (1)    not  = zero
                     go to acc-qta-dap-600.
           if        v-key                =    "UP  "
                     go to acc-qta-dap-600
           else      go to acc-qta-dap-100.
       acc-qta-dap-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-qta-dap-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-qta-dap-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-qta-dap-100.
       acc-qta-dap-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Quantita' da produrre     *
      *    *-----------------------------------------------------------*
       vis-qta-dap-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      w-tes-dec-qta (1)    to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB<"                to   v-edm                  .
           move      12                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-qta-dap (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-qta-dap-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Commento ad uso interno      *
      *    *-----------------------------------------------------------*
       acc-com-int-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-com-int-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "T"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      03                   to   v-ldt                  .
           move      16                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      w-tes-com-int (1)    to   v-txt                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-com-int-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-com-int-999.
      *              *-------------------------------------------------*
      *              * Valore impostato                                *
      *              *-------------------------------------------------*
           move      v-txt                to   w-tes-com-int (1)      .
       acc-com-int-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-com-int-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-com-int-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-com-int-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-com-int-100.
       acc-com-int-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Commento ad uso interno   *
      *    *-----------------------------------------------------------*
       vis-com-int-000.
           move      "DS"                 to   v-ope                  .
           move      "T"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      03                   to   v-ldt                  .
           move      16                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      w-tes-com-int (1)    to   v-txt                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-com-int-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi chiave           *
      *    *-----------------------------------------------------------*
       cnt-tdo-key-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-key-flg      .
      *              *-------------------------------------------------*
      *              * Test su tipo movimento                          *
      *              *-------------------------------------------------*
           if        w-tes-tmo-cdp        not  = spaces
                     go to cnt-tdo-key-100.
           move      "Manca il tipo movimento !"
                                          to   w-err-box-err-msg      .
           go to     cnt-tdo-key-900.
       cnt-tdo-key-100.
      *              *-------------------------------------------------*
      *              * Test su data documento                          *
      *              *-------------------------------------------------*
           if        w-tes-dat-doc        not  = zero
                     go to cnt-tdo-key-200.
           move      "Manca la data documento !"
                                          to   w-err-box-err-msg      .
           go to     cnt-tdo-key-900.
       cnt-tdo-key-200.
      *              *-------------------------------------------------*
      *              * Normalizzazioni                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Completamento numero documento              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Secolo/Anno                             *
      *                      *-----------------------------------------*
           move      w-tes-dat-doc        to   s-dat                  .
           move      s-saa                to   w-tes-num-doc-saa      .
      *                      *-----------------------------------------*
      *                      * Codice dipendenza                       *
      *                      *-----------------------------------------*
           move      w-tes-cod-dpz        to   w-tes-num-doc-dpz      .
      *              *-------------------------------------------------*
      *              * Uscita per controlli superati                   *
      *              *-------------------------------------------------*
           go to     cnt-tdo-key-999.
       cnt-tdo-key-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *              *-------------------------------------------------*
      *              * Flag di uscita ad errore                        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-tdo-key-flg      .
       cnt-tdo-key-999.
           exit.
           
      *    *===========================================================*
      *    * Controllo se chiave vuota                                 *
      *    *-----------------------------------------------------------*
       cnt-key-vuo-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-key-vuo-flg      .
      *              *-------------------------------------------------*
      *              * Test                                            *
      *              *-------------------------------------------------*
           if        w-tes-tmo-cdp        =    spaces
                     move  "#"            to   w-cnt-key-vuo-flg      .
       cnt-key-vuo-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi non chiave       *
      *    *-----------------------------------------------------------*
       cnt-tdo-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-nok-flg      .
       cnt-tdo-nok-020.
      *              *-------------------------------------------------*
      *              * Normalizzazione destinazione produzione         *
      *              *-------------------------------------------------*
           if        w-tes-dsz-prd (1)    =    zero
                     move  01             to   w-tes-dsz-prd (1)      .
       cnt-tdo-nok-040.
      *              *-------------------------------------------------*
      *              * Test su codice per la destinazione della produ- *
      *              * zione                                           *
      *              *-------------------------------------------------*
           if        w-tes-dsz-prd (1)    not  = 02
                     go to cnt-tdo-nok-060.
           if        w-tes-dsz-cod (1)    not  = zero
                     go to cnt-tdo-nok-060.
           move      "Manca il codice cliente destinatario della produzi
      -              "one !"              to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-060.
      *              *-------------------------------------------------*
      *              * Normalizzazione Esecuzione della produzione     *
      *              *-------------------------------------------------*
           if        w-tes-esz-prd (1)    =    zero
                     move  01             to   w-tes-esz-prd (1)      .
       cnt-tdo-nok-080.
      *              *-------------------------------------------------*
      *              * Test su codice per l'esecuzione della produzio- *
      *              * ne                                              *
      *              *-------------------------------------------------*
           if        w-tes-esz-prd (1)    not  = 02
                     go to cnt-tdo-nok-100.
           if        w-tes-esz-cod (1)    not  = zero
                     go to cnt-tdo-nok-100.
           move      "Manca il codice fornitore esecutore della produzio
      -              "ne !  "             to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-100.
      *              *-------------------------------------------------*
      *              * Test su tipo codice di magazzino                *
      *              *-------------------------------------------------*
           if        w-tes-tip-mag (1)    not  = zero
                     go to cnt-tdo-nok-120.
           move      "Manca il tipo prodotto !                          
      -              "      "             to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-120.
      *              *-------------------------------------------------*
      *              * Test su codice di magazzino                     *
      *              *-------------------------------------------------*
           if        w-tes-num-mag (1)    not  = zero
                     go to cnt-tdo-nok-140.
           move      "Manca il codice prodotto !                        
      -              "      "             to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-140.
      *              *-------------------------------------------------*
      *              * Test su quantita' da produrre                   *
      *              *-------------------------------------------------*
           if        w-tes-qta-dap (1)    not  = zero
                     go to cnt-tdo-nok-200.
           move      "Manca la quantita' da produrre !                  
      -              "      "             to   w-err-box-err-msg      .
           go to     cnt-tdo-nok-900.
       cnt-tdo-nok-200.
      *              *-------------------------------------------------*
      *              * Uscita per controlli superati                   *
      *              *-------------------------------------------------*
           go to     cnt-tdo-nok-999.
       cnt-tdo-nok-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *              *-------------------------------------------------*
      *              * Flag di uscita ad errore                        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-tdo-nok-flg      .
       cnt-tdo-nok-999.
           exit.
           
      *    *===========================================================*
      *    * Normalizzazione dati chiave e non chiave                  *
      *    *-----------------------------------------------------------*
       nor-key-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione dati chiave                     *
      *              *-------------------------------------------------*
           perform   nor-key-reg-000      thru nor-key-reg-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave testata         *
      *              *-------------------------------------------------*
           perform   nor-nok-tes-000      thru nor-nok-tes-999        .
       nor-key-nok-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati chiave                               *
      *    *-----------------------------------------------------------*
       nor-key-reg-000.
           move      zero                 to   w-tes-num-prt          .
           move      spaces               to   w-tes-tmo-cdp          .
           move      spaces               to   w-tes-tmo-cdp-des      .
           move      zero                 to   w-tes-tmo-cdp-vld      .
           move      zero                 to   w-tes-tmo-cdp-dpz      .
           move      zero                 to   w-tes-tmo-cdp-ord      .
           move      zero                 to   w-tes-tmo-cdp-prd      .
           move      spaces               to   w-tes-tmo-cdp-sgl      .
           move      zero                 to   w-tes-num-doc          .
           move      zero                 to   w-tes-dat-doc          .
           move      spaces               to   w-tes-sgl-num          .
       nor-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave testata                   *
      *    *-----------------------------------------------------------*
       nor-nok-tes-000.
           move      zero                 to   w-tes-dsz-prd (1)      .
           move      zero                 to   w-tes-dsz-cod (1)      .
           move      spaces               to   w-tes-dsz-cod-rag (1)  .
           move      spaces               to   w-tes-dsz-dpz (1)      .
           move      spaces               to   w-tes-dsz-dpz-rag (1)  .
           move      zero                 to   w-tes-esz-prd (1)      .
           move      zero                 to   w-tes-esz-cod (1)      .
           move      spaces               to   w-tes-esz-cod-rag (1)  .
           move      spaces               to   w-tes-esz-dpz (1)      .
           move      spaces               to   w-tes-esz-dpz-rag (1)  .
           move      zero                 to   w-tes-dat-cns (1)      .
           move      spaces               to   w-tes-pri-prd (1)      .
           move      spaces               to   w-tes-com-int (1)      .
           move      spaces               to   w-tes-voc-des (1, 1)   .
           move      spaces               to   w-tes-voc-des (1, 2)   .
           move      spaces               to   w-tes-voc-des (1, 3)   .
           move      spaces               to   w-tes-voc-des (1, 4)   .
           move      spaces               to   w-tes-voc-des (1, 5)   .
           move      spaces               to   w-tes-voc-des (1, 6)   .
           move      zero                 to   w-tes-tip-mag (1)      .
           move      zero                 to   w-tes-num-mag (1)      .
           move      spaces               to   w-tes-alf-mag (1)      .
           move      spaces               to   w-tes-des-mag (1)      .
           move      spaces               to   w-tes-sgl-vrn (1)      .
           move      spaces               to   w-tes-umi-prd (1)      .
           move      zero                 to   w-tes-dec-qta (1)      .
           move      zero                 to   w-tes-qta-dap (1)      .
           move      spaces               to   w-tes-cod-dsl (1)      .
           move      zero                 to   w-tes-snx-2qt (1)      .
           move      zero                 to   w-tes-dec-2qt (1)      .
           move      zero                 to   w-tes-qta-a02 (1)      .
           move      zero                 to   w-tes-snx-3qt (1)      .
           move      zero                 to   w-tes-dec-3qt (1)      .
           move      zero                 to   w-tes-qta-a03 (1)      .
           move      zero                 to   w-tes-ctr-stp (1)      .
           move      spaces               to   w-tes-sdc-ccs (1)      .
           move      spaces               to   w-tes-flg-cch (1)      .
           move      spaces               to   w-tes-flg-ela (1)      .
           move      spaces               to   w-tes-flg-pul (1)      .
           move      spaces               to   w-tes-alx-exp (1)      .
       nor-nok-tes-999.
           exit.

      *    *===========================================================*
      *    * Lettura registrazione pre-esistente                       *
      *    *-----------------------------------------------------------*
       rou-let-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-let-reg      .
      *              *-------------------------------------------------*
      *              * Se progressivo documento a zero : a inserimento *
      *              *-------------------------------------------------*
           if        w-tes-num-doc-prg    =    zero
                     go to rou-let-reg-050.
      *              *-------------------------------------------------*
      *              * Determinazione se documento esistente           *
      *              *-------------------------------------------------*
           perform   det-doc-ges-000      thru det-doc-ges-999        .
      *              *-------------------------------------------------*
      *              * Se documento non esistente : Inserimento        *
      *              *-------------------------------------------------*
           if        w-det-doc-ges-snx    =    "N"
                     go to rou-let-reg-050.
      *              *-------------------------------------------------*
      *              * Se documento esistente : Modifica               *
      *              *-------------------------------------------------*
           if        w-det-doc-ges-snx    =    "S"
                     go to rou-let-reg-100.
      *              *-------------------------------------------------*
      *              * Se documento esistente ma con tipo movimento    *
      *              * diverso                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "Movimento esistente, ma di tipo '"
                                delimited by   size
                     w-det-doc-ges-tmt
                                delimited by   spaces
                     "' !"
                                delimited by   size
                                          into w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-rou-let-reg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-050.
      *                  *---------------------------------------------*
      *                  * Se movimento non trovato                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se inserimento consentito          *
      *                      *-----------------------------------------*
           if        w-cnt-mfu-vis-sgr    not  = "V"
                     go to rou-let-reg-060.
      *                      *-----------------------------------------*
      *                      * Flag di uscita                          *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-rou-let-reg      .
      *                      *-----------------------------------------*
      *                      * Messaggio                               *
      *                      *-----------------------------------------*
           move      "Inserimento non consentito !                      
      -              "               "    to   w-err-box-err-msg      .
      *                      *-----------------------------------------*
      *                      * Box di errore                           *
      *                      *-----------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     rou-let-reg-900.
       rou-let-reg-060.
      *                      *-----------------------------------------*
      *                      * Tipo funzionamento : Inserimento        *
      *                      *-----------------------------------------*
           move      "I"                  to   w-cnt-mfu-tip-fun      .
      *                      *-----------------------------------------*
      *                      * Completamento valori attuali chiave     *
      *                      *-----------------------------------------*
           move      w-tes-tmo-cdp-sgl    to   w-tes-sgl-num          .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-100.
      *                  *---------------------------------------------*
      *                  * Se movimento trovato                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo funzionamento : Modifica           *
      *                      *-----------------------------------------*
           move      "M"                  to   w-cnt-mfu-tip-fun      .
      *                      *-----------------------------------------*
      *                      * Completamento valori attuali chiave     *
      *                      *-----------------------------------------*
           move      rf-cdp-num-prt       to   w-tes-num-prt          .
           move      rf-cdp-sgl-num       to   w-tes-sgl-num          .
      *                      *-----------------------------------------*
      *                      * Determinazione valori attuali           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Valori contenuti direttamente in    *
      *                          * record [cdp]                        *
      *                          *-------------------------------------*
           move      rf-cdp-dsz-prd       to   w-tes-dsz-prd (1)      .
           move      rf-cdp-dsz-cod       to   w-tes-dsz-cod (1)      .
           move      rf-cdp-dsz-dpz       to   w-tes-dsz-dpz (1)      .
           move      rf-cdp-esz-prd       to   w-tes-esz-prd (1)      .
           move      rf-cdp-esz-cod       to   w-tes-esz-cod (1)      .
           move      rf-cdp-esz-dpz       to   w-tes-esz-dpz (1)      .
           move      rf-cdp-dat-cns       to   w-tes-dat-cns (1)      .
           move      rf-cdp-pri-prd       to   w-tes-pri-prd (1)      .
           move      rf-cdp-com-int       to   w-tes-com-int (1)      .
           move      rf-cdp-voc-des (1)   to   w-tes-voc-des (1, 1)   .
           move      rf-cdp-voc-des (2)   to   w-tes-voc-des (1, 2)   .
           move      rf-cdp-voc-des (3)   to   w-tes-voc-des (1, 3)   .
           move      rf-cdp-voc-des (4)   to   w-tes-voc-des (1, 4)   .
           move      rf-cdp-voc-des (5)   to   w-tes-voc-des (1, 5)   .
           move      rf-cdp-voc-des (6)   to   w-tes-voc-des (1, 6)   .
           move      rf-cdp-tip-mag       to   w-tes-tip-mag (1)      .
           move      rf-cdp-num-mag       to   w-tes-num-mag (1)      .
           move      rf-cdp-alf-mag       to   w-tes-alf-mag (1)      .
           move      rf-cdp-sgl-vrn       to   w-tes-sgl-vrn (1)      .
           move      rf-cdp-umi-prd       to   w-tes-umi-prd (1)      .
           move      rf-cdp-dec-qta       to   w-tes-dec-qta (1)      .
           move      rf-cdp-qta-dap       to   w-tes-qta-dap (1)      .
           move      rf-cdp-cod-dsl       to   w-tes-cod-dsl (1)      .
           move      rf-cdp-snx-2qt       to   w-tes-snx-2qt (1)      .
           move      rf-cdp-dec-2qt       to   w-tes-dec-2qt (1)      .
           move      rf-cdp-qta-a02       to   w-tes-qta-a02 (1)      .
           move      rf-cdp-snx-3qt       to   w-tes-snx-3qt (1)      .
           move      rf-cdp-dec-3qt       to   w-tes-dec-3qt (1)      .
           move      rf-cdp-qta-a03       to   w-tes-qta-a03 (1)      .
           move      rf-cdp-ctr-stp       to   w-tes-ctr-stp (1)      .
           move      rf-cdp-sdc-ccs       to   w-tes-sdc-ccs (1)      .
           move      rf-cdp-flg-cch       to   w-tes-flg-cch (1)      .
           move      rf-cdp-flg-ela       to   w-tes-flg-ela (1)      .
           move      rf-cdp-flg-pul       to   w-tes-flg-pul (1)      .
           move      rf-cdp-alx-exp       to   w-tes-alx-exp (1)      .
       rou-let-reg-200.
      *                          *-------------------------------------*
      *                          * Valori contenuti indirettamente in  *
      *                          * record [cdp]                        *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Lettura record [cli]            *
      *                              *---------------------------------*
           move      w-tes-dsz-cod (1)    to   w-let-arc-cli-cod      .
           perform   let-arc-cli-000      thru let-arc-cli-999        .
           move      w-let-arc-cli-rag    to   w-tes-dsz-cod-rag (1)  .
      *                              *---------------------------------*
      *                              * Lettura record [dcc]            *
      *                              *---------------------------------*
           move      "D"                  to   w-let-arc-dcc-tle      .
           move      w-tes-dsz-cod (1)    to   w-let-arc-dcc-cod      .
           move      w-tes-dsz-dpz (1)    to   w-let-arc-dcc-dpz      .
           perform   let-arc-dcc-000      thru let-arc-dcc-999        .
           move      w-let-arc-dcc-rag    to   w-tes-dsz-dpz-rag (1)  .
      *                              *---------------------------------*
      *                              * Lettura record [fnt]            *
      *                              *---------------------------------*
           move      w-tes-esz-cod (1)    to   w-let-arc-fnt-cod      .
           perform   let-arc-fnt-000      thru let-arc-fnt-999        .
           move      w-let-arc-fnt-rag    to   w-tes-esz-cod-rag (1)  .
      *                              *---------------------------------*
      *                              * Lettura record [dcf]            *
      *                              *---------------------------------*
           move      "D"                  to   w-let-arc-dcf-tle      .
           move      w-tes-esz-cod (1)    to   w-let-arc-dcf-cod      .
           move      w-tes-esz-dpz (1)    to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
           move      w-let-arc-dcf-rag    to   w-tes-esz-dpz-rag (1)  .
      *                              *---------------------------------*
      *                              * Descrizione magazzino           *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Deviazione in funzione del  *
      *                                  * tipo codice di magazzino    *
      *                                  *-----------------------------*
           if        w-tes-tip-mag (1)    =    01
                     go to rou-let-reg-210
           else if   w-tes-tip-mag (1)    =    02
                     go to rou-let-reg-220.
       rou-let-reg-210.
      *                                  *-----------------------------*
      *                                  * Se prodotto di vendita      *
      *                                  *-----------------------------*
           move      w-tes-num-mag (1)    to   w-let-arc-dcp-cod      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
           move      w-let-arc-dcp-des    to   w-tes-des-mag (1)      .
           go to     rou-let-reg-300.
       rou-let-reg-220.
      *                                  *-----------------------------*
      *                                  * Se semilavorato             *
      *                                  *-----------------------------*
           move      w-tes-num-mag (1)    to   w-let-arc-dps-cod      .
           perform   let-arc-dps-000      thru let-arc-dps-999        .
           move      w-let-arc-dps-des    to   w-tes-des-mag (1)      .
           go to     rou-let-reg-300.
       rou-let-reg-300.
      *                      *-----------------------------------------*
      *                      * Valori precedenti anagrafica            *
      *                      *-----------------------------------------*
           move      w-tes-val-aep (1)    to   w-tes-val-aep (2)      .
       rou-let-reg-800.
      *              *-------------------------------------------------*
      *              * Test per visualizzazione                        *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-vis-sgr    =    "V"
                     move  "V"            to   w-cnt-mfu-tip-fun      .
       rou-let-reg-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per inserimento                  *
      *    *-----------------------------------------------------------*
       pre-acc-ins-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-ins      .
      *              *-------------------------------------------------*
      *              * Attribuzione numero protocollo commessa di pro- *
      *              * duzione                                         *
      *              *-------------------------------------------------*
           move      w-tes-dat-doc        to   w-att-cdp-prt-dat      .
           move      w-tes-cod-dpz        to   w-att-cdp-prt-dpz      .
           perform   att-cdp-prt-000      thru att-cdp-prt-999        .
           move      w-att-cdp-prt-num    to   w-tes-num-prt          .
       pre-acc-ins-100.
      *              *-------------------------------------------------*
      *              * Attribuzione numero documento commessa di pro-  *
      *              * duzione                                         *
      *              *-------------------------------------------------*
           move      w-tes-num-doc        to   w-att-cdp-ndo-num      .
           move      w-tes-dat-doc        to   w-att-cdp-ndo-dat      .
           move      w-tes-cod-dpz        to   w-att-cdp-ndo-dpz      .
           move      w-tes-tmo-cdp-sgl    to   w-att-cdp-ndo-sgl      .
           perform   att-cdp-ndo-000      thru att-cdp-ndo-999        .
           move      w-att-cdp-ndo-num    to   w-tes-num-doc          .
       pre-acc-ins-200.
      *              *-------------------------------------------------*
      *              * Se errore                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        w-att-cdp-ndo-flg    =    spaces
                     go to pre-acc-ins-300.
      *                  *---------------------------------------------*
      *                  * Ripristino numero protocollo                *
      *                  *---------------------------------------------*
           move      w-tes-dat-doc        to   w-att-cdp-prt-dat      .
           move      w-tes-cod-dpz        to   w-att-cdp-prt-dpz      .
           move      w-tes-num-prt        to   w-att-cdp-prt-num      .
           perform   rip-cdp-prt-000      thru rip-cdp-prt-999        .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-acc-ins      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pre-acc-ins-999.
       pre-acc-ins-300.
      *              *-------------------------------------------------*
      *              * Visualizzazione numero documento                *
      *              *-------------------------------------------------*
           perform   vis-num-doc-000      thru vis-num-doc-999        .
       pre-acc-ins-400.
      *              *-------------------------------------------------*
      *              * Test di congruenza tra data e numero documento  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione                                *
      *                  *---------------------------------------------*
           move      w-tes-cod-dpz        to    w-cdn-cdp-inp-dpz     .
           move      w-tes-tmo-cdp-sgl    to    w-cdn-cdp-inp-sgl     .
           move      w-tes-dat-doc        to    w-cdn-cdp-inp-dat     .
           move      w-tes-num-doc        to    w-cdn-cdp-inp-num     .
      *                  *---------------------------------------------*
      *                  * Richiamo routine di controllo               *
      *                  *---------------------------------------------*
           perform   rou-cdn-cdp-000      thru rou-cdn-cdp-999        .
      *                  *---------------------------------------------*
      *                  * Se errore                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        w-cdn-cdp-out-flg    =    spaces
                     go to pre-acc-ins-999.
      *                      *-----------------------------------------*
      *                      * Ripristino numero protocollo            *
      *                      *-----------------------------------------*
           move      w-tes-dat-doc        to   w-att-cdp-prt-dat      .
           move      w-tes-cod-dpz        to   w-att-cdp-prt-dpz      .
           move      w-tes-num-prt        to   w-att-cdp-prt-num      .
           perform   rip-cdp-prt-000      thru rip-cdp-prt-999        .
      *                      *-----------------------------------------*
      *                      * Ripristino numero documento             *
      *                      *-----------------------------------------*
           move      w-tes-dat-doc        to   w-att-cdp-ndo-dat      .
           move      w-tes-cod-dpz        to   w-att-cdp-ndo-dpz      .
           move      w-tes-tmo-cdp-sgl    to   w-att-cdp-ndo-sgl      .
           move      w-tes-num-doc        to   w-att-cdp-ndo-num      .
           perform   rip-cdp-ndo-000      thru rip-cdp-ndo-999        .
      *                      *-----------------------------------------*
      *                      * Flag di uscita ad errore                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-pre-acc-ins      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     pre-acc-ins-999.
       pre-acc-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per modifica                     *
      *    *-----------------------------------------------------------*
       pre-acc-mod-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-mod      .
       pre-acc-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per visualizzazione              *
      *    *-----------------------------------------------------------*
       pre-acc-vis-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-vis      .
       pre-acc-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-richiesta di ratifica tasto Delete            *
      *    *-----------------------------------------------------------*
       pre-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-snx-del      .
       pre-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-richiesta di ratifica tasto Delete           *
      *    *-----------------------------------------------------------*
       pos-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pos-snx-del      .
       pos-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su inserimento                          *
      *    *-----------------------------------------------------------*
       pos-exi-ins-000.
      *              *-------------------------------------------------*
      *              * Ripristino numero protocollo commessa di produ- *
      *              * zione                                           *
      *              *-------------------------------------------------*
           move      w-tes-dat-doc        to   w-att-cdp-prt-dat      .
           move      w-tes-cod-dpz        to   w-att-cdp-prt-dpz      .
           move      w-tes-num-prt        to   w-att-cdp-prt-num      .
           perform   rip-cdp-prt-000      thru rip-cdp-prt-999        .
       pos-exi-ins-100.
      *              *-------------------------------------------------*
      *              * Ripristino numero documento commessa di produ-  *
      *              * zione                                           *
      *              *-------------------------------------------------*
           move      w-tes-dat-doc        to   w-att-cdp-ndo-dat      .
           move      w-tes-cod-dpz        to   w-att-cdp-ndo-dpz      .
           move      w-tes-tmo-cdp-sgl    to   w-att-cdp-ndo-sgl      .
           move      w-tes-num-doc        to   w-att-cdp-ndo-num      .
           perform   rip-cdp-ndo-000      thru rip-cdp-ndo-999        .
       pos-exi-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su modifica                             *
      *    *-----------------------------------------------------------*
       pos-exi-mod-000.
       pos-exi-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su visualizzazione                      *
      *    *-----------------------------------------------------------*
       pos-exi-vis-000.
       pos-exi-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di inserimento                      *
      *    *-----------------------------------------------------------*
       pos-cnf-ins-000.
      *              *-------------------------------------------------*
      *              * Aggiornamento della data di registrazione di    *
      *              * default                                         *
      *              *-------------------------------------------------*
           move      w-tes-dat-doc        to   w-def-dat-doc          .
      *              *-------------------------------------------------*
      *              * Aggiornamento del tipo movimento di default     *
      *              *-------------------------------------------------*
           move      w-tes-tmo-cdp        to   w-def-tmo-cdp          .
      *              *-------------------------------------------------*
      *              * Scrittura movimento su files                    *
      *              *-------------------------------------------------*
           perform   scr-mov-fil-000      thru scr-mov-fil-999        .
       pos-cnf-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di modifica                         *
      *    *-----------------------------------------------------------*
       pos-cnf-mod-000.
      *              *-------------------------------------------------*
      *              * Scrittura movimento su files                    *
      *              *-------------------------------------------------*
           perform   scr-mov-fil-000      thru scr-mov-fil-999        .
       pos-cnf-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di annullamento                     *
      *    *-----------------------------------------------------------*
       pos-cnf-ann-000.
      *              *-------------------------------------------------*
      *              * Delete movimento da files                       *
      *              *-------------------------------------------------*
           perform   del-mov-fil-000      thru del-mov-fil-999        .
       pos-cnf-ann-999.
           exit.

      *    *===========================================================*
      *    * Routine di attribuzione numero protocollo commessa di     *
      *    * produzione                                                *
      *    *-----------------------------------------------------------*
       att-cdp-prt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-prt             .
      *              *-------------------------------------------------*
      *              * Preparazione chiave per lettura tabella numera- *
      *              * zioni [cdpprt]                                  *
      *              *-------------------------------------------------*
           move      w-att-cdp-prt-dat    to   s-dat                  .
           move      s-saa                to   w-att-cdp-prt-saa      .
           move      w-att-cdp-prt-saa    to   rn-cdp-prt-scl-ann     .
           move      w-att-cdp-prt-dpz    to   rn-cdp-prt-cod-dpz     .
      *              *-------------------------------------------------*
      *              * Lettura tabella numerazioni [cdpprt]            *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-prt             .
      *              *-------------------------------------------------*
      *              * Test su esito operazione                        *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to att-cdp-prt-100.
      *                  *---------------------------------------------*
      *                  * Record non trovato                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Composizione record normalizzato        *
      *                      *-----------------------------------------*
           move      zero                 to   rn-cdp-prt-num-prt     .
      *                      *-----------------------------------------*
      *                      * Scrittura record normalizzato           *
      *                      *-----------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-prt             .
      *                      *-----------------------------------------*
      *                      * Ripetizione dell'intera operazione      *
      *                      *-----------------------------------------*
           go to     att-cdp-prt-000.
       att-cdp-prt-100.
      *                  *---------------------------------------------*
      *                  * Record trovato                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Numero protocollo in work di comodo     *
      *                      *-----------------------------------------*
           move      rn-cdp-prt-num-prt   to   w-att-cdp-prt-wnu      .
      *                      *-----------------------------------------*
      *                      * Aggiornamento numero protocollo         *
      *                      *-----------------------------------------*
           add       1                    to   w-att-cdp-prt-wpr      .
           if        w-att-cdp-prt-wpr    =    zero
                     move  1              to   w-att-cdp-prt-wpr      .
      *                      *-----------------------------------------*
      *                      * Forzatura secolo/anno                   *
      *                      *-----------------------------------------*
           move      w-att-cdp-prt-saa    to   w-att-cdp-prt-wsa      .
      *                      *-----------------------------------------*
      *                      * Forzatura dipendenza                    *
      *                      *-----------------------------------------*
           move      w-att-cdp-prt-dpz    to   w-att-cdp-prt-wdz      .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione numero protocollo       *
      *                      *-----------------------------------------*
           move      w-att-cdp-prt-wnu    to   rn-cdp-prt-num-prt     .
      *                      *-----------------------------------------*
      *                      * Update record                           *
      *                      *-----------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-prt             .
      *                      *-----------------------------------------*
      *                      * Se errori ripete l'intera operazione    *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to att-cdp-prt-000.
      *                      *-----------------------------------------*
      *                      * Unlock record                           *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-prt             .
      *                      *-----------------------------------------*
      *                      * Valore in uscita                        *
      *                      *-----------------------------------------*
           move      rn-cdp-prt-num-prt   to   w-att-cdp-prt-num      .
       att-cdp-prt-999.
           exit.

      *    *===========================================================*
      *    * Routine di ripristino numero protocollo commessa di pro-  *
      *    * duzione                                                   *
      *    *-----------------------------------------------------------*
       rip-cdp-prt-000.
      *              *-------------------------------------------------*
      *              * Preparazione chiave per lettura tabella numera- *
      *              * zioni [cdpprt]                                  *
      *              *-------------------------------------------------*
           move      w-att-cdp-prt-dat    to   s-dat                  .
           move      s-saa                to   w-att-cdp-prt-saa      .
           move      w-att-cdp-prt-saa    to   rn-cdp-prt-scl-ann     .
           move      w-att-cdp-prt-dpz    to   rn-cdp-prt-cod-dpz     .
      *              *-------------------------------------------------*
      *              * Lettura tabella numerazioni [cdpprt]            *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-prt             .
      *              *-------------------------------------------------*
      *              * Se record non trovato : unlock e uscita         *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to rip-cdp-prt-900.
      *              *-------------------------------------------------*
      *              * Se record trovato                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Confronto con il numero protocollo passato; *
      *                  * se diverso unlock e uscita                  *
      *                  *---------------------------------------------*
           if        rn-cdp-prt-num-prt   not  = w-att-cdp-prt-num
                     go to  rip-cdp-prt-900.
      *                  *---------------------------------------------*
      *                  * Se uguale si esegue il controaggiornamento  *
      *                  *---------------------------------------------*
           move      w-att-cdp-prt-num    to   w-att-cdp-prt-wnu      .
           subtract  1                    from w-att-cdp-prt-wpr      .
           if        w-att-cdp-prt-wpr    =    zero
                     move  zero           to   w-att-cdp-prt-wnu      .
           move      w-att-cdp-prt-wnu    to   rn-cdp-prt-num-prt     .
      *                  *---------------------------------------------*
      *                  * Update record                               *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-prt             .
       rip-cdp-prt-900.
      *              *-------------------------------------------------*
      *              * Unlock                                          *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpprt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-prt             .
       rip-cdp-prt-999.
           exit.

      *    *===========================================================*
      *    * Routine di attribuzione numero documento commesse di pro- *
      *    * duzione                                                   *
      *    *-----------------------------------------------------------*
       att-cdp-ndo-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-att-cdp-ndo-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
      *              *-------------------------------------------------*
      *              * Composizione chiave per lettura                 *
      *              *-------------------------------------------------*
           move      w-att-cdp-ndo-dat    to   s-dat                  .
           move      s-saa                to   w-att-cdp-ndo-saa      .
           move      w-att-cdp-ndo-saa    to   rn-cdp-ndo-scl-ann     .
           move      w-att-cdp-ndo-dpz    to   rn-cdp-ndo-cod-dpz     .
           move      w-att-cdp-ndo-sgl    to   rn-cdp-ndo-sgl-num     .
      *              *-------------------------------------------------*
      *              * Lettura numerazione                             *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
           if        f-sts                =    e-not-err
                     go to att-cdp-ndo-100.
      *              *-------------------------------------------------*
      *              * Se numerazione non esistente la si crea norma-  *
      *              * lizzata a zero                                  *
      *              *-------------------------------------------------*
           move      zero                 to   rn-cdp-ndo-num-doc     .
           move      zero                 to   rn-cdp-ndo-dat-doc     .
           move      "PT"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
           move      "RL"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
           go to     att-cdp-ndo-000.
       att-cdp-ndo-100.
      *              *-------------------------------------------------*
      *              * Se numerazione esistente                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valori originali            *
      *                  *---------------------------------------------*
           move      rn-cdp-ndo-num-doc   to   w-att-cdp-ndo-nsv      .
           move      rn-cdp-ndo-dat-doc   to   w-att-cdp-ndo-dsv      .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del numero documento   *
      *                  * impostato                                   *
      *                  *---------------------------------------------*
           if        w-att-cdp-ndo-prg    =    zero
                     go to att-cdp-ndo-200
           else      go to att-cdp-ndo-300.
       att-cdp-ndo-200.
      *                  *---------------------------------------------*
      *                  * Se numero documento passato a zero          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Valore record in comodo ridefinito      *
      *                      *-----------------------------------------*
           move      rn-cdp-ndo-num-doc   to   w-att-cdp-ndo-wnu      .
      *                      *-----------------------------------------*
      *                      * Incremento numero progressivo del comodo*
      *                      * ridefinito                              *
      *                      *-----------------------------------------*
           add       1                    to   w-att-cdp-ndo-wpr      .
           if        w-att-cdp-ndo-wpr    =    zero
                     move  1              to   w-att-cdp-ndo-wpr      .
      *                      *-----------------------------------------*
      *                      * Forzatura secolo/anno                   *
      *                      *-----------------------------------------*
           move      w-att-cdp-ndo-saa    to   w-att-cdp-ndo-wsa      .
      *                      *-----------------------------------------*
      *                      * Forzatura dipendenza                    *
      *                      *-----------------------------------------*
           move      w-att-cdp-ndo-dpz    to   w-att-cdp-ndo-wdz      .
      *                      *-----------------------------------------*
      *                      * Movimento da comodo ridefinito a record *
      *                      *-----------------------------------------*
           move      w-att-cdp-ndo-wnu    to   rn-cdp-ndo-num-doc     .
      *                      *-----------------------------------------*
      *                      * Data documento                          *
      *                      *-----------------------------------------*
           move      w-att-cdp-ndo-dat    to   rn-cdp-ndo-dat-doc     .
      *                      *-----------------------------------------*
      *                      * Update record                           *
      *                      *-----------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
      *                      *-----------------------------------------*
      *                      * Se errori ripete l'intera operazione    *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to att-cdp-ndo-000.
      *                      *-----------------------------------------*
      *                      * Unlock                                  *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
      *                      *-----------------------------------------*
      *                      * Salvataggio nuovo valore                *
      *                      *-----------------------------------------*
           move      rn-cdp-ndo-num-doc   to   w-att-cdp-ndo-new      .
      *                      *-----------------------------------------*
      *                      * Valore in uscita                        *
      *                      *-----------------------------------------*
           move      rn-cdp-ndo-num-doc   to   w-att-cdp-ndo-num      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     att-cdp-ndo-999.
       att-cdp-ndo-300.
      *                  *---------------------------------------------*
      *                  * Se numero documento passato non a zero      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se numero documento passato minore o u- *
      *                      * guale a quello letto : uscita           *
      *                      *-----------------------------------------*
           if        w-att-cdp-ndo-num    >    w-att-cdp-ndo-nsv
                     go to att-cdp-ndo-320.
      *                          *-------------------------------------*
      *                          * Unlock                              *
      *                          *-------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
      *                          *-------------------------------------*
      *                          * Azzeramento nuovo numero documento  *
      *                          *-------------------------------------*
           move      zero                 to   w-att-cdp-ndo-new      .
           go to     att-cdp-ndo-999.
       att-cdp-ndo-320.
      *                      *-----------------------------------------*
      *                      * Se numero documento passato maggiore di *
      *                      * quello letto                            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se e' maggiore di un'unita' : come  *
      *                          * se fosse stato passato a zero       *
      *                          *-------------------------------------*
           move      w-att-cdp-ndo-nsv    to   w-att-cdp-ndo-wnu      .
           add       1                    to   w-att-cdp-ndo-wpr      .
           if        w-att-cdp-ndo-wpr    =    zero
                     move  1              to   w-att-cdp-ndo-wpr      .
           if        w-att-cdp-ndo-prg    =    w-att-cdp-ndo-wpr
                     go to att-cdp-ndo-200.
       att-cdp-ndo-400.
      *                          *-------------------------------------*
      *                          * Se invece e' maggiore di piu' di    *
      *                          * un'unita'                           *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Salvataggio del video attuale   *
      *                              *---------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Video in Off                    *
      *                              *---------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Box per messaggio all'operatore *
      *                              *---------------------------------*
           move      "BX"                 to   v-ope                  .
           move      09                   to   v-lin                  .
           move      18                   to   v-lto                  .
           move      09                   to   v-pos                  .
           move      72                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Messaggi entro il box           *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Titolo centrale             *
      *                                  *-----------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      11                   to   v-pos                  .
           move      "                      A T T E N Z I O N E         
      -              "          "         to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                  *-----------------------------*
      *                                  * Numeri saltati              *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Preparazione differenza *
      *                                      *-------------------------*
           move      w-att-cdp-ndo-prg    to   w-att-cdp-ndo-wdf      .
           subtract  w-att-cdp-ndo-wpr    from w-att-cdp-ndo-wdf      .
           add       1                    to   w-att-cdp-ndo-wdf      .
      *                                      *-------------------------*
      *                                      * Preparazione numero     *
      *                                      *-------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-att-cdp-ndo-wdf    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                                      *-------------------------*
      *                                      * Stringa per 1 numero    *
      *                                      *-------------------------*
           if        v-num                >    1
                     go to att-cdp-ndo-410.
           move      spaces               to   v-alf                  .
           string    "La numerazione e' stata aumentata di "
                                delimited by   size
                     v-edt      delimited by   spaces
                     " numero."
                                delimited by   size
                                          into v-alf                  .
           go to     att-cdp-ndo-420.
       att-cdp-ndo-410.
      *                                      *-------------------------*
      *                                      * Stringa per piu' numeri *
      *                                      *-------------------------*
           move      spaces               to   v-alf                  .
           string    "La numerazione e' stata aumentata di "
                                delimited by   size
                     v-edt      delimited by   spaces
                     " numeri."
                                delimited by   size
                                          into v-alf                  .
       att-cdp-ndo-420.
      *                                      *-------------------------*
      *                                      * Visualizzazione stringa *
      *                                      *-------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      11                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                      *-------------------------*
      *                                      * Prompt per richiesta    *
      *                                      *-------------------------*
      *                                          *---------------------*
      *                                          * Preparazione pros-  *
      *                                          * simo numero         *
      *                                          *---------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-att-cdp-ndo-prg    to   v-num                  .
           add       1                    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                                          *---------------------*
      *                                          * Visualizzazione     *
      *                                          *---------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      11                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "Si vuole che prosegua dal numero "
                                delimited by   size
                     v-edt      delimited by   spaces
                     " ?"
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Video in On                     *
      *                              *---------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       att-cdp-ndo-430.
      *                              *---------------------------------*
      *                              * Scelta dell'operatore           *
      *                              *---------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-rat-ndo-lun    to   v-car                  .
           move      w-exp-rat-ndo-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      15                   to   v-lin                  .
           move      54                   to   v-pos                  .
           move      w-exp-rat-ndo-tbl    to   v-txt                  .
           move      "EXIT"               to   v-pfk (20)             .
           move      zero                 to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-num                to   w-exp-rat-ndo-sce      .
      *                              *---------------------------------*
      *                              * Controllo risposta              *
      *                              *---------------------------------*
           if        w-exp-rat-ndo-sce    =    01 or
                     w-exp-rat-ndo-sce    =    02
                     go to att-cdp-ndo-440.
           if        v-key                =    "EXIT"
                     go to att-cdp-ndo-440.
           go to     att-cdp-ndo-430.
       att-cdp-ndo-440.
      *                              *---------------------------------*
      *                              * Ripristino immagine video       *
      *                              *---------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Esame risposta                  *
      *                              *---------------------------------*
           if        v-key                =    "EXIT"
                     move  "#"            to   w-att-cdp-ndo-flg
                     go to att-cdp-ndo-600.
           if        w-exp-rat-ndo-sce    =    01
                     go to att-cdp-ndo-500
           else if   w-exp-rat-ndo-sce    =    02
                     go to att-cdp-ndo-600.
       att-cdp-ndo-500.
      *                              *---------------------------------*
      *                              * Se risposta positiva            *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Aggiornamento numerazione   *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Numero                  *
      *                                      *-------------------------*
           move      w-att-cdp-ndo-num    to   w-att-cdp-ndo-wnu      .
           move      w-att-cdp-ndo-saa    to   w-att-cdp-ndo-wsa      .
           move      w-att-cdp-ndo-dpz    to   w-att-cdp-ndo-wdz      .
           move      w-att-cdp-ndo-wnu    to   rn-cdp-ndo-num-doc     .
      *                                      *-------------------------*
      *                                      * Data                    *
      *                                      *-------------------------*
           move      w-att-cdp-ndo-dat    to   rn-cdp-ndo-dat-doc     .
      *                                  *-----------------------------*
      *                                  * Update record               *
      *                                  *-----------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
      *                                  *-----------------------------*
      *                                  * Se errori ripete l'intera   *
      *                                  * operazione                  *
      *                                  *-----------------------------*
           if        f-sts                not  = e-not-err
                     go to att-cdp-ndo-000.
      *                                  *-----------------------------*
      *                                  * Unlock della numerazione    *
      *                                  *-----------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
      *                                  *-----------------------------*
      *                                  * Salvataggio nuovo valore    *
      *                                  *-----------------------------*
           move      rn-cdp-ndo-num-doc   to   w-att-cdp-ndo-new      .
      *                                  *-----------------------------*
      *                                  * Uscita                      *
      *                                  *-----------------------------*
           go to     att-cdp-ndo-999.
       att-cdp-ndo-600.
      *                              *---------------------------------*
      *                              * Se risposta negativa            *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Unlock della numerazione    *
      *                                  *-----------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
      *                                  *-----------------------------*
      *                                  * Nessun nuovo valore         *
      *                                  *-----------------------------*
           move      zero                 to   w-att-cdp-ndo-new      .
      *                                  *-----------------------------*
      *                                  * Uscita                      *
      *                                  *-----------------------------*
           go to     att-cdp-ndo-999.
       att-cdp-ndo-999.
           exit.

      *    *===========================================================*
      *    * Routine di ripristino numero documento commesse di produ- *
      *    * zione                                                     *
      *    *-----------------------------------------------------------*
       rip-cdp-ndo-000.
      *              *-------------------------------------------------*
      *              * Se nessun nuovo numero documento : uscita       *
      *              *-------------------------------------------------*
           if        w-att-cdp-ndo-new    =    zero
                     go to rip-cdp-ndo-999.
      *              *-------------------------------------------------*
      *              * Composizione chiave per lettura                 *
      *              *-------------------------------------------------*
           move      w-att-cdp-ndo-dat    to   s-dat                  .
           move      s-saa                to   w-att-cdp-ndo-saa      .
           move      w-att-cdp-ndo-saa    to   rn-cdp-ndo-scl-ann     .
           move      w-att-cdp-ndo-dpz    to   rn-cdp-ndo-cod-dpz     .
           move      w-att-cdp-ndo-sgl    to   rn-cdp-ndo-sgl-num     .
      *              *-------------------------------------------------*
      *              * Lettura numerazione                             *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
           if        f-sts                =    e-not-err
                     go to rip-cdp-ndo-100.
      *              *-------------------------------------------------*
      *              * Se numerazione non esistente la si crea norma-  *
      *              * lizzata a zero                                  *
      *              *-------------------------------------------------*
           move      zero                 to   rn-cdp-ndo-num-doc     .
           move      zero                 to   rn-cdp-ndo-dat-doc     .
           move      "PT"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
           go to     rip-cdp-ndo-000.
       rip-cdp-ndo-100.
      *              *-------------------------------------------------*
      *              * Se numerazione esistente                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Controllo se il valore attuale della nume-  *
      *                  * razione e' tuttora inalterato rispetto al-  *
      *                  * l'aggiornamento eseguito in fase di attri-  *
      *                  * buzione del numero                          *
      *                  *---------------------------------------------*
           if        rn-cdp-ndo-num-doc   =    w-att-cdp-ndo-new
                     go to rip-cdp-ndo-200
           else      go to rip-cdp-ndo-400.
       rip-cdp-ndo-200.
      *                  *---------------------------------------------*
      *                  * Se il valore risulta inalterato             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Controaggiornamento record              *
      *                      *-----------------------------------------*
           move      w-att-cdp-ndo-nsv    to   rn-cdp-ndo-num-doc     .
           move      w-att-cdp-ndo-dsv    to   rn-cdp-ndo-dat-doc     .
           move      "UP"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
      *                      *-----------------------------------------*
      *                      * Unlock                                  *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
      *                      *-----------------------------------------*
      *                      * Se errori ripete l'intera operazione    *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to rip-cdp-ndo-000.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     rip-cdp-ndo-999.
       rip-cdp-ndo-400.
      *                  *---------------------------------------------*
      *                  * Se il valore risulta cambiato               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se il cambiamento corrisponde alla for- *
      *                      * zatura eseguita dall'operatore stesso   *
      *                      * in caso di impostazione di un numero    *
      *                      * superiore al progressivo : si controag- *
      *                      * giorna senza alcun messaggio            *
      *                      *-----------------------------------------*
           if        rn-cdp-ndo-num-doc   =    w-att-cdp-ndo-num
                     go to rip-cdp-ndo-200.
      *                      *-----------------------------------------*
      *                      * Se il cambiamento invece e' dovuto al   *
      *                      * fatto che un altro utente ha nel frat-  *
      *                      * tempo prelevato un numero progressivo   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Unlock                              *
      *                          *-------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/cdp/num/ioc/obj/incdpndo"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-cdp-ndo             .
      *                          *-------------------------------------*
      *                          * Messaggio all'operatore che il nu-  *
      *                          * mero deve essere recuperato manual- *
      *                          * mente                               *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Salvataggio del video attuale   *
      *                              *---------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Video in Off                    *
      *                              *---------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Box                             *
      *                              *---------------------------------*
           move      "BX"                 to   v-ope                  .
           move      09                   to   v-lin                  .
           move      18                   to   v-lto                  .
           move      08                   to   v-pos                  .
           move      73                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Messaggi entro il box           *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Titolo centrale             *
      *                                  *-----------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      62                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      10                   to   v-pos                  .
           move      "                     A T T E N Z I O N E          
      -              "            "       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                  *-----------------------------*
      *                                  * Riga messaggio 1            *
      *                                  *-----------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      62                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      10                   to   v-pos                  .
           move      "Un altro utente ha nel frattempo prelevato un nume
      -              "ro !        "       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                  *-----------------------------*
      *                                  * Riga messaggio 2            *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Preparazione numero do- *
      *                                      * cumento editato         *
      *                                      *-------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-att-cdp-ndo-new    to   w-att-cdp-ndo-wnu      .
           move      w-att-cdp-ndo-wpr    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                                      *-------------------------*
      *                                      * Visualizzazione         *
      *                                      *-------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      62                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      10                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "Pertanto il numero  "
                                delimited by   size
                     v-edt      delimited by   spaces
                     " dovra' essere recuperato manualmente."
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                  *-----------------------------*
      *                                  * Riga messaggio 3            *
      *                                  *-----------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      62                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      10                   to   v-pos                  .
           move      "                                                  
      -              "         [ ]"       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                      *-------------------------*
      *                                      * Video in On             *
      *                                      *-------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                      *-------------------------*
      *                                      * Accettazione carattere  *
      *                                      * di presa visione        *
      *                                      *-------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      17                   to   v-lin                  .
           move      70                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                      *-------------------------*
      *                                      * Ripristino immagine     *
      *                                      * video                   *
      *                                      *-------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       rip-cdp-ndo-999.
           exit.

      *    *===========================================================*
      *    * Scrittura movimento su file                               *
      *    *-----------------------------------------------------------*
       scr-mov-fil-000.
      *              *-------------------------------------------------*
      *              * Trattamento file [cdp]                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se inserimento                              *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    not  = "I"
                     go to scr-mov-fil-500.
      *                      *-----------------------------------------*
      *                      * Write record [cdp]                      *
      *                      *-----------------------------------------*
           perform   wrt-rec-cdp-000      thru wrt-rec-cdp-999        .
           go to     scr-mov-fil-999.
       scr-mov-fil-500.
      *                  *---------------------------------------------*
      *                  * Se modifica                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Rewrite record [cdp]                    *
      *                      *-----------------------------------------*
           perform   rew-rec-cdp-000      thru rew-rec-cdp-999        .
       scr-mov-fil-999.
           exit.

      *    *===========================================================*
      *    * Delete movimento da file                                  *
      *    *-----------------------------------------------------------*
       del-mov-fil-000.
      *              *-------------------------------------------------*
      *              * Delete record [cdp]                             *
      *              *-------------------------------------------------*
           perform   del-rec-cdp-000      thru del-rec-cdp-999        .
       del-mov-fil-999.
           exit.

      *    *===========================================================*
      *    * Composizione record [cdp]                                 *
      *    *-----------------------------------------------------------*
       cmp-rec-cdp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   rf-cdp-ide-dat         .
           move      s-ute                to   rf-cdp-ide-ute         .
           move      s-fas                to   rf-cdp-ide-fas         .
           move      w-tes-cod-dpz        to   rf-cdp-cod-dpz         .
           move      w-tes-num-prt        to   rf-cdp-num-prt         .
           move      w-tes-tmo-cdp        to   rf-cdp-tmo-cdp         .
           move      w-tes-dat-doc        to   rf-cdp-dat-doc         .
           move      w-tes-num-doc        to   rf-cdp-num-doc         .
           move      w-tes-dat-doc        to   s-dat                  .
           move      s-saa                to   rf-cdp-scl-ann         .
           move      w-tes-sgl-num        to   rf-cdp-sgl-num         .
           move      w-tes-dsz-prd (1)    to   rf-cdp-dsz-prd         .
           move      w-tes-dsz-cod (1)    to   rf-cdp-dsz-cod         .
           move      w-tes-dsz-dpz (1)    to   rf-cdp-dsz-dpz         .
           move      w-tes-esz-prd (1)    to   rf-cdp-esz-prd         .
           move      w-tes-esz-cod (1)    to   rf-cdp-esz-cod         .
           move      w-tes-esz-dpz (1)    to   rf-cdp-esz-dpz         .
           move      w-tes-dat-cns (1)    to   rf-cdp-dat-cns         .
           move      w-tes-pri-prd (1)    to   rf-cdp-pri-prd         .
           move      w-tes-com-int (1)    to   rf-cdp-com-int         .
           move      w-tes-voc-des (1, 1) to   rf-cdp-voc-des (1)     .
           move      w-tes-voc-des (1, 2) to   rf-cdp-voc-des (2)     .
           move      w-tes-voc-des (1, 3) to   rf-cdp-voc-des (3)     .
           move      w-tes-voc-des (1, 4) to   rf-cdp-voc-des (4)     .
           move      w-tes-voc-des (1, 5) to   rf-cdp-voc-des (5)     .
           move      w-tes-voc-des (1, 6) to   rf-cdp-voc-des (6)     .
           move      w-tes-tip-mag (1)    to   rf-cdp-tip-mag         .
           move      w-tes-num-mag (1)    to   rf-cdp-num-mag         .
           move      w-tes-alf-mag (1)    to   rf-cdp-alf-mag         .
           move      w-tes-sgl-vrn (1)    to   rf-cdp-sgl-vrn         .
           move      w-tes-umi-prd (1)    to   rf-cdp-umi-prd         .
           move      w-tes-dec-qta (1)    to   rf-cdp-dec-qta         .
           move      w-tes-qta-dap (1)    to   rf-cdp-qta-dap         .
           move      w-tes-cod-dsl (1)    to   rf-cdp-cod-dsl         .
           move      w-tes-snx-2qt (1)    to   rf-cdp-snx-2qt         .
           move      w-tes-dec-2qt (1)    to   rf-cdp-dec-2qt         .
           move      w-tes-qta-a02 (1)    to   rf-cdp-qta-a02         .
           move      w-tes-snx-3qt (1)    to   rf-cdp-snx-3qt         .
           move      w-tes-dec-3qt (1)    to   rf-cdp-dec-3qt         .
           move      w-tes-qta-a03 (1)    to   rf-cdp-qta-a03         .
           move      w-tes-ctr-stp (1)    to   rf-cdp-ctr-stp         .
           move      w-tes-sdc-ccs (1)    to   rf-cdp-sdc-ccs         .
           move      w-tes-flg-cch (1)    to   rf-cdp-flg-cch         .
           move      w-tes-flg-ela (1)    to   rf-cdp-flg-ela         .
           move      w-tes-flg-pul (1)    to   rf-cdp-flg-pul         .
           move      w-tes-alx-exp (1)    to   rf-cdp-alx-exp         .
       cmp-rec-cdp-999.
           exit.

      *    *===========================================================*
      *    * Scrittura record [cdp]                                    *
      *    *-----------------------------------------------------------*
       wrt-rec-cdp-000.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
           perform   cmp-rec-cdp-000      thru cmp-rec-cdp-999        .
      *              *-------------------------------------------------*
      *              * Put record                                      *
      *              *-------------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
       wrt-rec-cdp-999.
           exit.

      *    *===========================================================*
      *    * Riscrittura record [cdp]                                  *
      *    *-----------------------------------------------------------*
       rew-rec-cdp-000.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
           perform   cmp-rec-cdp-000      thru cmp-rec-cdp-999        .
      *              *-------------------------------------------------*
      *              * Forced put record                               *
      *              *-------------------------------------------------*
           move      "FP"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
       rew-rec-cdp-999.
           exit.

      *    *===========================================================*
      *    * Cancellazione record [cdp]                                *
      *    *-----------------------------------------------------------*
       del-rec-cdp-000.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
           perform   cmp-rec-cdp-000      thru cmp-rec-cdp-999        .
      *              *-------------------------------------------------*
      *              * Delete record                                   *
      *              *-------------------------------------------------*
           move      "DE"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
       del-rec-cdp-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      74                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      70                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      71                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Find su archivio [cdp]                                    *
      *    *-----------------------------------------------------------*
       fnd-arc-cdp-000.
      *              *-------------------------------------------------*
      *              * Test se programma di interrogazione gia' attivo *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pcdp3010"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     move  "#"            to   w-fnd-arc-cdp-sel
                     go to  fnd-arc-cdp-999.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'snx-slc' per il  *
      *              * livello successivo per l'ammissibilita' del ta- *
      *              * sto Slct                                        *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "snx-slc"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      01                   to   s-car                  .
           move      "S"                  to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. per codice di- *
      *              * pendenza                                        *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "cod-dpz"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      02                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      w-tes-cod-dpz        to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo programma di interrogazione            *
      *              *-------------------------------------------------*
           move      "pgm/cdp/prg/obj/pcdp3010"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * Estrazione di eventuali variabili di i.p.c. de- *
      *              * terminate da function-key "SLCT" durante l'in-  *
      *              * terrogazione                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo movimento                              *
      *                  *---------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "tmo-cdp"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                not  = spaces
                     move  "#"            to   w-fnd-arc-cdp-sel
                     go to fnd-arc-cdp-999.
           move      s-alf                to   w-fnd-arc-cdp-tcp      .
      *                  *---------------------------------------------*
      *                  * Data documento                              *
      *                  *---------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "dat-doc"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                not  = spaces
                     move  "#"            to   w-fnd-arc-cdp-sel
                     go to fnd-arc-cdp-999.
           move      s-dat                to   w-fnd-arc-cdp-dat      .
      *                  *---------------------------------------------*
      *                  * Numero documento                            *
      *                  *---------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "num-doc"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                not  = spaces
                     move  "#"            to   w-fnd-arc-cdp-sel
                     go to fnd-arc-cdp-999.
           move      s-num                to   w-fnd-arc-cdp-num      .
      *              *-------------------------------------------------*
      *              * Salvataggio valori chiave                       *
      *              *-------------------------------------------------*
           move      w-tes-val-key        to   w-sav-val-key          .
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori estratti                 *
      *              *-------------------------------------------------*
           move      w-fnd-arc-cdp-tcp    to   w-tes-tmo-cdp          .
           move      w-fnd-arc-cdp-dat    to   w-tes-dat-doc          .
           move      w-fnd-arc-cdp-num    to   w-tes-num-doc          .
       fnd-arc-cdp-400.
      *              *-------------------------------------------------*
      *              * Determinazione campi derivati e effettuazione   *
      *              * controlli come se fossero stati impostati       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [ycp]                      *
      *                  *---------------------------------------------*
           move      w-tes-tmo-cdp        to   w-let-arc-ycp-cod      .
           perform   let-arc-ycp-000      thru let-arc-ycp-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valori associati al tipo    *
      *                  * movimento ordini fornitori                  *
      *                  *---------------------------------------------*
           move      w-let-arc-ycp-des    to   w-tes-tmo-cdp-des      .
           move      w-let-arc-ycp-vld    to   w-tes-tmo-cdp-vld      .
           move      w-let-arc-ycp-dpz    to   w-tes-tmo-cdp-dpz      .
           move      w-let-arc-ycp-ord    to   w-tes-tmo-cdp-ord      .
           move      w-let-arc-ycp-prd    to   w-tes-tmo-cdp-prd      .
           move      w-let-arc-ycp-sgl    to   w-tes-tmo-cdp-sgl      .
      *                  *---------------------------------------------*
      *                  * Se codice errato : uscita con errore        *
      *                  *---------------------------------------------*
           if        w-let-arc-ycp-flg    not  = spaces
                     go to fnd-arc-cdp-900.
      *                  *---------------------------------------------*
      *                  * Se a spaces : uscita con errore             *
      *                  *---------------------------------------------*
           if        w-tes-tmo-cdp        =    spaces
                     go to fnd-arc-cdp-900.
      *                  *---------------------------------------------*
      *                  * Test su codice dipendenza                   *
      *                  *---------------------------------------------*
           if        w-tes-tmo-cdp-vld    not  = 02
                     go to fnd-arc-cdp-420.
           if        w-tes-cod-dpz        =    w-tes-tmo-cdp-dpz
                     go to fnd-arc-cdp-420.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Tipo movimento incompatibile con il codice dipende
      -              "nza ! "             to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * A uscita con errore                     *
      *                      *-----------------------------------------*
           go to     fnd-arc-cdp-900.
       fnd-arc-cdp-420.
      *                  *---------------------------------------------*
      *                  * Controllo tipo origine del documento        *
      *                  *---------------------------------------------*
           if        w-tes-tmo-cdp-ord    =   01
                     go to fnd-arc-cdp-600.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Tipo movimento non gestibile da questo programma !
      -              "      "             to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * A uscita con errore                     *
      *                      *-----------------------------------------*
           go to     fnd-arc-cdp-900.
       fnd-arc-cdp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       fnd-arc-cdp-800.
      *              *-------------------------------------------------*
      *              * Visualizzazioni campi chiave                    *
      *              *-------------------------------------------------*
           perform   vis-tmo-cdp-000      thru vis-tmo-cdp-999        .
           perform   vis-tmo-cdp-des-000  thru vis-tmo-cdp-des-999    .
           perform   vis-dat-doc-000      thru vis-dat-doc-999        .
           perform   vis-num-doc-000      thru vis-num-doc-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     fnd-arc-cdp-999.
       fnd-arc-cdp-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ripristino valori chiave salvati            *
      *                  *---------------------------------------------*
           move      w-sav-val-key        to   w-tes-val-key          .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-fnd-arc-cdp-sel      .
       fnd-arc-cdp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [ycp]                         *
      *    *-----------------------------------------------------------*
       let-arc-ycp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-ycp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spazi                          *
      *              *-------------------------------------------------*
           if        w-let-arc-ycp-cod    =    spaces
                     go to let-arc-ycp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODTCP"             to   f-key                  .
           move      w-let-arc-ycp-cod    to   rf-ycp-cod-tcp         .
           move      "pgm/cdp/fls/ioc/obj/iofycp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ycp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-ycp-400.
       let-arc-ycp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-ycp-des-tcp       to   w-let-arc-ycp-des      .
           move      rf-ycp-vld-dpz       to   w-let-arc-ycp-vld      .
           move      rf-ycp-cod-dpz       to   w-let-arc-ycp-dpz      .
           move      rf-ycp-org-doc       to   w-let-arc-ycp-ord      .
           move      rf-ycp-prv-doc       to   w-let-arc-ycp-prd      .
           move      rf-ycp-sgl-num       to   w-let-arc-ycp-sgl      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-ycp-999.
       let-arc-ycp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-ycp-flg      .
           move      all   "."            to   w-let-arc-ycp-des      .
           go to     let-arc-ycp-600.
       let-arc-ycp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-ycp-des      .
       let-arc-ycp-600.
           move      spaces               to   w-let-arc-ycp-des      .
           move      zero                 to   w-let-arc-ycp-vld      .
           move      zero                 to   w-let-arc-ycp-dpz      .
           move      zero                 to   w-let-arc-ycp-ord      .
           move      zero                 to   w-let-arc-ycp-prd      .
           move      spaces               to   w-let-arc-ycp-sgl      .
       let-arc-ycp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [cli]                         *
      *    *-----------------------------------------------------------*
       let-arc-cli-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cli-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice cliente a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-cli-cod    =    zero
                     go to let-arc-cli-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-let-arc-cli-cod    to   rf-cli-cod-cli         .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-cli-400.
       let-arc-cli-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-cli-rag-soc       to   w-let-arc-cli-rag      .
           move      rf-cli-via-cli       to   w-let-arc-cli-via      .
           move      rf-cli-loc-cli       to   w-let-arc-cli-loc      .
           move      rf-cli-cod-cge       to   w-let-arc-cli-cge      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-cli-999.
       let-arc-cli-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-cli-flg      .
           move      all   "."            to   w-let-arc-cli-rag      .
           go to     let-arc-cli-600.
       let-arc-cli-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cli-rag      .
       let-arc-cli-600.
           move      spaces               to   w-let-arc-cli-via      .
           move      spaces               to   w-let-arc-cli-loc      .
           move      zero                 to   w-let-arc-cli-cge      .
       let-arc-cli-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio dipendenza cliente in [dcc]      *
      *    *-----------------------------------------------------------*
       let-arc-dcc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice cliente a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-cod    =    zero
                     go to let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a spaces, solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-dpz    =    spaces and
                     w-let-arc-dcc-tle    =    "D"
                     go to let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a "*   ", solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcc-dpz    =    "*   " and
                     w-let-arc-dcc-tle    =    "D"
                     go to let-arc-dcc-450.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI    "         to   f-key                  .
           move      w-let-arc-dcc-cod    to   rf-dcc-cod-cli         .
           move      w-let-arc-dcc-dpz    to   rf-dcc-dpz-cli         .
           move      "pgm/dcc/fls/ioc/obj/iofdcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcc-400.
       let-arc-dcc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcc-rag-soc       to   w-let-arc-dcc-rag      .
           move      rf-dcc-via-dcc       to   w-let-arc-dcc-via      .
           move      rf-dcc-loc-dcc       to   w-let-arc-dcc-loc      .
           move      rf-dcc-cod-abi       to   w-let-arc-dcc-abi      .
           move      rf-dcc-cod-cab       to   w-let-arc-dcc-cab      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcc-999.
       let-arc-dcc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcc-flg      .
           move      all   "."            to   w-let-arc-dcc-rag      .
           go to     let-arc-dcc-600.
       let-arc-dcc-450.
      *              *-------------------------------------------------*
      *              * Normalizzazione per codice dipendenza "*   "    *
      *              *-------------------------------------------------*
           move      "Sia la sede che tutte le dipendenze     "
                                          to   w-let-arc-dcc-rag      .
           go to     let-arc-dcc-600.
       let-arc-dcc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcc-rag      .
       let-arc-dcc-600.
           move      spaces               to   w-let-arc-dcc-via      .
           move      spaces               to   w-let-arc-dcc-loc      .
           move      zero                 to   w-let-arc-dcc-abi      .
           move      zero                 to   w-let-arc-dcc-cab      .
       let-arc-dcc-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [fnt]                         *
      *    *-----------------------------------------------------------*
       let-arc-fnt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-fnt-cod    =    zero
                     go to let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT"             to   f-key                  .
           move      w-let-arc-fnt-cod    to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-fnt-400.
       let-arc-fnt-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-fnt-rag-soc       to   w-let-arc-fnt-rag      .
           move      rf-fnt-via-fnt       to   w-let-arc-fnt-via      .
           move      rf-fnt-loc-fnt       to   w-let-arc-fnt-loc      .
           move      rf-fnt-prt-iva       to   w-let-arc-fnt-piv      .
           move      rf-fnt-cod-cge       to   w-let-arc-fnt-stc      .
           move      rf-fnt-cod-iva       to   w-let-arc-fnt-ass      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-fnt-999.
       let-arc-fnt-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-fnt-flg      .
           move      all   "."            to   w-let-arc-fnt-rag      .
           go to     let-arc-fnt-520.
       let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-rag      .
       let-arc-fnt-520.
           move      spaces               to   w-let-arc-fnt-via      .
           move      spaces               to   w-let-arc-fnt-loc      .
           move      zero                 to   w-let-arc-fnt-piv      .
           move      zero                 to   w-let-arc-fnt-stc      .
           move      zero                 to   w-let-arc-fnt-ass      .
       let-arc-fnt-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio dipendenza fornitore in [dcf]    *
      *    *-----------------------------------------------------------*
       let-arc-dcf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcf-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice fornitore a zero                 *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-cod    =    zero
                     go to let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a spaces, solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-dpz    =    spaces and
                     w-let-arc-dcf-tle    =    "D"
                     go to let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a "*   ", solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-dpz    =    "*   " and
                     w-let-arc-dcf-tle    =    "D"
                     go to let-arc-dcf-450.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      w-let-arc-dcf-cod    to   rf-dcf-cod-fnt         .
           move      w-let-arc-dcf-dpz    to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcf-400.
       let-arc-dcf-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcf-rag-soc       to   w-let-arc-dcf-rag      .
           move      rf-dcf-via-dcf       to   w-let-arc-dcf-via      .
           move      rf-dcf-loc-dcf       to   w-let-arc-dcf-loc      .
           move      rf-dcf-cod-abi       to   w-let-arc-dcf-abi      .
           move      rf-dcf-cod-cab       to   w-let-arc-dcf-cab      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcf-999.
       let-arc-dcf-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcf-flg      .
           move      all   "."            to   w-let-arc-dcf-rag      .
           go to     let-arc-dcf-600.
       let-arc-dcf-450.
      *              *-------------------------------------------------*
      *              * Normalizzazione per codice dipendenza "*   "    *
      *              *-------------------------------------------------*
           move      "Sia la sede che tutte le dipendenze     "
                                          to   w-let-arc-dcf-rag      .
           go to     let-arc-dcf-600.
       let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcf-rag      .
       let-arc-dcf-600.
           move      spaces               to   w-let-arc-dcf-via      .
           move      spaces               to   w-let-arc-dcf-loc      .
           move      zero                 to   w-let-arc-dcf-abi      .
           move      zero                 to   w-let-arc-dcf-cab      .
       let-arc-dcf-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [dcp]                         *
      *    *-----------------------------------------------------------*
       let-arc-dcp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcp-cod    =    zero  
                     go to let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      w-let-arc-dcp-cod    to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcp-400.
       let-arc-dcp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcp-des-pro       to   w-let-arc-dcp-des      .
           move      rf-dcp-umi-ven       to   w-let-arc-dcp-umi      .
           move      rf-dcp-dec-qta       to   w-let-arc-dcp-deq      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcp-999.
       let-arc-dcp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcp-flg      .
           move      all   "."            to   w-let-arc-dcp-des      .
           go to     let-arc-dcp-600.
       let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-des      .
       let-arc-dcp-600.
           move      spaces               to   w-let-arc-dcp-umi      .
           move      zero                 to   w-let-arc-dcp-deq      .
       let-arc-dcp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [dps]                         *
      *    *-----------------------------------------------------------*
       let-arc-dps-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dps-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dps-cod    =    zero
                     go to let-arc-dps-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMSEM"             to   f-key                  .
           move      w-let-arc-dps-cod    to   rf-dps-num-sem         .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dps-400.
       let-arc-dps-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dps-des-sem       to   w-let-arc-dps-des      .
           move      rf-dps-umi-prd       to   w-let-arc-dps-umi      .
           move      rf-dps-dec-qta       to   w-let-arc-dps-deq      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dps-999.
       let-arc-dps-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dps-flg      .
           move      all   "."            to   w-let-arc-dps-des      .
           go to     let-arc-dps-600.
       let-arc-dps-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dps-des      .
       let-arc-dps-600.
           move      spaces               to   w-let-arc-dps-umi      .
           move      zero                 to   w-let-arc-dps-deq      .
       let-arc-dps-999.
           exit.

      *    *===========================================================*
      *    * Determinazione se documento gia' esistente oppure no      *
      *    *-----------------------------------------------------------*
       det-doc-ges-000.
      *              *-------------------------------------------------*
      *              * Tipo movimento trovato per il caso che la de-   *
      *              * terminazione dia esito pari a 'X' : a spaces    *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-doc-ges-tmt      .
      *              *-------------------------------------------------*
      *              * Start su file [cdp]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "IDEDOC    "         to   f-key                  .
           move      w-tes-dat-doc        to   rf-cdp-dat-doc         .
           move      w-tes-cod-dpz        to   rf-cdp-cod-dpz         .
           move      w-tes-num-doc        to   rf-cdp-num-doc         .
           move      spaces               to   rf-cdp-tmo-cdp         .
           move      zero                 to   rf-cdp-num-prt         .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
      *              *-------------------------------------------------*
      *              * Se Start errata : a documento non esistente     *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-doc-ges-900.
       det-doc-ges-100.
      *              *-------------------------------------------------*
      *              * Next su [cdp]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
      *              *-------------------------------------------------*
      *              * Se 'at end' : a determinazione finale           *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-doc-ges-800.
      *              *-------------------------------------------------*
      *              * Max su [cdp], se non superato : a determinazio- *
      *              * ne finale                                       *
      *              *-------------------------------------------------*
           if        rf-cdp-dat-doc       not  = w-tes-dat-doc or
                     rf-cdp-cod-dpz       not  = w-tes-cod-dpz or
                     rf-cdp-num-doc       not  = w-tes-num-doc
                     go to det-doc-ges-800.
       det-doc-ges-200.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo movimento letto   *
      *              *-------------------------------------------------*
           if        rf-cdp-tmo-cdp       =    w-tes-tmo-cdp
                     go to det-doc-ges-300
           else      go to det-doc-ges-400.
       det-doc-ges-300.
      *              *-------------------------------------------------*
      *              * Se tipo movimento letto pari al tipo movimento  *
      *              * da cercare                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di documento esistente e trovato    *
      *                  *---------------------------------------------*
           move      "S"                  to   w-det-doc-ges-snx      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-doc-ges-999.
       det-doc-ges-400.
      *              *-------------------------------------------------*
      *              * Se tipo movimento letto diverso dal tipo movi-  *
      *              * mento da cercare                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se sigla numerazione per il tipo movimento  *
      *                  * letto diversa da sigla numerazione del ti-  *
      *                  * po movimento cercato : si ignora il docu-   *
      *                  * mento e si passa ad esaminare il documento  *
      *                  * successivo                                  *
      *                  *---------------------------------------------*
           if        rf-cdp-sgl-num       not  = w-tes-tmo-cdp-sgl
                     go to det-doc-ges-100.
      *                  *---------------------------------------------*
      *                  * Se invece la sigla numerazione e' la stessa *
      *                  * si memorizza il codice tipo movimento letto *
      *                  * per il caso in cui la determinazione doves- *
      *                  * se dare esito pari a 'X'                    *
      *                  *---------------------------------------------*
           move      rf-cdp-tmo-cdp       to   w-det-doc-ges-tmt      .
      *                  *---------------------------------------------*
      *                  * Quindi si ricicla per esaminare eventuali   *
      *                  * documenti successivi                        *
      *                  *---------------------------------------------*
           go to     det-doc-ges-100.
       det-doc-ges-800.
      *              *-------------------------------------------------*
      *              * Determinazioni finali per il caso in cui il do- *
      *              * cumento non sia stato sicuramente trovato       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se durante la ricerca e' stato trovato un   *
      *                  * documento con la data cercata, il numero    *
      *                  * cercato, e la sigla numerazione cercata :   *
      *                  * si esce con 'X', e con il codice del tipo   *
      *                  * movimento trovato gia' preparato; altri-    *
      *                  * menti si esce per documento non trovato     *
      *                  *---------------------------------------------*
           if        w-det-doc-ges-tmt    not  = spaces
                     move  "X"            to   w-det-doc-ges-snx
                     go to det-doc-ges-999
           else      go to det-doc-ges-900.
       det-doc-ges-900.
      *              *-------------------------------------------------*
      *              * Uscita per documento non trovato                *
      *              *-------------------------------------------------*
           move      "N"                  to   w-det-doc-ges-snx      .
       det-doc-ges-999.
           exit.

      *    *===========================================================*
      *    * Controllo di congruenza tra data e numero per [cdp]       *
      *    *-----------------------------------------------------------*
       rou-cdn-cdp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cdn-cdp-out-flg      .
       rou-cdn-cdp-200.
      *              *-------------------------------------------------*
      *              * Determinazione della sola componente 'secolo e  *
      *              * anno' della data passata come parametro in in-  *
      *              * put                                             *
      *              *-------------------------------------------------*
           move      w-cdn-cdp-inp-dat    to   w-cdn-cdp-wad-dat      .
           move      w-cdn-cdp-wad-saa    to   w-cdn-cdp-was-saa      .
      *              *-------------------------------------------------*
      *              * Determinazione della sola componente 'progres-  *
      *              * sivo' del numero passato come parametro in in-  *
      *              * put                                             *
      *              *-------------------------------------------------*
           move      w-cdn-cdp-inp-num    to   w-cdn-cdp-wan-num      .
           move      w-cdn-cdp-wan-prg    to   w-cdn-cdp-wap-prg      .
      *              *-------------------------------------------------*
      *              * Completamento del numero passato come parametro *
      *              * in input con le componenti 'secolo e anno' e    *
      *              * 'codice dipendenza'                             *
      *              *-------------------------------------------------*
           move      zero                 to   w-cdn-cdp-wan-num      .
           move      w-cdn-cdp-was-saa    to   w-cdn-cdp-wan-saa      .
           move      w-cdn-cdp-inp-dpz    to   w-cdn-cdp-wan-dpz      .
           move      w-cdn-cdp-wap-prg    to   w-cdn-cdp-wan-prg      .
           move      w-cdn-cdp-wan-num    to   w-cdn-cdp-wat-num      .
       rou-cdn-cdp-400.
      *              *-------------------------------------------------*
      *              * Test di congruenza con il numero successivo     *
      *              *-------------------------------------------------*
       rou-cdn-cdp-425.
      *                  *---------------------------------------------*
      *                  * Start su [cdp]                              *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "CNTDEN    "         to   f-key                  .
           move      w-cdn-cdp-was-saa    to   rf-cdp-scl-ann         .
           move      w-cdn-cdp-inp-dpz    to   rf-cdp-cod-dpz         .
           move      w-cdn-cdp-inp-sgl    to   rf-cdp-sgl-num         .
           move      w-cdn-cdp-wat-num    to   rf-cdp-num-doc         .
           move      zero                 to   rf-cdp-num-prt         .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata il test di congruenza con   *
      *                  * il numero successivo si considera superato, *
      *                  * e si passa al test di congruenza con il nu- *
      *                  * mero precedente                             *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to rou-cdn-cdp-600.
       rou-cdn-cdp-450.
      *                  *---------------------------------------------*
      *                  * Read Next su [cdp]                          *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
      *                  *---------------------------------------------*
      *                  * Se fine file il test di congruenza con il   *
      *                  * numero successivo si considera superato, e  *
      *                  * si passa al test di congruenza con il nume- *
      *                  * ro precedente                               *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to rou-cdn-cdp-600.
       rou-cdn-cdp-475.
      *                  *---------------------------------------------*
      *                  * Test di congruenza effettivo sul numero     *
      *                  * successivo                                  *
      *                  *---------------------------------------------*
       rou-cdn-cdp-480.
      *                      *-----------------------------------------*
      *                      * Se il secolo ed anno del documento let- *
      *                      * to non corrispondono al secolo ed anno  *
      *                      * passati come parametri il test di con-  *
      *                      * gruenza con il numero successivo e' su- *
      *                      * perato, e si passa al controllo di con- *
      *                      * gruenza con il numero precedente        *
      *                      *-----------------------------------------*
           move      rf-cdp-dat-doc       to   w-cdn-cdp-wad-dat      .
           if        w-cdn-cdp-wad-saa    not  = w-cdn-cdp-was-saa
                     go to rou-cdn-cdp-600.
       rou-cdn-cdp-485.
      *                      *-----------------------------------------*
      *                      * Se il codice dipendenza del documento   *
      *                      * letto non corrispondono al codice di-   *
      *                      * pendenza passato come parametro il test *
      *                      * di congruenza con il numero successivo  *
      *                      * e' superato, e si passa al controllo di *
      *                      * congruenza con il numero precedente     *
      *                      *-----------------------------------------*
           if        rf-cdp-cod-dpz       not  = w-cdn-cdp-inp-dpz
                     go to rou-cdn-cdp-600.
       rou-cdn-cdp-490.
      *                      *-----------------------------------------*
      *                      * Se la sigla numerazione del documento   *
      *                      * letto non corrispondono alla sigla nu-  *
      *                      * merazione passata come parametro il     *
      *                      * test di congruenza con il numero suc-   *
      *                      * cessivo e' superato, e si passa al con- *
      *                      * trollo di congruenza con il numero pre- *
      *                      * cedente                                 *
      *                      *-----------------------------------------*
           if        rf-cdp-sgl-num       not  = w-cdn-cdp-inp-sgl
                     go to rou-cdn-cdp-600.
       rou-cdn-cdp-495.
      *                      *-----------------------------------------*
      *                      * Se il numero documento esiste gia' il   *
      *                      * test non e' superato                    *
      *                      *-----------------------------------------*
           move      rf-cdp-num-doc       to   w-cdn-cdp-wan-num      .
           if        w-cdn-cdp-wan-prg    =    w-cdn-cdp-wap-prg
                     go to rou-cdn-cdp-800.
      *                      *-----------------------------------------*
      *                      * Se la data del documento letto non e'   *
      *                      * inferiore alla data passata come para-  *
      *                      * metro il test di congruenza con il nu-  *
      *                      * mero successivo e' superato, e si passa *
      *                      * al controllo di congruenza con il nume- *
      *                      * ro precedente                           *
      *                      *-----------------------------------------*
           if        rf-cdp-dat-doc       not  < w-cdn-cdp-inp-dat
                     go to rou-cdn-cdp-600.
       rou-cdn-cdp-500.
      *                      *-----------------------------------------*
      *                      * Altrimenti il controllo non e' superato *
      *                      * e si passa ad emettere un messaggio di  *
      *                      * errore                                  *
      *                      *-----------------------------------------*
           go to     rou-cdn-cdp-800.
       rou-cdn-cdp-600.
      *              *-------------------------------------------------*
      *              * Test di congruenza con il numero precedente     *
      *              *-------------------------------------------------*
       rou-cdn-cdp-625.
      *                  *---------------------------------------------*
      *                  * Start su [cdp]                              *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NG"                 to   f-cfr                  .
           move      "CNTDEN    "         to   f-key                  .
           move      w-cdn-cdp-was-saa    to   rf-cdp-scl-ann         .
           move      w-cdn-cdp-inp-dpz    to   rf-cdp-cod-dpz         .
           move      w-cdn-cdp-inp-sgl    to   rf-cdp-sgl-num         .
           move      w-cdn-cdp-wat-num    to   rf-cdp-num-doc         .
           move      9999999999999        to   rf-cdp-num-prt         .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata il test di congruenza con   *
      *                  * il numero successivo si considera superato, *
      *                  * e si esce                                   *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to rou-cdn-cdp-999.
       rou-cdn-cdp-650.
      *                  *---------------------------------------------*
      *                  * Read Previous su [cdp]                      *
      *                  *---------------------------------------------*
           move      "RP"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
      *                  *---------------------------------------------*
      *                  * Se fine file il test di congruenza con il   *
      *                  * numero successivo si considera superato, e  *
      *                  * si esce                                     *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to rou-cdn-cdp-999.
       rou-cdn-cdp-675.
      *                  *---------------------------------------------*
      *                  * Test di congruenza effettivo sul numero     *
      *                  * precedente                                  *
      *                  *---------------------------------------------*
       rou-cdn-cdp-680.
      *                      *-----------------------------------------*
      *                      * Se il secolo ed anno del documento let- *
      *                      * to non corrispondono al secolo ed anno  *
      *                      * passati come parametri il test di con-  *
      *                      * gruenza con il numero successivo e' su- *
      *                      * perato, e si esce                       *
      *                      *-----------------------------------------*
           move      rf-cdp-dat-doc       to   w-cdn-cdp-wad-dat      .
           if        w-cdn-cdp-wad-saa    not  = w-cdn-cdp-was-saa
                     go to rou-cdn-cdp-999.
       rou-cdn-cdp-685.
      *                      *-----------------------------------------*
      *                      * Se il codice dipendenza del documento   *
      *                      * letto non corrispondono al codice di-   *
      *                      * pendenza passato come parametro il test *
      *                      * di congruenza con il numero successivo  *
      *                      * e' superato, e si passa al controllo di *
      *                      * congruenza con il numero precedente     *
      *                      *-----------------------------------------*
           if        rf-cdp-cod-dpz       not  = w-cdn-cdp-inp-dpz
                     go to rou-cdn-cdp-999.
       rou-cdn-cdp-690.
      *                      *-----------------------------------------*
      *                      * Se la sigla numerazione del documento   *
      *                      * letto non corrispondono alla sigla nu-  *
      *                      * merazione passata come parametro il     *
      *                      * test di congruenza con il numero suc-   *
      *                      * cessivo e' superato, e si passa al con- *
      *                      * trollo di congruenza con il numero pre- *
      *                      * cedente                                 *
      *                      *-----------------------------------------*
           if        rf-cdp-sgl-num       not  = w-cdn-cdp-inp-sgl
                     go to rou-cdn-cdp-999.
       rou-cdn-cdp-695.
      *                      *-----------------------------------------*
      *                      * Se il numero documento esiste gia' il   *
      *                      * test non e' superato                    *
      *                      *-----------------------------------------*
           move      rf-cdp-num-doc       to   w-cdn-cdp-wan-num      .
           if        w-cdn-cdp-wan-prg    =    w-cdn-cdp-wap-prg
                     go to rou-cdn-cdp-800.
      *                      *-----------------------------------------*
      *                      * Se la data del documento letto non e'   *
      *                      * superiore alla data passata come para-  *
      *                      * metro il test di congruenza con il nu-  *
      *                      * mero successivo e' superato, e si esce  *
      *                      *-----------------------------------------*
           if        rf-cdp-dat-doc       not  > w-cdn-cdp-inp-dat
                     go to rou-cdn-cdp-999.
       rou-cdn-cdp-700.
      *                      *-----------------------------------------*
      *                      * Altrimenti il controllo non e' superato *
      *                      * e si passa ad emettere un messaggio di  *
      *                      * errore                                  *
      *                      *-----------------------------------------*
           go to     rou-cdn-cdp-800.
       rou-cdn-cdp-800.
      *              *-------------------------------------------------*
      *              * Emissione del messaggio di errore               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing numero progressivo del numero docu- *
      *                  * mento letto                                 *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      rf-cdp-num-doc       to   w-cdn-cdp-wan-num      .
           move      w-cdn-cdp-wan-prg    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-cdn-cdp-wae-e01      .
      *                  *---------------------------------------------*
      *                  * Editing data documento del documento letto  *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      rf-cdp-dat-doc       to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-cdn-cdp-wae-e02      .
      *                  *---------------------------------------------*
      *                  * Salvataggio immagine video                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      09                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      17                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Messaggio nel box                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea 01                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      70                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "Attenzione : Esiste gia' un documento numero "
                                delimited by   size
                     w-cdn-cdp-wae-e01
                                delimited by   spaces
                     " del "
                                delimited by   size
                     w-cdn-cdp-wae-e02
                                delimited by   size
                     "."
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Linea 02                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      70                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      "             Pertanto il numero documento impostat
      -              "o non puo' es-      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Linea 03                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      70                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      "             sere considerato accettabile per la d
      -              "ata impostata.      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Parentesi quadre di delimitazione       *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Accettazione carattere di presa visione     *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      16                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ripristino immagine video                   *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cdn-cdp-out-flg      .
       rou-cdn-cdp-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione tipo movimento per commes- *
      *    * se di produzione                                          *
      *    *-----------------------------------------------------------*
           copy      "pgm/cdp/prg/cpy/acdeycp0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione codice cliente commerciale *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acmndcc0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione codice dipendenza cliente  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoddcc0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice fornitore com-  *
      *    * merciale                                                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/acmndcf0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione codice dipendenza fornito- *
      *    * re                                                        *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/acoddcf0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per accettazione codice prodotto 'dcp'        *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acoddcp0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per accettazione codice semilavorato          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dps/prg/cpy/acoddps0.acs"                   .

