       Identification division.
       Program-Id.                                 pcdp3201           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    cdp                 *
      *                                Settore:    mov                 *
      *                                   Fase:    cdp320              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 21/10/92    *
      *                       Ultima revisione:    NdK del 14/10/05    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione stampa per il programma cdp320   *
      *                                                                *
      *                    Stampa commesse di produzione               *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Tipo movimento commessa di produzione             *
      *            *---------------------------------------------------*
               10  srt-tmo-cdp            pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Data commessa                                     *
      *            *---------------------------------------------------*
               10  srt-dat-doc            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero commessa                                   *
      *            *---------------------------------------------------*
               10  srt-num-doc            pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Numero protocollo commessa                        *
      *            *---------------------------------------------------*
               10  srt-num-prt            pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Tipo codice di magazzino                          *
      *            *---------------------------------------------------*
               10  srt-tip-mag            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice prodotto alfanumerico                      *
      *            *---------------------------------------------------*
               10  srt-alf-mag            pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Dscrizione prodotto                               *
      *            *---------------------------------------------------*
               10  srt-des-mag            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Numero decimali quantita'                         *
      *            *---------------------------------------------------*
               10  srt-dec-qta            pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Unita' di misura                                  *
      *            *---------------------------------------------------*
               10  srt-uni-mis            pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Data consegna commessa di produzione              *
      *            *---------------------------------------------------*
               10  srt-dat-cns            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Quantita' in commessa da produrre                 *
      *            *---------------------------------------------------*
               10  srt-qta-dap            pic s9(06)v9(03)            .
      *            *---------------------------------------------------*
      *            * Quantita' gia' prodotta                           *
      *            *---------------------------------------------------*
               10  srt-qta-gpr            pic s9(06)v9(03)            .
      *            *---------------------------------------------------*
      *            * Quantita' ancora da produrre                      *
      *            *---------------------------------------------------*
               10  srt-qta-dpr            pic s9(06)v9(03)            .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "cdp"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "mov"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "cdp320"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pcdp3201"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "     STAMPA COMMESSE DI PRODUZIONE      "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records logici                                            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [cdp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cdp/fls/rec/rfcdp"                          .
      *        *-------------------------------------------------------*
      *        * [ycp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cdp/fls/rec/rfycp"                          .
      *        *-------------------------------------------------------*
      *        * [vpt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/vdp/fls/rec/rfvpt"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [dps]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dps/fls/rec/rfdps"                          .

      *    *===========================================================*
      *    * Work-area richieste per stampa                            *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Codice dipendenza in uso                              *
      *        *-------------------------------------------------------*
           05  rr-dpz-inu                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Data commessa min - max                               *
      *        *-------------------------------------------------------*
           05  rr-dat-min                 pic  9(07)                  .
           05  rr-dat-max                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Stato delle commesse                                  *
      *        * - 01 : Solo quelle da evadere                         *
      *        * - 02 : Solo quelli evase                              *
      *        * - 03 : Tutte                                          *
      *        *-------------------------------------------------------*
           05  rr-sts-cdp                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Selezione su responsabile                             *
      *        *-------------------------------------------------------*
           05  rr-sel-rsp                 pic  x(03)                  .
           05  rr-sel-rsp-des             pic  x(20)                  .

      *    *===========================================================*
      *    * Work-area per routine stp-srt-inp-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-stp-srt-inp.
           05  w-stp-srt-inp-des          pic  x(40)                  .
           05  w-stp-srt-inp-alf          pic  x(14)                  .
           05  w-stp-srt-inp-deq          pic  9(01)                  .
           05  w-stp-srt-inp-umi          pic  x(03)                  .

      *    *===========================================================*
      *    * Work-area per routine int-pag-sta-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-int-pag-sta.
           05  w-int-pag-sta-x30          pic  x(30)                  .
           05  w-int-pag-sta-pnt          pic  9(03)                  .
           05  w-int-pag-sta-ctr          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [ycp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-ycp.
               10  w-let-arc-ycp-flg      pic  x(01)                  .
               10  w-let-arc-ycp-cod      pic  x(05)                  .
               10  w-let-arc-ycp-des      pic  x(30)                  .
               10  w-let-arc-ycp-vld      pic  9(02)                  .
               10  w-let-arc-ycp-dpz      pic  9(02)                  .
               10  w-let-arc-ycp-ord      pic  9(02)                  .
               10  w-let-arc-ycp-prd      pic  9(02)                  .
               10  w-let-arc-ycp-sgl      pic  9(02)                  .
               10  w-let-arc-ycp-rsp      pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcp.
               10  w-let-arc-dcp-flg      pic  x(01)                  .
               10  w-let-arc-dcp-cod      pic  9(07)                  .
               10  w-let-arc-dcp-alf      pic  x(14)                  .
               10  w-let-arc-dcp-des      pic  x(40)                  .
               10  w-let-arc-dcp-umi      pic  x(03)                  .
               10  w-let-arc-dcp-deq      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dps]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dps.
               10  w-let-arc-dps-flg      pic  x(01)                  .
               10  w-let-arc-dps-cod      pic  9(07)                  .
               10  w-let-arc-dps-alf      pic  x(14)                  .
               10  w-let-arc-dps-des      pic  x(40)                  .
               10  w-let-arc-dps-umi      pic  x(03)                  .
               10  w-let-arc-dps-deq      pic  9(01)                  .

      *    *===========================================================*
      *    * Work-area per routine prn-ini-lr1-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-prn-ini-lr1.
           05  w-prn-ini-lr1-x55          pic  x(55)                  .
           05  w-prn-ini-lr1-pnt          pic  9(02)                  .
           05  w-prn-ini-lr1-ctr          pic  9(02)                  .

      *    *===========================================================*
      *    * Work area generica                                        *
      *    *-----------------------------------------------------------*
       01  w-wrk.
           05  w-wrk-num-011              pic  9(11)                  .
           05  w-wrk-num-011-r redefines
               w-wrk-num-011                                          .
               10  w-wrk-num-011-saa      pic  9(03)                  .
               10  w-wrk-num-011-dpz      pic  9(02)                  .
               10  w-wrk-num-011-prg      pic  9(06)                  .

      *    *===========================================================*
      *    * Work-area per la determinazione, relativamente ad una     *
      *    * commessa di produzione, di :                              *
      *    *                                                           *
      *    *    - Quantita' commissionata                              *
      *    *    - Quantita' prodotta                                   *
      *    *    - Quantita' in corso di produzione                     *
      *    *                                                           *
      *    * e, di conseguenza, di :                                   *
      *    *                                                           *
      *    *    - Quantita' ancora da produrre                         *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       01  w-cdp-ogi.
      *        *-------------------------------------------------------*
      *        * Parametri in Output                                   *
      *        *-------------------------------------------------------*
           05  w-cdp-ogi-pxo.
      *            *---------------------------------------------------*
      *            * Quantita' commissionata                           *
      *            *---------------------------------------------------*
               10  w-cdp-ogi-qta-dap      pic s9(08)v9(03)            .
      *            *---------------------------------------------------*
      *            * Quantita' prodotta                                *
      *            *---------------------------------------------------*
               10  w-cdp-ogi-qta-pdt      pic s9(08)v9(03)            .
      *            *---------------------------------------------------*
      *            * Quantita' in corso di produzione                  *
      *            *---------------------------------------------------*
               10  w-cdp-ogi-qta-icp      pic s9(08)v9(03)            .
      *            *---------------------------------------------------*
      *            * Quantita' ancora da produrre                      *
      *            *---------------------------------------------------*
               10  w-cdp-ogi-qta-dpr      pic s9(08)v9(03)            .

      *    *===========================================================*
      *    * Work-area per la determinazione, relativamente ad una     *
      *    * commessa di produzione, di :                              *
      *    *                                                           *
      *    *    - Quantita' commissionata                              *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       01  w-cdp-dap.
      *        *-------------------------------------------------------*
      *        * Parametri in Output                                   *
      *        *-------------------------------------------------------*
           05  w-cdp-dap-pxo.
      *            *---------------------------------------------------*
      *            * Quantita' commissionata                           *
      *            *---------------------------------------------------*
               10  w-cdp-dap-qta-dap      pic s9(08)v9(03)            .

      *    *===========================================================*
      *    * Work-area per la determinazione, relativamente ad una     *
      *    * commessa di produzione, di :                              *
      *    *                                                           *
      *    *    - Quantita' prodotta                                   *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       01  w-cdp-gpr.
      *        *-------------------------------------------------------*
      *        * Parametri in Output                                   *
      *        *-------------------------------------------------------*
           05  w-cdp-gpr-pxo.
      *            *---------------------------------------------------*
      *            * Quantita' prodotta                                *
      *            *---------------------------------------------------*
               10  w-cdp-gpr-qta-pdt      pic s9(08)v9(03)            .

      *    *===========================================================*
      *    * Work-area per la determinazione, relativamente ad una     *
      *    * commessa di produzione, di :                              *
      *    *                                                           *
      *    *    - Quantita' in corso di produzione                     *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       01  w-cdp-icp.
      *        *-------------------------------------------------------*
      *        * Parametri in Output                                   *
      *        *-------------------------------------------------------*
           05  w-cdp-icp-pxo.
      *            *---------------------------------------------------*
      *            * Quantita' in corso di ricevimento                 *
      *            *---------------------------------------------------*
               10  w-cdp-icp-qta-icp      pic s9(08)v9(03)            .

      *    *===========================================================*
      *    * Work-area per la selezione sul record [vpt] relativamente *
      *    * al record di [cdp], per compatibilita'                    *
      *    *-----------------------------------------------------------*
       01  w-sel-vpt-cdp.
      *        *-------------------------------------------------------*
      *        * Parametri in Output                                   *
      *        *-------------------------------------------------------*
           05  w-sel-vpt-cdp-pxo.
      *            *---------------------------------------------------*
      *            * Flag su esito della selezione                     *
      *            *  - Spaces : Selezione superata                    *
      *            *  - #      : Selezione non superata                *
      *            *---------------------------------------------------*
               10  w-sel-vpt-cdp-flg      pic  x(01)                  .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  filler                 pic  x(01)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Elaborazioni preliminari su aree titolo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area nome azienda  *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-cnt-tit-des-azi      .
           move      40                   to   w-cnt-tit-ctr-azi      .
       int-pag-std-100.
           if        w-cnt-tit-chr-azi
                    (w-cnt-tit-ctr-azi)   =    spaces
                     if     w-cnt-tit-ctr-azi
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-azi
                            go to     int-pag-std-100.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza titolo stampato    *
      *                  *---------------------------------------------*
           move      80                   to   w-cnt-tit-ctr-tit      .
       int-pag-std-200.
           if        w-cnt-tit-chr-tit
                    (w-cnt-tit-ctr-tit)   =    spaces
                     if     w-cnt-tit-ctr-tit
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-tit
                            go to     int-pag-std-200.
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale titolo    *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-tit      .
           subtract  w-cnt-tit-ctr-tit    from w-cnt-tit-pos-tit      .
           divide    2                    into w-cnt-tit-pos-tit      .
           add       1                    to   w-cnt-tit-pos-tit      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area data e pagina *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-pag    =    zero
                     move  4              to   w-cnt-tit-ctr-wrk
                     go to int-pag-std-300.
           move      zero                 to   w-cnt-tit-ctr-wrk      .
           inspect   w-cnt-tit-num-pag
                                      tallying w-cnt-tit-ctr-wrk
                                   for leading "0"                    .
       int-pag-std-300.
           subtract  w-cnt-tit-ctr-wrk    from 27
                                        giving w-cnt-tit-ctr-dep      .
           subtract  w-cnt-tit-ctr-wrk    from 5
                                        giving w-cnt-tit-ctr-cif      .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale data e p. *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-dep      .
           subtract  w-cnt-tit-ctr-dep    from w-cnt-tit-pos-dep      .
           add       1                    to   w-cnt-tit-pos-dep      .
      *                  *---------------------------------------------*
      *                  * Determinazione se titolo su una o due linee *
      *                  *---------------------------------------------*
           move      w-cnt-tit-ctr-azi    to   w-cnt-tit-ctr-wrk      .
           add       2                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-tit
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      w-cnt-tit-pos-tit    to   w-cnt-tit-ctr-wrk      .
           add       w-cnt-tit-ctr-tit    to   w-cnt-tit-ctr-wrk      .
           add       1                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-dep
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      1                    to   w-cnt-tit-num-lin      .
       int-pag-std-500.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome azienda                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-azi    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-cnt-tit-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-lin    =    2
                     go to int-pag-std-600.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-600.
      *                  *---------------------------------------------*
      *                  * Literal per Data                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           move      "Data :"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       7                    to   p-pos                  .
           move      w-cnt-tit-dat-stp    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal per Pag.                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       17                   to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      w-cnt-tit-ctr-cif    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       22                   to   p-pos                  .
           move      w-cnt-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea titolo                            *
      *              *-------------------------------------------------*
           if        w-cnt-tit-num-lin    not  = 2
                     go to int-pag-std-900.
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-900.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [cdp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
      *              *-------------------------------------------------*
      *              * [ycp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofycp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ycp                 .
      *              *-------------------------------------------------*
      *              * [vpt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/vdp/fls/ioc/obj/iofvpt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-vpt                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [dps]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [cdp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
      *              *-------------------------------------------------*
      *              * [ycp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofycp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ycp                 .
      *              *-------------------------------------------------*
      *              * [vpt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/vdp/fls/ioc/obj/iofvpt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-vpt                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [dps]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : Si'                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-exe-rou-srt      .
      *              *-------------------------------------------------*
      *              * Esecuzione sort                                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   prn-rou-pri-000
                                          thru prn-rou-pri-999        .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Start su file [cdp]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "IDEDOC    "         to   f-key                  .
           move      rr-dat-min           to   rf-cdp-dat-doc         .
           move      rr-dpz-inu           to   rf-cdp-cod-dpz         .
           move      zero                 to   rf-cdp-num-doc         .
           move      spaces               to   rf-cdp-tmo-cdp         .
           move      zero                 to   rf-cdp-num-prt         .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-999.
       stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale record [cdp]                *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/cdp/fls/ioc/obj/iofcdp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cdp                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-999.
       stp-srt-inp-120.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su data commessa massima               *
      *                  *---------------------------------------------*
           if        rf-cdp-dat-doc       >    rr-dat-max
                     go to stp-srt-inp-999.
      *              *-------------------------------------------------*
      *              * Selezione sul record                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su codice dipendenza                   *
      *                  *---------------------------------------------*
           if        rf-cdp-cod-dpz       not  = rr-dpz-inu
                     go to stp-srt-inp-100.
      *                  *---------------------------------------------*
      *                  * Test su flag di commessa chiusa             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione dello stato del- *
      *                      * le commesse richiesto                   *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-121
                     stp-srt-inp-122
                     stp-srt-inp-123
                     depending            on   rr-sts-cdp             .
       stp-srt-inp-121.
      *                      *-----------------------------------------*
      *                      * Se solo commesse da evadere             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di commessa chiusa     *
      *                          *-------------------------------------*
           if        rf-cdp-flg-cch       not  = spaces
                     go to stp-srt-inp-100.
           go to     stp-srt-inp-130.
       stp-srt-inp-122.
      *                      *-----------------------------------------*
      *                      * Se solo commesse gia' evase             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Nessun test                         *
      *                          *-------------------------------------*
           go to     stp-srt-inp-130.
       stp-srt-inp-123.
      *                      *-----------------------------------------*
      *                      * Se tutte le commesse                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Nessun test                         *
      *                          *-------------------------------------*
           go to     stp-srt-inp-130.
       stp-srt-inp-130.
      *                  *---------------------------------------------*
      *                  * Selezione su responsabile commessa          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se da effettuare                   *
      *                      *-----------------------------------------*
           if        rr-sel-rsp           =    spaces
                     go to stp-srt-inp-140.
      *                      *-----------------------------------------*
      *                      * Lettura archivio [ycp]                  *
      *                      *-----------------------------------------*
           move      rf-cdp-tmo-cdp       to   w-let-arc-ycp-cod      .
           perform   let-arc-ycp-000      thru let-arc-ycp-999        .
           if        w-let-arc-ycp-rsp    not  = rr-sel-rsp
                     go to stp-srt-inp-100.
       stp-srt-inp-140.
      *                  *---------------------------------------------*
      *                  * Selezione su segnale di commessa comunque   *
      *                  * considerata saldata                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione dello stato del- *
      *                      * le commesse richiesto                   *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-141
                     stp-srt-inp-142
                     stp-srt-inp-143
                     depending            on   rr-sts-cdp             .
       stp-srt-inp-141.
      *                      *-----------------------------------------*
      *                      * Se solo commesse da evadere             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di commessa comunque   *
      *                          * saldata                             *
      *                          *-------------------------------------*
           if        rf-cdp-sdc-ccs       not  = spaces
                     go to stp-srt-inp-100.
           go to     stp-srt-inp-150.
       stp-srt-inp-142.
      *                      *-----------------------------------------*
      *                      * Se solo commesse gia' evase             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Nessun test                         *
      *                          *-------------------------------------*
           go to     stp-srt-inp-150.
       stp-srt-inp-143.
      *                      *-----------------------------------------*
      *                      * Se tutte le commesse                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Nessun test                         *
      *                          *-------------------------------------*
           go to     stp-srt-inp-150.
       stp-srt-inp-150.
      *                  *---------------------------------------------*
      *                  * Selezione sulla quantita' ancora da produr- *
      *                  * re                                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Determinazione, relativamente alla com- *
      *                      * messa letta, di :                       *
      *                      *                                         *
      *                      *  - Quantita' commissionata              *
      *                      *  - Quantita' gia' prodotta              *
      *                      *  - Quantita' in corso di produzione     *
      *                      *                                         *
      *                      *  - Quantita' ancora da produrre         *
      *                      *                                         *
      *                      *-----------------------------------------*
           perform   rpd-cdp-ogi-000      thru rpd-cdp-ogi-999        .
      *                      *******************************************
      *                      * Aggiustamento quantita' da produrre     *
      *                      *******************************************
           if        rf-cdp-sdc-ccs       not  = spaces
                     move  zero           to   w-cdp-ogi-qta-dpr      .
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione dello stato del- *
      *                      * le commesse richiesto                   *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-151
                     stp-srt-inp-152
                     stp-srt-inp-153
                     depending            on   rr-sts-cdp             .
       stp-srt-inp-151.
      *                      *-----------------------------------------*
      *                      * Se solo commesse da evadere             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se quantita' ancora da produrre a   *
      *                          * zero : riciclo                      *
      *                          *-------------------------------------*
           if        w-cdp-ogi-qta-dpr    =    zero
                     go to stp-srt-inp-100.
           go to     stp-srt-inp-160.
       stp-srt-inp-152.
      *                      *-----------------------------------------*
      *                      * Se solo commesse gia' evase             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se quantita' ancora da evadere non  *
      *                          * a zero : riciclo                    *
      *                          *-------------------------------------*
           if        w-cdp-ogi-qta-dpr    not  = zero
                     go to stp-srt-inp-100.
           go to     stp-srt-inp-160.
       stp-srt-inp-153.
      *                      *-----------------------------------------*
      *                      * Se tutti le commesse                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Nessun test                         *
      *                          *-------------------------------------*
           go to     stp-srt-inp-160.
       stp-srt-inp-160.
      *              *-------------------------------------------------*
      *              * Fine selezioni sul record                       *
      *              *-------------------------------------------------*
       stp-srt-inp-300.
      *              *-------------------------------------------------*
      *              * Determinazione descrizione magazzino            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo magazzino   *
      *                  *---------------------------------------------*
           if        rf-cdp-tip-mag       =    01
                     go to stp-srt-inp-310
           else if   rf-cdp-tip-mag       =    02
                     go to stp-srt-inp-320.
       stp-srt-inp-310.
      *                  *---------------------------------------------*
      *                  * Tipo magazzino : Prodotti di vendita        *
      *                  *---------------------------------------------*
           move      rf-cdp-num-mag       to   w-let-arc-dcp-cod      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
           move      w-let-arc-dcp-des    to   w-stp-srt-inp-des      .
           move      w-let-arc-dcp-alf    to   w-stp-srt-inp-alf      .
           move      w-let-arc-dcp-deq    to   w-stp-srt-inp-deq      .
           move      w-let-arc-dcp-umi    to   w-stp-srt-inp-umi      .
           go to     stp-srt-inp-350.
       stp-srt-inp-320.
      *                  *---------------------------------------------*
      *                  * Tipo magazzino : Semilavorati               *
      *                  *---------------------------------------------*
           move      rf-cdp-num-mag       to   w-let-arc-dps-cod      .
           perform   let-arc-dps-000      thru let-arc-dps-999        .
           move      w-let-arc-dps-des    to   w-stp-srt-inp-des      .
           move      w-let-arc-dps-alf    to   w-stp-srt-inp-alf      .
           move      w-let-arc-dps-deq    to   w-stp-srt-inp-deq      .
           move      w-let-arc-dps-umi    to   w-stp-srt-inp-umi      .
           go to     stp-srt-inp-350.
       stp-srt-inp-350.
      *              *-------------------------------------------------*
      *              * Preparazione record di Sort                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione iniziale                    *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
      *                  *---------------------------------------------*
      *                  * Chiave di sort                              *
      *                  *---------------------------------------------*
           move      rf-cdp-tmo-cdp       to   srt-tmo-cdp            .
           move      rf-cdp-dat-doc       to   srt-dat-doc            .
           move      rf-cdp-num-doc       to   srt-num-doc            .
           move      rf-cdp-num-prt       to   srt-num-prt            .
      *                  *---------------------------------------------*
      *                  * Dati di sort                                *
      *                  *---------------------------------------------*
           move      rf-cdp-tip-mag       to   srt-tip-mag            .
           move      w-stp-srt-inp-alf    to   srt-alf-mag            .
           move      w-stp-srt-inp-des    to   srt-des-mag            .
           move      w-stp-srt-inp-deq    to   srt-dec-qta            .
           move      w-stp-srt-inp-umi    to   srt-uni-mis            .
           move      rf-cdp-dat-cns       to   srt-dat-cns            .
           move      w-cdp-ogi-qta-dap    to   srt-qta-dap            .
           move      w-cdp-ogi-qta-pdt    to   srt-qta-gpr            .
           move      w-cdp-ogi-qta-dpr    to   srt-qta-dpr            .
      *              *-------------------------------------------------*
      *              * Rilascio del record al Sort                     *
      *              *-------------------------------------------------*
           release   srt-rec                                          .
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale record [cdp]     *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-100.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessuna registrazione entro i limiti assegnati !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
           return    srt    at end
                            move  "#"     to   w-cnt-prn-flg-sub
                            go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Reintestazione foglio                           *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Stampa riga di dettaglio                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    1
                     go to prn-liv-det-100.
      *                      *-----------------------------------------*
      *                      * Reintestazione                          *
      *                      *-----------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
       prn-liv-det-100.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Tipo movimento commessa di produzione       *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      srt-tmo-cdp          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero commessa di produzione               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      007                  to   p-pos                  .
           move      srt-num-doc          to   w-wrk-num-011          .
           move      w-wrk-num-011-prg    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data commessa di produzione                 *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      014                  to   p-pos                  .
           move      srt-dat-doc          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Tipo magazzino                              *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      023                  to   p-pos                  .
           if        srt-tip-mag          =    01
                     move  "[P]"          to   p-alf
           else if   srt-tip-mag          =    02
                     move  "[S]"          to   p-alf
           else      move  "[?]"          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Codice prodotto                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      027                  to   p-pos                  .
           move      srt-alf-mag          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Descrizione prodotto                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      042                  to   p-pos                  .
           move      srt-des-mag          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Unita' di misura                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      083                  to   p-pos                  .
           move      srt-uni-mis          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Quantita' in commessa                       *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      srt-dec-qta          to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "GB"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      086                  to   p-pos                  .
           move      srt-qta-dap          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Quantita' gia' prodotta                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      srt-dec-qta          to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "GB"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      098                  to   p-pos                  .
           move      srt-qta-gpr          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Quantita' ancora da produrre                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      srt-dec-qta          to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "GB"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      110                  to   p-pos                  .
           move      srt-qta-dpr          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data consegna                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      123                  to   p-pos                  .
           move      srt-dat-cns          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio                                       *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Preparazione parametri intestazione standard    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione titolo                         *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-tit-des-tit      .
           move      1                    to   w-int-pag-sta-pnt      .
      *
           string    "COMMESSE DI PRODUZIONE"
                                delimited by   size
                                          into w-cnt-tit-des-tit
                                  with pointer w-int-pag-sta-pnt      .
      *
           if        rr-sts-cdp           =   01
                     move  " DA EVADERE"  to  w-int-pag-sta-x30
           else if   rr-sts-cdp           =   02
                     move  " EVASE"
                                          to  w-int-pag-sta-x30
           else if   rr-sts-cdp           =   03
                     move  spaces         to  w-int-pag-sta-x30       .
      *
           string    w-int-pag-sta-x30
                                delimited by   size
                                          into w-cnt-tit-des-tit
                                  with pointer w-int-pag-sta-pnt      .
      *
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-cnt-tit-dat-stp      .
           move      p-pag                to   w-cnt-tit-num-pag      .
           add       1                    to   w-cnt-tit-num-pag      .
      *              *-------------------------------------------------*
      *              * Intestazione standard                           *
      *              *-------------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per interruzione forzata          *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  int-pag-sta-999.
      *              *-------------------------------------------------*
      *              * Fincatura                                       *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "       Commessa                           Descrizi
      -              "one prodotto                    Udm   Commessa   P
      -              "rodotto     Residuo   Consegna  "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura                        *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "--------------------- ----------------------------
      -              "------------------------------- --- ----------- --
      -              "--------- ----------- --------  "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-999.
           exit.

       fin-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [ycp]                         *
      *    *-----------------------------------------------------------*
       let-arc-ycp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-ycp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spazi                          *
      *              *-------------------------------------------------*
           if        w-let-arc-ycp-cod    =    spaces
                     go to let-arc-ycp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODTCP"             to   f-key                  .
           move      w-let-arc-ycp-cod    to   rf-ycp-cod-tcp         .
           move      "pgm/cdp/fls/ioc/obj/iofycp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ycp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-ycp-400.
       let-arc-ycp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-ycp-des-tcp       to   w-let-arc-ycp-des      .
           move      rf-ycp-vld-dpz       to   w-let-arc-ycp-vld      .
           move      rf-ycp-cod-dpz       to   w-let-arc-ycp-dpz      .
           move      rf-ycp-org-doc       to   w-let-arc-ycp-ord      .
           move      rf-ycp-prv-doc       to   w-let-arc-ycp-prd      .
           move      rf-ycp-sgl-num       to   w-let-arc-ycp-sgl      .
           move      rf-ycp-rsp-tcp       to   w-let-arc-ycp-rsp      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-ycp-999.
       let-arc-ycp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-ycp-flg      .
           move      all   "."            to   w-let-arc-ycp-des      .
           go to     let-arc-ycp-600.
       let-arc-ycp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-ycp-des      .
       let-arc-ycp-600.
           move      spaces               to   w-let-arc-ycp-des      .
           move      zero                 to   w-let-arc-ycp-vld      .
           move      zero                 to   w-let-arc-ycp-dpz      .
           move      zero                 to   w-let-arc-ycp-ord      .
           move      zero                 to   w-let-arc-ycp-prd      .
           move      spaces               to   w-let-arc-ycp-sgl      .
           move      spaces               to   w-let-arc-ycp-rsp      .
       let-arc-ycp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [dcp]                         *
      *    *-----------------------------------------------------------*
       let-arc-dcp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcp-cod    =    zero  
                     go to let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      w-let-arc-dcp-cod    to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcp-400.
       let-arc-dcp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcp-des-pro       to   w-let-arc-dcp-des      .
           move      rf-dcp-alf-pro       to   w-let-arc-dcp-alf      .
           move      rf-dcp-umi-ven       to   w-let-arc-dcp-umi      .
           move      rf-dcp-dec-qta       to   w-let-arc-dcp-deq      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcp-999.
       let-arc-dcp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcp-flg      .
           move      all   "."            to   w-let-arc-dcp-des      .
           go to     let-arc-dcp-600.
       let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-des      .
       let-arc-dcp-600.
           move      spaces               to   w-let-arc-dcp-alf      .
           move      spaces               to   w-let-arc-dcp-umi      .
           move      zero                 to   w-let-arc-dcp-deq      .
       let-arc-dcp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [dps]                         *
      *    *-----------------------------------------------------------*
       let-arc-dps-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dps-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dps-cod    =    zero
                     go to let-arc-dps-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMSEM"             to   f-key                  .
           move      w-let-arc-dps-cod    to   rf-dps-num-sem         .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dps-400.
       let-arc-dps-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dps-des-sem       to   w-let-arc-dps-des      .
           move      rf-dps-alf-sem       to   w-let-arc-dps-alf      .
           move      rf-dps-umi-prd       to   w-let-arc-dps-umi      .
           move      rf-dps-dec-qta       to   w-let-arc-dps-deq      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dps-999.
       let-arc-dps-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dps-flg      .
           move      all   "."            to   w-let-arc-dps-des      .
           go to     let-arc-dps-600.
       let-arc-dps-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dps-des      .
       let-arc-dps-600.
           move      spaces               to   w-let-arc-dps-alf      .
           move      spaces               to   w-let-arc-dps-umi      .
           move      zero                 to   w-let-arc-dps-deq      .
       let-arc-dps-999.
           exit.

      *    *===========================================================*
      *    * Routine per la determinazione, relativamente ad una       *
      *    * commessa di produzione, di :                              *
      *    *                                                           *
      *    *    - Quantita' commissionata                              *
      *    *    - Quantita' prodotta                                   *
      *    *    - Quantita' in corso di produzione                     *
      *    *                                                           *
      *    * e, di conseguenza, di :                                   *
      *    *                                                           *
      *    *    - Quantita' ancora da produrre                         *
      *    *                                                           *
      *    * Input  :                                                  *
      *    *                                                           *
      *    *    - Record di [cdp] relativo alla commessa di produzione *
      *    *      a disposizione in rf-cdp                             *
      *    *                                                           *
      *    * Output :                                                  *
      *    *                                                           *
      *    *    - w-cdp-ogi-qta-dap : Quantita' da produrre            *
      *    *                                                           *
      *    *    - w-cdp-ogi-qta-pdt : Quantita' prodotta               *
      *    *                                                           *
      *    *    - w-cdp-ogi-qta-icp : Quantita' in corso di produzione *
      *    *                                                           *
      *    *    - w-cdp-ogi-qta-dpr : Quantita' ancora da produrre     *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       rpd-cdp-ogi-000.
      *              *-------------------------------------------------*
      *              * Determinazione della quantita' commissionata    *
      *              *-------------------------------------------------*
           perform   rpd-cdp-dap-000      thru rpd-cdp-dap-999        .
           move      w-cdp-dap-qta-dap    to   w-cdp-ogi-qta-dap      .
       rpd-cdp-ogi-200.
      *              *-------------------------------------------------*
      *              * Determinazione della quantita' prodotta         *
      *              *-------------------------------------------------*
           perform   rpd-cdp-pdt-000      thru rpd-cdp-pdt-999        .
           move      w-cdp-gpr-qta-pdt    to   w-cdp-ogi-qta-pdt      .
       rpd-cdp-ogi-300.
      *              *-------------------------------------------------*
      *              * Determinazione della quantita' in corso di pro- *
      *              * duzione                                         *
      *              *-------------------------------------------------*
           perform   rpd-cdp-icp-000      thru rpd-cdp-icp-999        .
           move      w-cdp-icp-qta-icp    to   w-cdp-ogi-qta-icp      .
       rpd-cdp-ogi-400.
      *              *-------------------------------------------------*
      *              * Determinazione della quantita' ancora da pro-   *
      *              * durre                                           *
      *              *-------------------------------------------------*
       rpd-cdp-ogi-410.
      *                  *---------------------------------------------*
      *                  * Differenza algebrica tra :                  *
      *                  *   - Quantita' da produrre                   *
      *                  * e                                           *
      *                  *   - Quantita' prodotta                      *
      *                  *   - Quantita' in corso di produzione        *
      *                  *---------------------------------------------*
           move      w-cdp-ogi-qta-dap    to   w-cdp-ogi-qta-dpr      .
           subtract  w-cdp-ogi-qta-pdt    from w-cdp-ogi-qta-dpr      .
           subtract  w-cdp-ogi-qta-icp    from w-cdp-ogi-qta-dpr      .
      *                  *---------------------------------------------*
      *                  * Riduzione a zero del residuo eventualmente  *
      *                  * negativo, tenendo conto del segno algebri-  *
      *                  * co della quantita' in ordine                *
      *                  *---------------------------------------------*
           if        w-cdp-ogi-qta-dap    >    zero and
                     w-cdp-ogi-qta-dpr    <    zero
                     move  zero           to   w-cdp-ogi-qta-dpr      .
           if        w-cdp-ogi-qta-dap    <    zero and
                     w-cdp-ogi-qta-dpr    >    zero
                     move  zero           to   w-cdp-ogi-qta-dpr      .
       rpd-cdp-ogi-999.
           exit.

      *    *===========================================================*
      *    * Routine per la determinazione, relativamente ad una       *
      *    * commessa di produzione, di :                              *
      *    *                                                           *
      *    *    - Quantita' commissionata                              *
      *    *                                                           *
      *    * Input  :                                                  *
      *    *                                                           *
      *    *    - Record di [cdp] relativo alla commessa di produzione *
      *    *      a disposizione in rf-cdp                             *
      *    *                                                           *
      *    * Output :                                                  *
      *    *                                                           *
      *    *    - w-cdp-dap-qta-dap : Quantita' da produrre            *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       rpd-cdp-dap-000.
      *              *-------------------------------------------------*
      *              * Si considera come 'Quantita' da produrre' il    *
      *              * campo 'qta-dap' del record di [cdp] in esame    *
      *              *-------------------------------------------------*
           move      rf-cdp-qta-dap       to   w-cdp-dap-qta-dap      .
       rpd-cdp-dap-999.
           exit.

      *    *===========================================================*
      *    * Routine per la determinazione, relativamente ad una       *
      *    * commessa di produzione, di :                              *
      *    *                                                           *
      *    *    - Quantita' prodotta                                   *
      *    *                                                           *
      *    * Input  :                                                  *
      *    *                                                           *
      *    *    - Record di [cdp] relativo alla commessa di produzione *
      *    *      a disposizione in rf-cdp                             *
      *    *                                                           *
      *    * Output :                                                  *
      *    *                                                           *
      *    *    - w-cdp-gpr-qta-pdt : Quantita' prodotta               *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       rpd-cdp-pdt-000.
      *              *-------------------------------------------------*
      *              * Inizializzazioni preliminari                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Quantita' gia' prodotta : a zero            *
      *                  *---------------------------------------------*
           move      zero                 to   w-cdp-gpr-qta-pdt      .
       rpd-cdp-pdt-100.
      *              *-------------------------------------------------*
      *              * Start iniziale su [vpt]                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Start                                       *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "RIFCDP    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      rf-cdp-num-prt       to   rf-vpt-prt-cdp         .
           move      zero                 to   rf-vpt-num-prt         .
           move      "pgm/vdp/fls/ioc/obj/iofvpt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-vpt                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to rpd-cdp-pdt-999.
       rpd-cdp-pdt-200.
      *              *-------------------------------------------------*
      *              * Read Next su [vpt]                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Read Next                                   *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/vdp/fls/ioc/obj/iofvpt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-vpt                 .
      *                  *---------------------------------------------*
      *                  * Se At end : uscita                          *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to rpd-cdp-pdt-999.
       rpd-cdp-pdt-300.
      *              *-------------------------------------------------*
      *              * Test Max su [vpt]                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su :                                   *
      *                  *    - Numero protocollo commessa di produ-   *
      *                  *      zione                                  *
      *                  *---------------------------------------------*
           if        rf-vpt-prt-cdp       =    rf-cdp-num-prt
                     go to rpd-cdp-pdt-400.
      *                  *---------------------------------------------*
      *                  * Se oltre il Max : uscita                    *
      *                  *---------------------------------------------*
           go to     rpd-cdp-pdt-999.
       rpd-cdp-pdt-400.
      *              *-------------------------------------------------*
      *              * Selezioni sul record di [vpt] rispetto al re-   *
      *              * cord di [cdp]                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Selezione                                   *
      *                  *---------------------------------------------*
           perform   sel-vpt-cdp-000      thru sel-vpt-cdp-999        .
      *                  *---------------------------------------------*
      *                  * Se selezione non superata : si ignora il    *
      *                  * record letto                                *
      *                  *---------------------------------------------*
           if        w-sel-vpt-cdp-flg    not  = spaces
                     go to rpd-cdp-pdt-800.
       rpd-cdp-pdt-500.
      *              *-------------------------------------------------*
      *              * Considerazioni sul record di [vpt] letto e se-  *
      *              * lezionato rispetto ad [cdp]                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Si somma la 'Quantita prodotta' contenuta   *
      *                  * nel record alla 'Quantita prodotta' che si  *
      *                  * sta determinando                            *
      *                  *---------------------------------------------*
           add       rf-vpt-qta-pdt       to   w-cdp-gpr-qta-pdt      .
       rpd-cdp-pdt-800.
      *              *-------------------------------------------------*
      *              * Riciclo a Read Next su [vpt]                    *
      *              *-------------------------------------------------*
           go to     rpd-cdp-pdt-200.
       rpd-cdp-pdt-999.
           exit.

      *    *===========================================================*
      *    * Routine per la determinazione, relativamente ad una       *
      *    * commessa di produzione, di :                              *
      *    *                                                           *
      *    *    - Quantita' in corso di produzione                     *
      *    *                                                           *
      *    * Input  :                                                  *
      *    *                                                           *
      *    *    - Record di [cdp] relativo alla commessa di produzione *
      *    *      a disposizione in rf-cdp                             *
      *    *                                                           *
      *    * Output :                                                  *
      *    *                                                           *
      *    *    - w-cdp-icp-qta-icp : Quantita' in corso di produzione *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       rpd-cdp-icp-000.
      *              *-------------------------------------------------*
      *              * Quantita' in corso di produzione : a zero       *
      *              *-------------------------------------------------*
           move      zero                 to   w-cdp-icp-qta-icp      .
       rpd-cdp-icp-999.
           exit.

      *    *===========================================================*
      *    * Routine per la selezione sul record [vpt] relativamente   *
      *    * al record di [cdp], per compatibilita'                    *
      *    *                                                           *
      *    * Input  :                                                  *
      *    *                                                           *
      *    *    - Record di [vpt] relativo al versamento da produzione *
      *    *      a disposizione in rf-vpt                             *
      *    *                                                           *
      *    *    - Record di [cdp] relativo alla commessa di produzione *
      *    *      a disposizione in rf-cdp                             *
      *    *                                                           *
      *    * Output :                                                  *
      *    *                                                           *
      *    *    - w-sel-vpt-cdp-flg : Esito della selezione            *
      *    *                            - Spaces : Ok                  *
      *    *                            - #      : Ko                  *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       sel-vpt-cdp-000.
      *              *-------------------------------------------------*
      *              * Selezione su : Tipo movimento della commessa di *
      *              *                produzione                       *
      *              *                                                 *
      *              * Deve essere pari a quello della commessa che    *
      *              * si sta esaminando.                              *
      *              *-------------------------------------------------*
           if        rf-vpt-tmo-cdp       not  = rf-cdp-tmo-cdp
                     go to sel-vpt-cdp-900.
      *              *-------------------------------------------------*
      *              * Selezione su : Data documento della commessa di *
      *              *                produzione                       *
      *              *                                                 *
      *              * Deve essere pari a quello della commessa che    *
      *              * si sta esaminando.                              *
      *              *-------------------------------------------------*
           if        rf-vpt-dat-cdp       not  = rf-cdp-dat-doc
                     go to sel-vpt-cdp-900.
      *              *-------------------------------------------------*
      *              * Selezione su : Numero documento della commessa  *
      *              *                di produzione                    *
      *              *                                                 *
      *              * Deve essere pari a quello della commessa che    *
      *              * si sta esaminando.                              *
      *              *-------------------------------------------------*
           if        rf-vpt-num-cdp       not  = rf-cdp-num-doc
                     go to sel-vpt-cdp-900.
      *              *-------------------------------------------------*
      *              * Selezione su : Destinazione della produzione    *
      *              *                                                 *
      *              * Deve essere pari a quello della commessa che    *
      *              * si sta esaminando.                              *
      *              *-------------------------------------------------*
           if        rf-vpt-dsz-prd       not  = rf-cdp-dsz-prd
                     go to sel-vpt-cdp-900.
      *              *-------------------------------------------------*
      *              * Selezione su : Codice per la destinazione della *
      *              *                produzione                       *
      *              *                                                 *
      *              * Deve essere pari a quello della commessa che    *
      *              * si sta esaminando.                              *
      *              *-------------------------------------------------*
           if        rf-vpt-dsz-cod       not  = rf-cdp-dsz-cod
                     go to sel-vpt-cdp-900.
      *              *-------------------------------------------------*
      *              * Selezione su : Codice dipendenzaper la destina- *
      *              *                zione della produzione           *
      *              *                                                 *
      *              * Deve essere pari a quello della commessa che    *
      *              * si sta esaminando.                              *
      *              *-------------------------------------------------*
           if        rf-vpt-dsz-dpz       not  = rf-cdp-dsz-dpz
                     go to sel-vpt-cdp-900.
      *              *-------------------------------------------------*
      *              * Selezione su : Tipo codice di magazzino         *
      *              *                                                 *
      *              * Deve essere pari a quello della commessa che    *
      *              * si sta esaminando.                              *
      *              *-------------------------------------------------*
           if        rf-vpt-tip-mag       not  = rf-cdp-tip-mag
                     go to sel-vpt-cdp-900.
      *              *-------------------------------------------------*
      *              * Selezione su : Codice prodotto numerico         *
      *              *                                                 *
      *              * Deve essere pari a quello della commessa che    *
      *              * si sta esaminando.                              *
      *              *-------------------------------------------------*
           if        rf-vpt-num-mag       not  = rf-cdp-num-mag
                     go to sel-vpt-cdp-900.
      *              *-------------------------------------------------*
      *              * Selezione su : Quantita' prodotta               *
      *              *                                                 *
      *              * Deve essere diversa da Zero, non si prendono in *
      *              * considerazione versamenti con quantita' a Ze-   *
      *              * ro.                                             *
      *              *-------------------------------------------------*
           if        rf-vpt-qta-pdt       =    zero
                     go to sel-vpt-cdp-900.
       sel-vpt-cdp-800.
      *              *-------------------------------------------------*
      *              * Uscita per selezione : Ok                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-sel-vpt-cdp-flg      .
           go to     sel-vpt-cdp-999.
       sel-vpt-cdp-900.
      *              *-------------------------------------------------*
      *              * Uscita per selezione : Ko                       *
      *              *-------------------------------------------------*
           move      "#"                  to   w-sel-vpt-cdp-flg      .
           go to     sel-vpt-cdp-999.
       sel-vpt-cdp-999.
           exit.

