       Identification Division.
       Program-Id.                                 indatbil           .
      *================================================================*
      *                                                                *
      *                 Input-Output Numeri datbil                     *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Pathname completo del modulo oggetto                  *
      *        *-------------------------------------------------------*
           05  i-ide-pmo                  pic  x(40) value
                     "pgm/cge/num/ioc/obj/indatbil            "       .

      *    *===========================================================*
      *    * Area di definizione della chiave                          *
      *    *-----------------------------------------------------------*
       01  k.
      *        *-------------------------------------------------------*
      *        * Componente fissa                                      *
      *        *-------------------------------------------------------*
           05  k-fix                      pic  x(08) value
                     "datbil  "                                       .
      *        *-------------------------------------------------------*
      *        * Componente variabile : 10 caratteri                   *
      *        *-------------------------------------------------------*
           05  k-var.
               10  filler                 pic  x(10)                  .
      *        *-------------------------------------------------------*
      *        * Contatore numero frammenti                            *
      *        *-------------------------------------------------------*
           05  k-cnf                      pic  9(02)                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Record logico file [num]                                  *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/fls/rec/rfnum"                          .

      *    *===========================================================*
      *    * Work-area fissa per tutti i moduli di gestione i-o        *
      *    *-----------------------------------------------------------*
       01  z.
           05  z-inx                      pic  9(04)                  .
           05  z-pnt                      pic  9(04)                  .
           05  z-nfr                      pic  9(03)                  .
           05  z-cnf                      pic  9(03)                  .

      *================================================================*
       Linkage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Record logico numeri [datbil]                             *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/num/rec/rndatbil"                       .

      ******************************************************************
       Procedure Division                using f rn-dat-bil           .
      ******************************************************************

      *    *===========================================================*
      *    * Procedure division fissa per tutti i moduli di i-o        *
      *    *-----------------------------------------------------------*
           copy      "swd/ske/ion/ioncp50"                            .

      *    *===========================================================*
      *    * Unstring da record numeri a record [num]                  *
      *    *-----------------------------------------------------------*
       uns-000.
           unstring  rn-dat-bil           into rf-num-dat-num
                                  with pointer z-inx                  .
       uns-999.
           exit.

      *    *===========================================================*
      *    * String da record [num] a record numeri                    *
      *    *-----------------------------------------------------------*
       stg-000.
           string    rf-num-dat-num       
                     delimited  by size        into rn-dat-bil
                                  with pointer z-inx                  .
       stg-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione record numeri                             *
      *    *-----------------------------------------------------------*
       nor-000.
           move      spaces               to   rn-dat-bil             .
           move      spaces               to   rn-dat-bil-flg-bil     .
           move      zero                 to   rn-dat-bil-ini-bil     .
           move      zero                 to   rn-dat-bil-fin-bil     .
           move      zero                 to   rn-dat-bil-ese-bil     .
       nor-999.
           exit.
           
      *    *===========================================================*
      *    * Composizione componente variabile della chiave            *
      *    *-----------------------------------------------------------*
       key-000.
           move      spaces               to   k-var                  .
       key-999.
           exit.
