       Identification Division.
       Program-Id.                                 pscf300m           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    scf                 *
      *                                Settore:    mov                 *
      *                                   Fase:    scf300              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 29/07/94    *
      *                       Ultima revisione:    NdK del 08/04/26    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Movimenti per gestione scadenze fornitori   *
      *                                                                *
      *                    Sottoprogramma per esecuzione funzione di : *
      *                                                                *
      *                    - Stampa ordini di bonifico                 *
      *                                                                *
      *                    (con emissione file 'biAZIaa.nnn')          *
      *                                                                *
      *                    (Standard tecnici CBI - Rel.6.0.5 - 06/2008)*
      *                                                                *
      *                    (con emissione file 'biAZIaa.xml' in base   *
      *                     a Standard SEPA - ISO 20022)               *
      *                                                                *
      *                     Adeguamento CBIPaymentRequest.00.04.01     *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      *    *===========================================================*
      *    * File Control [ouf]                                        *
      *    *-----------------------------------------------------------*
           select            ouf   assign to input-output   f-ouf-pat
                             organization is binary sequential
                             access  mode is sequential
                             file  status is                f-ouf-sts .

      *    *===========================================================*
      *    * File Control [ou2], per il carattere di fine-file relati- *
      *    *                     vo a [ouf]                            *
      *    *-----------------------------------------------------------*
           select ou2        assign       to input-output   f-ou2-pat
                             organization is binary sequential
                             access  mode is sequential
                             file  status is                f-ou2-sts .

      *    *===========================================================*
      *    * File Control [kk0]                                        *
      *    *-----------------------------------------------------------*
           select  optional  kk0   assign to disk           f-kk0-pat
                             organization is indexed
                             access mode  is dynamic
                             record key   is kk0-key
                             file status  is                f-kk0-sts .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Filler                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Filler                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .

      *    *===========================================================*
      *    * File Description [ouf]                                    *
      *    *-----------------------------------------------------------*
       fd  ouf  label record omitted.
      *    *-----------------------------------------------------------*
      *    * Output record per distinta in formato MS-DOS              *
      *    *-----------------------------------------------------------*
       01  ouf-rec.
      *        *-------------------------------------------------------*
      *        * Area dati vera e propria                              *
      *        *-------------------------------------------------------*
           05  ouf-dat.
               10  filler     occurs 120  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Carattere CR                                          *
      *        *-------------------------------------------------------*
           05  ouf-crx                    pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Carattere LF                                          *
      *        *-------------------------------------------------------*
           05  ouf-lfx                    pic  x(01)                  .

      *    *===========================================================*
      *    * File Description [ou2], per il carattere di fine-file re- *
      *    *                         lativo a [ouf]                    *
      *    *-----------------------------------------------------------*
       fd  ou2  label record omitted.
      *    *-----------------------------------------------------------*
      *    * Record                                                    *
      *    *-----------------------------------------------------------*
       01  ou2-rec.
      *        *-------------------------------------------------------*
      *        * Caratteri componenti il record, 1 carattere           *
      *        *-------------------------------------------------------*
           05  ou2-chr                    pic  x(01)                  .

      *    *===========================================================*
      *    * File Description [kk0]                                    *
      *    *-----------------------------------------------------------*
       fd  kk0       label record standard                            .

      *    *===========================================================*
      *    * Record file di appoggio [kk0]                             *
      *    *-----------------------------------------------------------*
       01  kk0-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  kk0-key.
      *            *---------------------------------------------------*
      *            * Progressivo riga                                  *
      *            *---------------------------------------------------*
               10  kk0-prg-key            pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  kk0-dat.
      *            *---------------------------------------------------*
      *            * Codice fornitore                                  *
      *            *---------------------------------------------------*
               10  kk0-cod-fnt            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Ragione Sociale Fornitore                         *
      *            *---------------------------------------------------*
               10  kk0-rag-fnt            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * IBAN Fornitore                                    *
      *            *---------------------------------------------------*
               10  kk0-ibn-fnt            pic  x(27)                  .
      *            *---------------------------------------------------*
      *            * Importo scadenza                                  *
      *            *---------------------------------------------------*
               10  kk0-imp-scd            pic s9(13)                  .
      *            *---------------------------------------------------*
      *            * Riferimenti Fornitore                             *
      *            *---------------------------------------------------*
               10  kk0-rif-fnt            pic  x(80)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * File area per [kk0]                                       *
      *    *-----------------------------------------------------------*
       01  f-kk0.
      *        *-------------------------------------------------------*
      *        * File name                                             *
      *        *-------------------------------------------------------*
           05  f-kk0-nam                  pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * File pathname                                         *
      *        *-------------------------------------------------------*
           05  f-kk0-pat                  pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * File status                                           *
      *        *-------------------------------------------------------*
           05  f-kk0-sts                  pic  x(02)                  .

      *    *===========================================================*
      *    * Area ausiliaria per controllo i-o su [ouf]                *
      *    *-----------------------------------------------------------*
       01  f-ouf.
      *        *-------------------------------------------------------*
      *        * File name                                             *
      *        *-------------------------------------------------------*
           05  f-ouf-nam                  pic  x(04) value spaces     .
      *        *-------------------------------------------------------*
      *        * File pathname                                         *
      *        *-------------------------------------------------------*
           05  f-ouf-pat                  pic  x(40) value spaces     .
      *        *-------------------------------------------------------*
      *        * File status                                           *
      *        *-------------------------------------------------------*
           05  f-ouf-sts                  pic  x(02) value "00"       .

      *    *===========================================================*
      *    * Area ausiliaria per controllo i-o su [ou2]                *
      *    *-----------------------------------------------------------*
       01  f-ou2.
      *        *-------------------------------------------------------*
      *        * File name                                             *
      *        *-------------------------------------------------------*
           05  f-ou2-nam                  pic  x(04) value spaces     .
      *        *-------------------------------------------------------*
      *        * File pathname                                         *
      *        *-------------------------------------------------------*
           05  f-ou2-pat                  pic  x(40) value spaces     .
      *        *-------------------------------------------------------*
      *        * File status                                           *
      *        *-------------------------------------------------------*
           05  f-ou2-sts                  pic  x(02) value "00"       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "msegrt" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mpslct" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/r"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                 "mbckgx" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mmessg" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output su files *
      *    * di tipo line sequential                                   *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/g"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine sel-prm-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-sel-prm-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flag di controllo su status visualizzazione titolo    *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis-tit          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste per programma di esecuzione       *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico                       *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No richiesta di selezione stampa               *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area per preparazione parametri selezione stampa      *
      *        *-------------------------------------------------------*
           05  w-cnt-stp.
               10  w-cnt-stp-tip-sel      pic  x(10)                  .
               10  w-cnt-stp-cod-stp      pic  x(08)                  .
               10  w-cnt-stp-tip-sta      pic  x(01)                  .
               10  w-cnt-stp-cod-mod      pic  x(08)                  .
               10  w-cnt-stp-tip-mod      pic  x(01)                  .
               10  w-cnt-stp-amp-lin      pic  9(03)                  .
               10  w-cnt-stp-top-lin      pic  9(04)                  .
               10  w-cnt-stp-lin-min      pic  9(02)                  .
               10  w-cnt-stp-bot-lin      pic  9(04)                  .
               10  w-cnt-stp-amp-car      pic  9(02)v9(02)            .
               10  w-cnt-stp-alt-int      pic  9(02)v9(02)            .
               10  w-cnt-stp-esp-fut      pic  x(99)                  .
               10  w-cnt-stp-fnz-spc      pic  x(99)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring record richieste             *
      *        *-------------------------------------------------------*
           05  w-stu-rrr.
               10  w-stu-rrr-pnt-stu      pic  9(05)                  .
               10  w-stu-rrr-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-stu-rrr-sav-pnt      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records files                                             *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [ada]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/azi/fls/rec/rfada"                          .
      *        *-------------------------------------------------------*
      *        * [sfp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/fls/rec/rfsfp"                          .
      *        *-------------------------------------------------------*
      *        * [sfs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/fls/rec/rfsfs"                          .
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [cbp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfcbp"                          .
      *        *-------------------------------------------------------*
      *        * [gep]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfgep"                          .
      *        *-------------------------------------------------------*
      *        * [axi]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxi"                          .
      *        *-------------------------------------------------------*
      *        * [axs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxs"                          .
      *        *-------------------------------------------------------*
      *        * [sfonum]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/num/rec/rnsfonum"                       .

      *    *===========================================================*
      *    * Work-area richieste per stampa                            *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Tipo stampa :                                         *
      *        * - 01 : Stampa definitiva                              *
      *        * - 02 : Stampa di prova                                *
      *        * - 03 : Ristampa                                       *
      *        *-------------------------------------------------------*
           05  rr-tip-stp                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice ns. banca                                      *
      *        *-------------------------------------------------------*
           05  rr-cod-cbp                 pic  x(10)                  .
           05  rr-cod-cbp-des             pic  x(40)                  .
           05  rr-cod-cbp-abi             pic  9(05)                  .
           05  rr-cod-cbp-cab             pic  9(05)                  .
           05  rr-cod-cbp-ccc             pic  x(12)                  .
      *        *-------------------------------------------------------*
      *        * Data registrazione minima                             *
      *        *-------------------------------------------------------*
           05  rr-drg-min                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Data registrazione massima                            *
      *        *-------------------------------------------------------*
           05  rr-drg-max                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Numero pagamento minimo                               *
      *        *-------------------------------------------------------*
           05  rr-npg-min                 pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Numero pagamento massimo                              *
      *        *-------------------------------------------------------*
           05  rr-npg-max                 pic  9(11)                  .
      *        *-------------------------------------------------------*
      *        * Codice fornitore                                      *
      *        *-------------------------------------------------------*
           05  rr-cod-fnt                 pic  9(07)                  .
           05  rr-cod-fnt-rag             pic  x(40)                  .
           05  rr-cod-fnt-via             pic  x(40)                  .
           05  rr-cod-fnt-loc             pic  x(40)                  .
           05  rr-cod-fnt-cfi             pic  x(16)                  .
      *        *-------------------------------------------------------*
      *        * Codice dipendenza del fornitore                       *
      *        *-------------------------------------------------------*
           05  rr-dpz-fnt                 pic  x(04)                  .
           05  rr-dpz-fnt-rag             pic  x(40)                  .
           05  rr-dpz-fnt-via             pic  x(40)                  .
           05  rr-dpz-fnt-loc             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Preparazione archivio per la banca :                  *
      *        *                                                       *
      *        * - 01 : No                                             *
      *        * - 02 : Si                                             *
      *        *-------------------------------------------------------*
           05  rr-snx-pab                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Si/no dettaglio scadenze                              *
      *        *                                                       *
      *        * - 01 : No                                             *
      *        * - 02 : Si                                             *
      *        *-------------------------------------------------------*
           05  rr-snx-det                 pic  9(02)                  .

      *    *===========================================================*
      *    * Work area per stampa distinta bonifici bancari            *
      *    *-----------------------------------------------------------*
       01  w-sta-dis.
      *        *-------------------------------------------------------*
      *        * Numero pagina, reinizializzato per ogni distinta      *
      *        *-------------------------------------------------------*
           05  w-sta-dis-num-pag          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Numero progressivo pagamento nella distinta, reini-   *
      *        * zializzato per ogni distinta                          *
      *        *-------------------------------------------------------*
           05  w-sta-dis-num-prg          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Totale distinta, reinizializzato per ogni distinta    *
      *        *-------------------------------------------------------*
           05  w-sta-dis-tot-dis          pic s9(13)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per la determinazione del numero di linee ne-  *
      *        * cessarie per la stampa dell'elemento del corpo        *
      *        *-------------------------------------------------------*
           05  w-sta-dis-num-rnc          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Area per bufferizzazione generalita' del beneficiario *
      *        *-------------------------------------------------------*
           05  w-sta-dis-bfc.
      *            *---------------------------------------------------*
      *            * Ragione sociale                                   *
      *            *---------------------------------------------------*
               10  w-sta-dis-bfc-rag      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Indirizzo                                         *
      *            *---------------------------------------------------*
               10  w-sta-dis-bfc-via      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Localita'                                         *
      *            *---------------------------------------------------*
               10  w-sta-dis-bfc-loc      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice del fornitore                              *
      *            *---------------------------------------------------*
               10  w-sta-dis-bfc-cdf      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Area per il controllo delle voci da stampare in pro-  *
      *        * gressione nella colonna per l'appoggio bancario e per *
      *        * i riferimenti                                         *
      *        *-------------------------------------------------------*
           05  w-sta-dis-wcc.
      *            *---------------------------------------------------*
      *            * Numero totale voci da stampare                    *
      *            *---------------------------------------------------*
               10  w-sta-dis-wcc-ntv      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Indice ultima voce stampata                       *
      *            * - 00 : Non ancora stampata alcuna voce            *
      *            * - 01 : ABI                                        *
      *            * - 02 : CAB, denominazione                         *
      *            * - 03 : CAB, indirizzo                             *
      *            * - 04 : C/C                                        *
      *            * - 05 : Riga causale per pagamento nr. 1           *
      *            * - 06 : Riga causale per pagamento nr. 2           *
      *            * - 99 : Non piu' voci da stampare                  *
      *            *---------------------------------------------------*
               10  w-sta-dis-wcc-iuv      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Area editata per la voce da stampare              *
      *            *---------------------------------------------------*
               10  w-sta-dis-wcc-edt      pic  x(50)                  .
      *        *-------------------------------------------------------*
      *        * Aree gia' editate per la colonna per l'appoggio ban-  *
      *        * cario                                                 *
      *        *-------------------------------------------------------*
           05  w-sta-dis-ecc.
      *            *---------------------------------------------------*
      *            * Per codice ABI                                    *
      *            *---------------------------------------------------*
               10  w-sta-dis-ecc-e01.
      *                *-----------------------------------------------*
      *                * Literal                                       *
      *                *-----------------------------------------------*
                   15  w-sta-dis-ecc-l01  pic  x(03)                  .
                   15  filler             pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Codice                                        *
      *                *-----------------------------------------------*
                   15  w-sta-dis-ecc-c01  pic  9(05)                  .
                   15  filler             pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Denominazione                                 *
      *                *-----------------------------------------------*
                   15  w-sta-dis-ecc-d01  pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Per codice CAB, denominazione                     *
      *            *---------------------------------------------------*
               10  w-sta-dis-ecc-e02.
      *                *-----------------------------------------------*
      *                * Literal                                       *
      *                *-----------------------------------------------*
                   15  w-sta-dis-ecc-l02  pic  x(03)                  .
                   15  filler             pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Codice                                        *
      *                *-----------------------------------------------*
                   15  w-sta-dis-ecc-c02  pic  9(05)                  .
                   15  filler             pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Denominazione                                 *
      *                *-----------------------------------------------*
                   15  w-sta-dis-ecc-d02  pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Per codice CAB, localita'                         *
      *            *---------------------------------------------------*
               10  w-sta-dis-ecc-e03.
      *                *-----------------------------------------------*
      *                * Localita'                                     *
      *                *-----------------------------------------------*
                   15  filler             pic  x(10)                  .
                   15  w-sta-dis-ecc-l03  pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Per C/C o IBAN o BBAN                             *
      *            *---------------------------------------------------*
               10  w-sta-dis-ecc-e04.
      *                *-----------------------------------------------*
      *                * Literal                                       *
      *                *-----------------------------------------------*
                   15  w-sta-dis-ecc-l04  pic  x(09)                  .
                   15  filler             pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Valore                                        *
      *                *-----------------------------------------------*
                   15  w-sta-dis-ecc-v04  pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Per causale del pagamento nr. 1                   *
      *            *---------------------------------------------------*
               10  w-sta-dis-ecc-e05.
      *                *-----------------------------------------------*
      *                * Literal                                       *
      *                *-----------------------------------------------*
                   15  w-sta-dis-ecc-l05  pic  x(09)                  .
                   15  filler             pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Valore                                        *
      *                *-----------------------------------------------*
                   15  w-sta-dis-ecc-v05  pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Per causale del pagamento nr. 2                   *
      *            *---------------------------------------------------*
               10  w-sta-dis-ecc-e06.
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *-----------------------------------------------*
                   15  filler             pic  x(10)                  .
      *                *-----------------------------------------------*
      *                * Valore                                        *
      *                *-----------------------------------------------*
                   15  w-sta-dis-ecc-v06  pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per numero scadenze relative al pagamento      *
      *        *-------------------------------------------------------*
           05  w-sta-dis-num-scf          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per bufferizzazione dati documento di riferi-  *
      *        * mento per massimo due scadenze                        *
      *        *-------------------------------------------------------*
           05  w-sta-dis-dti-ddr occurs 02.
               10  w-sta-dis-tip-ddr      pic  9(02)                  .
               10  w-sta-dis-dat-ddr      pic  9(07)                  .
               10  w-sta-dis-num-ddr      pic  x(10)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per emissione TAG xml                          *
      *        *-------------------------------------------------------*
           05  w-sta-emi-xml.
      *            *---------------------------------------------------*
      *            * Tipo operazione                                   *
      *            *---------------------------------------------------*
               10  w-sta-emi-xml-ope      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Indentazione                                      *
      *            *---------------------------------------------------*
               10  w-sta-emi-xml-ind      pic  x(01)                  .
               10  w-sta-emi-xml-tab      pic  9(02)       value 02   .
               10  w-sta-emi-xml-inx      pic  9(02)                  .
               10  w-sta-emi-xml-inw      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Prompt                                            *
      *            *---------------------------------------------------*
               10  w-sta-emi-xml-pmt      pic  x(40)                  .
               10  w-sta-emi-xml-pma      pic  x(40)                  .
               10  w-sta-emi-xml-pmc      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Valore                                            *
      *            *---------------------------------------------------*
               10  w-sta-emi-xml-val      pic  x(80)                  .
      *            *---------------------------------------------------*
      *            * Stringa assemblata                                *
      *            *---------------------------------------------------*
               10  w-sta-emi-xml-str      pic  x(96)                  .
      *            *---------------------------------------------------*
      *            * Lunghezza stringa assemblata                      *
      *            *---------------------------------------------------*
               10  w-sta-emi-xml-lun      pic  9(02)                  .

      *    *===========================================================*
      *    * Work per personalizzazioni di portafoglio                 *
      *    *-----------------------------------------------------------*
       01  w-prs-gep.
      *        *-------------------------------------------------------*
      *        * Work per personalizzazioni portafoglio S.I.A.         *
      *        *-------------------------------------------------------*
           05  w-prs-sia.
      *            *---------------------------------------------------*
      *            * Dati del record di personalizzazione              *
      *            *---------------------------------------------------*
               10  w-prs-sia-dat-rec.
      *                *-----------------------------------------------*
      *                * Descrizione azienda S.I.A. - parte 1.         *
      *                *-----------------------------------------------*
                   15  w-prs-sia-daz-001  pic  x(24)                  .
      *                *-----------------------------------------------*
      *                * Descrizione azienda S.I.A. - parte 2.         *
      *                *-----------------------------------------------*
                   15  w-prs-sia-daz-002  pic  x(24)                  .
      *                *-----------------------------------------------*
      *                * Descrizione azienda S.I.A. - parte 3.         *
      *                *-----------------------------------------------*
                   15  w-prs-sia-daz-003  pic  x(24)                  .
      *                *-----------------------------------------------*
      *                * Descrizione azienda S.I.A. - parte 4.         *
      *                *-----------------------------------------------*
                   15  w-prs-sia-daz-004  pic  x(24)                  .
      *                *-----------------------------------------------*
      *                * Firma emittente per S.I.A.                    *
      *                *-----------------------------------------------*
                   15  w-prs-sia-fir-emi  pic  x(20)                  .
      *                *-----------------------------------------------*
      *                * Codice azienda per S.I.A.                     *
      *                *-----------------------------------------------*
                   15  w-prs-sia-cda-sia  pic  x(05)                  .
      *                *-----------------------------------------------*
      *                * Conto ordinante e/o NDG                       *
      *                *-----------------------------------------------*
                   15  w-prs-sia-cor-ndg  pic  x(12)                  .
      *                *-----------------------------------------------*
      *                * Provincia autorizzazione                      *
      *                *-----------------------------------------------*
                   15  w-prs-sia-pvc-aut  pic  x(15)                  .
      *                *-----------------------------------------------*
      *                * Numero autorizzazione                         *
      *                *-----------------------------------------------*
                   15  w-prs-sia-num-aut  pic  9(10)                  .
      *                *-----------------------------------------------*
      *                * Data autorizzazione                           *
      *                *-----------------------------------------------*
                   15  w-prs-sia-dat-aut  pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Codice azienda per C.U.C.                     *
      *                *-----------------------------------------------*
                   15  w-prs-sia-cda-cuc  pic  x(08)                  .

      *    *===========================================================*
      *    * Work per subroutines di Find                              *
      *    *-----------------------------------------------------------*
       01  w-fnd.
      *        *-------------------------------------------------------*
      *        * Work per Find su archivio [sfp]                       *
      *        *-------------------------------------------------------*
           05  w-fnd-arc-sfp.
               10  w-fnd-arc-sfp-sns      pic  x(01)                  .
               10  w-fnd-arc-sfp-sel      pic  x(01)                  .
               10  w-fnd-arc-sfp-mod      pic  9(02)                  .
               10  w-fnd-arc-sfp-tvl      pic  9(02)                  .
               10  w-fnd-arc-sfp-vlt      pic  x(03)                  .
               10  w-fnd-arc-sfp-cbp      pic  x(10)                  .
               10  w-fnd-arc-sfp-sda      pic  x(01)                  .
               10  w-fnd-arc-sfp-num      pic  9(11)                  .
               
      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [cbp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-cbp.
               10  w-let-arc-cbp-flg      pic  x(01)                  .
               10  w-let-arc-cbp-tip      pic  9(02)                  .
               10  w-let-arc-cbp-cod      pic  x(10)                  .
               10  w-let-arc-cbp-des      pic  x(40)                  .
               10  w-let-arc-cbp-csc      pic  9(07)                  .
               10  w-let-arc-cbp-csa      pic  9(07)                  .
               10  w-let-arc-cbp-opc      pic  9(07)                  .
               10  w-let-arc-cbp-abi      pic  9(05)                  .
               10  w-let-arc-cbp-cab      pic  9(05)                  .
               10  w-let-arc-cbp-ccb      pic  x(12)                  .
               10  w-let-arc-cbp-cco      pic  9(07)                  .
               10  w-let-arc-cbp-bba      pic  9(07)                  .
               10  w-let-arc-cbp-bbp      pic  9(07)                  .
               10  w-let-arc-cbp-psm      pic  9(07)                  .
               10  w-let-arc-cbp-psi      pic  9(07)                  .
               10  w-let-arc-cbp-pdi      pic  9(07)                  .
               10  w-let-arc-cbp-psc      pic  9(07)                  .
               10  w-let-arc-cbp-anv      pic  9(07)                  .
               10  w-let-arc-cbp-dfp      pic  9(07)                  .
               10  w-let-arc-cbp-dfa      pic  9(07)                  .
               10  w-let-arc-cbp-onb      pic  9(07)                  .
               10  w-let-arc-cbp-inb      pic  9(07)                  .
               10  w-let-arc-cbp-ccp      pic  x(12)                  .
               10  w-let-arc-cbp-bpa      pic  9(07)                  .
               10  w-let-arc-cbp-bpp      pic  9(07)                  .
               10  w-let-arc-cbp-onp      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [fnt]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-fnt.
               10  w-let-arc-fnt-flg      pic  x(01)                  .
               10  w-let-arc-fnt-cod      pic  9(07)                  .
               10  w-let-arc-fnt-rag      pic  x(40)                  .
               10  w-let-arc-fnt-via      pic  x(40)                  .
               10  w-let-arc-fnt-loc      pic  x(40)                  .
               10  w-let-arc-fnt-cge      pic  9(07)                  .
               10  w-let-arc-fnt-cfi      pic  x(16)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcf]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcf.
               10  w-let-arc-dcf-flg      pic  x(01)                  .
               10  w-let-arc-dcf-tle      pic  x(01)                  .
               10  w-let-arc-dcf-cod      pic  9(07)                  .
               10  w-let-arc-dcf-dpz      pic  x(04)                  .
               10  w-let-arc-dcf-rag      pic  x(40)                  .
               10  w-let-arc-dcf-via      pic  x(40)                  .
               10  w-let-arc-dcf-loc      pic  x(40)                  .
               10  w-let-arc-dcf-abi      pic  9(05)                  .
               10  w-let-arc-dcf-cab      pic  9(05)                  .
               10  w-let-arc-dcf-vlt      pic  x(03)                  .
               10  w-let-arc-dcf-cit      pic  x(01)                  .
               10  w-let-arc-dcf-ceu      pic  x(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [axi]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-axi.
               10  w-let-arc-axi-flg      pic  x(01)                  .
               10  w-let-arc-axi-cod      pic  9(05)                  .
               10  w-let-arc-axi-den      pic  x(40)                  .
               10  w-let-arc-axi-cib.
                   15  w-let-arc-axi-cic
                               occurs 05  pic  x(02)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [axs]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-axs.
               10  w-let-arc-axs-flg      pic  x(01)                  .
               10  w-let-arc-axs-abi      pic  9(05)                  .
               10  w-let-arc-axs-cab      pic  9(05)                  .
               10  w-let-arc-axs-den      pic  x(40)                  .
               10  w-let-arc-axs-via      pic  x(40)                  .
               10  w-let-arc-axs-loc      pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per salvataggi                                  *
      *    *-----------------------------------------------------------*
       01  w-sav.
      *        *-------------------------------------------------------*
      *        * Codice fornitore                                      *
      *        *-------------------------------------------------------*
           05  w-sav-cod-fnt              pic  9(07)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Tipo stampa                                *
      *        *-------------------------------------------------------*
           05  w-exp-tip-stp.
               10  w-exp-tip-stp-num      pic  9(02)       value 3    .
               10  w-exp-tip-stp-lun      pic  9(02)       value 20   .
               10  w-exp-tip-stp-tbl.
                   15  filler             pic  x(20) value
                            "Definitiva          "                    .
                   15  filler             pic  x(20) value
                            "di Prova            "                    .
                   15  filler             pic  x(20) value
                            "Ristampa            "                    .
      *        *-------------------------------------------------------*
      *        * Work per : Si/no preparazione archivio                *
      *        *-------------------------------------------------------*
           05  w-exp-snx-pab.
               10  w-exp-snx-pab-num      pic  9(02)       value 2    .
               10  w-exp-snx-pab-lun      pic  9(02)       value 02   .
               10  w-exp-snx-pab-tbl.
                   15  filler             pic  x(02) value "No"       .
                   15  filler             pic  x(02) value "Si"       .
      *        *-------------------------------------------------------*
      *        * Work per : Si/no dettaglio scadenze                   *
      *        *-------------------------------------------------------*
           05  w-exp-snx-det.
               10  w-exp-snx-det-num      pic  9(02)       value 2    .
               10  w-exp-snx-det-lun      pic  9(02)       value 02   .
               10  w-exp-snx-det-tbl.
                   15  filler             pic  x(02) value "No"       .
                   15  filler             pic  x(02) value "Si"       .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale                         *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .
               10  w-err-box-err-m02      pic  x(65)                  .
               10  w-err-box-err-m03      pic  x(65)                  .

      *    *===========================================================*
      *    * Work per routine int-pag-dob-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-int-pag-dob.
           05  w-int-pag-dob-str.
               10  filler    occurs 132   pic  x(01)                  .
           05  w-int-pag-dob-pnt          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutines per il trattamento dell'archivio di  *
      *    * supporto per trasmissione distinta alla banca             *
      *    *-----------------------------------------------------------*
       01  w-ads-tab.
      *        *-------------------------------------------------------*
      *        * Parametri in input                                    *
      *        *-------------------------------------------------------*
           05  w-ads-tab-inp.
      *            *---------------------------------------------------*
      *            * Data per la presentazione                         *
      *            *---------------------------------------------------*
               10  w-ads-tab-inp-dpr      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice nostra banca per la presentazione          *
      *            *---------------------------------------------------*
               10  w-ads-tab-inp-ban      pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Numero distinta                                   *
      *            *---------------------------------------------------*
               10  w-ads-tab-inp-ndi      pic  9(11)                  .
               10  w-ads-tab-inp-ndi-r01 redefines
                   w-ads-tab-inp-ndi.
                   15  w-ads-tab-inp-saa  pic  9(03)                  .
                   15  w-ads-tab-inp-nnn  pic  9(08)                  .
      *        *-------------------------------------------------------*
      *        * Work per determinazione del nome del file             *
      *        *-------------------------------------------------------*
           05  w-ads-tab-ndf.
      *            *---------------------------------------------------*
      *            * Informazioni sul formato di un filename           *
      *            *---------------------------------------------------*
               10  w-ads-tab-ndf-fxt.
      *                *-----------------------------------------------*
      *                * Max numero di caratteri per il nome del file  *
      *                *-----------------------------------------------*
                   15  w-ads-tab-ndf-mxf  pic  9(03)                  .
      *                *-----------------------------------------------*
      *                * Max numero di caratteri per l'estensione al   *
      *                * nome del file                                 *
      *                *-----------------------------------------------*
                   15  w-ads-tab-ndf-mxe  pic  9(03)                  .
      *                *-----------------------------------------------*
      *                * Carattere di separazione che deve essere uti- *
      *                * lizzato per l'estensione al nome del file     *
      *                *-----------------------------------------------*
                   15  w-ads-tab-ndf-che  pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Pathname completo del file                        *
      *            *---------------------------------------------------*
               10  w-ads-tab-ndf-pat      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Nome del file                                     *
      *            *---------------------------------------------------*
               10  w-ads-tab-ndf-nam      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Nome del file per formato MS-DOS                  *
      *            *---------------------------------------------------*
               10  w-ads-tab-ndf-dos      pic  x(12)                  .
      *            *---------------------------------------------------*
      *            * Sigla azienda in uso                              *
      *            *---------------------------------------------------*
               10  w-ads-tab-ndf-azi      pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Sigla azienda in uso eventualmente troncata ai    *
      *            * tre caratteri                                     *
      *            *---------------------------------------------------*
               10  w-ads-tab-ndf-az3      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Codice nostra banca di presentazione              *
      *            *---------------------------------------------------*
               10  w-ads-tab-ndf-ban      pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Numero distinta editato di quattro caratteri con  *
      *            * zeri in testa                                     *
      *            *---------------------------------------------------*
               10  w-ads-tab-ndf-n01      pic  9(04)                  .
      *            *---------------------------------------------------*
      *            * Numero distinta editato di tre caratteri con zeri *
      *            * in testa                                          *
      *            *---------------------------------------------------*
               10  w-ads-tab-ndf-n05      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Anno editato di quattro caratteri                 *
      *            *---------------------------------------------------*
               10  w-ads-tab-ndf-n02      pic  9(04)                  .
               10  w-ads-tab-ndf-n02-r01  redefines
                   w-ads-tab-ndf-n02.
                   15  w-ads-tab-ndf-n02-a12
                                          pic  9(02)                  .
                   15  w-ads-tab-ndf-n02-a34
                                          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Anno editato di due caratteri                     *
      *            *---------------------------------------------------*
               10  w-ads-tab-ndf-n03      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Parametri in output                                   *
      *        *-------------------------------------------------------*
           05  w-ads-tab-out.
      *            *---------------------------------------------------*
      *            * Flag su esito della generazione del file          *
      *            * - Spaces : Ok                                     *
      *            * - #      : Errori durante la generazione          *
      *            *---------------------------------------------------*
               10  w-ads-tab-out-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per generazione su tracciati record S.I.A.       *
      *        *-------------------------------------------------------*
           05  w-ads-sia.
      *            *---------------------------------------------------*
      *            * Numero progressivo disposizione                   *
      *            *---------------------------------------------------*
               10  w-ads-sia-gen-pro      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Totale valore disposizioni                        *
      *            *---------------------------------------------------*
               10  w-ads-sia-gen-val      pic  9(13)                  .
      *            *---------------------------------------------------*
      *            * Numero progressivo record emessi                  *
      *            *---------------------------------------------------*
               10  w-ads-sia-gen-rpt      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Numero scadenze appartenenti al pagamento         *
      *            *---------------------------------------------------*
               10  w-ads-sia-gen-sap      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Buffer scadenze appartenenti al pagamento         *
      *            *---------------------------------------------------*
               10  w-ads-sia-gen-buf occurs 15.
                   15  w-ads-sia-gen-prt  pic  9(11)                  .
                   15  w-ads-sia-gen-des  pic  x(30)                  .
      *            *---------------------------------------------------*
      *            * Contatori di comodo                               *
      *            *---------------------------------------------------*
               10  w-ads-sia-gen-ctr      pic  9(07)                  .
               10  w-ads-sia-gen-ct3      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Ridefinizioni varie per la ragione sociale        *
      *            *---------------------------------------------------*
               10  w-ads-sia-gen-rag      pic  x(40)                  .
               10  w-ads-sia-gen-r10 redefines
                   w-ads-sia-gen-rag.
                   15  w-ads-sia-gen-r11  pic  x(30)                  .
                   15  w-ads-sia-gen-r12  pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Ridefinizioni varie per l'indirizzo               *
      *            *---------------------------------------------------*
               10  w-ads-sia-gen-via      pic  x(40)                  .
               10  w-ads-sia-gen-v10 redefines
                   w-ads-sia-gen-via.
                   15  w-ads-sia-gen-v11  pic  x(30)                  .
                   15  w-ads-sia-gen-v12  pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Ridefinizioni varie per la localita'              *
      *            *---------------------------------------------------*
               10  w-ads-sia-gen-loc      pic  x(40)                  .
               10  w-ads-sia-gen-l10 redefines
                   w-ads-sia-gen-loc.
                   15  w-ads-sia-gen-l11  pic  x(05)                  .
                   15  w-ads-sia-gen-l12 redefines
                       w-ads-sia-gen-l11  pic  9(05)                  .
                   15  w-ads-sia-gen-l13  pic  x(01)                  .
                   15  w-ads-sia-gen-l14  pic  x(25)                  .
                   15  w-ads-sia-gen-l15  pic  x(09)                  .
               10  w-ads-sia-gen-l20 redefines
                   w-ads-sia-gen-loc.
                   15  w-ads-sia-gen-l21  pic  x(25)                  .
                   15  w-ads-sia-gen-l22  pic  x(15)                  .
      *            *---------------------------------------------------*
      *            * Ridefinizioni varie per il numero scadenza        *
      *            *---------------------------------------------------*
               10  w-ads-sia-gen-sdb      pic  9(11)                  .
               10  w-ads-sia-gen-s09 redefines
                   w-ads-sia-gen-sdb.
                   15  w-ads-sia-gen-saa  pic  9(03)                  .
                   15  w-ads-sia-gen-num  pic  9(08)                  .

      *    *===========================================================*
      *    * Work per inoltro Bonifici a Fornitori                     *
      *    *-----------------------------------------------------------*
       01  w-bon.
      *        *-------------------------------------------------------*
      *        * Tracciato SIA                                         *
      *        *-------------------------------------------------------*
           05  w-bon-sia.
      *            *---------------------------------------------------*
      *            * Per Bonifici tipo record di testata 'PC'          *
      *            *---------------------------------------------------*
               10  w-bon-sia-000.
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 1 - 1                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-000-fpu  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Tipo record                                   *
      *                *                                               *
      *                * 2 - 3                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-000-tre  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * Mittente, ovvero il codice con cui la SIA ha  *
      *                * censito il creditore presentante la distinta  *
      *                *                                               *
      *                * 4 - 8                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-000-mtn  pic  x(05)                  .
      *                *-----------------------------------------------*
      *                * Ordinante, ovvero il codice ABI della banca   *
      *                * di presentazione                              *
      *                *                                               *
      *                * 9 - 13                                        *
      *                *-----------------------------------------------*
                   15  w-bon-sia-000-odt  pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Data di creazione supporto (GGMMAA)           *
      *                *                                               *
      *                * 14 - 19                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-000-dcr.
                       20  w-bon-sia-000-dcg
                                          pic  9(02)                  .
                       20  w-bon-sia-000-dcm
                                          pic  9(02)                  .
                       20  w-bon-sia-000-dca
                                          pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Nome del supporto, formato dai seguenti valo- *
      *                * ri (per un totale di 20 caratteri) :          *
      *                *                                               *
      *                * - x10 : Primi quattro caratteri della descri- *
      *                *         zione azienda SIA, parte1, posti in   *
      *                *         uppercase                             *
      *                * - x20 : Numero progressivo di spedizione, che *
      *                *         varia ciclicamente da 000 a 999,e che *
      *                *         verra' posto pari alle ultime tre ci- *
      *                *         fre del numero distinta nell'ambito   *
      *                *         dell'anno                             *
      *                * - x30 : Data di creazione del supporto :      *
      *                *         - x31 : giorno                        *
      *                *         - x32 : mese                          *
      *                *         - x33 : anno                          *
      *                * - x40 : Fisso al valore spaces                *
      *                * - x50 : Codice ABI della banca di presenta-   *
      *                *         zione                                 *
      *                *                                               *
      *                * 20 - 39                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-000-nds.
                       20  w-bon-sia-000-x10
                                          pic  x(04)                  .
                       20  w-bon-sia-000-x20
                                          pic  9(03)                  .
                       20  w-bon-sia-000-x30.
                           25  w-bon-sia-000-x31
                                          pic  9(02)                  .
                           25  w-bon-sia-000-x32
                                          pic  9(02)                  .
                           25  w-bon-sia-000-x33
                                          pic  9(02)                  .
                       20  w-bon-sia-000-x40
                                          pic  x(02)                  .
                       20  w-bon-sia-000-x50
                                          pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Data di elaborazione supporto, pari alla data *
      *                * di creazione del supporto (GGMMAA)            *
      *                *                                               *
      *                * Campo a disposizione del mittente             *
      *                *                                               *
      *                * 40 - 45                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-000-del.
                       20  w-bon-sia-000-deg
                                          pic  9(02)                  .
                       20  w-bon-sia-000-dem
                                          pic  9(02)                  .
                       20  w-bon-sia-000-dea
                                          pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Filler a spaces                               *
      *                *                                               *
      *                * 46 - 113                                      *
      *                *-----------------------------------------------*
                   15  w-bon-sia-000-f68  pic  x(68)                  .
      *                *-----------------------------------------------*
      *                * Codice divisa                                 *
      *                *                                               *
      *                * 114 - 114                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-000-cdv  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Filler a spaces                               *
      *                *                                               *
      *                * 115 - 120                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-000-f06  pic  x(06)                  .
      *            *---------------------------------------------------*
      *            * Per Bonifici tipo record '10'                     *
      *            *---------------------------------------------------*
               10  w-bon-sia-010.
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 1 - 1                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-fpu  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Tipo record                                   *
      *                *                                               *
      *                * 2 - 3                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-tre  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * Numero disposizione                           *
      *                *                                               *
      *                * 4 - 10                                        *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-nud  pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Filler a spaces                               *
      *                *                                               *
      *                * 11 - 16                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-f06  pic  x(06)                  .
      *                *-----------------------------------------------*
      *                * Data di emissione bonifico (GGMMAA)           *
      *                *                                               *
      *                * 17 - 22                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-deb.
                       20  w-bon-sia-010-deg
                                          pic  9(02)                  .
                       20  w-bon-sia-010-dem
                                          pic  9(02)                  .
                       20  w-bon-sia-010-dea
                                          pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Data valuta destinatario (GGMMAA)             *
      *                *                                               *
      *                * 23 - 28                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-dvd.
                       20  w-bon-sia-010-dvg
                                          pic  9(02)                  .
                       20  w-bon-sia-010-dvm
                                          pic  9(02)                  .
                       20  w-bon-sia-010-dva
                                          pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Codice causale                                *
      *                *                                               *
      *                * (fisso a 48000)                               *
      *                *                                               *
      *                * 29 - 33                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-cau  pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Importo disposizione                          *
      *                *                                               *
      *                * 34 - 46                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-ims  pic  9(13)                  .
      *                *-----------------------------------------------*
      *                * Segno                                         *
      *                *                                               *
      *                * (fisso a '+')                                 *
      *                *                                               *
      *                * 47 - 47                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-sgn  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Codice ABI banca ordinante                    *
      *                *                                               *
      *                * 48 - 52                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-aba  pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Codice CAB banca ordinante                    *
      *                *                                               *
      *                * 53 - 57                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-cba  pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Conto ordinante e/o NDG cliente               *
      *                *                                               *
      *                * 58 - 69                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-ndg  pic  x(12)                  .
      *                *-----------------------------------------------*
      *                * Codice ABI banca destinataria                 *
      *                *                                               *
      *                * 70 - 74                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-abd  pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Codice CAB banca destinataria                 *
      *                *                                               *
      *                * 75 - 79                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-cbd  pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Conto destinatario banca destinataria         *
      *                *                                               *
      *                * 80 - 91                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-dbd  pic  x(12)                  .
      *                *-----------------------------------------------*
      *                * Codice azienda assegnato dalla S.I.A. al cre- *
      *                * ditore                                        *
      *                *                                               *
      *                * 92 - 96                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-azi  pic  x(05)                  .
      *                *-----------------------------------------------*
      *                * Tipo codice individuale                       *
      *                *                                               *
      *                * (fisso a 3 - codice fiscale [consigliato])    *
      *                *                                               *
      *                * 97 - 97                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-tci  pic  9(01)                  .
      *                *-----------------------------------------------*
      *                * Codice fiscale del beneficiario               *
      *                *                                               *
      *                * 98 - 113                                      *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-cod  pic  x(16)                  .
      *                *-----------------------------------------------*
      *                * Modalita' di pagamento                        *
      *                *                                               *
      *                * ('1' per bonifico/giroconto)                  *
      *                *                                               *
      *                * 114 - 114                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-mdp  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Filler a spaces                               *
      *                *                                               *
      *                * 115 - 119                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-f05  pic  x(05)                  .
      *                *-----------------------------------------------*
      *                * Codice divisa                                 *
      *                *                                               *
      *                * 120 - 120                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-010-cdv  pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per Bonifici tipo record '16'                     *
      *            *                                                   *
      *            * Coordinate ordinante                              *
      *            *---------------------------------------------------*
               10  w-bon-sia-016.
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 1 - 1                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-016-fpu  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Tipo record                                   *
      *                *                                               *
      *                * 2 - 3                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-016-tre  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * Numero disposizione                           *
      *                *                                               *
      *                * 4 - 10                                        *
      *                *-----------------------------------------------*
                   15  w-bon-sia-016-nud  pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Codice paese                                  *
      *                *                                               *
      *                * 11 - 12                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-016-naz  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * Check digit IBAN                              *
      *                *                                               *
      *                * 13 - 14                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-016-chd  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * CIN Italiano                                  *
      *                *                                               *
      *                * 15 - 15                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-016-cin  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Codice ABI banca ordinante                    *
      *                *                                               *
      *                * 16 - 20                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-016-abi  pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Codice CAB banca ordinante                    *
      *                *                                               *
      *                * 21 - 25                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-016-cab  pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Conto ordinante                               *
      *                *                                               *
      *                * 26 - 37                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-016-ccc  pic  x(12)                  .
      *                *-----------------------------------------------*
      *                * Filler a spaces                               *
      *                *                                               *
      *                * 38 - 120                                      *
      *                *-----------------------------------------------*
                   15  w-bon-sia-016-fxx  pic  x(83)                  .
      *            *---------------------------------------------------*
      *            * Per Bonifici tipo record '17'                     *
      *            *                                                   *
      *            * Coordinate beneficiario                           *
      *            *---------------------------------------------------*
               10  w-bon-sia-017.
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 1 - 1                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-017-fpu  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Tipo record                                   *
      *                *                                               *
      *                * 2 - 3                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-017-tre  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * Numero disposizione                           *
      *                *                                               *
      *                * 4 - 10                                        *
      *                *-----------------------------------------------*
                   15  w-bon-sia-017-nud  pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Codice paese                                  *
      *                *                                               *
      *                * 11 - 12                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-017-naz  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * Check digit IBAN                              *
      *                *                                               *
      *                * 13 - 14                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-017-chd  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * CIN Italiano                                  *
      *                *                                               *
      *                * 15 - 15                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-017-cin  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Codice ABI banca beneficiario                 *
      *                *                                               *
      *                * 16 - 20                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-017-abi  pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Codice CAB banca beneficiario                 *
      *                *                                               *
      *                * 21 - 25                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-017-cab  pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Conto ordinante                               *
      *                *                                               *
      *                * 26 - 37                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-017-ccc  pic  x(12)                  .
      *                *-----------------------------------------------*
      *                * Filler a spaces                               *
      *                *                                               *
      *                * 38 - 120                                      *
      *                *-----------------------------------------------*
                   15  w-bon-sia-017-fxx  pic  x(83)                  .
      *            *---------------------------------------------------*
      *            * Per Bonifici tipo record '20'                     *
      *            *---------------------------------------------------*
               10  w-bon-sia-020.
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 1 - 1                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-020-fpu  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Tipo record                                   *
      *                *                                               *
      *                * 2 - 3                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-020-tre  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * Numero disposizione                           *
      *                *                                               *
      *                * 4 - 10                                        *
      *                *-----------------------------------------------*
                   15  w-bon-sia-020-nud  pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Denominazione ordinante                       *
      *                *                                               *
      *                * 11 - 40                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-020-den  pic  x(30)                  .
      *                *-----------------------------------------------*
      *                * Indirizzo ordinante                           *
      *                *                                               *
      *                * 41 - 70                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-020-via  pic  x(30)                  .
      *                *-----------------------------------------------*
      *                * Localita' ordinante                           *
      *                *                                               *
      *                * 71 - 100                                      *
      *                *-----------------------------------------------*
                   15  w-bon-sia-020-loc  pic  x(30)                  .
      *                *-----------------------------------------------*
      *                * Codice fiscale/Partita Iva ordinante          *
      *                *                                               *
      *                * 101 - 116                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-020-cfi  pic  x(16)                  .
      *                *-----------------------------------------------*
      *                * Filler a spaces                               *
      *                *                                               *
      *                * 117 - 120                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-020-f04  pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Per Bonifici tipo record '30'                     *
      *            *---------------------------------------------------*
               10  w-bon-sia-030.
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 1 - 1                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-030-fpu  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Tipo record                                   *
      *                *                                               *
      *                * 2 - 3                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-030-tre  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * Numero disposizione                           *
      *                *                                               *
      *                * 4 - 10                                        *
      *                *-----------------------------------------------*
                   15  w-bon-sia-030-nud  pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Descrizione destinatario parte 1.             *
      *                *                                               *
      *                * 11 - 40                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-030-d01  pic  x(30)                  .
      *                *-----------------------------------------------*
      *                * Descrizione destinatario parte 2.             *
      *                *                                               *
      *                * 41 - 70                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-030-d02  pic  x(30)                  .
      *                *-----------------------------------------------*
      *                * Descrizione destinatario parte 3.             *
      *                *                                               *
      *                * 71 - 100                                      *
      *                *-----------------------------------------------*
                   15  w-bon-sia-030-d03  pic  x(30)                  .
      *                *-----------------------------------------------*
      *                * Partita Iva o Codice Fiscale destinatario     *
      *                *                                               *
      *                * 101 - 116                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-030-cfi  pic  x(16)                  .
      *                *-----------------------------------------------*
      *                * Filler a spaces                               *
      *                *                                               *
      *                * 117 - 120                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-030-f04  pic  x(04)                  .
      *            *---------------------------------------------------*
      *            * Per Bonifici tipo record '40'                     *
      *            *                                                   *
      *            * N.B.: facoltativo se nel tipo record '10' e' in-  *
      *            *       cato il tipo '1' - bonifico.                *
      *            *---------------------------------------------------*
               10  w-bon-sia-040.
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 1 - 1                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-040-fpu  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Tipo record                                   *
      *                *                                               *
      *                * 2 - 3                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-040-tre  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * Numero disposizione                           *
      *                *                                               *
      *                * 4 - 10                                        *
      *                *-----------------------------------------------*
                   15  w-bon-sia-040-nud  pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Indirizzo destinatario                        *
      *                *                                               *
      *                * 11 - 40                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-040-icd  pic  x(30)                  .
      *                *-----------------------------------------------*
      *                * C.a.p. destinatario                           *
      *                *                                               *
      *                * 41 - 45                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-040-ccd  pic  x(05)                  .
      *                *-----------------------------------------------*
      *                * Localita' destinatario con provincia          *
      *                *                                               *
      *                * 46 - 70                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-040-lcd  pic  x(25)                  .
      *                *-----------------------------------------------*
      *                * Sportello destinatario                        *
      *                *                                               *
      *                * 71 - 120                                      *
      *                *-----------------------------------------------*
                   15  w-bon-sia-040-sde  pic  x(30)                  .
      *            *---------------------------------------------------*
      *            * Per Bonifici tipo record '50'                     *
      *            *                                                   *
      *            * N.B.: obbligatorio se nel tipo record '10' e' in- *
      *            *       cato il tipo '1' - bonifico.                *
      *            *---------------------------------------------------*
               10  w-bon-sia-050.
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 1 - 1                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-050-fpu  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Tipo record                                   *
      *                *                                               *
      *                * 2 - 3                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-050-tre  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * Numero disposizione                           *
      *                *                                               *
      *                * 4 - 10                                        *
      *                *-----------------------------------------------*
                   15  w-bon-sia-050-nud  pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Riferimenti operazione di accredito, parte 1  *
      *                *                                               *
      *                * 11 - 40                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-050-ro1  pic  x(30)                  .
      *                *-----------------------------------------------*
      *                * Riferimenti operazione di accredito, parte 2  *
      *                *                                               *
      *                * 41 - 70                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-050-ro2  pic  x(30)                  .
      *                *-----------------------------------------------*
      *                * Riferimenti operazione di accredito, parte 3  *
      *                *                                               *
      *                * 71 - 100                                      *
      *                *-----------------------------------------------*
                   15  w-bon-sia-050-ro3  pic  x(30)                  .
      *                *-----------------------------------------------*
      *                * Filler a spaces                               *
      *                *                                               *
      *                * 101 - 120                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-050-f20  pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Per Bonifici tipo record '60'                     *
      *            *                                                   *
      *            * N.B.: obbligatorio se nel tipo record '10' e' in- *
      *            *       cato il tipo '1' - bonifico solo se non     *
      *            *       sufficienti i record di tipo '50'           *
      *            *                                                   *
      *            *       Minimo 2, massimo 5                         *
      *            *---------------------------------------------------*
               10  w-bon-sia-060.
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 1 - 1                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-060-fpu  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Tipo record                                   *
      *                *                                               *
      *                * 2 - 3                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-060-tre  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * Numero disposizione                           *
      *                *                                               *
      *                * 4 - 10                                        *
      *                *-----------------------------------------------*
                   15  w-bon-sia-060-nud  pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Riferimenti operazione di accredito, parte 1  *
      *                *                                               *
      *                * 11 - 40                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-060-ro1  pic  x(30)                  .
      *                *-----------------------------------------------*
      *                * Riferimenti operazione di accredito, parte 2  *
      *                *                                               *
      *                * 41 - 70                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-060-ro2  pic  x(30)                  .
      *                *-----------------------------------------------*
      *                * Riferimenti operazione di accredito, parte 3  *
      *                *                                               *
      *                * 71 - 100                                      *
      *                *-----------------------------------------------*
                   15  w-bon-sia-060-ro3  pic  x(30)                  .
      *                *-----------------------------------------------*
      *                * Filler a spaces                               *
      *                *                                               *
      *                * 101 - 120                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-060-f20  pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Per Bonifici tipo record '70'                     *
      *            *---------------------------------------------------*
               10  w-bon-sia-070.
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 1 - 1                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-070-fpu  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Tipo record                                   *
      *                *                                               *
      *                * 2 - 3                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-070-tre  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * Numero disposizione                           *
      *                *                                               *
      *                * 4 - 10                                        *
      *                *-----------------------------------------------*
                   15  w-bon-sia-070-nud  pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 11 - 110                                      *
      *                *-----------------------------------------------*
                   15  w-bon-sia-070-f00  pic  x(100)                 .
      *                *-----------------------------------------------*
      *                * CIN del beneficiario                          *
      *                *                                               *
      *                * 111 - 111                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-070-cin  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 112 - 120                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-070-f09  pic  x(09)                  .
      *            *---------------------------------------------------*
      *            * Per Bonifici tipo record di coda 'EF'             *
      *            *---------------------------------------------------*
               10  w-bon-sia-999.
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 1 - 1                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-fpu  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Tipo record                                   *
      *                *                                               *
      *                * 2 - 3                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-tre  pic  x(02)                  .
      *                *-----------------------------------------------*
      *                * Mittente, ovvero il codice con cui la SIA ha  *
      *                * censito il creditore presentante la distinta  *
      *                *                                               *
      *                * 4 - 8                                         *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-mtn  pic  x(05)                  .
      *                *-----------------------------------------------*
      *                * Ordinante, ovvero il codice ABI della banca   *
      *                * di presentazione                              *
      *                *                                               *
      *                * 9 - 13                                        *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-odt  pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Data di creazione supporto (GGMMAA)           *
      *                *                                               *
      *                * 14 - 19                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-dcr.
                       20  w-bon-sia-999-dcg
                                          pic  9(02)                  .
                       20  w-bon-sia-999-dcm
                                          pic  9(02)                  .
                       20  w-bon-sia-999-dca
                                          pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Nome del supporto, formato dai seguenti valo- *
      *                * ri (per un totale di 20 caratteri) :          *
      *                *                                               *
      *                * - x10 : Primi quattro caratteri della descri- *
      *                *         zione azienda SIA, parte1, posti in   *
      *                *         uppercase                             *
      *                * - x20 : Numero progressivo di spedizione, che *
      *                *         varia ciclicamente da 000 a 999,e che *
      *                *         verra' posto pari alle ultime tre ci- *
      *                *         fre del numero distinta nell'ambito   *
      *                *         dell'anno                             *
      *                * - x30 : Data di creazione del supporto :      *
      *                *         - x31 : giorno                        *
      *                *         - x32 : mese                          *
      *                *         - x33 : anno                          *
      *                * - x40 : Fisso al valore spaces                *
      *                * - x50 : Codice ABI della banca di presenta-   *
      *                *         zione                                 *
      *                *                                               *
      *                * 20 - 39                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-nds.
                       20  w-bon-sia-999-x10
                                          pic  x(04)                  .
                       20  w-bon-sia-999-x20
                                          pic  9(03)                  .
                       20  w-bon-sia-999-x30.
                           25  w-bon-sia-999-x31
                                          pic  9(02)                  .
                           25  w-bon-sia-999-x32
                                          pic  9(02)                  .
                           25  w-bon-sia-999-x33
                                          pic  9(02)                  .
                       20  w-bon-sia-999-x40
                                          pic  x(02)                  .
                       20  w-bon-sia-999-x50
                                          pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Data di elaborazione supporto, pari alla data *
      *                * di creazione del supporto (GGMMAA)            *
      *                *                                               *
      *                * Campo a disposizione del mittente             *
      *                *                                               *
      *                * 40 - 45                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-del.
                       20  w-bon-sia-999-deg
                                          pic  9(02)                  .
                       20  w-bon-sia-999-dem
                                          pic  9(02)                  .
                       20  w-bon-sia-999-dea
                                          pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Numero di disposizioni contenute nel flusso   *
      *                *                                               *
      *                * 46 - 52                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-nrv  pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Filler di 15 numeri a zero                    *
      *                *                                               *
      *                * (totale importi negativi)                     *
      *                *                                               *
      *                * 53 - 67                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-itr  pic  x(15)                  .
      *                *-----------------------------------------------*
      *                * Importo totale disposizioni contenute nel     *
      *                * flusso                                        *
      *                *                                               *
      *                * (totale importi positivi)                     *
      *                *                                               *
      *                * 68 - 82                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-itd  pic  9(15)                  .
      *                *-----------------------------------------------*
      *                * Numero dei record contenuti nel flusso com-   *
      *                * prensivo di testa e coda                      *
      *                *                                               *
      *                * 83 - 89                                       *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-nrc  pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * 90 - 113                                      *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-f24  pic  x(24)                  .
      *                *-----------------------------------------------*
      *                * Codice divisa                                 *
      *                *                                               *
      *                * 114 - 114                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-cdv  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Filler                                        *
      *                *                                               *
      *                * (giornata applicativa)                        *
      *                *                                               *
      *                * 115 - 120                                     *
      *                *-----------------------------------------------*
                   15  w-bon-sia-999-f06  pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di attribuzione numero ordine di     *
      *    * bonifico                                                  *
      *    *-----------------------------------------------------------*
       01  w-sfo-num.
           05  w-sfo-num-scl-ann          pic  9(03)                  .
           05  w-sfo-num-num-odb          pic  9(11)                  .
           05  w-sfo-num-r01-adp redefines
               w-sfo-num-num-odb.
               10  w-sfo-num-r01-saa      pic  9(03)                  .
               10  w-sfo-num-r01-num      pic  9(08)                  .
           05  w-sfo-num-val-pre          pic  9(08)                  .
           05  w-sfo-num-val-pos          pic  9(08)                  .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  filler                 pic  x(01)                  .

      *    *===========================================================*
      *    * Link-area per accettazione codice nostra cassa, banca, o  *
      *    * c/c postale                                               *
      *    *-----------------------------------------------------------*
           copy      "pgm/gep/prg/cpy/acdecbp0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice commerciale fornitore   *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/acmndcf0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice dipendenza fornitore    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/acoddcf0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice CIN                     *
      *    *-----------------------------------------------------------*
           copy      "pgm/abi/prg/cpy/acodcin0.acl"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *================================================================*
       Linkage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di Link per programmi della fase 'pscf3000'          *
      *    *-----------------------------------------------------------*
           copy      "pgm/scf/prg/cpy/pscf3000.pgl"                   .

      ******************************************************************
       Procedure Division                using i-ide
                                               w-prs
                                               w-ref
                                               w-top
                                               w-def
                                               w-key                  .
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Flag di visualizzazione titolo in On            *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-tit      .
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-800.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-800.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento programma       *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Se no richieste : a selezione stampante         *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-350.
       main-250.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-800.
      *                  *---------------------------------------------*
      *                  * Se uscita per 'N'                           *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "N"
                     go to main-250.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-350.
      *              *-------------------------------------------------*
      *              * Se no stampa : ad esecuzione                    *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to main-450.
      *              *-------------------------------------------------*
      *              * Preparazione defaults per parametri di selezio- *
      *              * ne stampa                                       *
      *              *-------------------------------------------------*
           perform   pre-prm-stp-000      thru pre-prm-stp-999        .
      *              *-------------------------------------------------*
      *              * Selezione parametri stampa                      *
      *              *-------------------------------------------------*
           perform   sel-prm-stp-000      thru sel-prm-stp-999        .
      *                  *---------------------------------------------*
      *                  * Test se uscita                              *
      *                  *---------------------------------------------*
           if        w-cnt-sel-prm-stp    not  = spaces
                     go to main-800.
       main-450.
      *              *-------------------------------------------------*
      *              * Esecuzione in foreground                        *
      *              *-------------------------------------------------*
           perform   exe-pgm-frg-000      thru exe-pgm-frg-999        .
      *              *-------------------------------------------------*
      *              * Test se tipo esecuzione ciclico                 *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S" or
                     w-cnt-fun-snx-cic    not  = "S"
                     go to main-800
           else      go to main-250.
       main-800.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Test su flag di visualizzazione titolo          *
      *              *-------------------------------------------------*
           if        w-cnt-sts-vis-tit    not  = spaces
                     move  spaces         to   w-cnt-sts-vis-tit
                     go to vis-tit-pgm-999.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Programma di esecuzione in foreground                     *
      *    *-----------------------------------------------------------*
       exe-pgm-frg-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione rullino messaggi di foreground *
      *              *-------------------------------------------------*
           move      "OF"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Se errore : uscita                          *
      *                  *---------------------------------------------*
            if       m-rsc                not  = spaces
                     go to exe-pgm-frg-999.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-pgm-frg-300.
      *              *-------------------------------------------------*
      *              * Esecuzione del programma                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura parametri di selezione stampa       *
      *                  *---------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to exe-pgm-frg-999.
      *                  *---------------------------------------------*
      *                  * Esecuzione eventuale sort preliminare       *
      *                  *---------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se sort eseguito       *
      *                  *---------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to exe-pgm-frg-400
           else      go to exe-pgm-frg-500.
       exe-pgm-frg-400.
      *                  *---------------------------------------------*
      *                  * Se sort non eseguito                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ciclo di report-program                 *
      *                      *-----------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     exe-pgm-frg-600.
       exe-pgm-frg-500.
      *                  *---------------------------------------------*
      *                  * Se sort eseguito                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     exe-pgm-frg-600.
       exe-pgm-frg-600.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo stampa                 *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       exe-pgm-frg-900.
      *                  *---------------------------------------------*
      *                  * Visual. eventuali errori di esecuzione      *
      *                  *---------------------------------------------*
           move      "VE"                 to   b-ope                  .
           move      "F"                  to   b-tfe                  .
           move      i-ide-des            to   b-chr                  .
           call      "swd/mod/prg/obj/mbckgv"
                                         using b                      .
           cancel    "swd/mod/prg/obj/mbckgv"                         .
       exe-pgm-frg-999.
           exit.

      *    *===========================================================*
      *    *  Selezione parametri stampa                               *
      *    *-----------------------------------------------------------*
       sel-prm-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sel-prm-stp      .
      *              *-------------------------------------------------*
      *              * Test se selezione stampa da eseguire            *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to sel-prm-stp-999.
      *              *-------------------------------------------------*
      *              * Preparazione parametri per richiamo selezione   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Informazioni generali da segreteria         *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Codice azienda                          *
      *                      *-----------------------------------------*
           move      s-azi                to   r-env-cod-azi          .
      *                      *-----------------------------------------*
      *                      * Codice terminale                        *
      *                      *-----------------------------------------*
           move      s-ter                to   r-env-cod-ter          .
      *                      *-----------------------------------------*
      *                      * Codice utente                           *
      *                      *-----------------------------------------*
           move      s-ute                to   r-env-cod-ute          .
      *                      *-----------------------------------------*
      *                      * Date and time da segreteria             *
      *                      *-----------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Date and time                           *
      *                      *-----------------------------------------*
           move      s-sdt                to   r-env-dat-tim          .
      *                  *---------------------------------------------*
      *                  * Informazioni da identificazione programma   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Sistema applicativo                     *
      *                      *-----------------------------------------*
           move      i-ide-sap            to   r-ide-sis-app          .
      *                      *-----------------------------------------*
      *                      * Area gestionale                         *
      *                      *-----------------------------------------*
           move      i-ide-arg            to   r-ide-are-ges          .
      *                      *-----------------------------------------*
      *                      * Settore gestionale                      *
      *                      *-----------------------------------------*
           move      i-ide-set            to   r-ide-set-ges          .
      *                      *-----------------------------------------*
      *                      * Fase gestionale                         *
      *                      *-----------------------------------------*
           move      i-ide-fas            to   r-ide-fas-ges          .
      *                  *---------------------------------------------*
      *                  * Informazioni da preparazione param. stampa  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flags di tipo selezione                 *
      *                      *-----------------------------------------*
           move      w-cnt-stp-tip-sel    to   r-fix-tip-sel          .
      *                      *-----------------------------------------*
      *                      * Codice stampante                        *
      *                      *-----------------------------------------*
           move      w-cnt-stp-cod-stp    to   r-fix-cod-stp          .
      *                      *-----------------------------------------*
      *                      * Tipo di stampa                          *
      *                      *-----------------------------------------*
           move      w-cnt-stp-tip-sta    to   r-fix-tip-sta          .
      *                      *-----------------------------------------*
      *                      * Codice modulo                           *
      *                      *-----------------------------------------*
           move      w-cnt-stp-cod-mod    to   r-fix-cod-mod          .
      *                      *-----------------------------------------*
      *                      * Tipo modulo                             *
      *                      *-----------------------------------------*
           move      w-cnt-stp-tip-mod    to   r-fix-tip-mod          .
      *                      *-----------------------------------------*
      *                      * Ampiezza linea di stampa in caratteri   *
      *                      *-----------------------------------------*
           move      w-cnt-stp-amp-lin    to   r-fix-amp-lin          .
      *                      *-----------------------------------------*
      *                      * Top margin in linee                     *
      *                      *-----------------------------------------*
           move      w-cnt-stp-top-lin    to   r-fix-top-lin          .
      *                      *-----------------------------------------*
      *                      * Numero linee di stampa minimo           *
      *                      *-----------------------------------------*
           move      w-cnt-stp-lin-min    to   r-fix-lin-min          .
      *                      *-----------------------------------------*
      *                      * Bottom margin in linee                  *
      *                      *-----------------------------------------*
           move      w-cnt-stp-bot-lin    to   r-fix-bot-lin          .
      *                      *-----------------------------------------*
      *                      * Ampiezza caratteri                      *
      *                      *-----------------------------------------*
           move      w-cnt-stp-amp-car    to   r-fix-amp-car          .
      *                      *-----------------------------------------*
      *                      * Altezza interlinea                      *
      *                      *-----------------------------------------*
           move      w-cnt-stp-alt-int    to   r-fix-alt-int          .
      *                      *-----------------------------------------*
      *                      * Area riservata per espansioni future    *
      *                      *-----------------------------------------*
           move      w-cnt-stp-esp-fut    to   r-fix-esp-fut          .
      *                      *-----------------------------------------*
      *                      * Area riservata per funzioni speciali    *
      *                      *-----------------------------------------*
           move      w-cnt-stp-fnz-spc    to   r-fix-fnz-spc          .
      *              *-------------------------------------------------*
      *              * Richiamo modulo di selezione stampa             *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mpslct"
                                         using r                      .
           cancel    "swd/mod/prg/obj/mpslct"                         .
      *              *-------------------------------------------------*
      *              * Status di uscita                                *
      *              *-------------------------------------------------*
           if        r-rsc                not  = spaces
                     move  "#"            to   w-cnt-sel-prm-stp      .
       sel-prm-stp-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Elaborazioni preliminari su aree titolo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area nome azienda  *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-cnt-tit-des-azi      .
           move      40                   to   w-cnt-tit-ctr-azi      .
       int-pag-std-100.
           if        w-cnt-tit-chr-azi
                    (w-cnt-tit-ctr-azi)   =    spaces
                     if     w-cnt-tit-ctr-azi
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-azi
                            go to     int-pag-std-100.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza titolo stampato    *
      *                  *---------------------------------------------*
           move      80                   to   w-cnt-tit-ctr-tit      .
       int-pag-std-200.
           if        w-cnt-tit-chr-tit
                    (w-cnt-tit-ctr-tit)   =    spaces
                     if     w-cnt-tit-ctr-tit
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-tit
                            go to     int-pag-std-200.
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale titolo    *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-tit      .
           subtract  w-cnt-tit-ctr-tit    from w-cnt-tit-pos-tit      .
           divide    2                    into w-cnt-tit-pos-tit      .
           add       1                    to   w-cnt-tit-pos-tit      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area data e pagina *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-pag    =    zero
                     move  4              to   w-cnt-tit-ctr-wrk
                     go to int-pag-std-300.
           move      zero                 to   w-cnt-tit-ctr-wrk      .
           inspect   w-cnt-tit-num-pag
                                      tallying w-cnt-tit-ctr-wrk
                                   for leading "0"                    .
       int-pag-std-300.
           subtract  w-cnt-tit-ctr-wrk    from 27
                                        giving w-cnt-tit-ctr-dep      .
           subtract  w-cnt-tit-ctr-wrk    from 5
                                        giving w-cnt-tit-ctr-cif      .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale data e p. *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-dep      .
           subtract  w-cnt-tit-ctr-dep    from w-cnt-tit-pos-dep      .
           add       1                    to   w-cnt-tit-pos-dep      .
      *                  *---------------------------------------------*
      *                  * Determinazione se titolo su una o due linee *
      *                  *---------------------------------------------*
           move      w-cnt-tit-ctr-azi    to   w-cnt-tit-ctr-wrk      .
           add       2                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-tit
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      w-cnt-tit-pos-tit    to   w-cnt-tit-ctr-wrk      .
           add       w-cnt-tit-ctr-tit    to   w-cnt-tit-ctr-wrk      .
           add       1                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-dep
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      1                    to   w-cnt-tit-num-lin      .
       int-pag-std-500.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome azienda                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-azi    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-cnt-tit-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-lin    =    2
                     go to int-pag-std-600.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-600.
      *                  *---------------------------------------------*
      *                  * Literal per Data                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           move      "Data :"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       7                    to   p-pos                  .
           move      w-cnt-tit-dat-stp    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal per Pag.                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       17                   to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      w-cnt-tit-ctr-cif    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       22                   to   p-pos                  .
           move      w-cnt-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea titolo                            *
      *              *-------------------------------------------------*
           if        w-cnt-tit-num-lin    not  = 2
                     go to int-pag-std-900.
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-900.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No richieste ad utente                       *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No funzionamento ciclico stampa              *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-cic      .
      *              *-------------------------------------------------*
      *              * Si/No richiesta di selezione stampa             *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice nostra cassa,   *
      *              * banca, o c/c postale                            *
      *              *-------------------------------------------------*
           perform   cod-des-cbp-opn-000  thru cod-des-cbp-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione fornitore commerciale  *
      *              *-------------------------------------------------*
           perform   cod-mne-dcf-opn-000  thru cod-mne-dcf-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione dipendenza fornitore   *
      *              *-------------------------------------------------*
           perform   cod-cod-dcf-opn-000  thru cod-cod-dcf-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice CIN             *
      *              *-------------------------------------------------*
           perform   cod-cod-cin-opn-000  thru cod-cod-cin-opn-999    .
       rou-opn-fls-200.
      *              *-------------------------------------------------*
      *              * [kk0]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiesta di un pathname unico alla segre-  *
      *                  * teria                                       *
      *                  *---------------------------------------------*
           move      "UP"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-pat                to   f-kk0-pat              .
      *                  *---------------------------------------------*
      *                  * Open file                                   *
      *                  *---------------------------------------------*
           open      i-o    kk0                                       .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice nostra cassa,  *
      *              * banca, o c/c postale                            *
      *              *-------------------------------------------------*
           perform   cod-des-cbp-cls-000  thru cod-des-cbp-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione fornitore commerciale *
      *              *-------------------------------------------------*
           perform   cod-mne-dcf-cls-000  thru cod-mne-dcf-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione dipendenza fornitore  *
      *              *-------------------------------------------------*
           perform   cod-cod-dcf-cls-000  thru cod-cod-dcf-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice CIN            *
      *              *-------------------------------------------------*
           perform   cod-cod-cin-cls-000  thru cod-cod-cin-cls-999    .
       rou-cls-fls-200.
      *              *-------------------------------------------------*
      *              * [kk0]                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close file                                  *
      *                  *---------------------------------------------*
           close     kk0                                              .
      *                  *---------------------------------------------*
      *                  * Richiesta di delete di un pathname alla se- *
      *                  * greteria                                    *
      *                  *---------------------------------------------*
           move      "PD"                 to   s-ope                  .
           move      f-kk0-pat            to   s-pat                  .
           move      "K"                  to   s-sts                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Tipo stampa                                 *
      *                  *---------------------------------------------*
           perform   acc-tip-stp-000      thru acc-tip-stp-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
       acc-ric-sel-200.
      *                  *---------------------------------------------*
      *                  * Codice nostra banca                         *
      *                  *---------------------------------------------*
           perform   acc-cod-cbp-000      thru acc-cod-cbp-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-100.
       acc-ric-sel-300.
      *                  *---------------------------------------------*
      *                  * Data registrazione minima                   *
      *                  *---------------------------------------------*
           perform   acc-drg-min-000      thru acc-drg-min-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-200.
       acc-ric-sel-400.
      *                  *---------------------------------------------*
      *                  * Data registrazione massima                  *
      *                  *---------------------------------------------*
           perform   acc-drg-max-000      thru acc-drg-max-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-300.
       acc-ric-sel-500.
      *                  *---------------------------------------------*
      *                  * Numero pagamento minimo                     *
      *                  *---------------------------------------------*
           perform   acc-npg-min-000      thru acc-npg-min-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-400.
       acc-ric-sel-600.
      *                  *---------------------------------------------*
      *                  * Numero pagamento massimo                    *
      *                  *---------------------------------------------*
           perform   acc-npg-max-000      thru acc-npg-max-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-500.
       acc-ric-sel-700.
      *                  *---------------------------------------------*
      *                  * Codice fornitore                            *
      *                  *---------------------------------------------*
           perform   acc-cod-fnt-000      thru acc-cod-fnt-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-600.
       acc-ric-sel-800.
      *                  *---------------------------------------------*
      *                  * Codice dipendenza del fornitore             *
      *                  *---------------------------------------------*
           perform   acc-dpz-fnt-000      thru acc-dpz-fnt-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-700.
       acc-ric-sel-850.
      *                  *---------------------------------------------*
      *                  * Si/no preparazione archivio                 *
      *                  *---------------------------------------------*
           perform   acc-snx-pab-000      thru acc-snx-pab-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-800.
       acc-ric-sel-875.
      *                  *---------------------------------------------*
      *                  * Si/no dettaglio scadenze                    *
      *                  *---------------------------------------------*
           perform   acc-snx-det-000      thru acc-snx-det-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-850.
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#CNF"               to   v-not                  .
           move      "S"                  to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else if   v-key                =    "UP  "
                     go to acc-ric-sel-950
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-950.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazioni                         *
      *                      *-----------------------------------------*
           go to     acc-ric-sel-100.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
           move      zero                 to   rr-tip-stp             .
           move      spaces               to   rr-cod-cbp             .
           move      spaces               to   rr-cod-cbp-des         .
           move      zero                 to   rr-cod-cbp-abi         .
           move      zero                 to   rr-cod-cbp-cab         .
           move      spaces               to   rr-cod-cbp-ccc         .
           move      zero                 to   rr-drg-min             .
           move      zero                 to   rr-drg-max             .
           move      zero                 to   rr-npg-min             .
           move      zero                 to   rr-npg-max             .
           move      zero                 to   rr-cod-fnt             .
           move      spaces               to   rr-cod-fnt-rag         .
           move      spaces               to   rr-cod-fnt-via         .
           move      spaces               to   rr-cod-fnt-loc         .
           move      spaces               to   rr-cod-fnt-cfi         .
           move      spaces               to   rr-dpz-fnt             .
           move      spaces               to   rr-dpz-fnt-rag         .
           move      spaces               to   rr-dpz-fnt-via         .
           move      spaces               to   rr-dpz-fnt-loc         .
           move      zero                 to   rr-snx-pab             .
           move      zero                 to   rr-snx-det             .
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Tipo stampa                                     *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo stampa                :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Codice nostra banca                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice nostra banca        :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Data registrazione minima                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data registrazione     dal :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Data registrazione massima                      *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "                        al :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Numero pagamento minimo                         *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero pagamento       dal :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Numero pagamento massimo                        *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "                        al :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Codice fornitore                                *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Selezione su fornitore     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Dipendenza fornitore                            *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Sua dipendenza             :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Si/no preparazione archivio                     *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Preparazione supporto      :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Si/no dettaglio scadenze                        *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "Dettaglio scadenze :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Tipo stampa                *
      *    *-----------------------------------------------------------*
       acc-tip-stp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-tip-stp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-stp-lun    to   v-car                  .
           move      w-exp-tip-stp-num    to   v-ldt                  .
           move      "DPR#"               to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      07                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-tip-stp-tbl    to   v-txt                  .
           move      rr-tip-stp           to   v-num                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-tip-stp-999.
       acc-tip-stp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-tip-stp             .
       acc-tip-stp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        rr-tip-stp           =    zero
                     go to acc-tip-stp-100.
       acc-tip-stp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Eventuale normalizzazione si/no preparazio- *
      *                  * ne archivio                                 *
      *                  *---------------------------------------------*
           if        rr-tip-stp           not  = 02
                     go to acc-tip-stp-800.
           if        rr-snx-pab           =    01
                     go to acc-tip-stp-800.
      *                  *---------------------------------------------*
      *                  * Normalizzazione si/no preparazione archivio *
      *                  *---------------------------------------------*
           move      01                   to   rr-snx-pab             .
      *                  *---------------------------------------------*
      *                  * Visualizzazione si/no preparazione archivio *
      *                  *---------------------------------------------*
           perform   vis-snx-pab-000      thru vis-snx-pab-999        .
       acc-tip-stp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-tip-stp-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-tip-stp-100.
       acc-tip-stp-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Codice ns. cassa, banca o c/c postale      *
      *    *-----------------------------------------------------------*
       acc-cod-cbp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-cbp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-des-cbp-ope      .
           move      02                   to   w-cod-des-cbp-tip      .
           move      rr-cod-cbp           to   w-cod-des-cbp-cod      .
           move      09                   to   w-cod-des-cbp-lin      .
           move      30                   to   w-cod-des-cbp-pos      .
           move      09                   to   w-cod-des-cbp-dln      .
           move      41                   to   w-cod-des-cbp-dps      .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
       acc-cod-cbp-110.
           perform   cod-des-cbp-cll-000  thru cod-des-cbp-cll-999    .
           if        w-cod-des-cbp-ope    =    "F+"
                     go to acc-cod-cbp-115.
           if        w-cod-des-cbp-ope    =    "AC"
                     go to acc-cod-cbp-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-cbp-115.
           perform   cod-des-cbp-foi-000  thru cod-des-cbp-foi-999    .
           go to     acc-cod-cbp-110.
       acc-cod-cbp-120.
           move      w-cod-des-cbp-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-cod-cbp-999.
       acc-cod-cbp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-cod-cbp             .
       acc-cod-cbp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [cbp]                      *
      *                  *---------------------------------------------*
           move      02                   to   w-let-arc-cbp-tip      .
           move      rr-cod-cbp           to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione valori record                *
      *                  *---------------------------------------------*
           move      w-let-arc-cbp-des    to   rr-cod-cbp-des         .
           move      w-let-arc-cbp-abi    to   rr-cod-cbp-abi         .
           move      w-let-arc-cbp-cab    to   rr-cod-cbp-cab         .
           move      w-let-arc-cbp-ccb    to   rr-cod-cbp-ccc         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-cod-cbp-des-000  thru vis-cod-cbp-des-999    .
      *                  *---------------------------------------------*
      *                  * Se record non esistente : reimpostazione    *
      *                  *---------------------------------------------*
           if        w-let-arc-cbp-flg    not  = spaces
                     go to acc-cod-cbp-100.
      *                  *---------------------------------------------*
      *                  * Valore a spaces non ammesso, a meno che non *
      *                  * si sia in Up                                *
      *                  *---------------------------------------------*
           if        rr-cod-cbp           not  = spaces
                     go to acc-cod-cbp-600.
           if        v-key                =    "UP  "
                     go to acc-cod-cbp-600
           else      go to acc-cod-cbp-100.
       acc-cod-cbp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-cbp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-cod-cbp-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-cod-cbp-100.
       acc-cod-cbp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Descrizione ns. cassa, banca o c/c po-  *
      *    * stale                                                     *
      *    *-----------------------------------------------------------*
       vis-cod-cbp-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-cod-cbp-des       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-cod-cbp-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Data registrazione minima da ricercare     *
      *    *-----------------------------------------------------------*
       acc-drg-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-drg-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      11                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-drg-min           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-drg-min-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-drg-min-999.
       acc-drg-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-drg-min             .
       acc-drg-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-drg-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-drg-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-drg-min-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-drg-min-100.
       acc-drg-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Data registrazione massima da ricercare    *
      *    *-----------------------------------------------------------*
       acc-drg-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-drg-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      12                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-drg-max           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-drg-max-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-drg-max-999.
       acc-drg-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-drg-max             .
       acc-drg-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-drg-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-drg-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-drg-max-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-drg-max-100.
       acc-drg-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Numero pagamento minimo                    *
      *    *-----------------------------------------------------------*
       acc-npg-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-npg-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      "<"                  to   v-edm                  .
           move      14                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-npg-min           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-npg-min-999.
       acc-npg-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-npg-min             .
      *              *-------------------------------------------------*
      *              * Se Find                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "FIND"
                     go to acc-npg-min-400.
      *                  *---------------------------------------------*
      *                  * Find su archivio [sfp]                      *
      *                  *---------------------------------------------*
           move      "S"                  to   w-fnd-arc-sfp-sns      .
           move      13                   to   w-fnd-arc-sfp-mod      .
           move      01                   to   w-fnd-arc-sfp-tvl      .
           move      spaces               to   w-fnd-arc-sfp-vlt      .
           move      rr-cod-cbp           to   w-fnd-arc-sfp-cbp      .
           move      "S"                  to   w-fnd-arc-sfp-sda      .
           perform   fnd-arc-sfp-000      thru fnd-arc-sfp-999        .
      *                  *---------------------------------------------*
      *                  * Se selezione non effettuata : a reimposta-  *
      *                  * zione                                       *
      *                  *---------------------------------------------*
           if        w-fnd-arc-sfp-sel    not  = spaces
                     go to acc-npg-min-100.
      *                  *---------------------------------------------*
      *                  * Numero pagamento selezionato in campo di    *
      *                  * destinazione                                *
      *                  *---------------------------------------------*
           move      w-fnd-arc-sfp-num    to   rr-npg-min             .
      *                  *---------------------------------------------*
      *                  * Visualizzazione numero pagamento seleziona- *
      *                  * to                                          *
      *                  *---------------------------------------------*
           perform   vis-npg-min-000      thru vis-npg-min-999        .
      *                  *---------------------------------------------*
      *                  * Normalizzazione function-key di impostazio- *
      *                  * ne                                          *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Continuazione post-impostazione             *
      *                  *---------------------------------------------*
           go to     acc-npg-min-400.
       acc-npg-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-npg-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-npg-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-npg-min-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-npg-min-100.
       acc-npg-min-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Numero pagamento minimo                 *
      *    *-----------------------------------------------------------*
       vis-npg-min-000.
           move      "DS"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      "<"                  to   v-edm                  .
           move      14                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-npg-min           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-npg-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Numero pagamento massimo                   *
      *    *-----------------------------------------------------------*
       acc-npg-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-npg-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      "<"                  to   v-edm                  .
           move      15                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-npg-max           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-npg-max-999.
       acc-npg-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-npg-max             .
      *              *-------------------------------------------------*
      *              * Se Find                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "FIND"
                     go to acc-npg-max-400.
      *                  *---------------------------------------------*
      *                  * Find su archivio [sfp]                      *
      *                  *---------------------------------------------*
           move      "S"                  to   w-fnd-arc-sfp-sns      .
           move      13                   to   w-fnd-arc-sfp-mod      .
           move      01                   to   w-fnd-arc-sfp-tvl      .
           move      spaces               to   w-fnd-arc-sfp-vlt      .
           move      rr-cod-cbp           to   w-fnd-arc-sfp-cbp      .
           move      "S"                  to   w-fnd-arc-sfp-sda      .
           perform   fnd-arc-sfp-000      thru fnd-arc-sfp-999        .
      *                  *---------------------------------------------*
      *                  * Se selezione non effettuata : a reimposta-  *
      *                  * zione                                       *
      *                  *---------------------------------------------*
           if        w-fnd-arc-sfp-sel    not  = spaces
                     go to acc-npg-max-100.
      *                  *---------------------------------------------*
      *                  * Numero pagamento selezionato in campo di    *
      *                  * destinazione                                *
      *                  *---------------------------------------------*
           move      w-fnd-arc-sfp-num    to   rr-npg-max             .
      *                  *---------------------------------------------*
      *                  * Visualizzazione numero pagamento seleziona- *
      *                  * to                                          *
      *                  *---------------------------------------------*
           perform   vis-npg-max-000      thru vis-npg-max-999        .
      *                  *---------------------------------------------*
      *                  * Normalizzazione function-key di impostazio- *
      *                  * ne                                          *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Continuazione post-impostazione             *
      *                  *---------------------------------------------*
           go to     acc-npg-max-400.
       acc-npg-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-npg-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-npg-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-npg-max-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-npg-max-100.
       acc-npg-max-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Numero pagamento massimo                *
      *    *-----------------------------------------------------------*
       vis-npg-max-000.
           move      "DS"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      "<"                  to   v-edm                  .
           move      15                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-npg-max           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-npg-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice fornitore                     *
      *    *-----------------------------------------------------------*
       acc-cod-fnt-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-fnt-100.
      *              *-------------------------------------------------*
      *              * Salvataggio valore precedente                   *
      *              *-------------------------------------------------*
           move      rr-cod-fnt           to   w-sav-cod-fnt          .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-dcf-ope      .
           move      rr-cod-fnt           to   w-cod-mne-dcf-cod      .
           move      17                   to   w-cod-mne-dcf-lin      .
           move      30                   to   w-cod-mne-dcf-pos      .
           move      17                   to   w-cod-mne-dcf-rln      .
           move      41                   to   w-cod-mne-dcf-rps      .
           move      zero                 to   w-cod-mne-dcf-vln      .
           move      zero                 to   w-cod-mne-dcf-vps      .
           move      zero                 to   w-cod-mne-dcf-lln      .
           move      zero                 to   w-cod-mne-dcf-lps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-dcf-cll-000  thru cod-mne-dcf-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-dcf-foi-000  thru cod-mne-dcf-foi-999    .
       acc-cod-fnt-110.
           perform   cod-mne-dcf-cll-000  thru cod-mne-dcf-cll-999    .
           if        w-cod-mne-dcf-ope    =    "F+"
                     go to acc-cod-fnt-115.
           if        w-cod-mne-dcf-ope    =    "AC"
                     go to acc-cod-fnt-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-fnt-115.
           perform   cod-mne-dcf-foi-000  thru cod-mne-dcf-foi-999    .
           go to     acc-cod-fnt-110.
       acc-cod-fnt-120.
           move      w-cod-mne-dcf-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-cod-fnt-999.
       acc-cod-fnt-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-cod-fnt             .
       acc-cod-fnt-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-fnt-410.
      *                  *---------------------------------------------*
      *                  * Lettura file [fnt]                          *
      *                  *---------------------------------------------*
           move      rr-cod-fnt           to   w-let-arc-fnt-cod      .
           perform   let-arc-fnt-000      thru let-arc-fnt-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione ragione sociale, indirizzo,  *
      *                  * localita', e sottoconto associato da ana-   *
      *                  * grafica contabile                           *
      *                  *---------------------------------------------*
           move      w-let-arc-fnt-rag    to   rr-cod-fnt-rag         .
           move      w-let-arc-fnt-via    to   rr-cod-fnt-via         .
           move      w-let-arc-fnt-loc    to   rr-cod-fnt-loc         .
           move      w-let-arc-fnt-cfi    to   rr-cod-fnt-cfi         .
       acc-cod-fnt-420.
      *                  *---------------------------------------------*
      *                  * Visualizzazione ragione sociale da anagra-  *
      *                  * fica contabile                              *
      *                  *---------------------------------------------*
           perform   vis-cod-fnt-rag-000  thru vis-cod-fnt-rag-999    .
       acc-cod-fnt-430.
      *                  *---------------------------------------------*
      *                  * Se fornitore non esistente                  *
      *                  *---------------------------------------------*
           if        w-let-arc-fnt-flg    =    spaces
                     go to acc-cod-fnt-440.
       acc-cod-fnt-432.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione di-   *
      *                      * pendenza del fornitore                  *
      *                      *-----------------------------------------*
           if        rr-dpz-fnt           =    spaces and
                     rr-dpz-fnt-rag       =    spaces and
                     rr-dpz-fnt-via       =    spaces and
                     rr-dpz-fnt-loc       =    spaces
                     go to acc-cod-fnt-434.
           move      spaces               to   rr-dpz-fnt             .
           move      spaces               to   rr-dpz-fnt-rag         .
           move      spaces               to   rr-dpz-fnt-via         .
           move      spaces               to   rr-dpz-fnt-loc         .
           perform   vis-dpz-fnt-000      thru vis-dpz-fnt-999        .
           perform   vis-dpz-fnt-rag-000  thru vis-dpz-fnt-rag-999    .
           perform   vis-dpz-fnt-via-000  thru vis-dpz-fnt-via-999    .
           perform   vis-dpz-fnt-loc-000  thru vis-dpz-fnt-loc-999    .
       acc-cod-fnt-434.
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-cod-fnt-100.
       acc-cod-fnt-440.
      *                  *---------------------------------------------*
      *                  * Se codice a zero                            *
      *                  *---------------------------------------------*
           if        rr-cod-fnt           not  = zero
                     go to acc-cod-fnt-450.
       acc-cod-fnt-442.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione di-   *
      *                      * pendenza del fornitore                  *
      *                      *-----------------------------------------*
           if        rr-dpz-fnt           =    spaces and
                     rr-dpz-fnt-rag       =    spaces and
                     rr-dpz-fnt-via       =    spaces and
                     rr-dpz-fnt-loc       =    spaces
                     go to acc-cod-fnt-444.
           move      spaces               to   rr-dpz-fnt             .
           move      spaces               to   rr-dpz-fnt-rag         .
           move      spaces               to   rr-dpz-fnt-via         .
           move      spaces               to   rr-dpz-fnt-loc         .
           perform   vis-dpz-fnt-000      thru vis-dpz-fnt-999        .
           perform   vis-dpz-fnt-rag-000  thru vis-dpz-fnt-rag-999    .
           perform   vis-dpz-fnt-via-000  thru vis-dpz-fnt-via-999    .
           perform   vis-dpz-fnt-loc-000  thru vis-dpz-fnt-loc-999    .
       acc-cod-fnt-444.
      *                      *-----------------------------------------*
      *                      * Visualizzazione literal "Tutti" al po-  *
      *                      * sto del codice                          *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "Tutti "             to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * A dipendenze dall'impostazione          *
      *                      *-----------------------------------------*
           go to     acc-cod-fnt-600.
       acc-cod-fnt-450.
      *                  *---------------------------------------------*
      *                  * Se codice diverso da zero                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda del confronto con  *
      *                      * il valore precedente                    *
      *                      *-----------------------------------------*
           if        rr-cod-fnt           =    w-sav-cod-fnt
                     go to acc-cod-fnt-455
           else      go to acc-cod-fnt-480.
       acc-cod-fnt-455.
      *                      *-----------------------------------------*
      *                      * Se valore impostato pari al valore pre- *
      *                      * cedente                                 *
      *                      *-----------------------------------------*
       acc-cod-fnt-457.
      *                          *-------------------------------------*
      *                          * Lettura anagrafica commerciale del  *
      *                          * fornitore principale                *
      *                          *-------------------------------------*
           move      "C"                  to   w-let-arc-dcf-tle      .
           move      rr-cod-fnt           to   w-let-arc-dcf-cod      .
           move      spaces               to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                          *-------------------------------------*
      *                          * Deviazione a seconda dell'esito     *
      *                          * della lettura                       *
      *                          *-------------------------------------*
           if        w-let-arc-dcf-flg    =    spaces
                     go to acc-cod-fnt-467.
       acc-cod-fnt-459.
      *                          *-------------------------------------*
      *                          * Se anagrafica commerciale del for-  *
      *                          * nitore principale non esistente     *
      *                          *-------------------------------------*
       acc-cod-fnt-461.
      *                              *---------------------------------*
      *                              * Normalizzazione e visualizza-   *
      *                              * zione dei dati relativi alla    *
      *                              * dipendenza                      *
      *                              *---------------------------------*
           if        rr-dpz-fnt           =    spaces and
                     rr-dpz-fnt-rag       =    spaces and
                     rr-dpz-fnt-via       =    spaces and
                     rr-dpz-fnt-loc       =    spaces
                     go to acc-cod-fnt-463.
           move      spaces               to   rr-dpz-fnt             .
           move      spaces               to   rr-dpz-fnt-rag         .
           move      spaces               to   rr-dpz-fnt-via         .
           move      spaces               to   rr-dpz-fnt-loc         .
           perform   vis-dpz-fnt-000      thru vis-dpz-fnt-999        .
           perform   vis-dpz-fnt-rag-000  thru vis-dpz-fnt-rag-999    .
           perform   vis-dpz-fnt-via-000  thru vis-dpz-fnt-via-999    .
           perform   vis-dpz-fnt-loc-000  thru vis-dpz-fnt-loc-999    .
       acc-cod-fnt-463.
      *                              *---------------------------------*
      *                              * Messaggio di errore             *
      *                              *---------------------------------*
           move      "Manca l'anagrafica commerciale per il fornitore   
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
       acc-cod-fnt-465.
      *                              *---------------------------------*
      *                              * A reimpostazione                *
      *                              *---------------------------------*
           go to     acc-cod-fnt-100.
       acc-cod-fnt-467.
      *                          *-------------------------------------*
      *                          * Se anagrafica commerciale del for-  *
      *                          * nitore principale esistente         *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Memorizzazione valori letti da  *
      *                              * anagrafica commerciale fornito- *
      *                              * re principale in dati per la    *
      *                              * dipendenza                      *
      *                              *---------------------------------*
           move      w-let-arc-dcf-rag    to   rr-dpz-fnt-rag         .
           move      w-let-arc-dcf-via    to   rr-dpz-fnt-via         .
           move      w-let-arc-dcf-loc    to   rr-dpz-fnt-loc         .
      *                              *---------------------------------*
      *                              * Deviazione a seconda se il co-  *
      *                              * dice dipendenza e' a spaces op- *
      *                              * pure diverso da spaces          *
      *                              *---------------------------------*
           if        rr-dpz-fnt           =    spaces
                     go to acc-cod-fnt-469
           else      go to acc-cod-fnt-471.
       acc-cod-fnt-469.
      *                              *---------------------------------*
      *                              * Se codice dipendenza a spaces   *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Visualizzazione valori re-  *
      *                                  * lativi alla dipendenza      *
      *                                  *-----------------------------*
           perform   vis-dpz-fnt-000      thru vis-dpz-fnt-999        .
           perform   vis-dpz-fnt-rag-000  thru vis-dpz-fnt-rag-999    .
           perform   vis-dpz-fnt-via-000  thru vis-dpz-fnt-via-999    .
           perform   vis-dpz-fnt-loc-000  thru vis-dpz-fnt-loc-999    .
      *                                  *-----------------------------*
      *                                  * A dipendenze dall'imposta-  *
      *                                  * zione                       *
      *                                  *-----------------------------*
           go to     acc-cod-fnt-600.
       acc-cod-fnt-471.
      *                              *---------------------------------*
      *                              * Se codice dipendenza diverso da *
      *                              * spaces                          *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Lettura anagrafica commer-  *
      *                                  * ciale della dipendenza      *
      *                                  *-----------------------------*
           move      "D"                  to   w-let-arc-dcf-tle      .
           move      rr-cod-fnt           to   w-let-arc-dcf-cod      .
           move      rr-dpz-fnt           to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                                  *-----------------------------*
      *                                  * Deviazione a seconda del-   *
      *                                  * l'esito della lettura       *
      *                                  *-----------------------------*
           if        w-let-arc-dcf-flg    =    spaces
                     go to acc-cod-fnt-473
           else      go to acc-cod-fnt-475.
       acc-cod-fnt-473.
      *                                  *-----------------------------*
      *                                  * Se anagrafica commerciale   *
      *                                  * della dipendenza esistente  *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Memorizzazione valori   *
      *                                      * letti da anagrafica     *
      *                                      * commerciale della di-   *
      *                                      * pendenza                *
      *                                      *-------------------------*
           move      w-let-arc-dcf-rag    to   rr-dpz-fnt-rag         .
           move      w-let-arc-dcf-via    to   rr-dpz-fnt-via         .
           move      w-let-arc-dcf-loc    to   rr-dpz-fnt-loc         .
      *                                      *-------------------------*
      *                                      * Visualizzazione valori  *
      *                                      * relativi alla dipenden- *
      *                                      * za                      *
      *                                      *-------------------------*
           perform   vis-dpz-fnt-000      thru vis-dpz-fnt-999        .
           perform   vis-dpz-fnt-rag-000  thru vis-dpz-fnt-rag-999    .
           perform   vis-dpz-fnt-via-000  thru vis-dpz-fnt-via-999    .
           perform   vis-dpz-fnt-loc-000  thru vis-dpz-fnt-loc-999    .
      *                                      *-------------------------*
      *                                      * A dipendenze dall'impo- *
      *                                      * stazione                *
      *                                      *-------------------------*
           go to     acc-cod-fnt-600.
       acc-cod-fnt-475.
      *                                  *-----------------------------*
      *                                  * Se anagrafica commerciale   *
      *                                  * della dipendenza non esi-   *
      *                                  * stente                      *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Memorizzazione valori   *
      *                                      * letti da anagrafica     *
      *                                      * commerciale della di-   *
      *                                      * pendenza                *
      *                                      *-------------------------*
           move      w-let-arc-dcf-rag    to   rr-dpz-fnt-rag         .
           move      w-let-arc-dcf-via    to   rr-dpz-fnt-via         .
           move      w-let-arc-dcf-loc    to   rr-dpz-fnt-loc         .
      *                                      *-------------------------*
      *                                      * Visualizzazione valori  *
      *                                      * relativi alla dipenden- *
      *                                      * za                      *
      *                                      *-------------------------*
           perform   vis-dpz-fnt-000      thru vis-dpz-fnt-999        .
           perform   vis-dpz-fnt-rag-000  thru vis-dpz-fnt-rag-999    .
           perform   vis-dpz-fnt-via-000  thru vis-dpz-fnt-via-999    .
           perform   vis-dpz-fnt-loc-000  thru vis-dpz-fnt-loc-999    .
      *                                      *-------------------------*
      *                                      * Messaggio di errore     *
      *                                      *-------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "Manca l'anagrafica commerciale per la dipendenza "
                                delimited by   size
                     "'"        delimited by   size
                     rr-dpz-fnt       
                                delimited by spaces
                     "'"        delimited by   size
                                          into w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                                      *-------------------------*
      *                                      * A reimpostazione        *
      *                                      *-------------------------*
           go to     acc-cod-fnt-100.
       acc-cod-fnt-480.
      *                      *-----------------------------------------*
      *                      * Se valore impostato diverso dal valore  *
      *                      * precedente                              *
      *                      *-----------------------------------------*
       acc-cod-fnt-482.
      *                              *---------------------------------*
      *                              * Normalizzazione e visualizza-   *
      *                              * zione dei dati relativi alla    *
      *                              * dipendenza                      *
      *                              *---------------------------------*
           if        rr-dpz-fnt           =    spaces and
                     rr-dpz-fnt-rag       =    spaces and
                     rr-dpz-fnt-via       =    spaces and
                     rr-dpz-fnt-loc       =    spaces
                     go to acc-cod-fnt-484.
           move      spaces               to   rr-dpz-fnt             .
           move      spaces               to   rr-dpz-fnt-rag         .
           move      spaces               to   rr-dpz-fnt-via         .
           move      spaces               to   rr-dpz-fnt-loc         .
           perform   vis-dpz-fnt-000      thru vis-dpz-fnt-999        .
           perform   vis-dpz-fnt-rag-000  thru vis-dpz-fnt-rag-999    .
           perform   vis-dpz-fnt-via-000  thru vis-dpz-fnt-via-999    .
           perform   vis-dpz-fnt-loc-000  thru vis-dpz-fnt-loc-999    .
       acc-cod-fnt-484.
      *                              *---------------------------------*
      *                              * Riaggancio                      *
      *                              *---------------------------------*
           go to     acc-cod-fnt-457.
       acc-cod-fnt-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ri-lettura anagrafica commerciale del       *
      *                  * fornitore principale                        *
      *                  *---------------------------------------------*
           move      "C"                  to   w-let-arc-dcf-tle      .
           move      rr-cod-fnt           to   w-let-arc-dcf-cod      .
           move      spaces               to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                  *---------------------------------------------*
      *                  * Subroutine per note su fornitore            *
      *                  *---------------------------------------------*
           perform   cod-mne-dcf-not-000  thru cod-mne-dcf-not-999    .
       acc-cod-fnt-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-cod-fnt-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-cod-fnt-100.
       acc-cod-fnt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice fornitore, ragione sociale       *
      *    *-----------------------------------------------------------*
       vis-cod-fnt-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-cod-fnt-rag       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-fnt-rag-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice dipendenza fornitore          *
      *    *-----------------------------------------------------------*
       acc-dpz-fnt-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dpz-fnt-025.
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        rr-cod-fnt           =    zero
                     go to acc-dpz-fnt-999.
       acc-dpz-fnt-050.
      *                  *---------------------------------------------*
      *                  * Preparazione valore di default              *
      *                  *---------------------------------------------*
           if        rr-dpz-fnt           not  = spaces
                     go to acc-dpz-fnt-100.
      *                      *-----------------------------------------*
      *                      * Preparazione valore                     *
      *                      *-----------------------------------------*
           move      "*   "               to   rr-dpz-fnt             .
      *                      *-----------------------------------------*
      *                      * Lettura archivio [dcf]                  *
      *                      *-----------------------------------------*
           move      "D"                  to   w-let-arc-dcf-tle      .
           move      rr-cod-fnt           to   w-let-arc-dcf-cod      .
           move      rr-dpz-fnt           to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori letti da anagra-  *
      *                      * fica commerciale della dipendenza in    *
      *                      * dati per la dipendenza                  *
      *                      *-----------------------------------------*
           move      w-let-arc-dcf-rag    to   rr-dpz-fnt-rag         .
           move      w-let-arc-dcf-via    to   rr-dpz-fnt-via         .
           move      w-let-arc-dcf-loc    to   rr-dpz-fnt-loc         .
      *                      *-----------------------------------------*
      *                      * Visualizzazione valori relativi alla    *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           perform   vis-dpz-fnt-000      thru vis-dpz-fnt-999        .
           perform   vis-dpz-fnt-rag-000  thru vis-dpz-fnt-rag-999    .
           perform   vis-dpz-fnt-via-000  thru vis-dpz-fnt-via-999    .
           perform   vis-dpz-fnt-loc-000  thru vis-dpz-fnt-loc-999    .
       acc-dpz-fnt-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "A*"                 to   w-cod-cod-dcf-ope      .
           move      rr-cod-fnt           to   w-cod-cod-dcf-fnt      .
           move      rr-dpz-fnt           to   w-cod-cod-dcf-cod      .
           move      18                   to   w-cod-cod-dcf-lin      .
           move      30                   to   w-cod-cod-dcf-pos      .
           move      18                   to   w-cod-cod-dcf-rln      .
           move      41                   to   w-cod-cod-dcf-rps      .
           move      19                   to   w-cod-cod-dcf-vln      .
           move      41                   to   w-cod-cod-dcf-vps      .
           move      20                   to   w-cod-cod-dcf-lln      .
           move      41                   to   w-cod-cod-dcf-lps      .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-dcf-cll-000  thru cod-cod-dcf-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dcf-foi-000  thru cod-cod-dcf-foi-999    .
       acc-dpz-fnt-110.
           perform   cod-cod-dcf-cll-000  thru cod-cod-dcf-cll-999    .
           if        w-cod-cod-dcf-ope    =    "F+"
                     go to acc-dpz-fnt-115.
           if        w-cod-cod-dcf-ope    =    "AC"
                     go to acc-dpz-fnt-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-dpz-fnt-115.
           perform   cod-cod-dcf-foi-000  thru cod-cod-dcf-foi-999    .
           go to     acc-dpz-fnt-110.
       acc-dpz-fnt-120.
           move      w-cod-cod-dcf-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dpz-fnt-999.
       acc-dpz-fnt-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-dpz-fnt             .
       acc-dpz-fnt-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dpz-fnt-410.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se codice dipendenza   *
      *                  * a spaces oppure no                          *
      *                  *---------------------------------------------*
           if        rr-dpz-fnt           =    spaces
                     go to acc-dpz-fnt-420
           else      go to acc-dpz-fnt-440.
       acc-dpz-fnt-420.
      *                  *---------------------------------------------*
      *                  * Se codice dipendenza a spaces               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica commerciale del for- *
      *                      * nitore principale                       *
      *                      *-----------------------------------------*
           move      "C"                  to   w-let-arc-dcf-tle      .
           move      rr-cod-fnt           to   w-let-arc-dcf-cod      .
           move      spaces               to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori letti da anagra-  *
      *                      * fica commerciale fornitore principale   *
      *                      * in dati per la dipendenza               *
      *                      *-----------------------------------------*
           move      w-let-arc-dcf-rag    to   rr-dpz-fnt-rag         .
           move      w-let-arc-dcf-via    to   rr-dpz-fnt-via         .
           move      w-let-arc-dcf-loc    to   rr-dpz-fnt-loc         .
      *                      *-----------------------------------------*
      *                      * Visualizzazione valori relativi alla    *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           perform   vis-dpz-fnt-000      thru vis-dpz-fnt-999        .
           perform   vis-dpz-fnt-rag-000  thru vis-dpz-fnt-rag-999    .
           perform   vis-dpz-fnt-via-000  thru vis-dpz-fnt-via-999    .
           perform   vis-dpz-fnt-loc-000  thru vis-dpz-fnt-loc-999    .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda dell'esito della   *
      *                      * lettura                                 *
      *                      *-----------------------------------------*
           if        w-let-arc-dcf-flg    =    spaces
                     go to acc-dpz-fnt-425
           else      go to acc-dpz-fnt-430.
       acc-dpz-fnt-425.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale del fornitore *
      *                      * principale esistente                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * A dipendenze dall'impostazione      *
      *                          *-------------------------------------*
           go to     acc-dpz-fnt-600.
       acc-dpz-fnt-430.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale del fornitore *
      *                      * principale non esistente                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      "Manca l'anagrafica commerciale per il fornitore   
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                          *-------------------------------------*
      *                          * A reimpostazione                    *
      *                          *-------------------------------------*
           go to     acc-dpz-fnt-100.
       acc-dpz-fnt-440.
      *                  *---------------------------------------------*
      *                  * Se codice dipendenza diverso da spaces      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica commerciale per la   *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           move      "D"                  to   w-let-arc-dcf-tle      .
           move      rr-cod-fnt           to   w-let-arc-dcf-cod      .
           move      rr-dpz-fnt           to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori letti da anagra-  *
      *                      * fica commerciale della dipendenza in    *
      *                      * dati per la dipendenza                  *
      *                      *-----------------------------------------*
           move      w-let-arc-dcf-rag    to   rr-dpz-fnt-rag         .
           move      w-let-arc-dcf-via    to   rr-dpz-fnt-via         .
           move      w-let-arc-dcf-loc    to   rr-dpz-fnt-loc         .
      *                      *-----------------------------------------*
      *                      * Visualizzazione valori relativi alla    *
      *                      * dipendenza                              *
      *                      *-----------------------------------------*
           perform   vis-dpz-fnt-000      thru vis-dpz-fnt-999        .
           perform   vis-dpz-fnt-rag-000  thru vis-dpz-fnt-rag-999    .
           perform   vis-dpz-fnt-via-000  thru vis-dpz-fnt-via-999    .
           perform   vis-dpz-fnt-loc-000  thru vis-dpz-fnt-loc-999    .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda dell'esito della   *
      *                      * lettura                                 *
      *                      *-----------------------------------------*
           if        w-let-arc-dcf-flg    =    spaces
                     go to acc-dpz-fnt-445
           else      go to acc-dpz-fnt-450.
       acc-dpz-fnt-445.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale della dipen-  *
      *                      * denza esistente                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * A dipendenze dall'impostazione      *
      *                          *-------------------------------------*
           go to     acc-dpz-fnt-600.
       acc-dpz-fnt-450.
      *                      *-----------------------------------------*
      *                      * Se anagrafica commerciale della dipen-  *
      *                      * denza non esistente                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Messaggio di errore                 *
      *                          *-------------------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "Manca l'anagrafica commerciale per la dipendenza "
                                delimited by   size
                     "'"        delimited by   size
                     rr-dpz-fnt       
                                delimited by spaces
                     "'"        delimited by   size
                                          into w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                          *-------------------------------------*
      *                          * A reimpostazione                    *
      *                          *-------------------------------------*
           go to     acc-dpz-fnt-100.
       acc-dpz-fnt-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dpz-fnt-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dpz-fnt-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dpz-fnt-100.
       acc-dpz-fnt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice dipendenza del fornitore         *
      *    *-----------------------------------------------------------*
       vis-dpz-fnt-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-dpz-fnt           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-fnt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice dipendenza fornitore, ragione    *
      *    *                   sociale                                 *
      *    *-----------------------------------------------------------*
       vis-dpz-fnt-rag-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-dpz-fnt-rag       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-fnt-rag-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice dipendenza fornitore, indirizzo  *
      *    *-----------------------------------------------------------*
       vis-dpz-fnt-via-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-dpz-fnt-via       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-fnt-via-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice dipendenza fornitore, localita'  *
      *    *-----------------------------------------------------------*
       vis-dpz-fnt-loc-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-dpz-fnt-loc       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dpz-fnt-loc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Si/no preparazione archivio          *
      *    *-----------------------------------------------------------*
       acc-snx-pab-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        rr-tip-stp           =    02
                     go to acc-snx-pab-999.
       acc-snx-pab-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snx-pab-lun    to   v-car                  .
           move      w-exp-snx-pab-num    to   v-ldt                  .
           move      "NS#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      21                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-snx-pab-tbl    to   v-txt                  .
           move      rr-snx-pab           to   v-num                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-snx-pab-999.
       acc-snx-pab-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-snx-pab             .
       acc-snx-pab-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        rr-snx-pab           =    zero
                     go to acc-snx-pab-100.
       acc-snx-pab-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-snx-pab-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-snx-pab-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-snx-pab-100.
       acc-snx-pab-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Si/no preparazione archivio             *
      *    *-----------------------------------------------------------*
       vis-snx-pab-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snx-pab-lun    to   v-car                  .
           move      w-exp-snx-pab-num    to   v-ldt                  .
           move      21                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-snx-pab-tbl    to   v-txt                  .
           move      rr-snx-pab           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-snx-pab-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Si/no dettaglio scadenze             *
      *    *-----------------------------------------------------------*
       acc-snx-det-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-snx-det-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snx-det-lun    to   v-car                  .
           move      w-exp-snx-det-num    to   v-ldt                  .
           move      "NS#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      21                   to   v-lin                  .
           move      62                   to   v-pos                  .
           move      w-exp-snx-det-tbl    to   v-txt                  .
           move      rr-snx-det           to   v-num                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-snx-det-999.
       acc-snx-det-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-snx-det             .
       acc-snx-det-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        rr-snx-det           =    zero
                     go to acc-snx-det-100.
       acc-snx-det-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-snx-det-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-snx-det-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-snx-det-100.
       acc-snx-det-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Si/no dettaglio scadenze                *
      *    *-----------------------------------------------------------*
       vis-snx-det-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snx-det-lun    to   v-car                  .
           move      w-exp-snx-det-num    to   v-ldt                  .
           move      21                   to   v-lin                  .
           move      62                   to   v-pos                  .
           move      w-exp-snx-det-tbl    to   v-txt                  .
           move      rr-snx-det           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-snx-det-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
      *              *-------------------------------------------------*
      *              * Controllo su tipo stampa                        *
      *              *-------------------------------------------------*
           if        rr-tip-stp           not  = zero
                     go to tdo-ric-sel-100.
           move      "Manca la selezione del tipo stampa !              
      -              "               "    to   w-err-box-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Controllo su codice ns. banca                   *
      *              *-------------------------------------------------*
           if        rr-cod-cbp           not  = spaces
                     go to tdo-ric-sel-200.
           move      "Manca il codice nostra banca !              
      -              "               "    to   w-err-box-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Controllo su data registrazione minima e massi- *
      *              * ma                                              *
      *              *-------------------------------------------------*
           if        rr-drg-min           =    zero or
                     rr-drg-max           =    zero
                     go to tdo-ric-sel-300.
           if        rr-drg-max           not  < rr-drg-min
                     go to tdo-ric-sel-300.
           move      "Data registrazione massima inferiore a quella mini
      -              "ma             "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-300.
      *              *-------------------------------------------------*
      *              * Controllo su numero pgamento minimo e massimo   *
      *              *-------------------------------------------------*
           if        rr-npg-min           =    zero or
                     rr-npg-max           =    zero
                     go to tdo-ric-sel-400.
           if        rr-npg-max           not  < rr-npg-min
                     go to tdo-ric-sel-400.
           move      "Numero pagamento massimo inferiore a quello minimo
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-400.
      *              *-------------------------------------------------*
      *              * Fine controlli                                  *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione messaggio                   *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Uscita con errore                           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Data registrazione minima e massima             *
      *              *-------------------------------------------------*
           if        rr-drg-max           not  = zero
                     go to reg-ric-sel-100.
           if        rr-drg-min           =    zero
                     move  9999999        to   rr-drg-max
           else      move  rr-drg-min     to   rr-drg-max             .
       reg-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Numero pagamento minimo e massimo               *
      *              *-------------------------------------------------*
           if        rr-npg-max           not  = zero
                     go to reg-ric-sel-200.
           if        rr-npg-min           =    zero
                     move  99999999999    to   rr-npg-max
           else      move  rr-npg-min     to   rr-npg-max             .
       reg-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Si/no preparazione archivio                     *
      *              *-------------------------------------------------*
           if        rr-snx-pab           not  = 02
                     move  01             to   rr-snx-pab             .
           if        rr-tip-stp           =    02
                     move  01             to   rr-snx-pab             .
      *              *-------------------------------------------------*
      *              * Si/no dettaglio scadenze                        *
      *              *-------------------------------------------------*
           if        rr-snx-det           not  = 02
                     move  01             to   rr-snx-det             .
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Preparazione parametri per selezione stampa               *
      *    *-----------------------------------------------------------*
       pre-prm-stp-000.
      *              *-------------------------------------------------*
      *              * Flags di tipo selezione                         *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-tip-sel      .
      *              *-------------------------------------------------*
      *              * Codice stampante                                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-cod-stp      .
      *              *-------------------------------------------------*
      *              * Tipo di stampa                                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-tip-sta      .
      *              *-------------------------------------------------*
      *              * Codice modulo                                   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-cod-mod      .
      *              *-------------------------------------------------*
      *              * Tipo modulo                                     *
      *              *   - L : Libero                                  *
      *              *   - T : Tipografico                             *
      *              *-------------------------------------------------*
           move      "L"                  to   w-cnt-stp-tip-mod      .
      *              *-------------------------------------------------*
      *              * Ampiezza linea di stampa in caratteri           *
      *              *-------------------------------------------------*
           move      132                  to   w-cnt-stp-amp-lin      .
      *              *-------------------------------------------------*
      *              * Top margin in linee                             *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stp-top-lin      .
      *              *-------------------------------------------------*
      *              * Numero linee di stampa minimo                   *
      *              *-------------------------------------------------*
           move      30                   to   w-cnt-stp-lin-min      .
      *              *-------------------------------------------------*
      *              * Bottom margin in linee                          *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stp-bot-lin      .
      *              *-------------------------------------------------*
      *              * Ampiezza caratteri                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stp-amp-car      .
      *              *-------------------------------------------------*
      *              * Altezza interlinea                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stp-alt-int      .
      *              *-------------------------------------------------*
      *              * Area riservata per espansioni future            *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-esp-fut      .
      *              *-------------------------------------------------*
      *              * Area riservata per espansioni speciali          *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-fnz-spc      .
       pre-prm-stp-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : No                    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-exe-rou-srt      .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Start su archivio [sfp]                         *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "CBPADP    "         to   f-key                  .
           move      rr-cod-cbp           to   rf-sfp-cbp-pgf         .
           move      zero                 to   rf-sfp-num-adp         .
           move      rr-npg-min           to   rf-sfp-num-pgf         .
           move      "pgm/scf/fls/ioc/obj/iofsfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfp                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata                             *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-cnt-prn-flg-sub      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessun Ordine di Bonifico Bancario da stampare !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Ottenimento sequenziale archivio [sfp]          *
      *              *-------------------------------------------------*
           move      "GN"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfp                 .
      *                  *---------------------------------------------*
      *                  * Se fine file                                *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-cnt-prn-flg-sub      .
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Test su codice nostra banca                     *
      *              *-------------------------------------------------*
           if        rf-sfp-cbp-pgf       not  = rr-cod-cbp
                     go to prn-tst-max-900.
      *              *-------------------------------------------------*
      *              * Test su numero addebito                         *
      *              *-------------------------------------------------*
           if        rf-sfp-num-adp       not  = zero
                     go to prn-tst-max-900.
      *              *-------------------------------------------------*
      *              * Test su numero pagamento                        *
      *              *-------------------------------------------------*
           if        rf-sfp-num-pgf       >    rr-npg-max
                     go to prn-tst-max-900.
      *              *-------------------------------------------------*
      *              * Uscita per test superato                        *
      *              *-------------------------------------------------*
           go to     prn-tst-max-999.
       prn-tst-max-900.
      *              *-------------------------------------------------*
      *              * Uscita per test non superato                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-prn-flg-sub      .
      *                  *---------------------------------------------*
      *                  * Rilascio record [sfp]                       *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfp                 .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Test su modalita' e tipo valuta pagamento       *
      *              *-------------------------------------------------*
           if        rf-sfp-mod-pgf       =    13 and
                     rf-sfp-tvl-pgf       =    01
                     go to prn-sel-rec-100
           else      go to prn-sel-rec-900.
       prn-sel-rec-100.
      *              *-------------------------------------------------*
      *              * Selezione in funzione del tipo stampa           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo stampa      *
      *                  *---------------------------------------------*
           if        rr-tip-stp           =    01
                     go to prn-sel-rec-110
           else if   rr-tip-stp           =    02
                     go to prn-sel-rec-120
           else if   rr-tip-stp           =    03
                     go to prn-sel-rec-130.
       prn-sel-rec-110.
      *                  *---------------------------------------------*
      *                  * Tipo stampa : definitiva                    *
      *                  *---------------------------------------------*
           if        rf-sfp-fcs-uno       not  = zero
                     go to prn-sel-rec-900.
           go to     prn-sel-rec-200.
       prn-sel-rec-120.
      *                  *---------------------------------------------*
      *                  * Tipo stampa : di prova                      *
      *                  *---------------------------------------------*
           if        rf-sfp-fcs-uno       not  = zero
                     go to prn-sel-rec-900.
           go to     prn-sel-rec-200.
       prn-sel-rec-130.
      *                  *---------------------------------------------*
      *                  * Tipo stampa : ristampa                      *
      *                  *---------------------------------------------*
           if        rf-sfp-fcs-uno       not  > zero
                     go to prn-sel-rec-900.
           go to     prn-sel-rec-200.
       prn-sel-rec-200.
      *              *-------------------------------------------------*
      *              * Test su data registrazione minima               *
      *              *-------------------------------------------------*
           if        rf-sfp-dtr-pgf       <    rr-drg-min
                     go to prn-sel-rec-900.
      *              *-------------------------------------------------*
      *              * Test su data registrazione massima              *
      *              *-------------------------------------------------*
           if        rf-sfp-dtr-pgf       >    rr-drg-max
                     go to prn-sel-rec-900.
      *              *-------------------------------------------------*
      *              * Test su codice fornitore                        *
      *              *-------------------------------------------------*
           if        rr-cod-fnt           =    zero
                     go to prn-sel-rec-300.
           if        rf-sfp-cod-fnt       not  = rr-cod-fnt
                     go to prn-sel-rec-900.
       prn-sel-rec-300.
      *              *-------------------------------------------------*
      *              * Test su dipendenza fornitore                    *
      *              *-------------------------------------------------*
           if        rr-cod-fnt           =    zero
                     go to prn-sel-rec-400.
           if        rr-dpz-fnt           =    "*    "
                     go to prn-sel-rec-400.
           if        rf-sfp-dpz-fnt       not  = rr-dpz-fnt
                     go to prn-sel-rec-900.
       prn-sel-rec-400.
      *              *-------------------------------------------------*
      *              * Uscita per selezione superata                   *
      *              *-------------------------------------------------*
           go to     prn-sel-rec-999.
       prn-sel-rec-900.
      *              *-------------------------------------------------*
      *              * Uscita per selezione non superata               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-prn-flg-sub      .
      *                  *---------------------------------------------*
      *                  * Rilascio record [sfp]                       *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfp                 .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero pagina per la distinta  *
      *              *-------------------------------------------------*
           move      zero                 to   w-sta-dis-num-pag      .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo pagamento   *
      *              * nella distinta                                  *
      *              *-------------------------------------------------*
           move      zero                 to   w-sta-dis-num-prg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione totale distinta                *
      *              *-------------------------------------------------*
           move      zero                 to   w-sta-dis-tot-dis      .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni portafoglio S.I.A.    *
      *              *-------------------------------------------------*
           perform   prs-gep-sia-000      thru prs-gep-sia-999        .
      *              *-------------------------------------------------*
      *              * Intestazione foglio                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Preparazione per supporto                       *
      *              *-------------------------------------------------*
           perform   prn-ini-cic-pab-000  thru prn-ini-cic-pab-999    .
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *                                                           *
      *    * Subroutine relativa a preparazione supporto               *
      *    *-----------------------------------------------------------*
       prn-ini-cic-pab-000.
      *              *-------------------------------------------------*
      *              * Test se preparazione da eseguire                *
      *              *-------------------------------------------------*
           if        rr-snx-pab           not  = 02
                     go to prn-ini-cic-pab-900.
       prn-ini-cic-pab-100.
      *              *-------------------------------------------------*
      *              * Inizializzazioni per flusso                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero progressivo disposizione a zero      *
      *                  *---------------------------------------------*
           move      zero                 to   w-ads-sia-gen-pro      .
      *                  *---------------------------------------------*
      *                  * Totale valore disposizioni a zero           *
      *                  *---------------------------------------------*
           move      zero                 to   w-ads-sia-gen-val      .
      *                  *---------------------------------------------*
      *                  * Numero progressivo record emessi            *
      *                  *---------------------------------------------*
           move      zero                 to   w-ads-sia-gen-rpt      .
       prn-ini-cic-pab-200.
      *              *-------------------------------------------------*
      *              * Determinazione data di comodo                   *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-ads-tab-inp-dpr      .
       prn-ini-cic-pab-225.
      *              *-------------------------------------------------*
      *              * Determinazione numero ordine di bonifico        *
      *              *-------------------------------------------------*
           perform   det-sfo-num-000      thru det-sfo-num-999        .
       prn-ini-cic-pab-250.
      *              *-------------------------------------------------*
      *              * Determinazione pathname completo per il file di *
      *              * supporto per trasmissione flusso alla banca     *
      *              *-------------------------------------------------*
           move      rr-cod-cbp           to   w-ads-tab-inp-ban      .
           move      w-sfo-num-num-odb    to   w-ads-tab-inp-ndi      .
           perform   det-pat-ads-000      thru det-pat-ads-999        .
      *              *-------------------------------------------------*
      *              * Determinazione pathname completo file [ouf] in  *
      *              * formato MS-DOS                                  *
      *              *-------------------------------------------------*
           perform   ouf-fil-det-000      thru ouf-fil-det-999        .
       prn-ini-cic-pab-300.
      *              *-------------------------------------------------*
      *              * Open output file Line-Sequential                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se open da effettuare                  *
      *                  *---------------------------------------------*
           if        w-prs-tip-fsm        not  = "U"
                     go to prn-ini-cic-pab-400.
      *                  *---------------------------------------------*
      *                  * Open output                                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "ads "               to   g-nam                  .
           move      w-ads-tab-ndf-pat    to   g-pat                  .
           call      "swd/mod/prg/obj/mlsfil"
                                         using g                      .
       prn-ini-cic-pab-400.
      *              *-------------------------------------------------*
      *              * Open output file [ouf] in formato MS-DOS        *
      *              *-------------------------------------------------*
           perform   ouf-fil-opo-000      thru ouf-fil-opo-999        .
      *              *-------------------------------------------------*
      *              * Se errori : messaggio ed uscita con flag di er- *
      *              * rore                                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se controllo da effettuare             *
      *                  *---------------------------------------------*
           if        w-prs-tip-fsm        not  = "U"
                     go to prn-ini-cic-pab-600.
      *                  *---------------------------------------------*
      *                  * Controllo                                   *
      *                  *---------------------------------------------*
           if        g-sts                =    e-not-err
                     go to prn-ini-cic-pab-600.
      *                  *---------------------------------------------*
      *                  * Messaggio                                   *
      *                  *---------------------------------------------*
           move      "Attenzione : Errore nella generazione dell'archivi
      -              "o di supporto. "    to   w-err-box-err-msg      .
           move      "             Operazione non eseguita (Open error) 
      -              "!              "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
      *                  *---------------------------------------------*
      *                  * Flag ad errore                              *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-prn-flg-int      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     prn-ini-cic-pab-900.
       prn-ini-cic-pab-600.
      *              *-------------------------------------------------*
      *              * Generazione record di testa per Bonifici        *
      *              *-------------------------------------------------*
           perform   bon-000-sia-000      thru bon-000-sia-999        .
       prn-ini-cic-pab-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-ini-cic-pab-999.
       prn-ini-cic-pab-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-cic-010.
      *              *-------------------------------------------------*
      *              * Stampa totali finali                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    7
                     go to prn-fin-cic-100.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-fin-cic-999.
      *                  *---------------------------------------------*
      *                  * Salto sottolineatura per totali             *
      *                  *---------------------------------------------*
           go to     prn-fin-cic-200.
       prn-fin-cic-100.
      *                  *---------------------------------------------*
      *                  * Sottolineatura fincatura finale             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * 2 interlinee                            *
      *                      *-----------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      2                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "---  -------- -------------  ---------------------
      -              "------------------- ------------------------------
      -              "-------------------- -----------"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-fin-cic-200.
      *                  *---------------------------------------------*
      *                  * Totale generale                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * 2 interlinee                            *
      *                      *-----------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      2                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      006                  to   p-pos                  .
           move      "Totale :"           to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Totale                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      015                  to   p-pos                  .
           move      w-sta-dis-tot-dis    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-fin-cic-300.
      *                  *---------------------------------------------*
      *                  * Divisa                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Descrizione valuta base                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      030                  to   p-pos                  .
           move      c-des                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-fin-cic-400.
      *                  *---------------------------------------------*
      *                  * Data di stampa e firma                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * 3 interlinee                            *
      *                      *-----------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      3                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      067                  to   p-pos                  .
           move      "Li'"                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Data di stampa                          *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      071                  to   p-pos                  .
           move      w-key-dat-reg        to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Firma                                   *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      081                  to   p-pos                  .
           move      all   "_"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-fin-cic-800.
      *              *-------------------------------------------------*
      *              * Preparazione per supporto                       *
      *              *                                                 *
      *              * INIBITA IN QUANTO OBSOLETA                      *
      *              *-------------------------------------------------*
           perform   prn-fin-cic-pab-000  thru prn-fin-cic-pab-999    .
      *              *-------------------------------------------------*
      *              * Emissione archivio SEPA                         *
      *              *-------------------------------------------------*
           perform   prn-fin-cic-sep-000  thru prn-fin-cic-sep-999    .
       prn-fin-cic-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-fin-cic-999.
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *                                                           *
      *    * Subroutine relativa a preparazione supporto               *
      *    *-----------------------------------------------------------*
       prn-fin-cic-pab-000.
      *              *-------------------------------------------------*
      *              * Test se preparazione da eseguire                *
      *              *-------------------------------------------------*
           if        rr-snx-pab           not  = 02
                     go to prn-fin-cic-pab-900.
       prn-fin-cic-pab-100.
      *              *-------------------------------------------------*
      *              * Generazione record di coda per Bonifici         *
      *              *-------------------------------------------------*
           perform   bon-999-sia-000      thru bon-999-sia-999        .
       prn-fin-cic-pab-200.
      *              *-------------------------------------------------*
      *              * Close file Line-Sequential                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se close da effettuare                 *
      *                  *---------------------------------------------*
           if        w-prs-tip-fsm        not  = "U"
                     go to prn-fin-cic-pab-300.
      *                  *---------------------------------------------*
      *                  * Open output                                 *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mlsfil"
                                         using g                      .
       prn-fin-cic-pab-300.
      *              *-------------------------------------------------*
      *              * Close file [ouf] in formato MS-DOS              *
      *              *-------------------------------------------------*
           perform   ouf-fil-cls-000      thru ouf-fil-cls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo per la gestione del file   *
      *              * Line-Sequential                                 *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mlsfil"                         .
       prn-fin-cic-pab-800.
      *              *-------------------------------------------------*
      *              * Messaggio di emissione file                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione                                *
      *                  *---------------------------------------------*
           move      spaces               to   m-msg                  .
           string    "Archivio creato regolarmente : "
                                delimited by size
                     w-ads-tab-ndf-dos
                                delimited by spaces
                                          into m-msg                  .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-fin-cic-pab-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-fin-cic-pab-999.
       prn-fin-cic-pab-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *                                                           *
      *    * Emissione archivio SEPA                                   *
      *    *-----------------------------------------------------------*
       prn-fin-cic-sep-000.
      *              *-------------------------------------------------*
      *              * Test se preparazione da eseguire                *
      *              *-------------------------------------------------*
           if        rr-snx-pab           not  = 02
                     go to prn-fin-cic-sep-900.
       prn-fin-cic-sep-050.
      *              *-------------------------------------------------*
      *              * Apertura file di appoggio                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Concatenamenti preliminari                  *
      *                  *---------------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "cbi/"               to   w-all-str-cat (1)      .
           move      w-ads-tab-ndf-dos    to   w-all-str-cat (2)      .
           move      ".xml"               to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                  *---------------------------------------------*
      *                  * Determinazione pathname completo del file   *
      *                  *---------------------------------------------*
           move      "AS"                 to   s-ope                  .
           move      w-all-str-alf        to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Open output                                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "sepa"               to   g-nam                  .
           move      s-pat                to   g-pat                  .
           call      "swd/mod/prg/obj/mlsfil"
                                         using g                      .
       prn-fin-cic-sep-075.
      *              *-------------------------------------------------*
      *              * Emissione elementi di testata                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tag di apertura                             *
      *                  *---------------------------------------------*
           perform   emi-tag-opn-000      thru emi-tag-opn-999        .
       prn-fin-cic-sep-100.
      *              *-------------------------------------------------*
      *              * Start su file [kk0]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione chiave                         *
      *                  *---------------------------------------------*
           move      zero                 to   kk0-prg-key            .
      *                  *---------------------------------------------*
      *                  * Operazione di Start                         *
      *                  *---------------------------------------------*
           start     kk0    key not less
                            kk0-key
                            invalid key
                            go to prn-fin-cic-sep-700.
       prn-fin-cic-sep-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file di appoggio [kk0]      *
      *              *-------------------------------------------------*
           read      kk0    next
                            with no lock
                            at end
                            go to prn-fin-cic-sep-700.
       prn-fin-cic-sep-400.
      *              *-------------------------------------------------*
      *              * Emissione singolo ordine di bonifico            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tag singola disposizione                    *
      *                  *---------------------------------------------*
           perform   emi-tag-rig-000      thru emi-tag-rig-999        .
       prn-fin-cic-sep-600.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     prn-fin-cic-sep-200.
       prn-fin-cic-sep-700.
      *              *-------------------------------------------------*
      *              * Emissione dati chiusura file                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tag di chiusura                             *
      *                  *---------------------------------------------*
           perform   emi-tag-cls-000      thru emi-tag-cls-999        .
       prn-fin-cic-sep-800.
      *              *-------------------------------------------------*
      *              * Chiusura file di appoggio                       *
      *              *-------------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mlsfil"
                                         using g                      .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo per la gestione del file   *
      *              * Line-Sequential                                 *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mlsfil"                         .
       prn-fin-cic-sep-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-fin-cic-sep-999.
       prn-fin-cic-sep-999.
           exit.

      *    *===========================================================*
      *    * Emissione archivio SEPA                                   *
      *    *                                                           *
      *    * Righe di testata                                          *
      *    *-----------------------------------------------------------*
       emi-tag-opn-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione indice di indentazione xml      *
      *              *-------------------------------------------------*
           move      zero                 to   w-sta-emi-xml-inx      .
      *              *-------------------------------------------------*
      *              * Apertura file SEPA - direttiva xml              *
      *              *-------------------------------------------------*
           move      "<?xml version=""1.0"" encoding=""utf-8""?>"
                                          to   g-rec                  .
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      "PN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mlsfil"
                                         using g                      .
       emi-tag-opn-020.
      *              *-------------------------------------------------*
      *              * Apertura file SEPA                              *
      *              *-------------------------------------------------*
           move      "<CBIPaymentRequest xmlns=""urn:CBI:xsd:CBIPaymentR
      -              "equest.00.04.01"">" to   g-rec                  .
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      "PN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mlsfil"
                                         using g                      .
       emi-tag-opn-100.
      *              *-------------------------------------------------*
      *              * Apertura tag 'GrpHdr'                           *
      *              *-------------------------------------------------*
           move      "GrpHdr"             to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'MsgId'                            *
      *              *-------------------------------------------------*
           move      "MsgId"              to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-ads-tab-ndf-dos    to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'CreDtTm'                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione data e ora                     *
      *                  *                                             *
      *                  * FORMATO : AAAA-MM-GGTHH:MM:SS               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Date and time da segreteria             *
      *                      *-----------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Date and time                           *
      *                      *-----------------------------------------*
           move      s-sdt                to   r-env-dat-tim          .
      *                      *-----------------------------------------*
      *                      * Editing anno                            *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      s-saa                to   p-num                  .
           add       1900                 to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (1)      .
      *                      *-----------------------------------------*
      *                      * Editing mese                            *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      s-mes                to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (3)      .
      *                      *-----------------------------------------*
      *                      * Editing giorno                          *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      s-gio                to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (5)      .
      *                      *-----------------------------------------*
      *                      * Editing ora                             *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      s-ora                to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (7)      .
      *                      *-----------------------------------------*
      *                      * Editing minuti                          *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      s-min                to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (9)      .
      *                      *-----------------------------------------*
      *                      * Pre-assemblaggio                        *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      09                   to   w-all-str-num          .
           move      "-"                  to   w-all-str-cat (2)      .
           move      "-"                  to   w-all-str-cat (4)      .
           move      "T"                  to   w-all-str-cat (6)      .
           move      ":"                  to   w-all-str-cat (8)      .
           move      "-"                  to   w-all-str-cat (2)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                      *-----------------------------------------*
      *                      * Editing secondi                         *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      s-min                to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (3)      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      ":"                  to   w-all-str-cat (2)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "CreDtTm"            to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-all-str-alf        to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'NbOfTxs'                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione numero disposizioni            *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-ads-sia-gen-pro    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "NbOfTxs"            to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      p-edt                to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'CtrlSum'                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione totale importo disposizioni    *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      13                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-ads-sia-gen-val    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "CtrlSum"            to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      p-edt                to   w-sta-emi-xml-val      .
      *
           inspect   w-sta-emi-xml-val
                                replacing all  ","
                                          by   "."                    .
      *
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'InitgPty'                         *
      *              *                                                 *
      *              * Struttura                                       *
      *              * ---------                                       *
      *              *                                                 *
      *              * <InitgPty>                                      *
      *              *   <Nm>RAGIONE SOCIALE AZIENDA</Nm>              *
      *              *   <Id>                                          *
      *              *     <OrgId>                                     *
      *              *       <Othr>                                    *
      *              *         <Id>CUC o PARTITA IVA</Id>              *
      *              *         <Issr>CBI</Issr>                        *
      *              *       </Othr>                                   *
      *              *     </OrgId>                                    *
      *              *   </Id>                                         *
      *              * </InitgPty>                                     *
      *              *-------------------------------------------------*
           move      "InitgPty"           to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Nm' con chiusura elemento         *
      *              *-------------------------------------------------*
           move      "Nm"                 to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-prs-sia-daz-001    to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Lettura anagrafica Azienda                      *
      *              *-------------------------------------------------*
           perform   emi-tag-opn-ada-000  thru emi-tag-opn-ada-999    .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Id'                               *
      *              *-------------------------------------------------*
           move      "Id"                 to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'OrgId'                            *
      *              *-------------------------------------------------*
           move      "OrgId"              to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Othr'                             *
      *              *-------------------------------------------------*
           move      "Othr"               to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Id' con chiusura elemento         *
      *              *-------------------------------------------------*
           move      "Id"                 to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
      *
           if        w-prs-sia-cda-cuc    =    spaces
                     move  rf-ada-cod-fis to   w-sta-emi-xml-val
           else      move  w-prs-sia-cda-cuc
                                          to   w-sta-emi-xml-val      .
      *
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Issr' con chiusura elemento       *
      *              *-------------------------------------------------*
           move      "Issr"               to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "CBI"                to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'Othr'                             *
      *              *-------------------------------------------------*
           move      "Othr"               to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'OrgId'                            *
      *              *-------------------------------------------------*
           move      "OrgId"              to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'Id'                               *
      *              *-------------------------------------------------*
           move      "Id"                 to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'InitgPty'                         *
      *              *-------------------------------------------------*
           move      "InitgPty"           to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'GrpHdr'                           *
      *              *-------------------------------------------------*
           move      "GrpHdr"             to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-tag-opn-200.
      *              *-------------------------------------------------*
      *              * Apertura tag 'PmtInf'                           *
      *              *-------------------------------------------------*
           move      "PmtInf"             to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'PmtInfId'                         *
      *              *-------------------------------------------------*
           move      "PmtInfId"           to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-ads-tab-ndf-dos    to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'PmtMtd'                           *
      *              *-------------------------------------------------*
           move      "PmtMtd"             to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "TRF"                to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'BtchBookg'                       *
      *              *-------------------------------------------------*
           move      "BtchBookg"          to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "false"              to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'PmtTpInf'                         *
      *              *-------------------------------------------------*
           move      "PmtTpInf"           to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'InstrPrty'                       *
      *              *-------------------------------------------------*
           move      "InstrPrty"          to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "NORM"               to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'SvcLvl'                           *
      *              *-------------------------------------------------*
           move      "SvcLvl"             to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Emissione tag 'Cd'                              *
      *              *-------------------------------------------------*
           move      "Cd"                 to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "SEPA"               to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'SvcLvl'                           *
      *              *-------------------------------------------------*
           move      "SvcLvl"             to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'PmtTpInf'                         *
      *              *-------------------------------------------------*
           move      "PmtTpInf"           to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-tag-opn-300.
      *              *-------------------------------------------------*
      *              * Apertura tag 'ReqdExctnDt'                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Apertura tag                                *
      *                  *---------------------------------------------*
           move      "ReqdExctnDt"        to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *                  *---------------------------------------------*
      *                  * Preparazione data e ora                     *
      *                  *                                             *
      *                  * FORMATO : AAAA-MM-GG                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Date and time da segreteria             *
      *                      *-----------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Date and time                           *
      *                      *-----------------------------------------*
           move      s-sdt                to   r-env-dat-tim          .
      *                      *-----------------------------------------*
      *                      * Editing anno                            *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      s-saa                to   p-num                  .
           add       1900                 to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (1)      .
      *                      *-----------------------------------------*
      *                      * Editing mese                            *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      s-mes                to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (3)      .
      *                      *-----------------------------------------*
      *                      * Editing giorno                          *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      s-gio                to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (5)      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
           move      "-"                  to   w-all-str-cat (2)      .
           move      "-"                  to   w-all-str-cat (4)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "Dt"                 to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-all-str-alf        to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'ReqdExctnDt'                      *
      *              *-------------------------------------------------*
           move      "ReqdExctnDt"        to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Dbtr'                             *
      *              *                                                 *
      *              * Struttura                                       *
      *              * ---------                                       *
      *              *                                                 *
      *              * <Dbtr>                                          *
      *              *   <Nm>RAGIONE SOCIALE AZIENDA</Nm>              *
      *              *   <PstlAdr>                                     *
      *              *     <Ctry>IT</Ctry>                             *
      *              *     <AdrLine>INDIRIZZO AZIENDA</AdrLine>        *
      *              *     <AdrLine>LOCALITA AZIENDA</AdrLine>         *
      *              *   </PstlAdr>                                    *
      *              *   <CtryOfRes>IT</CtryOfRes>                     *
      *              * </Dbtr>                                         *
      *              *-------------------------------------------------*
           move      "Dbtr"               to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Nm' con chiusura elemento         *
      *              *-------------------------------------------------*
           move      "Nm"                 to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-prs-sia-daz-001    to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'PstlAdr'                          *
      *              *-------------------------------------------------*
           move      "PstlAdr"            to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'TwnNm'                            *
      *              *                                                 *
      *              * Attenzione alla personalizzazione 'gep001'      *
      *              *                                                 *
      *              * ___ ??? ___                                     *
      *              *-------------------------------------------------*
      *              *-------------------------------------------------*
      *              * Apertura tag 'Ctry' con chiusura elemento       *
      *              *-------------------------------------------------*
           move      "Ctry"               to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "IT"                 to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'AdrLine' con chiusura elemento    *
      *              *                                                 *
      *              * Indirizzo                                       *
      *              *-------------------------------------------------*
           move      "AdrLine"            to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      rf-ada-via-azi       to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'AdrLine' con chiusura elemento    *
      *              *                                                 *
      *              * Localita'                                       *
      *              *-------------------------------------------------*
           move      "AdrLine"            to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      rf-ada-loc-azi       to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'PstlAdr'                          *
      *              *-------------------------------------------------*
           move      "PstlAdr"            to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'CtryOfRes' con chiusura elemento  *
      *              *-------------------------------------------------*
           move      "CtryOfRes"          to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "IT"                 to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'Dbtr'                             *
      *              *-------------------------------------------------*
           move      "Dbtr"               to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-tag-opn-400.
      *              *-------------------------------------------------*
      *              * Apertura tag 'DbtrAcct'                         *
      *              *-------------------------------------------------*
           move      "DbtrAcct"           to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Id'                               *
      *              *-------------------------------------------------*
           move      "Id"                 to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'IBAN'                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [cbp]                      *
      *                  *---------------------------------------------*
           move      02                   to   w-let-arc-cbp-tip      .
           move      rr-cod-cbp           to   w-let-arc-cbp-cod      .
           perform   let-arc-cbp-000      thru let-arc-cbp-999        .
      *                  *---------------------------------------------*
      *                  * Preparazione IBAN azienda                   *
      *                  *---------------------------------------------*
           move      "EI"                 to   w-cod-cod-cin-ope      .
           move      "IT"                 to   w-cod-cod-cin-naz      .
           move      rf-cbp-cin-eur       to   w-cod-cod-cin-chd      .
           move      rf-cbp-cin-ita       to   w-cod-cod-cin-cod      .
           move      w-let-arc-cbp-abi    to   w-cod-cod-cin-abi      .
           move      w-let-arc-cbp-cab    to   w-cod-cod-cin-cab      .
           move      w-let-arc-cbp-ccb    to   w-cod-cod-cin-ccc      .
           perform   cod-cod-cin-cll-000  thru cod-cod-cin-cll-999    .
      *                  *---------------------------------------------*
      *                  * Scomposizione e ricomposizione per elimina- *
      *                  * gli spazi                                   *
      *                  *---------------------------------------------*
           move      w-cod-cod-cin-edt    to   w-all-str-alf          .
           move      " "                  to   w-all-str-del          .
           perform   all-str-ext-000      thru all-str-ext-999        .
      *
           move      40                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IBAN"               to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-all-str-alf        to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'Id'                               *
      *              *-------------------------------------------------*
           move      "Id"                 to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'DbtrAcct'                         *
      *              *-------------------------------------------------*
           move      "DbtrAcct"           to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-tag-opn-500.
      *              *-------------------------------------------------*
      *              * Apertura tag 'DbtrAgt'                          *
      *              *-------------------------------------------------*
           move      "DbtrAgt"            to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'FinInstnId'                       *
      *              *-------------------------------------------------*
           move      "FinInstnId"         to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'ClrSysMmbId'                      *
      *              *-------------------------------------------------*
           move      "ClrSysMmbId"        to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'MmbId'                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing ABI                                 *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9"                  to   v-edm                  .
           move      rr-cod-cbp-abi       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Emissione tag                               *
      *                  *---------------------------------------------*
           move      "MmbId"              to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      v-edt                to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'ClrSysMmbId'                      *
      *              *-------------------------------------------------*
           move      "ClrSysMmbId"        to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'FinInstnId'                       *
      *              *-------------------------------------------------*
           move      "FinInstnId"         to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'DbtrAgt'                          *
      *              *-------------------------------------------------*
           move      "DbtrAgt"            to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'ChrgBr'                           *
      *              *-------------------------------------------------*
           move      "ChrgBr"             to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "SLEV"               to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-tag-opn-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-tag-opn-999.
       emi-tag-opn-999.
           exit.

      *    *===========================================================*
      *    * Emissione archivio SEPA                                   *
      *    *                                                           *
      *    * Righe di testata                                          *
      *    *                                                           *
      *    * Lettura anagrafica Azienda                                *
      *    *-----------------------------------------------------------*
       emi-tag-opn-ada-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione [ada]                           *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *              *-------------------------------------------------*
      *              * Lettura [ada] Sede                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODDPZ    "         to   f-key                  .
           move      zero                 to   rf-ada-cod-dpz         .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
       emi-tag-opn-ada-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-tag-opn-ada-999.
       emi-tag-opn-ada-999.
           exit.

      *    *===========================================================*
      *    * Emissione archivio SEPA                                   *
      *    *                                                           *
      *    * Singola disposizione flusso 'xml'                         *
      *    *-----------------------------------------------------------*
       emi-tag-rig-000.
      *              *-------------------------------------------------*
      *              * Apertura 'CdtTrfTxInf'                          *
      *              *-------------------------------------------------*
           move      "CdtTrfTxInf"        to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura 'PmtId'                                *
      *              *-------------------------------------------------*
           move      "PmtId"              to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'InstrId'                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione progressivo disposizione       *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      kk0-prg-key          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "InstrId"            to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      p-edt                to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'EndToEndId'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione nome file e progressivo        *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      kk0-prg-key          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-ads-tab-ndf-dos    to   w-all-str-cat (1)      .
           move      "-"                  to   w-all-str-cat (2)      .
           move      p-edt                to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "EndToEndId"         to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      w-all-str-alf        to   w-sta-emi-xml-val      .
           move      08                   to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura 'PmtId'                                *
      *              *-------------------------------------------------*
           move      "PmtId"              to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura 'PmtTpInf'                             *
      *              *-------------------------------------------------*
           move      "PmtTpInf"           to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura 'CtgyPurp'                             *
      *              *-------------------------------------------------*
           move      "CtgyPurp"           to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Cd'                               *
      *              *-------------------------------------------------*
           move      "Cd"                 to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "SUPP"               to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura 'CtgyPurp'                             *
      *              *-------------------------------------------------*
           move      "CtgyPurp"           to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura 'PmtTpInf'                             *
      *              *-------------------------------------------------*
           move      "PmtTpInf"           to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-tag-rig-200.
      *              *-------------------------------------------------*
      *              * Apertura 'Amt'                                  *
      *              *-------------------------------------------------*
           move      "Amt"                to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'InstdAmt'                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione Importo disposizione           *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      13                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      kk0-imp-scd          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "InstdAmt Ccy=""EUR"""
                                          to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      p-edt                to   w-sta-emi-xml-val      .
      *
           inspect   w-sta-emi-xml-val
                                replacing all  ","
                                          by   "."                    .
      *
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura 'Amt'                                  *
      *              *-------------------------------------------------*
           move      "Amt"                to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-tag-rig-300.
      *              *-------------------------------------------------*
      *              * Apertura 'Cdtr'                                 *
      *              *-------------------------------------------------*
           move      "Cdtr"               to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Nm'                               *
      *              *-------------------------------------------------*
           move      "Nm"                 to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      kk0-rag-fnt          to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'CtryOfRes'                        *
      *              *-------------------------------------------------*
           move      "CtryOfRes"          to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      "IT"                 to   w-sta-emi-xml-val      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura 'Cdtr'                                 *
      *              *-------------------------------------------------*
           move      "Cdtr"               to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-tag-rig-400.
      *              *-------------------------------------------------*
      *              * Apertura 'CdtrAcct'                             *
      *              *-------------------------------------------------*
           move      "CdtrAcct"           to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Id'                               *
      *              *-------------------------------------------------*
           move      "Id"                 to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'IBAN'                             *
      *              *-------------------------------------------------*
           move      "IBAN"               to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      kk0-ibn-fnt          to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'Id'                               *
      *              *-------------------------------------------------*
           move      "Id"                 to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura 'CdtrAcct'                             *
      *              *-------------------------------------------------*
           move      "CdtrAcct"           to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-tag-rig-500.
      *              *-------------------------------------------------*
      *              * Apertura tag 'RmtInf'                           *
      *              *-------------------------------------------------*
           move      "RmtInf"             to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Apertura tag 'Ustrd'                            *
      *              *-------------------------------------------------*
           move      "Ustrd"              to   w-sta-emi-xml-pmt      .
           move      "E"                  to   w-sta-emi-xml-ope      .
           move      kk0-rif-fnt          to   w-sta-emi-xml-val      .
           move      "+"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura tag 'RmtInf'                           *
      *              *-------------------------------------------------*
           move      "RmtInf"             to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-tag-rig-800.
      *              *-------------------------------------------------*
      *              * Chiusura 'CdtTrfTxInf'                          *
      *              *-------------------------------------------------*
           move      "CdtTrfTxInf"        to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-tag-rig-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-tag-rig-999.
       emi-tag-rig-999.
           exit.

      *    *===========================================================*
      *    * Emissione archivio SEPA                                   *
      *    *                                                           *
      *    * Chiusura flusso 'xml'                                     *
      *    *-----------------------------------------------------------*
       emi-tag-cls-000.
      *              *-------------------------------------------------*
      *              * Chiusura 'PmtInf'                               *
      *              *-------------------------------------------------*
           move      "PmtInf"             to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Chiusura 'CBIPaymentRequest'                    *
      *              *-------------------------------------------------*
           move      "CBIPaymentRequest"  to   w-sta-emi-xml-pmt      .
           move      "C"                  to   w-sta-emi-xml-ope      .
           move      "-"                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
      *              *-------------------------------------------------*
      *              * Tag di commento                                 *
      *              *-------------------------------------------------*
           move      "!-- Generated by TANGRAM - wip --"
                                          to   w-sta-emi-xml-pmt      .
           move      "A"                  to   w-sta-emi-xml-ope      .
           move      "="                  to   w-sta-emi-xml-ind      .
           perform   emi-tag-xml-000      thru emi-tag-xml-999        .
       emi-tag-cls-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-tag-cls-999.
       emi-tag-cls-999.
           exit.

      *    *===========================================================*
      *    * Emissione tag 'xml'                                       *
      *    *-----------------------------------------------------------*
       emi-tag-xml-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione preliminare prompt              *
      *              *-------------------------------------------------*
           move      w-sta-emi-xml-pmt    to   w-sta-emi-xml-pma      .
           move      w-sta-emi-xml-pmt    to   w-sta-emi-xml-pmc      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo operazione      *
      *              *-------------------------------------------------*
           if        w-sta-emi-xml-ope    =    "A"
                     go to emi-tag-xml-100
           else if   w-sta-emi-xml-ope    =    "E"
                     go to emi-tag-xml-300
           else      go to emi-tag-xml-500.
       emi-tag-xml-100.
      *              *=================================================*
      *              * Composizione tag xml di apertura                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "<"                  to   w-all-str-cat (1)      .
           move      w-sta-emi-xml-pmt    to   w-all-str-cat (2)      .
           move      ">"                  to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-sta-emi-xml-str      .
      *                  *---------------------------------------------*
      *                  * Ad eventuale indentazione                   *
      *                  *---------------------------------------------*
           go to     emi-tag-xml-800.
       emi-tag-xml-300.
      *              *=================================================*
      *              * Composizione tag xml con valore                 *
      *              *                                                 *
      *              * '<prompt> valore </prompt>'                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se valore presente                     *
      *                  *---------------------------------------------*
           if        w-sta-emi-xml-val    =    spaces
                     go to emi-tag-xml-900.
      *                  *---------------------------------------------*
      *                  * Filtraggio per eliminare eventuali carat-   *
      *                  * teri incompatibili con XML                  *
      *                  *---------------------------------------------*
           inspect   w-sta-emi-xml-val
                                replacing all  "&"
                                          by   "e"                    .
      *
           inspect   w-sta-emi-xml-val
                                replacing all  "<"
                                          by   "("                    .
      *
           inspect   w-sta-emi-xml-val
                                replacing all  ">"
                                          by   ")"                    .
      *                  *---------------------------------------------*
      *                  * Test se prompt composito                    *
      *                  *---------------------------------------------*
           move      w-sta-emi-xml-pmt    to   w-all-str-alf          .
           move      " "                  to   w-all-str-del          .
           perform   all-str-ext-000      thru all-str-ext-999        .
           if        w-all-str-num        not  > 1
                     go to emi-tag-xml-320.
      *                  *---------------------------------------------*
      *                  * Scorporo prompt                             *
      *                  *---------------------------------------------*
           move      w-all-str-cat (1)    to   w-sta-emi-xml-pmc      .
       emi-tag-xml-320.
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      07                   to   w-all-str-num          .
           move      "<"                  to   w-all-str-cat (1)      .
           move      w-sta-emi-xml-pma    to   w-all-str-cat (2)      .
           move      ">"                  to   w-all-str-cat (3)      .
           move      w-sta-emi-xml-val    to   w-all-str-cat (4)      .
           move      "</"                 to   w-all-str-cat (5)      .
           move      w-sta-emi-xml-pmc    to   w-all-str-cat (6)      .
           move      ">"                  to   w-all-str-cat (7)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-sta-emi-xml-str      .
      *                  *---------------------------------------------*
      *                  * Ad eventuale indentazione                   *
      *                  *---------------------------------------------*
           go to     emi-tag-xml-800.
       emi-tag-xml-500.
      *              *=================================================*
      *              * Composizione tag xml di chiusura                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "</"                 to   w-all-str-cat (1)      .
           move      w-sta-emi-xml-pmt    to   w-all-str-cat (2)      .
           move      ">"                  to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-sta-emi-xml-str      .
      *                  *---------------------------------------------*
      *                  * Ad eventuale indentazione                   *
      *                  *---------------------------------------------*
           go to     emi-tag-xml-800.
       emi-tag-xml-800.
      *              *=================================================*
      *              * Eventuale indentazione                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione indice di indentazione       *
      *                  *---------------------------------------------*
           if        w-sta-emi-xml-ind    =    "+"
                     add      w-sta-emi-xml-tab
                                          to   w-sta-emi-xml-inx
           else if   w-sta-emi-xml-ind    =    "-"
                     subtract w-sta-emi-xml-tab
                                          from w-sta-emi-xml-inx      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza stringa            *
      *                  *---------------------------------------------*
           move      w-sta-emi-xml-str    to   w-all-str-alf          .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-lun        to   w-sta-emi-xml-lun      .
      *                  *---------------------------------------------*
      *                  * Indentazione                                *
      *                  *---------------------------------------------*
           move      spaces               to   w-all-str-alf          .
           move      w-sta-emi-xml-inx    to   w-sta-emi-xml-inw      .
           add       1                    to   w-sta-emi-xml-inw      .
           move      w-sta-emi-xml-str    to   w-all-str-alf
                                              (w-sta-emi-xml-inw :
                                               w-sta-emi-xml-lun)     .
           move      w-all-str-alf        to   w-sta-emi-xml-str      .
       emi-tag-xml-850.
      *              *=================================================*
      *              * Emissione                                       *
      *              *-------------------------------------------------*
           move      w-sta-emi-xml-str    to   g-rec                  .
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      "PN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mlsfil"
                                         using g                      .
       emi-tag-xml-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-tag-xml-999.
       emi-tag-xml-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Stampa elemento del corpo distinta              *
      *              *-------------------------------------------------*
           perform   sta-cor-dis-000      thru sta-cor-dis-999        .
      *              *-------------------------------------------------*
      *              * Preparazione per supporto                       *
      *              *-------------------------------------------------*
           perform   prn-liv-det-pab-000  thru prn-liv-det-pab-999    .
       prn-liv-det-100.
      *              *-------------------------------------------------*
      *              * Aggiornamento record [sfp]                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo stampa      *
      *                  *---------------------------------------------*
           if        rr-tip-stp           =    01
                     go to prn-liv-det-110
           else if   rr-tip-stp           =    02
                     go to prn-liv-det-120
           else if   rr-tip-stp           =    03
                     go to prn-liv-det-130.
       prn-liv-det-110.
      *                  *---------------------------------------------*
      *                  * Tipo stampa : definitiva                    *
      *                  *---------------------------------------------*
           move      01                   to   rf-sfp-fcs-uno         .
           go to     prn-liv-det-150.
       prn-liv-det-120.
      *                  *---------------------------------------------*
      *                  * Tipo stampa : di prova                      *
      *                  *---------------------------------------------*
           go to     prn-liv-det-200.
       prn-liv-det-130.
      *                  *---------------------------------------------*
      *                  * Tipo stampa : ristampa                      *
      *                  *---------------------------------------------*
           if        rf-sfp-fcs-uno       <    99
                     add  1               to   rf-sfp-fcs-uno         .
           go to     prn-liv-det-150.
       prn-liv-det-150.
      *                  *---------------------------------------------*
      *                  * Update record [sfp]                         *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfp                 .
       prn-liv-det-200.
      *                  *---------------------------------------------*
      *                  * Rilascio record [sfp]                       *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfp                 .
       prn-liv-det-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *                                                           *
      *    * Subroutine relativa a preparazione supporto               *
      *    *-----------------------------------------------------------*
       prn-liv-det-pab-000.
      *              *-------------------------------------------------*
      *              * Test se preparazione da eseguire                *
      *              *-------------------------------------------------*
           if        rr-snx-pab           not  = 02
                     go to prn-liv-det-pab-900.
       prn-liv-det-pab-050.
      *              *-------------------------------------------------*
      *              * Determinazione e bufferizzazione generalita'    *
      *              * del beneficiario per l'inoltro                  *
      *              *-------------------------------------------------*
           perform   det-gdb-inl-000      thru det-gdb-inl-999        .
       prn-liv-det-pab-100.
      *              *-------------------------------------------------*
      *              * Emissione record                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento numero progressivo disposizione  *
      *                  *---------------------------------------------*
           add       1                    to   w-ads-sia-gen-pro      .
      *                  *---------------------------------------------*
      *                  * Incremento totale disposizioni              *
      *                  *---------------------------------------------*
           add       rf-sfp-imp-pgf       to   w-ads-sia-gen-val      .
      *                  *---------------------------------------------*
      *                  * Generazione tipo record '10'                *
      *                  *---------------------------------------------*
           perform   bon-010-sia-000      thru bon-010-sia-999        .
      *                  *---------------------------------------------*
      *                  * Se errori : a chiusura ed uscita            *
      *                  *---------------------------------------------*
           if        w-ads-tab-out-flg    not  = spaces
                     go to prn-liv-det-pab-900.
      *                  *---------------------------------------------*
      *                  * Generazione tipo record '16'                *
      *                  *---------------------------------------------*
           perform   bon-016-sia-000      thru bon-016-sia-999        .
      *                  *---------------------------------------------*
      *                  * Se errori : a chiusura ed uscita            *
      *                  *---------------------------------------------*
           if        w-ads-tab-out-flg    not  = spaces
                     go to prn-liv-det-pab-900.
      *                  *---------------------------------------------*
      *                  * Generazione tipo record '17'                *
      *                  *---------------------------------------------*
           perform   bon-017-sia-000      thru bon-017-sia-999        .
      *                  *---------------------------------------------*
      *                  * Se errori : a chiusura ed uscita            *
      *                  *---------------------------------------------*
           if        w-ads-tab-out-flg    not  = spaces
                     go to prn-liv-det-pab-900.
      *                  *---------------------------------------------*
      *                  * Generazione tipo record '20'                *
      *                  *---------------------------------------------*
           perform   bon-020-sia-000      thru bon-020-sia-999        .
      *                  *---------------------------------------------*
      *                  * Se errori : a chiusura ed uscita            *
      *                  *---------------------------------------------*
           if        w-ads-tab-out-flg    not  = spaces
                     go to prn-liv-det-pab-900.
      *                  *---------------------------------------------*
      *                  * Generazione tipo record '30'                *
      *                  *---------------------------------------------*
           perform   bon-030-sia-000      thru bon-030-sia-999        .
      *                  *---------------------------------------------*
      *                  * Se errori : a chiusura ed uscita            *
      *                  *---------------------------------------------*
           if        w-ads-tab-out-flg    not  = spaces
                     go to prn-liv-det-pab-900.
      *                  *---------------------------------------------*
      *                  * Generazione tipo record '40'                *
      *                  *---------------------------------------------*
           perform   bon-040-sia-000      thru bon-040-sia-999        .
      *                  *---------------------------------------------*
      *                  * Se errori : a chiusura ed uscita            *
      *                  *---------------------------------------------*
           if        w-ads-tab-out-flg    not  = spaces
                     go to prn-liv-det-pab-900.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione scadenze appartenenti al    *
      *                  * pagamento per emissione record '50' o '60'  *
      *                  *---------------------------------------------*
           perform   buf-sfs-pag-000      thru buf-sfs-pag-999        .
      *                  *---------------------------------------------*
      *                  * Se errori : a chiusura ed uscita            *
      *                  *---------------------------------------------*
           if        w-ads-tab-out-flg    not  = spaces
                     go to prn-liv-det-pab-900.
      *                  *---------------------------------------------*
      *                  * Generazione tipo record '70'                *
      *                  *---------------------------------------------*
           perform   bon-070-sia-000      thru bon-070-sia-999        .
      *                  *---------------------------------------------*
      *                  * Se errori : a chiusura ed uscita            *
      *                  *---------------------------------------------*
           if        w-ads-tab-out-flg    not  = spaces
                     go to prn-liv-det-pab-900.
       prn-liv-det-pab-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-pab-999.
       prn-liv-det-pab-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio                                       *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Incremento numero pagina per la distinta        *
      *              *-------------------------------------------------*
           add       1                    to   w-sta-dis-num-pag      .
       int-pag-sta-600.
      *              *-------------------------------------------------*
      *              * Intestazione foglio per la presentazione        *
      *              *-------------------------------------------------*
           perform   int-pag-dob-000      thru int-pag-dob-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     int-pag-sta-999.
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio per distinta ordini di bonifico       *
      *    *-----------------------------------------------------------*
       int-pag-dob-000.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Se errore di i-o su stampa : uscita con flag di *
      *              * interruzione forzata                            *
      *              *-------------------------------------------------*
           if        p-rsc                not  = spaces
                     move  "#"            to   w-cnt-prn-flg-int
                     go to int-pag-dob-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale fisso              *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      01                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Titolo centrale                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale fisso              *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      02                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      30                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      051                  to   p-pos                  .
           move      "  DISTINTA ORDINI DI BONIFICO "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale fisso              *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      03                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Numero pagina                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale fisso              *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      05                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal                                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      126                  to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      130                  to   p-pos                  .
           move      w-sta-dis-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se non sulla prima pagina : a fincatura     *
      *                  *---------------------------------------------*
           if        w-sta-dis-num-pag    not  = 1
                     go to int-pag-dob-800.
       int-pag-dob-300.
      *              *-------------------------------------------------*
      *              * Emittente                                       *
      *              *-------------------------------------------------*
       int-pag-dob-310.
      *                  *---------------------------------------------*
      *                  * Descrizione SIA parte 1.                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      05                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      21                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Emittente           :"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      24                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      023                  to   p-pos                  .
           move      w-prs-sia-daz-001    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-315.
      *                  *---------------------------------------------*
      *                  * Descrizione SIA parte 2.                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      06                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      24                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      023                  to   p-pos                  .
           move      w-prs-sia-daz-002    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-320.
      *                  *---------------------------------------------*
      *                  * Descrizione SIA parte 3.                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      07                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      24                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      023                  to   p-pos                  .
           move      w-prs-sia-daz-003    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-325.
      *                  *---------------------------------------------*
      *                  * Descrizione SIA parte 4.                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      08                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      24                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      023                  to   p-pos                  .
           move      w-prs-sia-daz-004    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-400.
      *              *-------------------------------------------------*
      *              * Banca di presentazione                          *
      *              *-------------------------------------------------*
       int-pag-dob-405.
      *                  *---------------------------------------------*
      *                  * Lettura anagrafica istituto di credito      *
      *                  *---------------------------------------------*
           move      rr-cod-cbp-abi       to   w-let-arc-axi-cod      .
           perform   let-arc-axi-000      thru let-arc-axi-999        .
      *                  *---------------------------------------------*
      *                  * Lettura anagrafica sportello istituto di    *
      *                  * credito                                     *
      *                  *---------------------------------------------*
           move      rr-cod-cbp-abi       to   w-let-arc-axs-abi      .
           move      rr-cod-cbp-cab       to   w-let-arc-axs-cab      .
           perform   let-arc-axs-000      thru let-arc-axs-999        .
       int-pag-dob-410.
      *                  *---------------------------------------------*
      *                  * Denominazione per l'istituto di credito     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      08                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      069                  to   p-pos                  .
           move      "Spettabile"         to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      081                  to   p-pos                  .
           move      w-let-arc-axi-den    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-415.
      *                  *---------------------------------------------*
      *                  * Denominazione per lo sportello              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      09                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      081                  to   p-pos                  .
           move      w-let-arc-axs-den    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-420.
      *                  *---------------------------------------------*
      *                  * Via per lo sportello                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      10                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      081                  to   p-pos                  .
           move      w-let-arc-axs-via    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-425.
      *                  *---------------------------------------------*
      *                  * Localita' per lo sportello                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale fisso          *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      11                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      081                  to   p-pos                  .
           move      w-let-arc-axs-loc    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-500.
      *              *-------------------------------------------------*
      *              * Firma emittente S.I.A.                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale fisso              *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      11                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal                                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      21                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Firma emittente SIA :"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      023                  to   p-pos                  .
           move      w-prs-sia-fir-emi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-550.
      *              *-------------------------------------------------*
      *              * Codice azienda S.I.A.                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale fisso              *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      12                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal                                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      21                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Codice azienda SIA  :"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      023                  to   p-pos                  .
           move      w-prs-sia-cda-sia    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-600.
      *              *-------------------------------------------------*
      *              * Linea nr. 1                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale fisso              *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      15                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Si richiede a codesto Istituto di Credito di esegu
      -              "ire le seguenti disposizioni di bonifico bancario 
      -              "ordinario, che vorrete addebita-"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-700.
      *              *-------------------------------------------------*
      *              * Linea nr. 2                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale fisso              *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      17                   to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Composizione stringa                        *
      *                  *---------------------------------------------*
           move      spaces               to   w-int-pag-dob-str      .
           move      1                    to   w-int-pag-dob-pnt      .
           string    "re nel nostro c/c nr. "
                                delimited by   size
                     rr-cod-cbp-ccc
                                delimited by   size
                                          into w-int-pag-dob-str
                                  with pointer w-int-pag-dob-pnt      .
           move      zero                 to   w-int-pag-dob-pnt      .
           inspect   w-int-pag-dob-str
                                      tallying w-int-pag-dob-pnt
                                          for  trailing spaces        .
           subtract  132                  from w-int-pag-dob-pnt      .
           add       1                    to   w-int-pag-dob-pnt      .
           string    " presso di Voi."
                                delimited by   size
                                          into w-int-pag-dob-str
                                  with pointer w-int-pag-dob-pnt      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-int-pag-dob-str    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-800.
      *              *-------------------------------------------------*
      *              * Fincatura                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale relativamente al   *
      *                  * posizionamento verticale attuale            *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      p-lnr                to   p-lin                  .
           add       4                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "Prg   Valuta     Importo           Generalita' del
      -              " beneficiario                   Appoggio bancario 
      -              "e Causale            Nr. interno"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale relativamente al   *
      *                  * posizionamento verticale attuale            *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      p-lnr                to   p-lin                  .
           add       1                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "---  -------- -------------  ---------------------
      -              "------------------- ------------------------------
      -              "-------------------- -----------"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-900.
      *              *-------------------------------------------------*
      *              * Posizionamento verticale per righe corpo, rela- *
      *              * tivamente al posizionamento verticale attuale   *
      *              *-------------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      p-lnr                to   p-lin                  .
           add       2                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-dob-950.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     int-pag-dob-999.
       int-pag-dob-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazioni portafoglio S.I.A.              *
      *    *-----------------------------------------------------------*
       prs-gep-sia-000.
      *              *-------------------------------------------------*
      *              * Lettura record personalizzazioni                *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODGEP    "         to   f-key                  .
           move      10                   to   rf-gep-tip-gep         .
           move      "SIA       "         to   rf-gep-cod-gep         .
           move      "pgm/gep/fls/ioc/obj/iofgep"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-gep                 .
      *              *-------------------------------------------------*
      *              * Deviazione secondo l'esito della lettura        *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to prs-gep-sia-200
           else      go to prs-gep-sia-400.
       prs-gep-sia-200.
      *              *-------------------------------------------------*
      *              * Se record personalizzazioni esistente           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Dati record in area per ridefinizione delle *
      *                  * personalizzazioni portafoglio S.I.A.        *
      *                  *---------------------------------------------*
           move      rf-gep-dat-rec       to   w-prs-sia-dat-rec      .
      *                  *---------------------------------------------*
      *                  * Eventuali normalizzazioni                   *
      *                  *---------------------------------------------*
           if        w-prs-sia-num-aut    not  numeric
                     move  zero           to   w-prs-sia-num-aut      .
           if        w-prs-sia-dat-aut    not  numeric
                     move  zero           to   w-prs-sia-dat-aut      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prs-gep-sia-999.
       prs-gep-sia-400.
      *              *-------------------------------------------------*
      *              * Se record personalizzazioni non esistente       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione area per ridefinizione del- *
      *                  * le personalizzazioni portafoglio S.I.A.     *
      *                  *---------------------------------------------*
           move      spaces               to   w-prs-sia-daz-001      .
           move      spaces               to   w-prs-sia-daz-002      .
           move      spaces               to   w-prs-sia-daz-003      .
           move      spaces               to   w-prs-sia-daz-004      .
           move      spaces               to   w-prs-sia-fir-emi      .
           move      spaces               to   w-prs-sia-cda-sia      .
           move      spaces               to   w-prs-sia-cda-cuc      .
           move      spaces               to   w-prs-sia-cor-ndg      .
           move      spaces               to   w-prs-sia-pvc-aut      .
           move      zero                 to   w-prs-sia-num-aut      .
           move      zero                 to   w-prs-sia-dat-aut      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prs-gep-sia-999.
       prs-gep-sia-999.
           exit.

      *    *===========================================================*
      *    * Stampa elemento del corpo distinta ordini di bonifico     *
      *    *-----------------------------------------------------------*
       sta-cor-dis-000.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo pagamento nella   *
      *              * distinta                                        *
      *              *-------------------------------------------------*
           add       1                    to   w-sta-dis-num-prg      .
      *              *-------------------------------------------------*
      *              * Aggiornamento totale distinta                   *
      *              *-------------------------------------------------*
           add       rf-sfp-imp-pgf       to   w-sta-dis-tot-dis      .
      *              *-------------------------------------------------*
      *              * Determinazione e bufferizzazione generalita'    *
      *              * del beneficiario per l'inoltro                  *
      *              *-------------------------------------------------*
           perform   det-gdb-inl-000      thru det-gdb-inl-999        .
      *              *-------------------------------------------------*
      *              * Determinazione numero voci da stampare per la   *
      *              * colonna per l'appoggio bancario, con prepara-   *
      *              * zione delle aree gia' editate                   *
      *              *-------------------------------------------------*
           perform   pre-are-wcc-000      thru pre-are-wcc-999        .
      *              *-------------------------------------------------*
      *              * Determinazione numero righe necessarie per la   *
      *              * stampa dell'elemento del corpo, tenendo conto   *
      *              * che minimo sono quattro, per le generalita' del *
      *              * beneficiario, e massimo possono essere sei per  *
      *              * la colonna dell'appoggio bancario. Inoltre c'e' *
      *              * sempre una interlinea di separazione.           *
      *              *-------------------------------------------------*
           if        w-sta-dis-wcc-ntv    >    4
                     move  w-sta-dis-wcc-ntv
                                          to   w-sta-dis-num-rnc
           else      move  4              to   w-sta-dis-num-rnc      .
           add       1                    to   w-sta-dis-num-rnc      .
      *              *-------------------------------------------------*
      *              * Test se linee residue sufficienti               *
      *              *-------------------------------------------------*
           if        p-res                >    w-sta-dis-num-rnc
                     go to sta-cor-dis-100.
       sta-cor-dis-050.
      *              *-------------------------------------------------*
      *              * Se linee residue non sufficienti                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Intestazione foglio                         *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                  *---------------------------------------------*
      *                  * Se flag di interruzione stampa in On : u-   *
      *                  * scita                                       *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-cor-dis-999.
       sta-cor-dis-100.
      *              *-------------------------------------------------*
      *              * Linea 1.                                        *
      *              *-------------------------------------------------*
       sta-cor-dis-110.
      *                  *---------------------------------------------*
      *                  * Interlinea doppia                           *
      *                  *---------------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      2                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-120.
      *                  *---------------------------------------------*
      *                  * Numero progressivo                          *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-sta-dis-num-prg    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-130.
      *                  *---------------------------------------------*
      *                  * Data valuta per beneficiario                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      006                  to   p-pos                  .
           move      rf-sfp-dvf-bfc       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           go to     sta-cor-dis-140.
       sta-cor-dis-140.
      *                  *---------------------------------------------*
      *                  * Importo pagamento                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      c-dec                to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "G"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      015                  to   p-pos                  .
           move      rf-sfp-imp-pgf       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-150.
      *                  *---------------------------------------------*
      *                  * Beneficiario, ragione sociale               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      030                  to   p-pos                  .
           move      w-sta-dis-bfc-rag    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-160.
      *                  *---------------------------------------------*
      *                  * Voce per colonna per appoggio bancario      *
      *                  *---------------------------------------------*
           perform   ext-are-wcc-000      thru ext-are-wcc-999        .
           if        w-sta-dis-wcc-edt    =    spaces
                     go to sta-cor-dis-170.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      071                  to   p-pos                  .
           move      w-sta-dis-wcc-edt    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-170.
      *                  *---------------------------------------------*
      *                  * Numero pagamento                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "P"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      122                  to   p-pos                  .
           move      rf-sfp-num-pgf       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-180.
      *                  *---------------------------------------------*
      *                  * A linea 2.                                  *
      *                  *---------------------------------------------*
           go to     sta-cor-dis-200.
       sta-cor-dis-200.
      *              *-------------------------------------------------*
      *              * Linea 2.                                        *
      *              *-------------------------------------------------*
       sta-cor-dis-210.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-220.
      *                  *---------------------------------------------*
      *                  * Beneficiario, indirizzo                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      030                  to   p-pos                  .
           move      w-sta-dis-bfc-via    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-230.
      *                  *---------------------------------------------*
      *                  * Voce per colonna per appoggio bancario      *
      *                  *---------------------------------------------*
           perform   ext-are-wcc-000      thru ext-are-wcc-999        .
           if        w-sta-dis-wcc-edt    =    spaces
                     go to sta-cor-dis-240.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      071                  to   p-pos                  .
           move      w-sta-dis-wcc-edt    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-240.
      *                  *---------------------------------------------*
      *                  * A linea 3.                                  *
      *                  *---------------------------------------------*
           go to     sta-cor-dis-300.
       sta-cor-dis-300.
      *              *-------------------------------------------------*
      *              * Linea 3.                                        *
      *              *-------------------------------------------------*
       sta-cor-dis-310.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-320.
      *                  *---------------------------------------------*
      *                  * Beneficiario, localita'                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      030                  to   p-pos                  .
           move      w-sta-dis-bfc-loc    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-330.
      *                  *---------------------------------------------*
      *                  * Voce per colonna per appoggio bancario      *
      *                  *---------------------------------------------*
           perform   ext-are-wcc-000      thru ext-are-wcc-999        .
           if        w-sta-dis-wcc-edt    =    spaces
                     go to sta-cor-dis-340.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      071                  to   p-pos                  .
           move      w-sta-dis-wcc-edt    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-340.
      *                  *---------------------------------------------*
      *                  * A linea 4.                                  *
      *                  *---------------------------------------------*
           go to     sta-cor-dis-400.
       sta-cor-dis-400.
      *              *-------------------------------------------------*
      *              * Linea 4.                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Estrazione voce per colonne per appoggio    *
      *                  * bancario                                    *
      *                  *---------------------------------------------*
           perform   ext-are-wcc-000      thru ext-are-wcc-999        .
      *                  *---------------------------------------------*
      *                  * Se la voce e' a Spaces e anche il codice    *
      *                  * fornitore e' a Spaces: no linea 4           *
      *                  *---------------------------------------------*
           if        w-sta-dis-wcc-edt    =    spaces and
                     w-sta-dis-bfc-cdf    =    spaces
                     go to sta-cor-dis-430.
       sta-cor-dis-410.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-415.
      *                  *---------------------------------------------*
      *                  * Beneficiario, codice                        *
      *                  *---------------------------------------------*
           if        w-sta-dis-bfc-cdf    =    spaces
                     go to sta-cor-dis-420.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      030                  to   p-pos                  .
           move      w-sta-dis-bfc-cdf    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-420.
      *                  *---------------------------------------------*
      *                  * Voce per colonna per appoggio bancario      *
      *                  *---------------------------------------------*
           if        w-sta-dis-wcc-edt    =    spaces
                     go to sta-cor-dis-430.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      071                  to   p-pos                  .
           move      w-sta-dis-wcc-edt    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-430.
      *                  *---------------------------------------------*
      *                  * A linea 5.                                  *
      *                  *---------------------------------------------*
           go to     sta-cor-dis-500.
       sta-cor-dis-500.
      *              *-------------------------------------------------*
      *              * Linea 5.                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Estrazione voce per colonne per appoggio    *
      *                  * bancario                                    *
      *                  *---------------------------------------------*
           perform   ext-are-wcc-000      thru ext-are-wcc-999        .
      *                  *---------------------------------------------*
      *                  * Se voce a Spaces : no linea 5               *
      *                  *---------------------------------------------*
           if        w-sta-dis-wcc-edt    =    spaces
                     go to sta-cor-dis-600.
       sta-cor-dis-510.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-520.
      *                  *---------------------------------------------*
      *                  * Voce per colonna per appoggio bancario      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      071                  to   p-pos                  .
           move      w-sta-dis-wcc-edt    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-600.
      *              *-------------------------------------------------*
      *              * Linea 6.                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Estrazione voce per colonne per appoggio    *
      *                  * bancario                                    *
      *                  *---------------------------------------------*
           perform   ext-are-wcc-000      thru ext-are-wcc-999        .
      *                  *---------------------------------------------*
      *                  * Se voce a Spaces : no linea 6               *
      *                  *---------------------------------------------*
           if        w-sta-dis-wcc-edt    =    spaces
                     go to sta-cor-dis-700.
       sta-cor-dis-610.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-620.
      *                  *---------------------------------------------*
      *                  * Voce per colonna per appoggio bancario      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      071                  to   p-pos                  .
           move      w-sta-dis-wcc-edt    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-700.
      *              *-------------------------------------------------*
      *              * Eventuale riferimenti a scadenze                *
      *              *-------------------------------------------------*
           perform   sta-cor-dis-rif-000  thru sta-cor-dis-rif-999    .
       sta-cor-dis-800.
      *              *-------------------------------------------------*
      *              * Raccolta dati per emissione finale file SEPA    *
      *              *-------------------------------------------------*
           perform   sta-cor-dis-sep-000  thru sta-cor-dis-sep-999    .
       sta-cor-dis-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     sta-cor-dis-999.
       sta-cor-dis-999.
           exit.

      *    *===========================================================*
      *    * Stampa elemento del corpo distinta ordini di bonifico     *
      *    *                                                           *
      *    * Ciclo di scansione scadenze appartenenti al pagamento     *
      *    *-----------------------------------------------------------*
       sta-cor-dis-rif-000.
      *              *-------------------------------------------------*
      *              * Test se da stampare                             *
      *              *-------------------------------------------------*
           if        rr-snx-det           not  = 02
                     go to sta-cor-dis-rif-900.
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-sta-dis-num-scf      .
       sta-cor-dis-rif-100.
      *              *-------------------------------------------------*
      *              * Start su archivio [sfs]                         *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "PGFSCF    "         to   f-key                  .
           move      rf-sfp-num-pgf       to   rf-sfs-num-pgf         .
           move      zero                 to   rf-sfs-num-scf         .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to sta-cor-dis-rif-900.
       sta-cor-dis-rif-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale record [sfs]                *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At End'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to sta-cor-dis-rif-900.
       sta-cor-dis-rif-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-sfs-num-pgf       not  = rf-sfp-num-pgf
                     go to sta-cor-dis-rif-900.
       sta-cor-dis-rif-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento numero scadenze incontrate       *
      *                  *---------------------------------------------*
           add       1                    to   w-sta-dis-num-scf      .
       sta-cor-dis-rif-500.
      *              *-------------------------------------------------*
      *              * Stampa intestazione                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da effettuare                       *
      *                  *---------------------------------------------*
           if        w-sta-dis-num-scf    >    1
                     go to sta-cor-dis-rif-600.
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    7
                     go to sta-cor-dis-rif-520.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-cor-dis-rif-900.
       sta-cor-dis-rif-520.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Fincatura - linea 1.                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      071                  to   p-pos                  .
           move      "------------------[ Riferimenti ]-----------------
      -              ""                   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Fincatura - linea 2.                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      071                  to   p-pos                  .
           move      "Tipo Doc    Numero      Data     Importo Doc/Rata 
      -              ""                   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Fincatura - linea 2.                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      071                  to   p-pos                  .
           move      "--------  ----------  --------  ------------------
      -              ""                   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-rif-600.
      *              *-------------------------------------------------*
      *              * Stampa riferimenti scadenza                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    1
                     go to sta-cor-dis-rif-620.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-cor-dis-rif-900.
       sta-cor-dis-rif-620.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Tipo documento di riferimento               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      071                  to   p-pos                  .
      *
           if        rf-sfs-tip-ddr       =    01
                     move  "Fattura "     to   p-alf
           else if   rf-sfs-tip-ddr       =    02
                     move  "Nota add"     to   p-alf
           else if   rf-sfs-tip-ddr       =    11
                     move  "Nota acc"     to   p-alf
           else if   rf-sfs-tip-ddr       =    51
                     move  "Preavv. "     to   p-alf
           else      move  "........"     to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero documento di riferimento             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      081                  to   p-pos                  .
           move      rf-sfs-num-ddr       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data documento di riferimento               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      093                  to   p-pos                  .
           move      rf-sfs-dat-ddr       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valuta documento di riferimento             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      103                  to   p-pos                  .
           move      rf-sfs-sgl-vlt       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Importo documento di riferimento            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           if        rf-sfs-imp-ddr       >    999999999 or
                     rf-sfs-imp-ddr       <   -999999999
                     move  11             to   p-car
                     move  "B"            to   p-edm
           else      move  09             to   p-car
                     move  "GB"           to   p-edm                  .
           move      rf-sfs-dec-vlt       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      108                  to   p-pos                  .
           if        p-dec                =    zero
                     add   1              to   p-pos                  .
           move      rf-sfs-imp-ddr       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-rif-700.
      *              *-------------------------------------------------*
      *              * Eventuale riga aggiuntiva per riferimenti rata  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se importo documento uguale ad importo *
      *                  * scadenza                                    *
      *                  *---------------------------------------------*
           if        rf-sfs-iiv-scf       =    rf-sfs-imp-ddr
                     go to sta-cor-dis-rif-800.
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    1
                     go to sta-cor-dis-rif-720.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-cor-dis-rif-900.
       sta-cor-dis-rif-720.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Rata scadenza                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      104                  to   p-pos                  .
           move      rf-sfs-nra-ddr       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Importo scadenza                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           if        rf-sfs-iiv-scf       >    999999999 or
                     rf-sfs-iiv-scf       <   -999999999
                     move  11             to   p-car
                     move  "B"            to   p-edm
           else      move  09             to   p-car
                     move  "GB"           to   p-edm                  .
           move      rf-sfs-dec-vlt       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      108                  to   p-pos                  .
           if        p-dec                =    zero
                     add   1              to   p-pos                  .
           move      rf-sfs-iiv-scf       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       sta-cor-dis-rif-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     sta-cor-dis-rif-200.
       sta-cor-dis-rif-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     sta-cor-dis-rif-999.
       sta-cor-dis-rif-999.
           exit.

      *    *===========================================================*
      *    * Stampa elemento del corpo distinta ordini di bonifico     *
      *    *                                                           *
      *    * Raccolta dati per emissione finale file SEPA              *
      *    *-----------------------------------------------------------*
       sta-cor-dis-sep-000.
      *              *-------------------------------------------------*
      *              * Test se preparazione da eseguire                *
      *              *-------------------------------------------------*
           if        rr-snx-pab           not  = 02
                     go to sta-cor-dis-sep-900.
       sta-cor-dis-sep-100.
      *              *-------------------------------------------------*
      *              * Aggiornamento contatore                         *
      *              *-------------------------------------------------*
           move      w-sta-dis-num-prg    to   kk0-prg-key            .
      *              *-------------------------------------------------*
      *              * Area dati                                       *
      *              *-------------------------------------------------*
           move      rf-sfp-cod-fnt       to   kk0-cod-fnt            .
           move      w-sta-dis-bfc-rag    to   kk0-rag-fnt            .
       sta-cor-dis-sep-200.
      *              *-------------------------------------------------*
      *              * IBAN Fornitore                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "EI"                 to   w-cod-cod-cin-ope      .
           move      "IT"                 to   w-cod-cod-cin-naz      .
           move      rf-dcf-cin-eur       to   w-cod-cod-cin-chd      .
           move      rf-dcf-cin-ita       to   w-cod-cod-cin-cod      .
           move      rf-dcf-cod-abi       to   w-cod-cod-cin-abi      .
           move      rf-dcf-cod-cab       to   w-cod-cod-cin-cab      .
           move      rf-dcf-ccc-app       to   w-cod-cod-cin-ccc      .
           perform   cod-cod-cin-cll-000  thru cod-cod-cin-cll-999    .
      *                  *---------------------------------------------*
      *                  * Scomposizione e ricomposizione per elimina- *
      *                  * gli spazi                                   *
      *                  *---------------------------------------------*
           move      w-cod-cod-cin-edt    to   w-all-str-alf          .
           move      " "                  to   w-all-str-del          .
           perform   all-str-ext-000      thru all-str-ext-999        .
      *
           move      40                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *
           move      w-all-str-alf        to   kk0-ibn-fnt            .
      *                  *---------------------------------------------*
      *                  * Eventuale messaggio di errore               *
      *                  *---------------------------------------------*
           if        kk0-ibn-fnt          not  = spaces
                     go to sta-cor-dis-sep-400.
      *                  *---------------------------------------------*
      *                  * Editing codice fornitore                    *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      rf-sfp-cod-fnt       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Preparazione                                *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "ATTENZIONE: codice Fornitore "
                                          to   w-all-str-cat (1)      .
           move      p-edt                to   w-all-str-cat (2)      .
           move      "privo di IBAN!"     to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-all-str-alf        to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Sottolineatura                              *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      all "*"              to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       sta-cor-dis-sep-400.
      *              *-------------------------------------------------*
      *              * Importo scadenza                                *
      *              *-------------------------------------------------*
           move      rf-sfp-imp-pgf       to   kk0-imp-scd            .
      *              *-------------------------------------------------*
      *              * Riferimenti                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione scadenze appartenenti al    *
      *                  * pagamento per emissione record '50' o '60'  *
      *                  *---------------------------------------------*
           perform   buf-sfs-pag-000      thru buf-sfs-pag-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione                              *
      *                  *---------------------------------------------*
           move      w-ads-sia-gen-des (1)
                                          to   kk0-rif-fnt            .
       sta-cor-dis-sep-800.
      *              *-------------------------------------------------*
      *              * Scrittura record [kk0]                          *
      *              *-------------------------------------------------*
           write     kk0-rec                                          .
       sta-cor-dis-sep-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     sta-cor-dis-sep-999.
       sta-cor-dis-sep-999.
           exit.

      *    *===========================================================*
      *    * Determinazione e bufferizzazione generalita' del benefi-  *
      *    * ciario per l'inoltro                                      *
      *    *-----------------------------------------------------------*
       det-gdb-inl-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo di inoltro per il *
      *              * pagamento                                       *
      *              *-------------------------------------------------*
           if        rf-sfp-inl-pgf       =    01
                     go to det-gdb-inl-200
           else if   rf-sfp-inl-pgf       =    02
                     go to det-gdb-inl-400
           else if   rf-sfp-inl-pgf       =    03
                     go to det-gdb-inl-600
           else      go to det-gdb-inl-400.
       det-gdb-inl-200.
      *              *-------------------------------------------------*
      *              * Se inoltro alla sede commerciale                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se codice creditore a zero : a lettura da   *
      *                  * anagrafica fornitore contabile              *
      *                  *---------------------------------------------*
           if        rf-sfp-cod-fnt       =    zero
                     go to det-gdb-inl-400.
      *                  *---------------------------------------------*
      *                  * Lettura da anagrafica fornitore commerciale *
      *                  * per la sede                                 *
      *                  *---------------------------------------------*
           move      "C"                  to   w-let-arc-dcf-tle      .
           move      rf-sfp-cod-fnt       to   w-let-arc-dcf-cod      .
           move      spaces               to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                  *---------------------------------------------*
      *                  * Se record non trovato : a lettura da ana-   *
      *                  * grafica fornitore contabile                 *
      *                  *---------------------------------------------*
           if        w-let-arc-dcf-flg    not  = spaces
                     go to det-gdb-inl-400.
      *                  *---------------------------------------------*
      *                  * Se record trovato                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Spostamento dati                        *
      *                      *-----------------------------------------*
           move      w-let-arc-dcf-rag    to   w-sta-dis-bfc-rag      .
           move      w-let-arc-dcf-via    to   w-sta-dis-bfc-via      .
           move      w-let-arc-dcf-loc    to   w-sta-dis-bfc-loc      .
      *                      *-----------------------------------------*
      *                      * A codice fornitore                      *
      *                      *-----------------------------------------*
           go to     det-gdb-inl-900.
       det-gdb-inl-400.
      *              *-------------------------------------------------*
      *              * Se inoltro alla sede legale                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura da anagrafica fornitore contabile   *
      *                  *---------------------------------------------*
           move      rf-sfp-cod-fnt       to   w-let-arc-fnt-cod      .
           perform   let-arc-fnt-000      thru let-arc-fnt-999        .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se record trovato op-  *
      *                  * pure no                                     *
      *                  *---------------------------------------------*
           if        w-let-arc-fnt-flg    =    spaces
                     go to det-gdb-inl-420
           else      go to det-gdb-inl-440.
       det-gdb-inl-420.
      *                  *---------------------------------------------*
      *                  * Se record trovato                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Spostamento dati                        *
      *                      *-----------------------------------------*
           move      w-let-arc-fnt-rag    to   w-sta-dis-bfc-rag      .
           move      w-let-arc-fnt-via    to   w-sta-dis-bfc-via      .
           move      w-let-arc-fnt-loc    to   w-sta-dis-bfc-loc      .
      *                      *-----------------------------------------*
      *                      * A codice fornitore                      *
      *                      *-----------------------------------------*
           go to     det-gdb-inl-900.
       det-gdb-inl-440.
      *                  *---------------------------------------------*
      *                  * Se record non trovato                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Riempimento con puntini                 *
      *                      *-----------------------------------------*
           move      all   "."            to   w-sta-dis-bfc-rag      .
           move      all   "."            to   w-sta-dis-bfc-via      .
           move      all   "."            to   w-sta-dis-bfc-loc      .
      *                      *-----------------------------------------*
      *                      * A codice fornitore                      *
      *                      *-----------------------------------------*
           go to     det-gdb-inl-900.
       det-gdb-inl-600.
      *              *-------------------------------------------------*
      *              * Se inoltro alla dipendenza                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se codice fornitore a zero : a lettura da   *
      *                  * anagrafica fornitore commerciale            *
      *                  *---------------------------------------------*
           if        rf-sfp-cod-fnt       =    zero
                     go to det-gdb-inl-200.
      *                  *---------------------------------------------*
      *                  * Se codice dipendenza a spaces : a lettura   *
      *                  * anagrafica fornitore commerciale            *
      *                  *---------------------------------------------*
           if        rf-sfp-dpz-fnt       =    spaces
                     go to det-gdb-inl-200.
      *                  *---------------------------------------------*
      *                  * Lettura da anagrafica fornitore commerciale *
      *                  * per la dipendenza                           *
      *                  *---------------------------------------------*
           move      "D"                  to   w-let-arc-dcf-tle      .
           move      rf-sfp-cod-fnt       to   w-let-arc-dcf-cod      .
           move      rf-sfp-dpz-fnt       to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
      *                  *---------------------------------------------*
      *                  * Se record non trovato : a lettura da ana-   *
      *                  * grafica fornitore commerciale               *
      *                  *---------------------------------------------*
           if        w-let-arc-dcf-flg    not  = spaces
                     go to det-gdb-inl-200.
      *                  *---------------------------------------------*
      *                  * Se record trovato                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Spostamento dati                        *
      *                      *-----------------------------------------*
           move      w-let-arc-dcf-rag    to   w-sta-dis-bfc-rag      .
           move      w-let-arc-dcf-via    to   w-sta-dis-bfc-via      .
           move      w-let-arc-dcf-loc    to   w-sta-dis-bfc-loc      .
      *                      *-----------------------------------------*
      *                      * A codice fornitore                      *
      *                      *-----------------------------------------*
           go to     det-gdb-inl-900.
       det-gdb-inl-900.
      *              *-------------------------------------------------*
      *              * Codice del fornitore                            *
      *              *-------------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione codice fornitore        *
      *                      *-----------------------------------------*
           move      spaces               to   w-sta-dis-bfc-cdf      .
       det-gdb-inl-932.
      *                      *-----------------------------------------*
      *                      * Codice fornitore, con il seguente for-  *
      *                      * mato :                                  *
      *                      *                                         *
      *                      * Codice fornitore : X/NNNNNNN/DDDD       *
      *                      *                                         *
      *                      * dove :                                  *
      *                      *                                         *
      *                      * X       : F = Fornitore                 *
      *                      *                                         *
      *                      * NNNNNNN : Codice fornitore              *
      *                      *                                         *
      *                      * DDDD    : Sigla della dipendenza        *
      *                      *                                         *
      *                      *-----------------------------------------*
       det-gdb-inl-933.
      *                          *-------------------------------------*
      *                          * Editing preliminare codice fornito- *
      *                          * re                                  *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      rf-sfp-cod-fnt       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Deviazione a seconda se c'e' o no   *
      *                          * la dipendenza                       *
      *                          *-------------------------------------*
           if        rf-sfp-dpz-fnt       not  = spaces
                     go to det-gdb-inl-936.
       det-gdb-inl-935.
      *                              *---------------------------------*
      *                              * Se non c'e' dipendenza          *
      *                              *---------------------------------*
           string    " - Codice creditore : F/"
                                delimited by   size
                     p-edt      delimited by   spaces
                                          into w-sta-dis-bfc-cdf      .
           go to     det-gdb-inl-940.
       det-gdb-inl-936.
      *                              *---------------------------------*
      *                              * Se c'e' dipendenza              *
      *                              *---------------------------------*
           string    " - Codice creditore : F/"
                                delimited by   size
                     p-edt      delimited by   spaces
                     "-"        delimited by   size
                     rf-sfp-dpz-fnt
                                delimited by   spaces
                                          into w-sta-dis-bfc-cdf      .
           go to     det-gdb-inl-940.
       det-gdb-inl-940.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     det-gdb-inl-999.
       det-gdb-inl-999.
           exit.

      *    *===========================================================*
      *    * Determinazione numero voci da stampare per la colonna per *
      *    * l'appoggio bancario, con preparazione delle aree gia' e-  *
      *    * ditate                                                    *
      *    *-----------------------------------------------------------*
       pre-are-wcc-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione aree gia' editate              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Per codice ABI                              *
      *                  *---------------------------------------------*
           move      spaces               to   w-sta-dis-ecc-e01      .
      *                  *---------------------------------------------*
      *                  * Per codice CAB, denominazione               *
      *                  *---------------------------------------------*
           move      spaces               to   w-sta-dis-ecc-e02      .
      *                  *---------------------------------------------*
      *                  * Per codice CAB, localita'                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-sta-dis-ecc-e03      .
      *                  *---------------------------------------------*
      *                  * Per C/C e CIN                               *
      *                  *---------------------------------------------*
           move      spaces               to   w-sta-dis-ecc-e04      .
      *                  *---------------------------------------------*
      *                  * Per causale della scadenza nr. 1            *
      *                  *---------------------------------------------*
           move      spaces               to   w-sta-dis-ecc-e05      .
      *                  *---------------------------------------------*
      *                  * Per causale della scadenza nr. 2            *
      *                  *---------------------------------------------*
           move      spaces               to   w-sta-dis-ecc-e06      .
      *                  *---------------------------------------------*
      *                  * Per estremi documento di riferimento        *
      *                  *---------------------------------------------*
           move      zero                 to   w-sta-dis-tip-ddr (1)  .
           move      zero                 to   w-sta-dis-dat-ddr (1)  .
           move      spaces               to   w-sta-dis-num-ddr (1)  .
           move      zero                 to   w-sta-dis-tip-ddr (2)  .
           move      zero                 to   w-sta-dis-dat-ddr (2)  .
           move      spaces               to   w-sta-dis-num-ddr (2)  .
       pre-are-wcc-100.
      *              *-------------------------------------------------*
      *              * Preparazione area editata per codice ABI        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se Codice ABI per l'appoggio a zero : nes-  *
      *                  * sun editing, e si omette anche la prepara-  *
      *                  * zione per il codice CAB, sia per la deno-   *
      *                  * minazione che per la localita'              *
      *                  *---------------------------------------------*
           if        rf-sfp-abi-pgf       =    zero
                     go to pre-are-wcc-400.
      *                  *---------------------------------------------*
      *                  * Lettura codice ABI banca d'appoggio         *
      *                  *---------------------------------------------*
           move      rf-sfp-abi-pgf       to   w-let-arc-axi-cod      .
           perform   let-arc-axi-000      thru let-arc-axi-999        .
      *                  *---------------------------------------------*
      *                  * Se record non esistente : nessun editing, e *
      *                  * si omette anche la preparazione per il co-  *
      *                  * dice CAB, sia per la denominazione che per  *
      *                  * la localita'                                *
      *                  *---------------------------------------------*
           if        w-let-arc-axi-flg    not  = spaces
                     go to pre-are-wcc-400.
      *                  *---------------------------------------------*
      *                  * Se denominazione a Spaces : nessun editing, *
      *                  * e si omette anche la preparazione per il    *
      *                  * codice CAB, sia per la denominazione che    *
      *                  * per la localita'                            *
      *                  *---------------------------------------------*
           if        w-let-arc-axi-den    =    spaces
                     go to pre-are-wcc-400.
       pre-are-wcc-120.
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "ABI"                to   w-sta-dis-ecc-l01      .
      *                      *-----------------------------------------*
      *                      * Codice                                  *
      *                      *-----------------------------------------*
           move      rf-sfp-abi-pgf       to   w-sta-dis-ecc-c01      .
      *                      *-----------------------------------------*
      *                      * Denominazione                           *
      *                      *-----------------------------------------*
           move      w-let-arc-axi-den    to   w-sta-dis-ecc-d01      .
       pre-are-wcc-200.
      *              *-------------------------------------------------*
      *              * Preparazione area editata per codice CAB, deno- *
      *              * minazione                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se Codice CAB per l'appoggio a zero : nes-  *
      *                  * sun editing                                 *
      *                  *---------------------------------------------*
           if        rf-sfp-cab-pgf       =    zero
                     go to pre-are-wcc-300.
      *                  *---------------------------------------------*
      *                  * Lettura sportello CAB per d'appoggio        *
      *                  *---------------------------------------------*
           move      rf-sfp-abi-pgf       to   w-let-arc-axs-abi      .
           move      rf-sfp-cab-pgf       to   w-let-arc-axs-cab      .
           perform   let-arc-axs-000      thru let-arc-axs-999        .
      *                  *---------------------------------------------*
      *                  * Se record non esistente : nessun editing, e *
      *                  * si omette la preparazione per il codice CAB *
      *                  * sia per la denominazione che per la locali- *
      *                  * ta'                                         *
      *                  *---------------------------------------------*
           if        w-let-arc-axs-flg    not  = spaces
                     go to pre-are-wcc-400.
      *                  *---------------------------------------------*
      *                  * Se denominazione a Spaces : nessun editing, *
      *                  * e si omette la preparazione per il codice   *
      *                  * CAB, sia per la denominazione che per la    *
      *                  * localita'                                   *
      *                  *---------------------------------------------*
           if        w-let-arc-axs-den    =    spaces
                     go to pre-are-wcc-400.
       pre-are-wcc-220.
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "CAB"                to   w-sta-dis-ecc-l02      .
      *                      *-----------------------------------------*
      *                      * Codice                                  *
      *                      *-----------------------------------------*
           move      rf-sfp-cab-pgf       to   w-sta-dis-ecc-c02      .
      *                      *-----------------------------------------*
      *                      * Denominazione                           *
      *                      *-----------------------------------------*
           move      w-let-arc-axs-den    to   w-sta-dis-ecc-d02      .
       pre-are-wcc-300.
      *              *-------------------------------------------------*
      *              * Preparazione area editata per codice CAB, loca- *
      *              * lita'                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se localita' a Spaces : nessun editing      *
      *                  *---------------------------------------------*
           if        w-let-arc-axs-loc    =    spaces
                     go to pre-are-wcc-400.
       pre-are-wcc-320.
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Denominazione                           *
      *                      *-----------------------------------------*
           move      w-let-arc-axs-loc    to   w-sta-dis-ecc-l03      .
       pre-are-wcc-400.
      *              *-------------------------------------------------*
      *              * Preparazione area editata per codice C/C o IBAN *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se C/C a Spaces : nessun editing            *
      *                  *---------------------------------------------*
           if        rf-sfp-ccc-pgf       =    spaces
                     go to pre-are-wcc-500.
       pre-are-wcc-420.
      *                  *---------------------------------------------*
      *                  * Test preliminare se IBAN o BBAN o C/C       *
      *                  *                                             *
      *                  * Se manca anche solo uno dei seguenti ele-   *
      *                  * menti :                                     *
      *                  *                                             *
      *                  *  - Codice ABI                               *
      *                  *  - Codice CAB                               *
      *                  *  - Codice C/C                               *
      *                  *  - CIN italiano                             *
      *                  *                                             *
      *                  * si esce con C/C                             *
      *                  *                                             *
      *                  * Se manca anche solo uno dei seguenti ele-   *
      *                  * menti :                                     *
      *                  *                                             *
      *                  *  - CIN europeo                              *
      *                  *                                             *
      *                  * si esce con BBAN                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        rf-sfp-abi-pgf       =    zero   or
                     rf-sfp-cab-pgf       =    zero   or
                     rf-sfp-ccc-pgf       =    spaces or
                     w-let-arc-dcf-cit    =    spaces
                     go to pre-are-wcc-480.
      *                      *-----------------------------------------*
      *                      * Editing ABI                             *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9"                  to   v-edm                  .
           move      rf-sfp-abi-pgf       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-all-str-cat (4)      .
      *                      *-----------------------------------------*
      *                      * Editing CAB                             *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9"                  to   v-edm                  .
           move      rf-sfp-cab-pgf       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-all-str-cat (5)      .
      *                      *-----------------------------------------*
      *                      * Completamento                           *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      06                   to   w-all-str-num          .
      *
           if        w-let-arc-dcf-ceu    =    spaces
                     move  spaces         to   w-all-str-cat (1)
           else      move  "IT"           to   w-all-str-cat (1)      .
      *
           move      w-let-arc-dcf-ceu    to   w-all-str-cat (2)      .
           move      w-let-arc-dcf-cit    to   w-all-str-cat (3)      .
           move      rf-sfp-ccc-pgf       to   w-all-str-cat (6)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           if        w-let-arc-dcf-ceu    =    spaces
                     move  "BBAN"         to   w-sta-dis-ecc-l04
           else      move  "IBAN"         to   w-sta-dis-ecc-l04      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      w-all-str-alf        to   w-sta-dis-ecc-v04      .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     pre-are-wcc-500.
       pre-are-wcc-480.
      *                  *---------------------------------------------*
      *                  * Editing C/C                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "C/C     :"          to   w-sta-dis-ecc-l04      .
      *                      *-----------------------------------------*
      *                      * Valore                                  *
      *                      *-----------------------------------------*
           move      rf-sfp-ccc-pgf       to   w-sta-dis-ecc-v04      .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     pre-are-wcc-500.
       pre-are-wcc-500.
      *              *-------------------------------------------------*
      *              * Determinazione numero scadenze appartenenti al  *
      *              * pagamento                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se lettura da fare                     *
      *                  *---------------------------------------------*
           if        rr-snx-det           =    02
                     go to pre-are-wcc-700.
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-sta-dis-num-scf      .
      *                  *---------------------------------------------*
      *                  * Start su archivio [sfs]                     *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "PGFSCF    "         to   f-key                  .
           move      rf-sfp-num-pgf       to   rf-sfs-num-pgf         .
           move      zero                 to   rf-sfs-num-scf         .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to pre-are-wcc-520.
       pre-are-wcc-510.
      *                  *---------------------------------------------*
      *                  * Lettura sequenziale record [sfs]            *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At End'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to pre-are-wcc-520.
      *                  *---------------------------------------------*
      *                  * Test sul massimo                            *
      *                  *---------------------------------------------*
           if        rf-sfs-num-pgf       not  = rf-sfp-num-pgf
                     go to pre-are-wcc-520.
      *                  *---------------------------------------------*
      *                  * Incremento numero scadenze incontrate       *
      *                  *---------------------------------------------*
           add       1                    to   w-sta-dis-num-scf      .
      *                  *---------------------------------------------*
      *                  * Se oltre 2 scadenze : oltre                 *
      *                  *---------------------------------------------*
           if        w-sta-dis-num-scf    >    2
                     go to pre-are-wcc-520.
      *                  *---------------------------------------------*
      *                  * Memorizzazione estremi documento di riferi- *
      *                  * mento                                       *
      *                  *---------------------------------------------*
           move      rf-sfs-tip-ddr       to   w-sta-dis-tip-ddr
                                              (w-sta-dis-num-scf)     .
           move      rf-sfs-dat-ddr       to   w-sta-dis-dat-ddr
                                              (w-sta-dis-num-scf)     .
           move      rf-sfs-num-ddr       to   w-sta-dis-num-ddr
                                              (w-sta-dis-num-scf)     .
      *                  *---------------------------------------------*
      *                  * Riciclo su lettura sequenziale record [sfs] *
      *                  *---------------------------------------------*
           go to     pre-are-wcc-510.
       pre-are-wcc-520.
      *              *-------------------------------------------------*
      *              * Se nessuna scadenza per il pagamento : nessun   *
      *              * editing, continuazione                          *
      *              *-------------------------------------------------*
           if        w-sta-dis-num-scf    =    zero
                     go to pre-are-wcc-700.
      *              *-------------------------------------------------*
      *              * Se piu' di due scadenze per il pagamento : nes- *
      *              * sun editing, continuazione                      *
      *              *-------------------------------------------------*
           if        w-sta-dis-num-scf    >    2
                     go to pre-are-wcc-700.
      *              *-------------------------------------------------*
      *              * Preparazione area editata per causale del paga- *
      *              * mento nr. 1                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione della data del   *
      *                      * documento di riferimento                *
      *                      *-----------------------------------------*
           if        w-sta-dis-dat-ddr (1)
                                          =    zero
                     go to pre-are-wcc-530
           else      go to pre-are-wcc-540.
       pre-are-wcc-530.
      *                      *-----------------------------------------*
      *                      * Se data del documento di riferimento a  *
      *                      * zero                                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Nessun editing, continuazione       *
      *                          *-------------------------------------*
           go to     pre-are-wcc-600.
       pre-are-wcc-540.
      *                      *-----------------------------------------*
      *                      * Se data del documento di riferimento    *
      *                      * diversa da zero                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "Causale :"          to   w-sta-dis-ecc-l05      .
      *                          *-------------------------------------*
      *                          * Deviazione in funzione del tipo di  *
      *                          * documento                           *
      *                          *-------------------------------------*
           if        w-sta-dis-tip-ddr (1)
                                          =    01
                     go to pre-are-wcc-550
           else if   w-sta-dis-tip-ddr (1)
                                          =    02
                     go to pre-are-wcc-560
           else if   w-sta-dis-tip-ddr (1)
                                          =    11
                     go to pre-are-wcc-570
           else      go to pre-are-wcc-580.
       pre-are-wcc-550.
      *                          *-------------------------------------*
      *                          * Se tipo documento 01 : Fattura      *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Deviazione a seconda se esiste  *
      *                              * anche il numero fattura         *
      *                              *---------------------------------*
           if        w-sta-dis-num-ddr (1)
                                          =    spaces
                     go to pre-are-wcc-554.
       pre-are-wcc-552.
      *                              *---------------------------------*
      *                              * Se esiste il numero fattura     *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (1)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Fattura nr. "
                                delimited by   size
                     w-sta-dis-num-ddr (1)
                                delimited by   spaces
                     " del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v05      .
           go to     pre-are-wcc-600.
       pre-are-wcc-554.
      *                              *---------------------------------*
      *                              * Se non esiste il numero fattura *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (1)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Fattura del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v05      .
           go to     pre-are-wcc-600.
       pre-are-wcc-560.
      *                          *-------------------------------------*
      *                          * Se tipo documento 02 : Nota di ad-  *
      *                          * debito                              *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Deviazione a seconda se esiste  *
      *                              * anche il numero fattura         *
      *                              *---------------------------------*
           if        w-sta-dis-num-ddr (1)
                                          =    spaces
                     go to pre-are-wcc-564.
       pre-are-wcc-562.
      *                              *---------------------------------*
      *                              * Se esiste il numero fattura     *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (1)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Nota di addebito nr. "
                                delimited by   size
                     w-sta-dis-num-ddr (1)
                                delimited by   spaces
                     " del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v05      .
           go to     pre-are-wcc-600.
       pre-are-wcc-564.
      *                              *---------------------------------*
      *                              * Se non esiste il numero fattura *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (1)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Nota di addebito del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v05      .
           go to     pre-are-wcc-600.
       pre-are-wcc-570.
      *                          *-------------------------------------*
      *                          * Se tipo documento 11 : Nota di ac-  *
      *                          * credito                             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Deviazione a seconda se esiste  *
      *                              * anche il numero fattura         *
      *                              *---------------------------------*
           if        w-sta-dis-num-ddr (1)
                                          =    spaces
                     go to pre-are-wcc-574.
       pre-are-wcc-572.
      *                              *---------------------------------*
      *                              * Se esiste il numero fattura     *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (1)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Nota di accredito nr. "
                                delimited by   size
                     w-sta-dis-num-ddr (1)
                                delimited by   spaces
                     " del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v05      .
           go to     pre-are-wcc-600.
       pre-are-wcc-574.
      *                              *---------------------------------*
      *                              * Se non esiste il numero fattura *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (1)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Nota di accredito del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v05      .
           go to     pre-are-wcc-600.
       pre-are-wcc-580.
      *                          *-------------------------------------*
      *                          * Se tipo documento non classificato  *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Deviazione a seconda se esiste  *
      *                              * anche il numero fattura         *
      *                              *---------------------------------*
           if        w-sta-dis-num-ddr (1)
                                          =    spaces
                     go to pre-are-wcc-584.
       pre-are-wcc-582.
      *                              *---------------------------------*
      *                              * Se esiste il numero fattura     *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (1)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Documento nr. "
                                delimited by   size
                     w-sta-dis-num-ddr (1)
                                delimited by   spaces
                     " del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v05      .
           go to     pre-are-wcc-600.
       pre-are-wcc-584.
      *                              *---------------------------------*
      *                              * Se non esiste il numero fattura *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (1)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Documento del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v05      .
           go to     pre-are-wcc-600.
       pre-are-wcc-600.
      *              *-------------------------------------------------*
      *              * Preparazione area editata per causale del paga- *
      *              * mento nr. 2                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se esistente                           *
      *                  *---------------------------------------------*
           if        w-sta-dis-num-scf    not  = 2
                     go to pre-are-wcc-700.
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione della data del   *
      *                      * documento di riferimento                *
      *                      *-----------------------------------------*
           if        w-sta-dis-dat-ddr (2)
                                          =    zero
                     go to pre-are-wcc-630
           else      go to pre-are-wcc-640.
       pre-are-wcc-630.
      *                      *-----------------------------------------*
      *                      * Se data del documento di riferimento a  *
      *                      * zero                                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Nessun editing, continuazione       *
      *                          *-------------------------------------*
           go to     pre-are-wcc-700.
       pre-are-wcc-640.
      *                      *-----------------------------------------*
      *                      * Se data del documento di riferimento    *
      *                      * diversa da zero                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Deviazione in funzione del tipo di  *
      *                          * documento                           *
      *                          *-------------------------------------*
           if        w-sta-dis-tip-ddr (2)
                                          =    01
                     go to pre-are-wcc-650
           else if   w-sta-dis-tip-ddr (2)
                                          =    02
                     go to pre-are-wcc-660
           else if   w-sta-dis-tip-ddr (2)
                                          =    11
                     go to pre-are-wcc-670
           else      go to pre-are-wcc-680.
       pre-are-wcc-650.
      *                          *-------------------------------------*
      *                          * Se tipo documento 01 : Fattura      *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Deviazione a seconda se esiste  *
      *                              * anche il numero fattura         *
      *                              *---------------------------------*
           if        w-sta-dis-num-ddr (2)
                                          =    spaces
                     go to pre-are-wcc-654.
       pre-are-wcc-652.
      *                              *---------------------------------*
      *                              * Se esiste il numero fattura     *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (2)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Fattura nr. "
                                delimited by   size
                     w-sta-dis-num-ddr (2)
                                delimited by   spaces
                     " del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v06      .
           go to     pre-are-wcc-700.
       pre-are-wcc-654.
      *                              *---------------------------------*
      *                              * Se non esiste il numero fattura *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (2)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Fattura del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v06      .
           go to     pre-are-wcc-700.
       pre-are-wcc-660.
      *                          *-------------------------------------*
      *                          * Se tipo documento 02 : Nota di ad-  *
      *                          * debito                              *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Deviazione a seconda se esiste  *
      *                              * anche il numero fattura         *
      *                              *---------------------------------*
           if        w-sta-dis-num-ddr (2)
                                          =    spaces
                     go to pre-are-wcc-664.
       pre-are-wcc-662.
      *                              *---------------------------------*
      *                              * Se esiste il numero fattura     *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (2)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Nota di addebito nr. "
                                delimited by   size
                     w-sta-dis-num-ddr (2)
                                delimited by   spaces
                     " del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v06      .
           go to     pre-are-wcc-700.
       pre-are-wcc-664.
      *                              *---------------------------------*
      *                              * Se non esiste il numero fattura *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (2)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Nota di addebito del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v06      .
           go to     pre-are-wcc-700.
       pre-are-wcc-670.
      *                          *-------------------------------------*
      *                          * Se tipo documento 11 : Nota di ac-  *
      *                          * credito                             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Deviazione a seconda se esiste  *
      *                              * anche il numero fattura         *
      *                              *---------------------------------*
           if        w-sta-dis-num-ddr (2)
                                          =    spaces
                     go to pre-are-wcc-674.
       pre-are-wcc-672.
      *                              *---------------------------------*
      *                              * Se esiste il numero fattura     *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (2)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Nota di accredito nr. "
                                delimited by   size
                     w-sta-dis-num-ddr (2)
                                delimited by   spaces
                     " del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v06      .
           go to     pre-are-wcc-700.
       pre-are-wcc-674.
      *                              *---------------------------------*
      *                              * Se non esiste il numero fattura *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (2)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Nota di accredito del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v06      .
           go to     pre-are-wcc-700.
       pre-are-wcc-680.
      *                          *-------------------------------------*
      *                          * Se tipo documento non classificato  *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Deviazione a seconda se esiste  *
      *                              * anche il numero fattura         *
      *                              *---------------------------------*
           if        w-sta-dis-num-ddr (2)
                                          =    spaces
                     go to pre-are-wcc-684.
       pre-are-wcc-682.
      *                              *---------------------------------*
      *                              * Se esiste il numero fattura     *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (2)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Documento nr. "
                                delimited by   size
                     w-sta-dis-num-ddr (2)
                                delimited by   spaces
                     " del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v06      .
           go to     pre-are-wcc-700.
       pre-are-wcc-684.
      *                              *---------------------------------*
      *                              * Se non esiste il numero fattura *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-sta-dis-dat-ddr (2)
                                          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                        using  p                      .
           string    "Documento del "
                                delimited by   size
                     p-edt  
                                delimited by   spaces
                                          into w-sta-dis-ecc-v06      .
           go to     pre-are-wcc-700.
       pre-are-wcc-700.
      *              *-------------------------------------------------*
      *              * Preparazioni finali                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero totale voci da stampare              *
      *                  *---------------------------------------------*
           move      zero                 to   w-sta-dis-wcc-ntv      .
           if        w-sta-dis-ecc-e01    not  = spaces
                     add   1              to   w-sta-dis-wcc-ntv      .
           if        w-sta-dis-ecc-e02    not  = spaces
                     add   1              to   w-sta-dis-wcc-ntv      .
           if        w-sta-dis-ecc-e03    not  = spaces
                     add   1              to   w-sta-dis-wcc-ntv      .
           if        w-sta-dis-ecc-e04    not  = spaces
                     add   1              to   w-sta-dis-wcc-ntv      .
           if        w-sta-dis-ecc-e05    not  = spaces
                     add   1              to   w-sta-dis-wcc-ntv      .
           if        w-sta-dis-ecc-e06    not  = spaces
                     add   1              to   w-sta-dis-wcc-ntv      .
      *                  *---------------------------------------------*
      *                  * Indice ultima voce stampata                 *
      *                  *---------------------------------------------*
           move      zero                 to   w-sta-dis-wcc-iuv      .
      *                  *---------------------------------------------*
      *                  * Area editata per la voce da stampare        *
      *                  *---------------------------------------------*
           move      spaces               to   w-sta-dis-wcc-edt      .
       pre-are-wcc-999.
           exit.

      *    *===========================================================*
      *    * Estrazione voce successiva da stampere, gia' editata, per *
      *    * la colonna per l'appoggio bancario                        *
      *    *-----------------------------------------------------------*
       ext-are-wcc-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'indice dell'ultima    *
      *              * voce gia' stampata                              *
      *              *-------------------------------------------------*
           if        w-sta-dis-wcc-iuv    =    zero
                     go to ext-are-wcc-100
           else if   w-sta-dis-wcc-iuv    =    01
                     go to ext-are-wcc-200
           else if   w-sta-dis-wcc-iuv    =    02
                     go to ext-are-wcc-300
           else if   w-sta-dis-wcc-iuv    =    03
                     go to ext-are-wcc-400
           else if   w-sta-dis-wcc-iuv    =    04
                     go to ext-are-wcc-500
           else if   w-sta-dis-wcc-iuv    =    05
                     go to ext-are-wcc-600
           else      go to ext-are-wcc-700.
       ext-are-wcc-100.
      *              *-------------------------------------------------*
      *              * Se non ancora stampata alcuna voce              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice ABI, se esiste, altrimenti a voce    *
      *                  * successiva                                  *
      *                  *---------------------------------------------*
           if        w-sta-dis-ecc-e01    =    spaces
                     go to ext-are-wcc-200.
           move      01                   to   w-sta-dis-wcc-iuv      .
           move      w-sta-dis-ecc-e01    to   w-sta-dis-wcc-edt      .
           go to     ext-are-wcc-999.
       ext-are-wcc-200.
      *              *-------------------------------------------------*
      *              * Se ultima voce stampata : codice ABI            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice CAB denominazione, se esiste, altri- *
      *                  * menti a voce successiva                     *
      *                  *---------------------------------------------*
           if        w-sta-dis-ecc-e02    =    spaces
                     go to ext-are-wcc-300.
           move      02                   to   w-sta-dis-wcc-iuv      .
           move      w-sta-dis-ecc-e02    to   w-sta-dis-wcc-edt      .
           go to     ext-are-wcc-999.
       ext-are-wcc-300.
      *              *-------------------------------------------------*
      *              * Se ultima voce stampata : codice CAB denomina-  *
      *              * zione                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice CAB localita', se esiste, altrimenti *
      *                  * a voce successiva                           *
      *                  *---------------------------------------------*
           if        w-sta-dis-ecc-e03    =    spaces
                     go to ext-are-wcc-400.
           move      03                   to   w-sta-dis-wcc-iuv      .
           move      w-sta-dis-ecc-e03    to   w-sta-dis-wcc-edt      .
           go to     ext-are-wcc-999.
       ext-are-wcc-400.
      *              *-------------------------------------------------*
      *              * Se ultima voce stampata : codice CAB localita'  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice C/C, se esiste, altrimenti a voce    *
      *                  * successiva                                  *
      *                  *---------------------------------------------*
           if        w-sta-dis-ecc-e04    =    spaces
                     go to ext-are-wcc-500.
           move      04                   to   w-sta-dis-wcc-iuv      .
           move      w-sta-dis-ecc-e04    to   w-sta-dis-wcc-edt      .
           go to     ext-are-wcc-999.
       ext-are-wcc-500.
      *              *-------------------------------------------------*
      *              * Se ultima voce stampata : codice C/C            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Causale della scadenza, se esiste, altri-   *
      *                  * menti a voce successiva                     *
      *                  *---------------------------------------------*
           if        w-sta-dis-ecc-e05    =    spaces
                     go to ext-are-wcc-600.
           move      05                   to   w-sta-dis-wcc-iuv      .
           move      w-sta-dis-ecc-e05    to   w-sta-dis-wcc-edt      .
           go to     ext-are-wcc-999.
       ext-are-wcc-600.
      *              *-------------------------------------------------*
      *              * Se ultima voce stampata : causale della scaden- *
      *              * za nr. 1                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Causale della scadenza nr. 2, se esiste,    *
      *                  * altrimenti a voce successiva                *
      *                  *---------------------------------------------*
           if        w-sta-dis-ecc-e06    =    spaces
                     go to ext-are-wcc-700.
           move      06                   to   w-sta-dis-wcc-iuv      .
           move      w-sta-dis-ecc-e06    to   w-sta-dis-wcc-edt      .
           go to     ext-are-wcc-999.
       ext-are-wcc-700.
      *              *-------------------------------------------------*
      *              * Se ultima voce stampata : causale della scaden- *
      *              * za nr. 2                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita per non piu' voci da stampare        *
      *                  * successiva                                  *
      *                  *---------------------------------------------*
           move      99                   to   w-sta-dis-wcc-iuv      .
           move      spaces               to   w-sta-dis-wcc-edt      .
       ext-are-wcc-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su tre righe          *
      *    *-----------------------------------------------------------*
       box-msg-e03-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      10                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 03                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m03    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e03-999.
           exit.

      *    *===========================================================*
      *    * Find su archivio [sfp]                                    *
      *    *-----------------------------------------------------------*
       fnd-arc-sfp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di selezione               *
      *              *-------------------------------------------------*
           move      "N"                  to   w-fnd-arc-sfp-sel      .
      *              *-------------------------------------------------*
      *              * Se programma di interrogazione gia' attivo :    *
      *              * uscita senza alcuna azione                      *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pscf3010"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to fnd-arc-sfp-999.
       fnd-arc-sfp-025.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'tip-int' per il  *
      *              * livello successivo per il tipo di interrogazio- *
      *              * ne                                              *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "tip-int"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      10                   to   s-car                  .
           move      "INTPGF    "         to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-sfp-050.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'mod-pgf' per il  *
      *              * livello successivo per la modalita' di pagamen- *
      *              * to                                              *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "mod-pgf"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      02                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      w-fnd-arc-sfp-mod    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-sfp-075.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'tvl-pgf' per il  *
      *              * livello successivo per il tipo valuta del paga- *
      *              * mento                                           *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "tvl-pgf"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      02                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      w-fnd-arc-sfp-tvl    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-sfp-100.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'sgl-vlt' per il  *
      *              * livello successivo per la sigla valuta del pa-  *
      *              * gamento                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se il tipo valuta non lo prevede : no       *
      *                  * scrittura                                   *
      *                  *---------------------------------------------*
           if        w-fnd-arc-sfp-tvl    not  = 02
                     go to fnd-arc-sfp-125.
      *                  *---------------------------------------------*
      *                  * Scrittura effettiva                         *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "sgl-vlt"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      03                   to   s-car                  .
           move      w-fnd-arc-sfp-vlt    to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-sfp-125.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'cbp-pgf' per il  *
      *              * livello successivo per il codice ns. cassa,     *
      *              * banca o c/c postale del pagamento               *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "cbp-pgf"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      10                   to   s-car                  .
           move      w-fnd-arc-sfp-cbp    to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-sfp-150.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'snx-sda' per il  *
      *              * livello successivo per il segnale Si/No solo    *
      *              * pagamenti da addebitare                         *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "snx-sda"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      01                   to   s-car                  .
           move      w-fnd-arc-sfp-sda    to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-sfp-175.
      *              *-------------------------------------------------*
      *              * Scrittura variabile di i.p.c. 'snx-slc' per il  *
      *              * livello successivo per l'ammissibilita' del ta- *
      *              * sto Slct                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non ammesso : no scrittura               *
      *                  *---------------------------------------------*
           if        w-fnd-arc-sfp-sns    not  = "S"
                     go to fnd-arc-sfp-200.
      *                  *---------------------------------------------*
      *                  * Scrittura effettiva                         *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "snx-slc"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      01                   to   s-car                  .
           move      "S"                  to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fnd-arc-sfp-200.
      *              *-------------------------------------------------*
      *              * Richiamo del programma di interrogazione        *
      *              *-------------------------------------------------*
           move      "pgm/scf/prg/obj/pscf3010"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
      *              *-------------------------------------------------*
      *              * Cancellazione del programma di interrogazione   *
      *              *-------------------------------------------------*
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * Determinazione selezione avvenuta               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non era ammessa la selezioone : uscita   *
      *                  *---------------------------------------------*
           if        w-fnd-arc-sfp-sns    not  = "S"
                     go to fnd-arc-sfp-999.
      *                  *---------------------------------------------*
      *                  * Lettura variabile di i.p.c. 'num-pgf' dal   *
      *                  * livello successivo per numero pagamento se- *
      *                  * lezionato                                   *
      *                  *---------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "num-pgf"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito della let-  *
      *                  * tura                                        *
      *                  *---------------------------------------------*
           if        s-ves                =    spaces
                     go to fnd-arc-sfp-225
           else      go to fnd-arc-sfp-250.
       fnd-arc-sfp-225.
      *                  *---------------------------------------------*
      *                  * Se variabile esistente                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di selezione avvenuta              *
      *                      *-----------------------------------------*
           move      spaces               to   w-fnd-arc-sfp-sel      .
      *                      *-----------------------------------------*
      *                      * Numero pagamento selezionato            *
      *                      *-----------------------------------------*
           move      s-num                to   w-fnd-arc-sfp-num      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     fnd-arc-sfp-999.
       fnd-arc-sfp-250.
      *                  *---------------------------------------------*
      *                  * Se variabile non esistente                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     fnd-arc-sfp-999.
       fnd-arc-sfp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [cbp]                         *
      *    *-----------------------------------------------------------*
       let-arc-cbp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cbp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spaces                         *
      *              *-------------------------------------------------*
           if        w-let-arc-cbp-cod    =    spaces
                     go to let-arc-cbp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCBP    "         to   f-key                  .
           move      w-let-arc-cbp-tip    to   rf-cbp-tip-cbp         .
           move      w-let-arc-cbp-cod    to   rf-cbp-cod-cbp         .
           move      "pgm/gep/fls/ioc/obj/iofcbp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cbp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-cbp-400.
       let-arc-cbp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-cbp-des-cbp       to   w-let-arc-cbp-des      .
           move      rf-cbp-stc-csc       to   w-let-arc-cbp-csc      .
           move      rf-cbp-stc-csa       to   w-let-arc-cbp-csa      .
           move      rf-cbp-stc-opc       to   w-let-arc-cbp-opc      .
           move      rf-cbp-abi-ban       to   w-let-arc-cbp-abi      .
           move      rf-cbp-cab-ban       to   w-let-arc-cbp-cab      .
           move      rf-cbp-sgl-ccb       to   w-let-arc-cbp-ccb      .
           move      rf-cbp-stc-cco       to   w-let-arc-cbp-cco      .
           move      rf-cbp-stc-bba       to   w-let-arc-cbp-bba      .
           move      rf-cbp-stc-bbp       to   w-let-arc-cbp-bbp      .
           move      rf-cbp-stc-psm       to   w-let-arc-cbp-psm      .
           move      rf-cbp-stc-psi       to   w-let-arc-cbp-psi      .
           move      rf-cbp-stc-pdi       to   w-let-arc-cbp-pdi      .
           move      rf-cbp-stc-psc       to   w-let-arc-cbp-psc      .
           move      rf-cbp-stc-anv       to   w-let-arc-cbp-anv      .
           move      rf-cbp-stc-dfp       to   w-let-arc-cbp-dfp      .
           move      rf-cbp-stc-dfa       to   w-let-arc-cbp-dfa      .
           move      rf-cbp-stc-onb       to   w-let-arc-cbp-onb      .
           move      rf-cbp-stc-inb       to   w-let-arc-cbp-inb      .
           move      rf-cbp-sgl-ccp       to   w-let-arc-cbp-ccp      .
           move      rf-cbp-stc-bpa       to   w-let-arc-cbp-bpa      .
           move      rf-cbp-stc-bpp       to   w-let-arc-cbp-bpp      .
           move      rf-cbp-stc-onp       to   w-let-arc-cbp-onp      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-cbp-999.
       let-arc-cbp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-cbp-flg      .
           move      all   "."            to   w-let-arc-cbp-des      .
           go to     let-arc-cbp-600.
       let-arc-cbp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-cbp-des      .
       let-arc-cbp-600.
           move      zero                 to   w-let-arc-cbp-csc      .
           move      zero                 to   w-let-arc-cbp-csa      .
           move      zero                 to   w-let-arc-cbp-opc      .
           move      zero                 to   w-let-arc-cbp-abi      .
           move      zero                 to   w-let-arc-cbp-cab      .
           move      spaces               to   w-let-arc-cbp-ccb      .
           move      zero                 to   w-let-arc-cbp-cco      .
           move      zero                 to   w-let-arc-cbp-bba      .
           move      zero                 to   w-let-arc-cbp-bbp      .
           move      zero                 to   w-let-arc-cbp-psm      .
           move      zero                 to   w-let-arc-cbp-psi      .
           move      zero                 to   w-let-arc-cbp-pdi      .
           move      zero                 to   w-let-arc-cbp-psc      .
           move      zero                 to   w-let-arc-cbp-anv      .
           move      zero                 to   w-let-arc-cbp-dfp      .
           move      zero                 to   w-let-arc-cbp-dfa      .
           move      zero                 to   w-let-arc-cbp-onb      .
           move      zero                 to   w-let-arc-cbp-inb      .
           move      spaces               to   w-let-arc-cbp-ccp      .
           move      zero                 to   w-let-arc-cbp-bpa      .
           move      zero                 to   w-let-arc-cbp-bpp      .
           move      zero                 to   w-let-arc-cbp-onp      .
       let-arc-cbp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [fnt]                         *
      *    *-----------------------------------------------------------*
       let-arc-fnt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice fornitore a zero                 *
      *              *-------------------------------------------------*
           if        w-let-arc-fnt-cod    =    zero
                     go to let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      w-let-arc-fnt-cod    to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-fnt-400.
       let-arc-fnt-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-fnt-rag-soc       to   w-let-arc-fnt-rag      .
           move      rf-fnt-via-fnt       to   w-let-arc-fnt-via      .
           move      rf-fnt-loc-fnt       to   w-let-arc-fnt-loc      .
           move      rf-fnt-cod-cge       to   w-let-arc-fnt-cge      .
           move      rf-fnt-cod-fis       to   w-let-arc-fnt-cfi      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-fnt-999.
       let-arc-fnt-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-fnt-flg      .
           move      all   "."            to   w-let-arc-fnt-rag      .
           go to     let-arc-fnt-600.
       let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-rag      .
       let-arc-fnt-600.
           move      spaces               to   w-let-arc-fnt-via      .
           move      spaces               to   w-let-arc-fnt-loc      .
           move      zero                 to   w-let-arc-fnt-cge      .
           move      spaces               to   w-let-arc-fnt-cfi      .
       let-arc-fnt-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio dipendenza fornitore in [dcf]    *
      *    *-----------------------------------------------------------*
       let-arc-dcf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcf-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice fntente a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-cod    =    zero
                     go to let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a spaces, solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-dpz    =    spaces and
                     w-let-arc-dcf-tle    =    "D"
                     go to let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a "*   ", solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-dpz    =    "*   " and
                     w-let-arc-dcf-tle    =    "D"
                     go to let-arc-dcf-450.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      w-let-arc-dcf-cod    to   rf-dcf-cod-fnt         .
           move      w-let-arc-dcf-dpz    to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcf-400.
       let-arc-dcf-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcf-rag-soc       to   w-let-arc-dcf-rag      .
           move      rf-dcf-via-dcf       to   w-let-arc-dcf-via      .
           move      rf-dcf-loc-dcf       to   w-let-arc-dcf-loc      .
           move      rf-dcf-cod-abi       to   w-let-arc-dcf-abi      .
           move      rf-dcf-cod-cab       to   w-let-arc-dcf-cab      .
           move      rf-dcf-cod-vlt       to   w-let-arc-dcf-vlt      .
           move      rf-dcf-cin-ita       to   w-let-arc-dcf-cit      .
           move      rf-dcf-cin-eur       to   w-let-arc-dcf-ceu      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcf-999.
       let-arc-dcf-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcf-flg      .
           move      all   "."            to   w-let-arc-dcf-rag      .
           go to     let-arc-dcf-600.
       let-arc-dcf-450.
      *              *-------------------------------------------------*
      *              * Normalizzazione per codice dipendenza "*   "    *
      *              *-------------------------------------------------*
           move      "Sia la sede che tutte le dipendenze     "
                                          to   w-let-arc-dcf-rag      .
           go to     let-arc-dcf-600.
       let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcf-rag      .
       let-arc-dcf-600.
           move      spaces               to   w-let-arc-dcf-via      .
           move      spaces               to   w-let-arc-dcf-loc      .
           move      zero                 to   w-let-arc-dcf-abi      .
           move      zero                 to   w-let-arc-dcf-cab      .
           move      spaces               to   w-let-arc-dcf-vlt      .
           move      spaces               to   w-let-arc-dcf-cit      .
           move      spaces               to   w-let-arc-dcf-ceu      .
       let-arc-dcf-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [axi]                         *
      *    *-----------------------------------------------------------*
       let-arc-axi-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axi-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice istituto a zero                  *
      *              *-------------------------------------------------*
           if        w-let-arc-axi-cod    =    zero
                     go to let-arc-axi-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODABI"             to   f-key                  .
           move      w-let-arc-axi-cod    to   rf-axi-cod-abi         .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-axi-400.
       let-arc-axi-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-axi-den-abi       to   w-let-arc-axi-den      .
           move      rf-axi-cir-itb       to   w-let-arc-axi-cib      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-axi-999.
       let-arc-axi-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-axi-flg      .
           move      all   "."            to   w-let-arc-axi-den      .
           go to     let-arc-axi-600.
       let-arc-axi-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axi-den      .
       let-arc-axi-600.
           move      spaces               to   w-let-arc-axi-cib      .
       let-arc-axi-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [axs]                         *
      *    *-----------------------------------------------------------*
       let-arc-axs-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axs-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice istituto a zero                  *
      *              *-------------------------------------------------*
           if        w-let-arc-axs-abi    =    zero
                     go to let-arc-axs-500.
      *              *-------------------------------------------------*
      *              * Test se codice agenzia a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-axs-cab    =    zero
                     go to let-arc-axs-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "ABICAB"             to   f-key                  .
           move      w-let-arc-axs-abi    to   rf-axs-cod-abi         .
           move      w-let-arc-axs-cab    to   rf-axs-cod-cab         .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-axs-400.
       let-arc-axs-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-axs-den-spt       to   w-let-arc-axs-den      .
           move      rf-axs-via-spt       to   w-let-arc-axs-via      .
           move      rf-axs-loc-spt       to   w-let-arc-axs-loc      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-axs-999.
       let-arc-axs-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-axs-flg      .
           move      all   "."            to   w-let-arc-axs-den      .
           go to     let-arc-axs-600.
       let-arc-axs-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-axs-den      .
       let-arc-axs-600.
           move      spaces               to   w-let-arc-axs-via      .
           move      spaces               to   w-let-arc-axs-loc      .
       let-arc-axs-999.
           exit.

      *    *===========================================================*
      *    * Determinazione pathname completo per il file di supporto  *
      *    * per trasmissione distinta alla banca                      *
      *    *-----------------------------------------------------------*
       det-pat-ads-000.
      *              *-------------------------------------------------*
      *              * Richiesta alla segreteria delle informazioni    *
      *              * relative al formato di un filename, e memo-     *
      *              * rizzazione di :                                 *
      *              *  - Max numero di caratteri per il nome del file *
      *              *  - Max numero di caratteri per l'estensione     *
      *              *  - Carattere di separazione per l'estensione    *
      *              *-------------------------------------------------*
           move      "EX"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-alf                to   w-ads-tab-ndf-fxt      .
       det-pat-ads-200.
      *              *-------------------------------------------------*
      *              * Preparazioni per determinazione nome del file   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Estrazione sigla azienda in uso per ri-     *
      *                  * chiesta al modulo di segreteria             *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Memorizzazione della sigla azienda in uso   *
      *                  *---------------------------------------------*
           move      s-azi                to   w-ads-tab-ndf-azi      .
      *                  *---------------------------------------------*
      *                  * Memorizzazione della sigla azienda in uso   *
      *                  * eventualmente troncata ai tre caratteri     *
      *                  *---------------------------------------------*
           move      s-azi                to   w-ads-tab-ndf-az3      .
      *                  *---------------------------------------------*
      *                  * Memorizzazione della sigla della nostra     *
      *                  * banca di presentazione                      *
      *                  *---------------------------------------------*
           move      w-ads-tab-inp-ban    to   w-ads-tab-ndf-ban      .
      *                  *---------------------------------------------*
      *                  * Sigla della nostra banca di presentazione   *
      *                  * in lowercase                                *
      *                  *---------------------------------------------*
           move      w-ads-tab-ndf-ban    to   w-all-str-alf          .
           move      10                   to   w-all-str-lun          .
           perform   all-str-low-000      thru all-str-low-999        .
           move      w-all-str-alf        to   w-ads-tab-ndf-ban      .
      *                  *---------------------------------------------*
      *                  * Editing del numero distinta di quattro ca-  *
      *                  * ratteri con zeri in testa                   *
      *                  *---------------------------------------------*
           move      w-ads-tab-inp-nnn    to   w-ads-tab-ndf-n01      .
      *                  *---------------------------------------------*
      *                  * Editing del numero distinta di tre caratte- *
      *                  * ri con zeri in testa                        *
      *                  *---------------------------------------------*
           move      w-ads-tab-inp-nnn    to   w-ads-tab-ndf-n05      .
      *                  *---------------------------------------------*
      *                  * Editing dell'anno della distinta di quattro *
      *                  * caratteri                                   *
      *                  *---------------------------------------------*
           move      w-ads-tab-inp-saa    to   w-ads-tab-ndf-n02      .
           add       1900                 to   w-ads-tab-ndf-n02      .
      *                  *---------------------------------------------*
      *                  * Editing dell'anno della distinta di due     *
      *                  * caratteri                                   *
      *                  *---------------------------------------------*
           move      w-ads-tab-inp-saa    to   w-ads-tab-ndf-n03      .
       det-pat-ads-300.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del massimo numero di ca-  *
      *              * ratteri per un filename                         *
      *              *-------------------------------------------------*
           if        w-ads-tab-ndf-mxf    <    40
                     go to det-pat-ads-500.
       det-pat-ads-400.
      *              *-------------------------------------------------*
      *              * Se il massimo numero di caratteri per un nome   *
      *              * di file puo' raggiungere i 40 caratteri         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione di una stringa composta come   *
      *                  * segue :                                     *
      *                  *                                             *
      *                  *        aa_bbbb_cccc_dddd_eeeeeeeeee         *
      *                  *                                             *
      *                  * dove : aa         = valore fisso 'dp'       *
      *                  *        bbbb       = anno di quattro cifre   *
      *                  *        cccc       = numero della distinta   *
      *                  *                     di quattro cifre        *
      *                  *        dddd       = sigla azienda           *
      *                  *        eeeeeeeeee = codice banca            *
      *                  *                                             *
      *                  *---------------------------------------------*
           move      spaces               to   w-ads-tab-ndf-nam      .
           string    "bi"
                                delimited by   size
                     "_"
                                delimited by   size
                     w-ads-tab-ndf-n02
                                delimited by   size
                     "_"
                                delimited by   size
                     w-ads-tab-ndf-azi
                                delimited by   spaces
                     "_"
                                delimited by   size
                     w-ads-tab-ndf-n01
                                delimited by   size
                     "_"
                                delimited by   size
                     w-ads-tab-ndf-ban
                                delimited by   spaces
                                          into w-ads-tab-ndf-nam      .
      *                  *---------------------------------------------*
      *                  * A composizione pathname completo            *
      *                  *---------------------------------------------*
           go to     det-pat-ads-600.
       det-pat-ads-500.
      *              *-------------------------------------------------*
      *              * Se il massimo numero di caratteri per un nome   *
      *              * di file non puo' raggiungere i 40 caratteri     *
      *              *-------------------------------------------------*
       det-pat-ads-510.
      *                  *---------------------------------------------*
      *                  * Composizione di una stringa composta come   *
      *                  * segue :                                     *
      *                  *                                             *
      *                  *        aabbcccc.ddd                         *
      *                  *                                             *
      *                  * dove : aa         = valore fisso 'dp'       *
      *                  *        bb         = anno di due cifre       *
      *                  *        cccc       = numero della distinta   *
      *                  *                     di quattro cifre        *
      *                  *        .          = carattere di separa-    *
      *                  *                     zione per l'estensione  *
      *                  *        ddd        = sigla azienda eventual- *
      *                  *                     mente troncata a tre    *
      *                  *                     caratteri               *
      *                  *                                             *
      *                  * nota : l'estensione viene espressa sola-    *
      *                  *        mente se consentita                  *
      *                  *                                             *
      *                  *---------------------------------------------*
           if        w-ads-tab-ndf-mxe    >    zero
                     go to det-pat-ads-520
           else      go to det-pat-ads-530.
       det-pat-ads-520.
           move      spaces               to   w-ads-tab-ndf-nam      .
           string    "bi"
                                delimited by   size
                     w-ads-tab-ndf-n03
                                delimited by   size
                     w-ads-tab-ndf-n01
                                delimited by   size
                     w-ads-tab-ndf-che
                                delimited by   size
                     w-ads-tab-ndf-az3
                                delimited by   spaces
                                          into w-ads-tab-ndf-nam      .
           go to     det-pat-ads-540.
       det-pat-ads-530.
           move      spaces               to   w-ads-tab-ndf-nam      .
           string    "bi"
                                delimited by   size
                     w-ads-tab-ndf-n03
                                delimited by   size
                     w-ads-tab-ndf-n01
                                delimited by   size
                                          into w-ads-tab-ndf-nam      .
           go to     det-pat-ads-540.
       det-pat-ads-540.
      *                  *---------------------------------------------*
      *                  * A composizione pathname completo            *
      *                  *---------------------------------------------*
           go to     det-pat-ads-600.
       det-pat-ads-600.
      *              *-------------------------------------------------*
      *              * Determinazione pathname completo del file       *
      *              *-------------------------------------------------*
           move      "AS"                 to   s-ope                  .
           move      w-ads-tab-ndf-nam    to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-pat                to   w-ads-tab-ndf-pat      .
       det-pat-ads-999.
           exit.

      *    *===========================================================*
      *    * Generazione archivio di supporto come definito dalla So-  *
      *    * cieta' Interbancaria per l'Automazione S.I.A.             *
      *    *                                                           *
      *    * Bonifici - Record di testa                                *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       bon-000-sia-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      spaces               to   w-bon-sia-000          .
       bon-000-sia-100.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
       bon-000-sia-125.
      *                  *---------------------------------------------*
      *                  * Filler a posizione uno, e tipo record       *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-000-fpu      .
           move      "PC"                 to   w-bon-sia-000-tre      .
       bon-000-sia-150.
      *                  *---------------------------------------------*
      *                  * Mittente, ovvero il codice con cui la SIA   *
      *                  * ha censito il creditore presentante la di-  *
      *                  * stinta                                      *
      *                  *---------------------------------------------*
           move      w-prs-sia-cda-sia    to   w-bon-sia-000-mtn      .
       bon-000-sia-175.
      *                  *---------------------------------------------*
      *                  * Ordinante, ovvero il codice ABI della banca *
      *                  * di presentazione                            *
      *                  *---------------------------------------------*
           move      rr-cod-cbp-abi       to   w-bon-sia-000-odt      .
       bon-000-sia-200.
      *                  *---------------------------------------------*
      *                  * Data di creazione supporto                  *
      *                  *---------------------------------------------*
           move      w-ads-tab-inp-dpr    to   s-dat                  .
           move      s-gio                to   w-bon-sia-000-dcg      .
           move      s-mes                to   w-bon-sia-000-dcm      .
           move      s-ann                to   w-bon-sia-000-dca      .
       bon-000-sia-225.
      *                  *---------------------------------------------*
      *                  * Nome del supporto                           *
      *                  *---------------------------------------------*
       bon-000-sia-250.
      *                      *-----------------------------------------*
      *                      * Normalizzazione preliminare             *
      *                      *-----------------------------------------*
           move      spaces               to   w-bon-sia-000-nds      .
       bon-000-sia-275.
      *                      *-----------------------------------------*
      *                      * Primi quattro caratteri della descri-   *
      *                      * zione azienda SIA, parte 1, posti in    *
      *                      * uppercase                               *
      *                      *-----------------------------------------*
           move      w-prs-sia-daz-001    to   w-all-str-alf          .
           move      04                   to   w-all-str-lun          .
           perform   all-str-upp-000      thru all-str-upp-999        .
           move      w-all-str-alf        to   w-bon-sia-000-x10      .
       bon-000-sia-300.
      *                      *-----------------------------------------*
      *                      * Numero progressivo di spedizione, che   *
      *                      * viene posto pari alle ultime tre cifre  *
      *                      * del numero ordine di bonifico           *
      *                      *-----------------------------------------*
           move      w-sfo-num-num-odb    to   w-bon-sia-000-x20      .
       bon-000-sia-300.
      *                      *-----------------------------------------*
      *                      * Data di creazione del supporto          *
      *                      *-----------------------------------------*
           move      w-ads-tab-inp-dpr    to   s-dat                  .
           move      s-gio                to   w-bon-sia-000-x31      .
           move      s-mes                to   w-bon-sia-000-x32      .
           move      s-ann                to   w-bon-sia-000-x33      .
       bon-000-sia-325.
      *                      *-----------------------------------------*
      *                      * Valore fisso a spaces                   *
      *                      *-----------------------------------------*
           move      spaces               to   w-bon-sia-000-x40      .
       bon-000-sia-350.
      *                      *-----------------------------------------*
      *                      * Codice ABI della banca di presentazione *
      *                      *-----------------------------------------*
           move      rr-cod-cbp-abi       to   w-bon-sia-000-x50      .
       bon-000-sia-375.
      *                  *---------------------------------------------*
      *                  * Data di elaborazione supporto, pari alla    *
      *                  * data di creazione del supporto              *
      *                  *---------------------------------------------*
           move      w-ads-tab-inp-dpr    to   s-dat                  .
           move      s-gio                to   w-bon-sia-000-deg      .
           move      s-mes                to   w-bon-sia-000-dem      .
           move      s-ann                to   w-bon-sia-000-dea      .
       bon-000-sia-400.
      *                  *---------------------------------------------*
      *                  * Filler di 68 caratteri a spaces             *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-000-f68      .
       bon-000-sia-425.
      *                  *---------------------------------------------*
      *                  * Codice divisa (I=ITL - E=EUR)               *
      *                  *---------------------------------------------*
           if        c-sgl                =    "EUR"
                     move  "E"            to   w-bon-sia-000-cdv
           else      move  "I"            to   w-bon-sia-000-cdv      .
       bon-000-sia-450.
      *                  *---------------------------------------------*
      *                  * Filler di 6 caratteri a spaces              *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-000-f06      .
       bon-000-sia-900.
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      w-bon-sia-000        to   g-rec                  .
           perform   put-nxt-seq-000      thru put-nxt-seq-999        .
      *              *-------------------------------------------------*
      *              * Scrittura record in file [ouf] in formato per   *
      *              * MS-DOS                                          *
      *              *-------------------------------------------------*
           move      spaces               to   ouf-rec                .
           move      w-bon-sia-000        to   ouf-dat                .
           perform   ouf-fil-wrt-000      thru ouf-fil-wrt-999        .
       bon-000-sia-950.
      *              *-------------------------------------------------*
      *              * Test se errori di scrittura su file             *
      *              *-------------------------------------------------*
           perform   tst-err-wrt-000      thru tst-err-wrt-999        .
       bon-000-sia-999.
           exit.

      *    *===========================================================*
      *    * Generazione archivio di supporto come definito dalla So-  *
      *    * cieta' Interbancaria per l'Automazione S.I.A.             *
      *    *                                                           *
      *    * Bonifici - Tipo record '10'                               *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       bon-010-sia-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      spaces               to   w-bon-sia-010          .
       bon-010-sia-100.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
       bon-010-sia-125.
      *                  *---------------------------------------------*
      *                  * Filler a posizione uno, e tipo record       *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-010-fpu      .
           move      "10"                 to   w-bon-sia-010-tre      .
       bon-010-sia-150.
      *                  *---------------------------------------------*
      *                  * Numero disposizione                         *
      *                  *---------------------------------------------*
           move      w-ads-sia-gen-pro    to   w-bon-sia-010-nud      .
       bon-010-sia-200.
      *                  *---------------------------------------------*
      *                  * Filler a spaces                             *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-010-f06      .
       bon-010-sia-225.
      *                  *---------------------------------------------*
      *                  * Data di emissione bonifico (GGMMAA)         *
      *                  *                                             *
      *                  * Data di registrazione pagamento             *
      *                  *---------------------------------------------*
           move      rf-sfp-dtr-pgf       to   s-dat                  .
           move      s-gio                to   w-bon-sia-010-deg      .
           move      s-mes                to   w-bon-sia-010-dem      .
           move      s-ann                to   w-bon-sia-010-dea      .
       bon-010-sia-235.
      *                  *---------------------------------------------*
      *                  * Data valuta destinatario (GGMMAA)           *
      *                  *---------------------------------------------*
           move      rf-sfp-dvf-bfc       to   s-dat                  .
           move      s-gio                to   w-bon-sia-010-dvg      .
           move      s-mes                to   w-bon-sia-010-dvm      .
           move      s-ann                to   w-bon-sia-010-dva      .
       bon-010-sia-250.
      *                  *---------------------------------------------*
      *                  * Codice causale, fisso a : 48000             *
      *                  *---------------------------------------------*
           move      48000                to   w-bon-sia-010-cau      .
       bon-010-sia-275.
      *                  *---------------------------------------------*
      *                  * Importo disposizione                        *
      *                  *---------------------------------------------*
           move      rf-sfp-imp-pgf       to   w-bon-sia-010-ims      .
       bon-010-sia-300.
      *                  *---------------------------------------------*
      *                  * Segno                                       *
      *                  *---------------------------------------------*
           move      "+"                  to   w-bon-sia-010-sgn      .
       bon-010-sia-325.
      *                  *---------------------------------------------*
      *                  * Codice ABI banca ordinante                  *
      *                  *---------------------------------------------*
           move      rr-cod-cbp-abi       to   w-bon-sia-010-aba      .
       bon-010-sia-350.
      *                  *---------------------------------------------*
      *                  * Codice CAB banca ordinante                  *
      *                  *---------------------------------------------*
           move      rr-cod-cbp-cab       to   w-bon-sia-010-cba      .
       bon-010-sia-375.
      *                  *---------------------------------------------*
      *                  * Conto ordinante banca ordinante             *
      *                  *---------------------------------------------*
           move      rr-cod-cbp-ccc       to   w-bon-sia-010-ndg      .
      *
           if        w-bon-sia-010-ndg    =    spaces
                     move  w-prs-sia-cor-ndg
                                          to   w-bon-sia-010-ndg      .
       bon-010-sia-400.
      *                  *---------------------------------------------*
      *                  * Codice ABI banca destinataria               *
      *                  *---------------------------------------------*
           move      rf-sfp-abi-pgf       to   w-bon-sia-010-abd      .
       bon-010-sia-425.
      *                  *---------------------------------------------*
      *                  * Codice CAB banca destinataria               *
      *                  *---------------------------------------------*
           move      rf-sfp-cab-pgf       to   w-bon-sia-010-cbd      .
       bon-010-sia-450.
      *                  *---------------------------------------------*
      *                  * Conto destinatario banca destinataria       *
      *                  *---------------------------------------------*
           move      rf-sfp-ccc-pgf       to   w-bon-sia-010-dbd      .
       bon-010-sia-475.
      *                  *---------------------------------------------*
      *                  * Codice azienda assegnato dalla S.I.A. al    *
      *                  * creditore, da personalizzazioni portfoglio  *
      *                  * S.I.A.                                      *
      *                  *---------------------------------------------*
           move      w-prs-sia-cda-sia    to   w-bon-sia-010-azi      .
       bon-010-sia-500.
      *                  *---------------------------------------------*
      *                  * Tipo codice individuale                     *
      *                  *---------------------------------------------*
           move      3                    to   w-bon-sia-010-tci      .
       bon-010-sia-525.
      *                  *---------------------------------------------*
      *                  * Codice fiscale del fornitore                *
      *                  *---------------------------------------------*
           move      rr-cod-fnt-cfi       to   w-bon-sia-010-cod      .
       bon-010-sia-550.
      *                  *---------------------------------------------*
      *                  * Modalita' di pagamento                      *
      *                  *                                             *
      *                  * ('1' o blank per bonifico/giroconto)        *
      *                  *---------------------------------------------*
           move      " "                  to   w-bon-sia-010-mdp      .
       bon-010-sia-575.
      *                  *---------------------------------------------*
      *                  * Filler a spaces                             *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-010-f05      .
       bon-010-sia-600.
      *                  *---------------------------------------------*
      *                  * Codice divisa (I=ITL - E=EUR)               *
      *                  *---------------------------------------------*
           if        c-sgl                =    "EUR"
                     move  "E"            to   w-bon-sia-010-cdv
           else      move  "I"            to   w-bon-sia-010-cdv      .
       bon-010-sia-900.
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      w-bon-sia-010        to   g-rec                  .
           perform   put-nxt-seq-000      thru put-nxt-seq-999        .
      *              *-------------------------------------------------*
      *              * Scrittura record in file [ouf] in formato per   *
      *              * MS-DOS                                          *
      *              *-------------------------------------------------*
           move      spaces               to   ouf-rec                .
           move      w-bon-sia-010        to   ouf-dat                .
           perform   ouf-fil-wrt-000      thru ouf-fil-wrt-999        .
       bon-010-sia-950.
      *              *-------------------------------------------------*
      *              * Test se errori di scrittura su file             *
      *              *-------------------------------------------------*
           perform   tst-err-wrt-000      thru tst-err-wrt-999        .
       bon-010-sia-999.
           exit.

      *    *===========================================================*
      *    * Generazione archivio di supporto come definito dalla So-  *
      *    * cieta' Interbancaria per l'Automazione S.I.A.             *
      *    *                                                           *
      *    * Bonifici - Tipo record '16'                               *
      *    *                                                           *
      *    * Coordinate ordinante                                      *
      *    *-----------------------------------------------------------*
       bon-016-sia-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      spaces               to   w-bon-sia-016          .
       bon-016-sia-100.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Filler a posizione uno                      *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-016-fpu      .
      *                  *---------------------------------------------*
      *                  * Tipo record                                 *
      *                  *---------------------------------------------*
           move      "16"                 to   w-bon-sia-016-tre      .
      *                  *---------------------------------------------*
      *                  * Numero disposizione                         *
      *                  *---------------------------------------------*
           move      w-ads-sia-gen-pro    to   w-bon-sia-016-nud      .
       bon-016-sia-200.
      *                  *---------------------------------------------*
      *                  * Codice nazione                              *
      *                  *---------------------------------------------*
           move      "IT"                 to   w-bon-sia-016-naz      .
      *                  *---------------------------------------------*
      *                  * Check digit IBAN                            *
      *                  *---------------------------------------------*
           move      rf-cbp-cin-eur       to   w-bon-sia-016-chd      .
      *                  *---------------------------------------------*
      *                  * CIN italiano                                *
      *                  *---------------------------------------------*
           move      rf-cbp-cin-ita       to   w-bon-sia-016-cin      .
      *                  *---------------------------------------------*
      *                  * Codice ABI banca ordinante                  *
      *                  *---------------------------------------------*
           move      rr-cod-cbp-abi       to   w-bon-sia-016-abi      .
      *                  *---------------------------------------------*
      *                  * Codice CAB banca ordinante                  *
      *                  *---------------------------------------------*
           move      rr-cod-cbp-cab       to   w-bon-sia-016-cab      .
      *                  *---------------------------------------------*
      *                  * Conto ordinante banca ordinante             *
      *                  *---------------------------------------------*
           move      rr-cod-cbp-ccc       to   w-bon-sia-016-ccc      .
      *
           if        w-bon-sia-016-ccc    =    spaces
                     move  w-prs-sia-cor-ndg
                                          to   w-bon-sia-016-ccc      .
       bon-016-sia-800.
      *                  *---------------------------------------------*
      *                  * Filler a spaces                             *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-016-fxx      .
       bon-016-sia-900.
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      w-bon-sia-016        to   g-rec                  .
           perform   put-nxt-seq-000      thru put-nxt-seq-999        .
      *              *-------------------------------------------------*
      *              * Scrittura record in file [ouf] in formato per   *
      *              * MS-DOS                                          *
      *              *-------------------------------------------------*
           move      spaces               to   ouf-rec                .
           move      w-bon-sia-016        to   ouf-dat                .
           perform   ouf-fil-wrt-000      thru ouf-fil-wrt-999        .
       bon-016-sia-950.
      *              *-------------------------------------------------*
      *              * Test se errori di scrittura su file             *
      *              *-------------------------------------------------*
           perform   tst-err-wrt-000      thru tst-err-wrt-999        .
       bon-016-sia-999.
           exit.

      *    *===========================================================*
      *    * Generazione archivio di supporto come definito dalla So-  *
      *    * cieta' Interbancaria per l'Automazione S.I.A.             *
      *    *                                                           *
      *    * Bonifici - Tipo record '17'                               *
      *    *                                                           *
      *    * Coordinate ordinante                                      *
      *    *                                                           *
      *    * N.B.: si presume che sia stata preventivamente letta      *
      *    *       l'anagrafica commerciale del fornitore              *
      *    *-----------------------------------------------------------*
       bon-017-sia-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      spaces               to   w-bon-sia-017          .
       bon-017-sia-100.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Filler a posizione uno                      *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-017-fpu      .
      *                  *---------------------------------------------*
      *                  * Tipo record                                 *
      *                  *---------------------------------------------*
           move      "17"                 to   w-bon-sia-017-tre      .
      *                  *---------------------------------------------*
      *                  * Numero disposizione                         *
      *                  *---------------------------------------------*
           move      w-ads-sia-gen-pro    to   w-bon-sia-017-nud      .
       bon-017-sia-200.
      *                  *---------------------------------------------*
      *                  * Codice nazione                              *
      *                  *---------------------------------------------*
           move      rf-dcf-cod-naz       to   w-bon-sia-017-naz      .
      *                  *---------------------------------------------*
      *                  * Check digit IBAN                            *
      *                  *---------------------------------------------*
           move      rf-dcf-cin-eur       to   w-bon-sia-017-chd      .
      *                  *---------------------------------------------*
      *                  * CIN italiano                                *
      *                  *---------------------------------------------*
           move      rf-dcf-cin-ita       to   w-bon-sia-017-cin      .
      *                  *---------------------------------------------*
      *                  * Codice ABI banca destinataria               *
      *                  *---------------------------------------------*
           move      rf-sfp-abi-pgf       to   w-bon-sia-017-abi      .
      *                  *---------------------------------------------*
      *                  * Codice CAB banca destinataria               *
      *                  *---------------------------------------------*
           move      rf-sfp-cab-pgf       to   w-bon-sia-017-cab      .
      *                  *---------------------------------------------*
      *                  * Conto ordinante banca destinataria          *
      *                  *---------------------------------------------*
           move      rf-sfp-ccc-pgf       to   w-bon-sia-017-ccc      .
       bon-017-sia-800.
      *                  *---------------------------------------------*
      *                  * Filler a spaces                             *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-017-fxx      .
       bon-017-sia-900.
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      w-bon-sia-017        to   g-rec                  .
           perform   put-nxt-seq-000      thru put-nxt-seq-999        .
      *              *-------------------------------------------------*
      *              * Scrittura record in file [ouf] in formato per   *
      *              * MS-DOS                                          *
      *              *-------------------------------------------------*
           move      spaces               to   ouf-rec                .
           move      w-bon-sia-017        to   ouf-dat                .
           perform   ouf-fil-wrt-000      thru ouf-fil-wrt-999        .
       bon-017-sia-950.
      *              *-------------------------------------------------*
      *              * Test se errori di scrittura su file             *
      *              *-------------------------------------------------*
           perform   tst-err-wrt-000      thru tst-err-wrt-999        .
       bon-017-sia-999.
           exit.

      *    *===========================================================*
      *    * Generazione archivio di supporto come definito dalla So-  *
      *    * cieta' Interbancaria per l'Automazione S.I.A.             *
      *    *                                                           *
      *    * Bonifici - Tipo record '20'                               *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       bon-020-sia-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      spaces               to   w-bon-sia-020          .
       bon-020-sia-100.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
       bon-020-sia-125.
      *                  *---------------------------------------------*
      *                  * Filler a posizione uno, e tipo record       *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-020-fpu      .
           move      "20"                 to   w-bon-sia-020-tre      .
       bon-020-sia-150.
      *                  *---------------------------------------------*
      *                  * Numero disposizione                         *
      *                  *---------------------------------------------*
           move      w-ads-sia-gen-pro    to   w-bon-sia-020-nud      .
       bon-020-sia-175.
      *                  *---------------------------------------------*
      *                  * Denominazione ordinante                     *
      *                  *                                             *
      *                  * 1. personalizzazione portafoglio S.I.A.     *
      *                  *---------------------------------------------*
           move      w-prs-sia-daz-001    to   w-bon-sia-020-den      .
       bon-020-sia-200.
      *                  *---------------------------------------------*
      *                  * Indirizzo ordinante                         *
      *                  *                                             *
      *                  * 3. personalizzazione portafoglio S.I.A.     *
      *                  *---------------------------------------------*
           move      w-prs-sia-daz-003    to   w-bon-sia-020-via      .
       bon-020-sia-225.
      *                  *---------------------------------------------*
      *                  * Indirizzo ordinante                         *
      *                  *                                             *
      *                  * 4. personalizzazione portafoglio S.I.A.     *
      *                  *---------------------------------------------*
           move      w-prs-sia-daz-004    to   w-bon-sia-020-loc      .
       bon-020-sia-250.
      *                  *---------------------------------------------*
      *                  * Codice fiscale/Partita Iva ordinante        *
      *                  *                                             *
      *                  * Obbligatorio (Rel.4.5.1)                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione [ada]                   *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                      *-----------------------------------------*
      *                      * Lettura [ada] Sede                      *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODDPZ    "         to   f-key                  .
           move      zero                 to   rf-ada-cod-dpz         .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                      *-----------------------------------------*
      *                      * Codice fiscale                          *
      *                      *-----------------------------------------*
           move      rf-ada-cod-fis       to   w-bon-sia-020-cfi      .
       bon-020-sia-275.
      *                  *---------------------------------------------*
      *                  * Filler a spaces                             *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-020-f04      .
       bon-020-sia-900.
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      w-bon-sia-020        to   g-rec                  .
           perform   put-nxt-seq-000      thru put-nxt-seq-999        .
      *              *-------------------------------------------------*
      *              * Scrittura record in file [ouf] in formato per   *
      *              * MS-DOS                                          *
      *              *-------------------------------------------------*
           move      spaces               to   ouf-rec                .
           move      w-bon-sia-020        to   ouf-dat                .
           perform   ouf-fil-wrt-000      thru ouf-fil-wrt-999        .
       bon-020-sia-950.
      *              *-------------------------------------------------*
      *              * Test se errori di scrittura su file             *
      *              *-------------------------------------------------*
           perform   tst-err-wrt-000      thru tst-err-wrt-999        .
       bon-020-sia-999.
           exit.

      *    *===========================================================*
      *    * Generazione archivio di supporto come definito dalla So-  *
      *    * cieta' Interbancaria per l'Automazione S.I.A.             *
      *    *                                                           *
      *    * Bonifici - Tipo record '30'                               *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       bon-030-sia-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      spaces               to   w-bon-sia-030          .
       bon-030-sia-100.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
       bon-030-sia-125.
      *                  *---------------------------------------------*
      *                  * Filler a posizione uno, e tipo record       *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-030-fpu      .
           move      "30"                 to   w-bon-sia-030-tre      .
       bon-030-sia-150.
      *                  *---------------------------------------------*
      *                  * Numero disposizione                         *
      *                  *---------------------------------------------*
           move      w-ads-sia-gen-pro    to   w-bon-sia-030-nud      .
       bon-030-sia-175.
      *                  *---------------------------------------------*
      *                  * Descrizione destinatario parte 1 e parte 2. *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ragione sociale per l'inoltro in area   *
      *                      * di comodo di 30 + 10 caratteri          *
      *                      *-----------------------------------------*
           move      w-sta-dis-bfc-rag    to   w-ads-sia-gen-rag      .
      *                      *-----------------------------------------*
      *                      * Parte 1 : primi 30 caratteri            *
      *                      *-----------------------------------------*
           move      w-ads-sia-gen-r11    to   w-bon-sia-030-d01      .
      *                      *-----------------------------------------*
      *                      * Parte 2 : 10 caratteri rimanenti        *
      *                      *-----------------------------------------*
           move      w-ads-sia-gen-r12    to   w-bon-sia-030-d02      .
       bon-030-sia-200.
      *                  *---------------------------------------------*
      *                  * Partita Iva o Codice Fiscale destinatario   *
      *                  *---------------------------------------------*
           move      rr-cod-fnt-cfi       to   w-bon-sia-030-cfi      .
       bon-030-sia-225.
      *                  *---------------------------------------------*
      *                  * Filler a spaces                             *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-030-f04      .
       bon-030-sia-900.
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      w-bon-sia-030        to   g-rec                  .
           perform   put-nxt-seq-000      thru put-nxt-seq-999        .
      *              *-------------------------------------------------*
      *              * Scrittura record in file [ouf] in formato per   *
      *              * MS-DOS                                          *
      *              *-------------------------------------------------*
           move      spaces               to   ouf-rec                .
           move      w-bon-sia-030        to   ouf-dat                .
           perform   ouf-fil-wrt-000      thru ouf-fil-wrt-999        .
       bon-030-sia-950.
      *              *-------------------------------------------------*
      *              * Test se errori di scrittura su file             *
      *              *-------------------------------------------------*
           perform   tst-err-wrt-000      thru tst-err-wrt-999        .
       bon-030-sia-999.
           exit.

      *    *===========================================================*
      *    * Generazione archivio di supporto come definito dalla So-  *
      *    * cieta' Interbancaria per l'Automazione S.I.A.             *
      *    *                                                           *
      *    * Ri.Ba. - Tipo record '40'                                 *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       bon-040-sia-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      spaces               to   w-bon-sia-040          .
       bon-040-sia-100.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
       bon-040-sia-125.
      *                  *---------------------------------------------*
      *                  * Filler a posizione uno, e tipo record       *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-040-fpu      .
           move      "40"                 to   w-bon-sia-040-tre      .
       bon-040-sia-150.
      *                  *---------------------------------------------*
      *                  * Numero disposizione                         *
      *                  *---------------------------------------------*
           move      w-ads-sia-gen-pro    to   w-bon-sia-040-nud      .
       bon-040-sia-175.
      *                  *---------------------------------------------*
      *                  * Indirizzo beneficiario                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Indirizzo per l'inoltro in area di co-  *
      *                      * modo di 30 + 10 caratteri               *
      *                      *-----------------------------------------*
           move      w-sta-dis-bfc-via    to   w-ads-sia-gen-via      .
      *                      *-----------------------------------------*
      *                      * Indirizzo beneficiario : primi 30       *
      *                      * caratteri                               *
      *                      *-----------------------------------------*
           move      w-ads-sia-gen-v11    to   w-bon-sia-040-icd      .
       bon-040-sia-200.
      *                  *---------------------------------------------*
      *                  * C.a.p. e localita' beneficiario             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Localita' per l'inoltro in area di co-  *
      *                      * modo di 5 + 1 + 25 + 9 caratteri oppu-  *
      *                      * re di 25 + 15 caratteri                 *
      *                      *-----------------------------------------*
           move      w-sta-dis-bfc-loc    to   w-ads-sia-gen-loc      .
      *                      *-----------------------------------------*
      *                      * Test sul formato della localita'        *
      *                      *-----------------------------------------*
           if        w-ads-sia-gen-l12    not  numeric
                     go to bon-040-sia-210.
           if        w-ads-sia-gen-l13    not  = spaces
                     go to bon-040-sia-210.
       bon-040-sia-205.
      *                      *-----------------------------------------*
      *                      * Se formato : C.a.p. + Localita'         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * C.a.p. : primi 5 caratteri alfanu-  *
      *                          * merici                              *
      *                          *-------------------------------------*
           move      w-ads-sia-gen-l11    to   w-bon-sia-040-ccd      .
      *                          *-------------------------------------*
      *                          * Localita' con provincia : terzi 25  *
      *                          * caratteri alfanumerici              *
      *                          *-------------------------------------*
           move      w-ads-sia-gen-l14    to   w-bon-sia-040-lcd      .
      *                          *-------------------------------------*
      *                          * Continuazione a campo successivo    *
      *                          *-------------------------------------*
           go to     bon-040-sia-225.
       bon-040-sia-210.
      *                      *-----------------------------------------*
      *                      * Se formato diverso                      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * C.a.p. : fisso a '00000'            *
      *                          *-------------------------------------*
           move      "00000"              to   w-bon-sia-040-ccd      .
      *                          *-------------------------------------*
      *                          * Localita' con provincia : primi 25  *
      *                          * caratteri alfanumerici              *
      *                          *-------------------------------------*
           move      w-ads-sia-gen-l21    to   w-bon-sia-040-lcd      .
      *                          *-------------------------------------*
      *                          * Continuazione a campo successivo    *
      *                          *-------------------------------------*
           go to     bon-040-sia-225.
       bon-040-sia-225.
      *                  *---------------------------------------------*
      *                  * Sportello destinatario                      *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-040-sde      .
       bon-040-sia-900.
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      w-bon-sia-040        to   g-rec                  .
           perform   put-nxt-seq-000      thru put-nxt-seq-999        .
      *              *-------------------------------------------------*
      *              * Scrittura record in file [ouf] in formato per   *
      *              * MS-DOS                                          *
      *              *-------------------------------------------------*
           move      spaces               to   ouf-rec                .
           move      w-bon-sia-040        to   ouf-dat                .
           perform   ouf-fil-wrt-000      thru ouf-fil-wrt-999        .
       bon-040-sia-950.
      *              *-------------------------------------------------*
      *              * Test se errori di scrittura su file             *
      *              *-------------------------------------------------*
           perform   tst-err-wrt-000      thru tst-err-wrt-999        .
       bon-040-sia-999.
           exit.

      *    *===========================================================*
      *    * Generazione archivio di supporto come definito dalla So-  *
      *    * cieta' Interbancaria per l'Automazione S.I.A.             *
      *    *                                                           *
      *    * Ciclo di scansione scadenze appartenenti al pagamento     *
      *    *                                                           *
      *    * N.B.: max 15                                              *
      *    *-----------------------------------------------------------*
       buf-sfs-pag-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione numero scadenze appartenenti al *
      *              * pagamento                                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-ads-sia-gen-sap      .
       buf-sfs-pag-100.
      *              *-------------------------------------------------*
      *              * Start su archivio [sfs]                         *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "PGFSCF    "         to   f-key                  .
           move      rf-sfp-num-pgf       to   rf-sfs-num-pgf         .
           move      zero                 to   rf-sfs-num-scf         .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to buf-sfs-pag-600.
       buf-sfs-pag-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale record [sfs]                *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At End'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to buf-sfs-pag-600.
       buf-sfs-pag-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-sfs-num-pgf       not  = rf-sfp-num-pgf
                     go to buf-sfs-pag-600.
       buf-sfs-pag-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento numero scadenze incontrate       *
      *                  *---------------------------------------------*
           add       1                    to   w-ads-sia-gen-sap      .
      *                  *---------------------------------------------*
      *                  * Se oltre 15 scadenze : a ciclo di emissione *
      *                  *---------------------------------------------*
           if        w-ads-sia-gen-sap    >    15
                     move  15             to   w-ads-sia-gen-sap
                     go to buf-sfs-pag-600.
       buf-sfs-pag-450.
      *              *-------------------------------------------------*
      *              * Bufferizzazione                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero scadenza                             *
      *                  *---------------------------------------------*
           move      rf-sfs-num-scf       to   w-ads-sia-gen-prt
                                              (w-ads-sia-gen-sap)     .
      *                  *---------------------------------------------*
      *                  * Riferimento                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing data di riferimento             *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      rf-sfs-dat-ddr       to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      30                   to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
      *
           if        rf-sfs-tip-ddr       =    01
                     move  "Fattura"      to   w-all-str-cat (1)
           else if   rf-sfs-tip-ddr       =    02
                     move  "Nota di debito"
                                          to   w-all-str-cat (1)
           else      move  "Documento"    to   w-all-str-cat (1)      .
      *
           if        rf-sfs-num-ddr       not  = spaces
                     move  "nr."          to   w-all-str-cat (2)
           else      move  spaces         to   w-all-str-cat (2)      .
      *
           move      rf-sfs-num-ddr       to   w-all-str-cat (3)      .
      *
           if        rf-sfs-dat-ddr       not  = zero
                     move  "del"          to   w-all-str-cat (4)
           else      move  spaces         to   w-all-str-cat (4)      .
      *
           move      v-edt                to   w-all-str-cat (5)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * In campo di destinazione                *
      *                      *-----------------------------------------*
           move      w-all-str-alf        to   w-ads-sia-gen-des
                                              (w-ads-sia-gen-sap)     .
       buf-sfs-pag-500.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     buf-sfs-pag-200.
       buf-sfs-pag-600.
      *              *-------------------------------------------------*
      *              * Ciclo di emissione vera e propria               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del numero scadenze  *
      *                  *---------------------------------------------*
           if        w-ads-sia-gen-sap    >    3
                     go to buf-sfs-pag-800.
       buf-sfs-pag-700.
      *                  *---------------------------------------------*
      *                  * Emissione di un record '50'                 *
      *                  *---------------------------------------------*
           perform   bon-050-sia-000      thru bon-050-sia-999        .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     buf-sfs-pag-900.
       buf-sfs-pag-800.
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione buffer                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ciclo                                   *
      *                      *-----------------------------------------*
           move      zero                 to   w-ads-sia-gen-ct3      .
       buf-sfs-pag-820.
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        w-ads-sia-gen-ct3    >    w-ads-sia-gen-sap
                     go to buf-sfs-pag-880.
           if        w-ads-sia-gen-ct3    >    15
                     go to buf-sfs-pag-880.
      *                      *-----------------------------------------*
      *                      * Generazione tipi record '60'            *
      *                      *-----------------------------------------*
           perform   bon-060-sia-000      thru bon-060-sia-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     buf-sfs-pag-820.
       buf-sfs-pag-880.
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     buf-sfs-pag-900.
       buf-sfs-pag-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     buf-sfs-pag-999.
       buf-sfs-pag-999.
           exit.

      *    *===========================================================*
      *    * Generazione archivio di supporto come definito dalla So-  *
      *    * cieta' Interbancaria per l'Automazione S.I.A.             *
      *    *                                                           *
      *    * Bonifici - Tipo record '50'                               *
      *    *-----------------------------------------------------------*
       bon-050-sia-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      spaces               to   w-bon-sia-050          .
       bon-050-sia-100.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
       bon-050-sia-125.
      *                  *---------------------------------------------*
      *                  * Filler a posizione uno, e tipo record       *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-050-fpu      .
           move      "50"                 to   w-bon-sia-050-tre      .
       bon-050-sia-150.
      *                  *---------------------------------------------*
      *                  * Numero disposizione                         *
      *                  *---------------------------------------------*
           move      w-ads-sia-gen-pro    to   w-bon-sia-050-nud      .
       bon-050-sia-200.
      *                  *---------------------------------------------*
      *                  * Riferimenti operazione di accredito         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ciclo di preparazione                   *
      *                      *-----------------------------------------*
           move      zero                 to   w-ads-sia-gen-ctr      .
       bon-050-sia-220.
           add       1                    to   w-ads-sia-gen-ctr      .
           if        w-ads-sia-gen-ctr    >    w-ads-sia-gen-sap
                     go to bon-050-sia-900.
           if        w-ads-sia-gen-ctr    >    3
                     go to bon-050-sia-900.
      *                      *-----------------------------------------*
      *                      * Riferimenti                             *
      *                      *-----------------------------------------*
           if        w-ads-sia-gen-ctr    =    1
                     move  w-ads-sia-gen-des
                          (w-ads-sia-gen-ctr)
                                          to   w-bon-sia-050-ro1
           else if   w-ads-sia-gen-ctr    =    2
                     move  w-ads-sia-gen-des
                          (w-ads-sia-gen-ctr)
                                          to   w-bon-sia-050-ro2
           else if   w-ads-sia-gen-ctr    =    3
                     move  w-ads-sia-gen-des
                          (w-ads-sia-gen-ctr)
                                          to   w-bon-sia-050-ro3      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     bon-050-sia-220.
       bon-050-sia-900.
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      w-bon-sia-050        to   g-rec                  .
           perform   put-nxt-seq-000      thru put-nxt-seq-999        .
      *              *-------------------------------------------------*
      *              * Scrittura record in file [ouf] in formato per   *
      *              * MS-DOS                                          *
      *              *-------------------------------------------------*
           move      spaces               to   ouf-rec                .
           move      w-bon-sia-050        to   ouf-dat                .
           perform   ouf-fil-wrt-000      thru ouf-fil-wrt-999        .
       bon-050-sia-950.
      *              *-------------------------------------------------*
      *              * Test se errori di scrittura su file             *
      *              *-------------------------------------------------*
           perform   tst-err-wrt-000      thru tst-err-wrt-999        .
       bon-050-sia-999.
           exit.

      *    *===========================================================*
      *    * Generazione archivio di supporto come definito dalla So-  *
      *    * cieta' Interbancaria per l'Automazione S.I.A.             *
      *    *                                                           *
      *    * Bonifici - Tipo record '60'                               *
      *    *-----------------------------------------------------------*
       bon-060-sia-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      spaces               to   w-bon-sia-060          .
       bon-060-sia-100.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
       bon-060-sia-125.
      *                  *---------------------------------------------*
      *                  * Filler a posizione uno, e tipo record       *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-060-fpu      .
           move      "60"                 to   w-bon-sia-060-tre      .
       bon-060-sia-150.
      *                  *---------------------------------------------*
      *                  * Numero disposizione                         *
      *                  *---------------------------------------------*
           move      w-ads-sia-gen-pro    to   w-bon-sia-060-nud      .
       bon-060-sia-200.
      *                  *---------------------------------------------*
      *                  * Riferimenti operazione di accredito         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ciclo di preparazione                   *
      *                      *-----------------------------------------*
           move      zero                 to   w-ads-sia-gen-ctr      .
       bon-060-sia-220.
      *                      *-----------------------------------------*
      *                      * Incremento contatore locale             *
      *                      *-----------------------------------------*
           add       1                    to   w-ads-sia-gen-ctr      .
      *                      *-----------------------------------------*
      *                      * Test su contatore locale                *
      *                      *-----------------------------------------*
           if        w-ads-sia-gen-ctr    >    3
                     go to bon-060-sia-900.
      *                      *-----------------------------------------*
      *                      * Incremento contatore 1..15              *
      *                      *-----------------------------------------*
           add       1                    to   w-ads-sia-gen-ct3      .
           if        w-ads-sia-gen-ct3    >    15
                     go to bon-060-sia-900.
      *                      *-----------------------------------------*
      *                      * Riferimenti                             *
      *                      *-----------------------------------------*
           if        w-ads-sia-gen-ctr    =    1
                     move  w-ads-sia-gen-des
                          (w-ads-sia-gen-ct3)
                                          to   w-bon-sia-060-ro1
           else if   w-ads-sia-gen-ctr    =    2
                     move  w-ads-sia-gen-des
                          (w-ads-sia-gen-ct3)
                                          to   w-bon-sia-060-ro2
           else if   w-ads-sia-gen-ctr    =    3
                     move  w-ads-sia-gen-des
                          (w-ads-sia-gen-ct3)
                                          to   w-bon-sia-060-ro3      .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     bon-060-sia-220.
       bon-060-sia-900.
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      w-bon-sia-060        to   g-rec                  .
           perform   put-nxt-seq-000      thru put-nxt-seq-999        .
      *              *-------------------------------------------------*
      *              * Scrittura record in file [ouf] in formato per   *
      *              * MS-DOS                                          *
      *              *-------------------------------------------------*
           move      spaces               to   ouf-rec                .
           move      w-bon-sia-060        to   ouf-dat                .
           perform   ouf-fil-wrt-000      thru ouf-fil-wrt-999        .
       bon-060-sia-950.
      *              *-------------------------------------------------*
      *              * Test se errori di scrittura su file             *
      *              *-------------------------------------------------*
           perform   tst-err-wrt-000      thru tst-err-wrt-999        .
       bon-060-sia-999.
           exit.

      *    *===========================================================*
      *    * Generazione archivio di supporto come definito dalla So-  *
      *    * cieta' Interbancaria per l'Automazione S.I.A.             *
      *    *                                                           *
      *    * Bonifici - Tipo record '70'                               *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       bon-070-sia-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      spaces               to   w-bon-sia-070          .
       bon-070-sia-100.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
       bon-070-sia-125.
      *                  *---------------------------------------------*
      *                  * Filler a posizione uno, e tipo record       *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-070-fpu      .
           move      "70"                 to   w-bon-sia-070-tre      .
       bon-070-sia-150.
      *                  *---------------------------------------------*
      *                  * Numero disposizione                         *
      *                  *---------------------------------------------*
           move      w-ads-sia-gen-pro    to   w-bon-sia-070-nud      .
       bon-070-sia-200.
      *                  *---------------------------------------------*
      *                  * Filler a spaces                             *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-070-f00      .
       bon-070-sia-225.
      *                  *---------------------------------------------*
      *                  * CIN del beneficiario                        *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-070-cin      .
       bon-070-sia-250.
      *                  *---------------------------------------------*
      *                  * Filler a spaces                             *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-070-f09      .
       bon-070-sia-900.
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      w-bon-sia-070        to   g-rec                  .
           perform   put-nxt-seq-000      thru put-nxt-seq-999        .
      *              *-------------------------------------------------*
      *              * Scrittura record in file [ouf] in formato per   *
      *              * MS-DOS                                          *
      *              *-------------------------------------------------*
           move      spaces               to   ouf-rec                .
           move      w-bon-sia-070        to   ouf-dat                .
           perform   ouf-fil-wrt-000      thru ouf-fil-wrt-999        .
       bon-070-sia-950.
      *              *-------------------------------------------------*
      *              * Test se errori di scrittura su file             *
      *              *-------------------------------------------------*
           perform   tst-err-wrt-000      thru tst-err-wrt-999        .
       bon-070-sia-999.
           exit.

      *    *===========================================================*
      *    * Generazione archivio di supporto come definito dalla So-  *
      *    * cieta' Interbancaria per l'Automazione S.I.A.             *
      *    *                                                           *
      *    * Bonifici - Record di coda                                 *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       bon-999-sia-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      spaces               to   w-bon-sia-999          .
       bon-999-sia-100.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
       bon-999-sia-125.
      *                  *---------------------------------------------*
      *                  * Filler a posizione uno, e tipo record       *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-999-fpu      .
           move      "EF"                 to   w-bon-sia-999-tre      .
       bon-999-sia-150.
      *                  *---------------------------------------------*
      *                  * Mittente, ovvero il codice con cui la SIA   *
      *                  * ha censito il creditore presentante la di-  *
      *                  * stinta                                      *
      *                  *---------------------------------------------*
           move      w-prs-sia-cda-sia    to   w-bon-sia-999-mtn      .
       bon-999-sia-175.
      *                  *---------------------------------------------*
      *                  * Ordinante, ovvero il codice ABI della banca *
      *                  * di presentazione                            *
      *                  *---------------------------------------------*
           move      rr-cod-cbp-abi       to   w-bon-sia-999-odt      .
       bon-999-sia-200.
      *                  *---------------------------------------------*
      *                  * Data di creazione supporto                  *
      *                  *---------------------------------------------*
           move      w-ads-tab-inp-dpr    to   s-dat                  .
           move      s-gio                to   w-bon-sia-999-dcg      .
           move      s-mes                to   w-bon-sia-999-dcm      .
           move      s-ann                to   w-bon-sia-999-dca      .
       bon-999-sia-225.
      *                  *---------------------------------------------*
      *                  * Nome del supporto                           *
      *                  *---------------------------------------------*
       bon-999-sia-250.
      *                      *-----------------------------------------*
      *                      * Normalizzazione preliminare             *
      *                      *-----------------------------------------*
           move      spaces               to   w-bon-sia-999-nds      .
       bon-999-sia-275.
      *                      *-----------------------------------------*
      *                      * Primi quattro caratteri della descri-   *
      *                      * zione azienda SIA, parte 1, posti in    *
      *                      * uppercase                               *
      *                      *-----------------------------------------*
           move      w-prs-sia-daz-001    to   w-all-str-alf          .
           move      04                   to   w-all-str-lun          .
           perform   all-str-upp-000      thru all-str-upp-999        .
           move      w-all-str-alf        to   w-bon-sia-999-x10      .
       bon-999-sia-300.
      *                      *-----------------------------------------*
      *                      * Numero progressivo di spedizione, che   *
      *                      * viene posto pari alle ultime tre cifre  *
      *                      * del numero progressivo nell'ambito del- *
      *                      * l'anno                                  *
      *                      *-----------------------------------------*
           move      w-sfo-num-num-odb    to   w-bon-sia-999-x20      .
       bon-999-sia-300.
      *                      *-----------------------------------------*
      *                      * Data di creazione del supporto          *
      *                      *-----------------------------------------*
           move      w-ads-tab-inp-dpr    to   s-dat                  .
           move      s-gio                to   w-bon-sia-999-x31      .
           move      s-mes                to   w-bon-sia-999-x32      .
           move      s-ann                to   w-bon-sia-999-x33      .
       bon-999-sia-325.
      *                      *-----------------------------------------*
      *                      * Valore fisso a spaces                   *
      *                      *-----------------------------------------*
           move      spaces               to   w-bon-sia-999-x40      .
       bon-999-sia-350.
      *                      *-----------------------------------------*
      *                      * Codice ABI della banca di presentazione *
      *                      *-----------------------------------------*
           move      rr-cod-cbp-abi       to   w-bon-sia-999-x50      .
       bon-999-sia-375.
      *                  *---------------------------------------------*
      *                  * Data di elaborazione supporto, pari alla    *
      *                  * data di creazione del supporto              *
      *                  *---------------------------------------------*
           move      w-ads-tab-inp-dpr    to   s-dat                  .
           move      s-gio                to   w-bon-sia-999-deg      .
           move      s-mes                to   w-bon-sia-999-dem      .
           move      s-ann                to   w-bon-sia-999-dea      .
       bon-999-sia-400.
      *                  *---------------------------------------------*
      *                  * Numero di disposizioni contenute nel flusso *
      *                  *---------------------------------------------*
           move      w-ads-sia-gen-pro    to   w-bon-sia-999-nrv      .
       bon-999-sia-425.
      *                  *---------------------------------------------*
      *                  * Filler di 15 numeri a zero                  *
      *                  *---------------------------------------------*
           move      "000000000000000"    to   w-bon-sia-999-itr      .
       bon-999-sia-450.
      *                  *---------------------------------------------*
      *                  * Importo totale delle ricevute contenute nel *
      *                  * flusso                                      *
      *                  *---------------------------------------------*
           move      w-ads-sia-gen-val    to   w-bon-sia-999-itd      .
       bon-999-sia-475.
      *                  *---------------------------------------------*
      *                  * Numero dei record contenuti nel flusso com- *
      *                  * prensivo di testa e coda                    *
      *                  *---------------------------------------------*
           move      w-ads-sia-gen-rpt    to   w-bon-sia-999-nrc      .
           add       1                    to   w-bon-sia-999-nrc      .
       bon-999-sia-500.
      *                  *---------------------------------------------*
      *                  * Filler                                      *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-999-f24      .
       bon-999-sia-525.
      *                  *---------------------------------------------*
      *                  * Codice divisa (I=ITL - E=EUR)               *
      *                  *---------------------------------------------*
           if        c-sgl                =    "EUR"
                     move  "E"            to   w-bon-sia-999-cdv
           else      move  "I"            to   w-bon-sia-999-cdv      .
       bon-999-sia-550.
      *                  *---------------------------------------------*
      *                  * Filler                                      *
      *                  *---------------------------------------------*
           move      spaces               to   w-bon-sia-999-f06      .
       bon-999-sia-900.
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      w-bon-sia-999        to   g-rec                  .
           perform   put-nxt-seq-000      thru put-nxt-seq-999        .
      *              *-------------------------------------------------*
      *              * Scrittura record in file [ouf] in formato per   *
      *              * MS-DOS                                          *
      *              *-------------------------------------------------*
           move      spaces               to   ouf-rec                .
           move      w-bon-sia-999        to   ouf-dat                .
           perform   ouf-fil-wrt-000      thru ouf-fil-wrt-999        .
       bon-999-sia-950.
      *              *-------------------------------------------------*
      *              * Test se errori di scrittura su file             *
      *              *-------------------------------------------------*
           perform   tst-err-wrt-000      thru tst-err-wrt-999        .
       bon-999-sia-999.
           exit.

      *    *===========================================================*
      *    * Routines per il trattamento del file [ouf] per la compo-  *
      *    * sizione del file di supporto in formato MS-DOS            *
      *    *-----------------------------------------------------------*
       ouf-fil-det-000.
      *              *=================================================*
      *              * Determinazione name e pathname completo per il  *
      *              * file [ouf]                                      *
      *              *-------------------------------------------------*
       ouf-fil-det-100.
      *                  *---------------------------------------------*
      *                  * File name                                   *
      *                  *---------------------------------------------*
           move      "ouf "               to   f-ouf-nam              .
       ouf-fil-det-200.
      *                  *---------------------------------------------*
      *                  * File pathname                               *
      *                  *---------------------------------------------*
       ouf-fil-det-210.
      *                      *-----------------------------------------*
      *                      * Composizione di una stringa composta    *
      *                      * come segue :                            *
      *                      *                                         *
      *                      * aabbbbcc.nnn                            *
      *                      *                                         *
      *                      * dove : aa   = valore fisso 'DP'         *
      *                      *                                         *
      *                      *        bbbb = sigla azienda             *
      *                      *                                         *
      *                      *        cc   = anno di due cifre         *
      *                      *                                         *
      *                      *        nnn  = numero distinta           *
      *                      *                                         *
      *                      *-----------------------------------------*
           move      spaces               to   w-ads-tab-ndf-dos      .
           string    "bi"       delimited by   size
                     w-ads-tab-ndf-azi
                                delimited by   spaces
                     w-ads-tab-ndf-n02-a34
                                delimited by   size
                     "."        delimited by   size
                     w-ads-tab-ndf-n05
                                delimited by   size
                                          into w-ads-tab-ndf-dos      .
       ouf-fil-det-220.
      *                      *-----------------------------------------*
      *                      * Trasformazione in lowercase             *
      *                      *-----------------------------------------*
           move      w-ads-tab-ndf-dos    to   w-all-str-alf          .
           move      12                   to   w-all-str-lun          .
           perform   all-str-low-000      thru all-str-low-999        .
           move      w-all-str-alf        to   w-ads-tab-ndf-dos      .
       ouf-fil-det-230.
      *                      *-----------------------------------------*
      *                      * Concatenamento preliminare con /cbi     *
      *                      *-----------------------------------------*
           move      16                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      "cbi/"               to   w-all-str-cat (1)      .
           move      w-ads-tab-ndf-dos    to   w-all-str-cat (2)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                      *-----------------------------------------*
      *                      * Concatenamento eventuale con '.TXT'     *
      *                      *-----------------------------------------*
           if        w-prs-tip-fsm        not  = "T"
                     go to ouf-fil-det-280.
      *                      *-----------------------------------------*
      *                      * Concatenamento                          *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      ".txt"               to   w-all-str-cat (2)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
       ouf-fil-det-280.
      *                      *-----------------------------------------*
      *                      * Pathname completo sotto /abd/asc        *
      *                      *-----------------------------------------*
           move      "AS"                 to   s-ope                  .
           move      w-all-str-alf        to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-pat                to   f-ouf-pat              .
       ouf-fil-det-300.
      *                  *---------------------------------------------*
      *                  * File status                                 *
      *                  *---------------------------------------------*
           move      "00"                 to   f-ouf-sts              .
       ouf-fil-det-999.
           exit.
       ouf-fil-opo-000.
      *              *-------------------------------------------------*
      *              * Open output file [ouf]                          *
      *              *-------------------------------------------------*
           open      output ouf                                       .
       ouf-fil-opo-999.
           exit.
       ouf-fil-cls-000.
      *              *=================================================*
      *              * Close file [ouf]                                *
      *              *-------------------------------------------------*
           close     ouf                                              .
       ouf-fil-cls-100.
      *              *-------------------------------------------------*
      *              * Completamento del file [ouf] con il carattere   *
      *              * di fine-file x'1A'                              *
      *              *-------------------------------------------------*
       ouf-fil-cls-110.
      *                  *---------------------------------------------*
      *                  * File name per [0u2]                         *
      *                  *---------------------------------------------*
           move      "0u2 "               to   f-ou2-nam              .
      *                  *---------------------------------------------*
      *                  * File pathname per [0u2]                     *
      *                  *---------------------------------------------*
           move      f-ouf-pat            to   f-ou2-pat              .
      *                  *---------------------------------------------*
      *                  * File status per [0u2]                       *
      *                  *---------------------------------------------*
           move      "00"                 to   f-ou2-sts              .
       ouf-fil-cls-120.
      *                  *---------------------------------------------*
      *                  * Open Extend file [ou2]                      *
      *                  *---------------------------------------------*
           open      extend ou2                                       .
       ouf-fil-cls-130.
      *                  *---------------------------------------------*
      *                  * Soppressione carattere di 'EOF'             *
      *                  *---------------------------------------------*
           go to     ouf-fil-cls-140.
      *                  *---------------------------------------------*
      *                  * Scrittura file [ou2]                        *
      *                  *---------------------------------------------*
           move      x'1A'                to   ou2-chr                .
           write     ou2-rec                                          .
       ouf-fil-cls-140.
      *                  *---------------------------------------------*
      *                  * Close file [ou2]                            *
      *                  *---------------------------------------------*
           close     ou2                                              .
       ouf-fil-cls-999.
           exit.
       ouf-fil-wrt-000.
      *              *=================================================*
      *              * Write file [ouf]                                *
      *              *-------------------------------------------------*
       ouf-fil-wrt-100.
      *                  *---------------------------------------------*
      *                  * Incremento progressivo record emessi        *
      *                  *---------------------------------------------*
           add       1                    to   w-ads-sia-gen-rpt      .
       ouf-fil-wrt-200.
      *                  *---------------------------------------------*
      *                  * Completamento con carattere CR              *
      *                  *---------------------------------------------*
           move      x'0D'                to   ouf-crx                .
       ouf-fil-wrt-200.
      *                  *---------------------------------------------*
      *                  * Completamento con carattere LF              *
      *                  *---------------------------------------------*
           move      x'0A'                to   ouf-lfx                .
       ouf-fil-wrt-300.
      *                  *---------------------------------------------*
      *                  * Scrittura effettiva                         *
      *                  *---------------------------------------------*
           write     ouf-rec                                          .
       ouf-fil-wrt-999.
           exit.

      *    *===========================================================*
      *    * Routine per la scrittura record in file Line-Sequential   *
      *    *                                                           *
      *    * Tipo : UNIX                                               *
      *    *-----------------------------------------------------------*
       put-nxt-seq-000.
      *              *-------------------------------------------------*
      *              * Test su personalizzazione relativa al tipo di   *
      *              * file da emettere : UNIX o MS-DOS                *
      *              *-------------------------------------------------*
           if        w-prs-tip-fsm        not  = "U"
                     go to put-nxt-seq-999.
      *              *-------------------------------------------------*
      *              * Incremento progressivo record emessi            *
      *              *-------------------------------------------------*
           add       1                    to   w-ads-sia-gen-rpt      .
       put-nxt-seq-200.
      *              *-------------------------------------------------*
      *              * Scrittura record in file Line-Sequential        *
      *              *-------------------------------------------------*
           move      "PN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mlsfil"
                                         using g                      .
       put-nxt-seq-999.
           exit.

      *    *===========================================================*
      *    * Routine per il controllo di errore in scrittura record in *
      *    * file Line-Sequential                                      *
      *    *-----------------------------------------------------------*
       tst-err-wrt-000.
      *              *-------------------------------------------------*
      *              * Se errori : messaggio ed uscita con flag di er- *
      *              * rore                                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se controllo da effettuare             *
      *                  *---------------------------------------------*
           if        w-prs-tip-fsm        not  = "U"
                     go to tst-err-wrt-999.
      *                  *---------------------------------------------*
      *                  * Controllo                                   *
      *                  *---------------------------------------------*
           if        g-sts                =    e-not-err
                     go to tst-err-wrt-999.
      *                  *---------------------------------------------*
      *                  * Messaggio                                   *
      *                  *---------------------------------------------*
           move      "Attenzione : Errore nella generazione dell'archivi
      -              "o di supporto. "    to   w-err-box-err-msg      .
           move      "             Operazione non eseguita (Write error)
      -              " !             "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
      *                  *---------------------------------------------*
      *                  * Flag ad errore                              *
      *                  *---------------------------------------------*
           move      "#"                  to   w-ads-tab-out-flg      .
       tst-err-wrt-999.
           exit.

      *    *===========================================================*
      *    * Determinazione numero ordine di bonifico                  *
      *    *-----------------------------------------------------------*
       det-sfo-num-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo stampa          *
      *              *-------------------------------------------------*
           if        rr-tip-stp           =    01
                     go to det-sfo-num-100
           else if   rr-tip-stp           =    03
                     go to det-sfo-num-300
           else      go to det-sfo-num-900.
       det-sfo-num-100.
      *              *-------------------------------------------------*
      *              * Se stampa definitiva                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione secolo ed anno                 *
      *                  *---------------------------------------------*
           move      w-ads-tab-inp-dpr    to   s-dat                  .
           move      s-saa                to   w-sfo-num-scl-ann      .
      *                  *---------------------------------------------*
      *                  * Richiamo routine di attribuzione            *
      *                  *---------------------------------------------*
           perform   att-sfo-num-000      thru att-sfo-num-999        .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     det-sfo-num-900.
       det-sfo-num-300.
      *              *-------------------------------------------------*
      *              * Ristampa                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Come per stampa definitiva                  *
      *                  *---------------------------------------------*
           go to     det-sfo-num-100.
       det-sfo-num-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-sfo-num-999.
       det-sfo-num-999.
           exit.

      *    *===========================================================*
      *    * Routine di attribuzione numero ordine di bonifico         *
      *    *-----------------------------------------------------------*
       att-sfo-num-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfonum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfo-num             .
      *              *-------------------------------------------------*
      *              * Preparazione chiave per lettura tabella numera- *
      *              * zioni [sfonum]                                  *
      *              *-------------------------------------------------*
           move      w-sfo-num-scl-ann    to   rn-sfo-num-scl-ann     .
      *              *-------------------------------------------------*
      *              * Lettura tabella numerazioni [sfonum]            *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfonum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfo-num             .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to att-sfo-num-400.
       att-sfo-num-200.
      *              *-------------------------------------------------*
      *              * Se record non esistente                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Scrittura record normalizzato               *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfonum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfo-num             .
      *                  *---------------------------------------------*
      *                  * Unlock record                               *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfonum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfo-num             .
      *                  *---------------------------------------------*
      *                  * Ripetizione dell'intera operazione          *
      *                  *---------------------------------------------*
           go to     att-sfo-num-000.
       att-sfo-num-400.
      *              *-------------------------------------------------*
      *              * Se record esistente                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore pre-incremento           *
      *                  *---------------------------------------------*
           move      rn-sfo-num-num-odb   to   w-sfo-num-num-odb      .
           move      w-sfo-num-r01-num    to   w-sfo-num-val-pre      .
      *                  *---------------------------------------------*
      *                  * Preparazione valore post-incremento         *
      *                  *---------------------------------------------*
           move      w-sfo-num-val-pre    to   w-sfo-num-val-pos      .
           add       1                    to   w-sfo-num-val-pos      .
           if        w-sfo-num-val-pos    =    zero
                     move  1              to   w-sfo-num-val-pos      .
      *                  *---------------------------------------------*
      *                  * Preparazione numero addebito completo       *
      *                  *---------------------------------------------*
           move      w-sfo-num-scl-ann    to   w-sfo-num-r01-saa      .
           move      w-sfo-num-val-pos    to   w-sfo-num-r01-num      .
      *                  *---------------------------------------------*
      *                  * Aggiornamento numero addebito               *
      *                  *---------------------------------------------*
           move      w-sfo-num-num-odb    to   rn-sfo-num-num-odb     .
      *                  *---------------------------------------------*
      *                  * Update record                               *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfonum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfo-num             .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito dell'opera- *
      *                  * zione di update                             *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to att-sfo-num-600.
       att-sfo-num-500.
      *                  *---------------------------------------------*
      *                  * Se errore in operazione di update           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Unlock record                           *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfonum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfo-num             .
      *                      *-----------------------------------------*
      *                      * Ripetizione dell'intera operazione      *
      *                      *-----------------------------------------*
           go to     att-sfo-num-000.
       att-sfo-num-600.
      *                  *---------------------------------------------*
      *                  * Se nessun errore in operazione di update    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Unlock record                           *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfonum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfo-num             .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     att-sfo-num-999.
       att-sfo-num-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice nostra cassa, o *
      *    * nostra banca, o nostro c/c postale                        *
      *    *-----------------------------------------------------------*
           copy      "pgm/gep/prg/cpy/acdecbp0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice fornitore com-  *
      *    * merciale                                                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/acmndcf0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per accettazione codice dipendenza fornitore  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/acoddcf0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice CIN             *
      *    *-----------------------------------------------------------*
           copy      "pgm/abi/prg/cpy/acodcin0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

