       Identification Division.
       Program-Id.                                 pcge9560           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    cge                 *
      *                                Settore:    uti                 *
      *                                   Fase:    cge956              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 14/11/89    *
      *                       Ultima revisione:    NdK del 14/11/22    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Gestione movimento iva fattura fornitore    *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "cge"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "uti"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "cge956"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pcge9560"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "GESTIONE MOVIMENTO IVA DOCUMENTO FORNIT."       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo su modalita' di funzionamento      *
      *        *-------------------------------------------------------*
           05  w-cnt-mfu.
      *            *---------------------------------------------------*
      *            * Visualizzazione forzata da segreteria             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-vis-sgr      pic  x(01)                  .

      *    *===========================================================*
      *    * Area per utilizzo interno                                 *
      *    *-----------------------------------------------------------*
       01  y-are.
      *        *-------------------------------------------------------*
      *        * Status di uscita da routines specifiche               *
      *        *-------------------------------------------------------*
           05  OK                         pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 80 trattini                                           *
      *        *-------------------------------------------------------*
           05  y-are-080-tra              pic  x(80) value all "="    .
      *        *-------------------------------------------------------*
      *        * Descrizione della funzione in atto                    *
      *        *-------------------------------------------------------*
           05  y-are-des-fun              pic  x(15)                  .
      *        *-------------------------------------------------------*
      *        * Segnale di tipo funzionamento                         *
      *        * - "K" : campi chiave                                  *
      *        * - "I" : inserimento                                   *
      *        * - "M" : modifica                                      *
      *        *-------------------------------------------------------*
           05  y-are-tip-fun              pic  x(01) value spaces     .
      *        *-------------------------------------------------------*
      *        * Flag di impostazione campi chiave o non-chiave        *
      *        * - spaces : impostazione campi non-chiave              *
      *        * - "K"    : impostazione campi chiave                  *
      *        *-------------------------------------------------------*
           05  y-are-flg-kon              pic  x(01) value spaces     .
      *        *-------------------------------------------------------*
      *        * Segnale se avvenuta almeno una modifica nell'imposta- *
      *        * zione dei campi non chiave                            *
      *        * - spaces : nessuna modifica                           *
      *        * - "#"    : almeno una modifica                        *
      *        *-------------------------------------------------------*
           05  y-are-flg-aum              pic  x(01) value spaces     .
      *        *-------------------------------------------------------*
      *        * Area per salvataggio parametri video                  *
      *        *-------------------------------------------------------*
           05  y-are-sav-are.
               10  y-are-sav-tip          pic  x(01)                  .
               10  y-are-sav-car          pic  9(02)                  .
               10  y-are-sav-ldt          pic  9(02)                  .
               10  y-are-sav-dec          pic  9(01)                  .
               10  y-are-sav-sgn          pic  x(01)                  .
               10  y-are-sav-edm          pic  x(10)                  .
               10  y-are-sav-msk          pic  x(24)                  .
               10  y-are-sav-lin          pic  9(02)                  .
               10  y-are-sav-pos          pic  9(02)                  .
               10  y-are-sav-alf          pic  x(80)                  .
               10  y-are-sav-txt.
                   15  filler occurs 400  pic  x(01)                  .
               10  y-are-sav-num          pic s9(13)v9(05)  trailing
                                                            separate
                                                            character .
               10  y-are-sav-dat          pic  9(07)                  .
               10  y-are-sav-ufk          pic  x(80)                  .
               10  y-are-sav-mod          pic  x(01)                  .
               10  y-are-sav-l23          pic  x(80)                  .
               10  y-are-sav-l24          pic  x(80)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [sff]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/fls/rec/rfsff"                          .
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [zcc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfzcc"                          .
      *        *-------------------------------------------------------*
      *        * [zci]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfzci"                          .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Regime fiscale particolare                 *
      *        *-------------------------------------------------------*
           05  w-exp-flg-rfp.
               10  w-exp-flg-rfp-num      pic  9(02)       value 4    .
               10  w-exp-flg-rfp-lun      pic  9(02)       value 40   .
               10  w-exp-flg-rfp-tbl.
                   15  filler             pic  x(40) value
                            "Normale regime fiscale                  ".
                   15  filler             pic  x(40) value
                            "regime di Scissione dei pagamenti       ".
                   15  filler             pic  x(40) value
                            "regime di reverse Charge                ".
                   15  filler             pic  x(40) value
                            "Esclusione da dichiarazione annuale IVA ".

      *    *===========================================================*
      *    * Work area locale                                          *
      *    *-----------------------------------------------------------*
       01  w-wrk.
      *        *-------------------------------------------------------*
      *        * Work per codice iva ridefinito                        *
      *        *-------------------------------------------------------*
           05  w-wrk-cod-iva              pic  9(05)                  .
           05  w-wrk-cod-iva-r redefines
               w-wrk-cod-iva                                          .
               10  w-wrk-cod-iva-001      pic  9(01)                  .
               10  w-wrk-cod-iva-002      pic  9(01)                  .
               10  w-wrk-cod-iva-345      pic  9(03)                  .
               10  w-wrk-cod-iva-345-r redefines
                   w-wrk-cod-iva-345                                  .
                   15  w-wrk-cod-iva-003  pic  9(01)                  .
                   15  w-wrk-cod-iva-045  pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Contatore per numero linea                            *
      *        *-------------------------------------------------------*
           05  w-wrk-ctr-lin              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo 1                                 *
      *        *-------------------------------------------------------*
           05  w-wrk-ctr-001              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo 2                                 *
      *        *-------------------------------------------------------*
           05  w-wrk-ctr-002              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per numero di 13 cifre con segno               *
      *        *-------------------------------------------------------*
           05  w-wrk-num-s13              pic s9(13)                  .

      *    *===========================================================*
      *    * Work area per lettura causale                             *
      *    *-----------------------------------------------------------*
       01  w-cau.
      *        *-------------------------------------------------------*
      *        * Codice causale in input                               *
      *        *-------------------------------------------------------*
           05  w-cau-cod-inp              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Descrizione causale in output                         *
      *        *-------------------------------------------------------*
           05  w-cau-des-cau              pic  x(30)                  .
      *        *-------------------------------------------------------*
      *        * Marker di causale trovata o non trovata               *
      *        *-------------------------------------------------------*
           05  w-cau-mrk-fnf              pic  x(01)                  .

      *    *===========================================================*
      *    * Work area per impostazione riga castelletto               *
      *    *-----------------------------------------------------------*
       01  w-cst.
      *        *-------------------------------------------------------*
      *        * Totale riga                                           *
      *        *-------------------------------------------------------*
           05  w-cst-tot-rig              pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di riga                                     *
      *        *-------------------------------------------------------*
           05  w-cst-ctr-rig              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Numero di riga massimo a cui si e' arrivati nell'im-  *
      *        * postazione castelletto                                *
      *        *-------------------------------------------------------*
           05  w-cst-max-rig              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Numero di linea dell'ultima riga castelletto imposta- *
      *        * ta                                                    *
      *        *-------------------------------------------------------*
           05  w-cst-max-lin              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Segnale che indica fase di impostazione riga castel-  *
      *        * letto                                                 *
      *        *-------------------------------------------------------*
           05  w-cst-flg-ins              pic  x(01)                  .

      *    *===========================================================*
      *    * Work area per totale castelletto iva                      *
      *    *-----------------------------------------------------------*
       01  w-tot.
      *        *-------------------------------------------------------*
      *        * Totale imponibile                                     *
      *        *-------------------------------------------------------*
           05  w-tot-ibl-iva              pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Totale imposta                                        *
      *        *-------------------------------------------------------*
           05  w-tot-imp-iva              pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Flag di forzatura totale documento                    *
      *        *-------------------------------------------------------*
           05  w-tot-flg-frz              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo 1                                 *
      *        *-------------------------------------------------------*
           05  w-tot-ctr-001              pic  9(02)                  .

      *    *===========================================================*
      *    * Work per subroutines di editing codice iva                *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/wedtzci0.wkl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazioni su codice Iva    *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/dimpiva0.dtl"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   z-dic-ini-pgm-000    thru z-dic-ini-pgm-999      .
           if        OK                   not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   OK                     .
           perform   pre-exe-pgm-000    thru pre-exe-pgm-999      .
           if        OK                   not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Open file                                       *
      *              *-------------------------------------------------*
           move      spaces               to   OK                     .
           perform   z-mnt-fil-opn-000    thru z-mnt-fil-opn-999      .
           if        OK                   not  = spaces
                     go to main-950.
      *              *-------------------------------------------------*
      *              * Open files ausiliari                            *
      *              *-------------------------------------------------*
           perform   z-opn-fls-aux-000    thru z-opn-fls-aux-999      .
       main-100.
      *              *-------------------------------------------------*
      *              * Normalizzazione record file                     *
      *              *-------------------------------------------------*
           perform   z-mnt-fil-nor-000    thru z-mnt-fil-nor-999      .
      *              *-------------------------------------------------*
      *              * Video in 'OFF'                                  *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Visualizzazione titolo programma                *
      *              *-------------------------------------------------*
           perform   z-vis-tit-pgm-000    thru z-vis-tit-pgm-999      .
      *              *-------------------------------------------------*
      *              * Descrizione della funzione in atto              *
      *              *-------------------------------------------------*
           move      spaces               to   y-are-des-fun          .
           perform   z-vis-des-fun-000    thru z-vis-des-fun-999      .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts a video                 *
      *              *-------------------------------------------------*
           perform   z-vis-pmt-vid-000    thru z-vis-pmt-vid-999      .
      *              *-------------------------------------------------*
      *              * Video in 'ON'                                   *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Tipo funzionamento : campi chiave               *
      *              *-------------------------------------------------*
           move      "K"                  to   y-are-tip-fun          .
      *              *-------------------------------------------------*
      *              * Flag di impostazione campi chiave               *
      *              *-------------------------------------------------*
           move      "K"                  to   y-are-flg-kon          .
      *              *-------------------------------------------------*
      *              * Flag di almeno una modifica                     *
      *              *-------------------------------------------------*
           move      spaces               to   y-are-flg-aum          .
      *              *-------------------------------------------------*
      *              * Accettazione campi chiave                       *
      *              *-------------------------------------------------*
           move      spaces               to   OK                     .
           perform   z-acc-cmp-key-000    thru z-acc-cmp-key-999      .
      *              *-------------------------------------------------*
      *              * Test su tasto di uscita                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     go to main-220
           else      go to main-240.
       main-220.
      *                  *---------------------------------------------*
      *                  * Uscita per tasto "EXIT"                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se dal primo campo di impostazione si   *
      *                      * esce dal programma                      *
      *                      *-----------------------------------------*
           if        OK                   not  = spaces
                     go to main-900.
      *                      *-----------------------------------------*
      *                      * Altrimenti si ricicla nella gestione    *
      *                      *-----------------------------------------*
           go to     main-100.
       main-240.
      *                  *---------------------------------------------*
      *                  * Uscita per tasto "DO  "                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se chiave vuota                    *
      *                      *-----------------------------------------*
           move      spaces               to   OK                     .
           perform   z-tst-key-vuo-000    thru z-tst-key-vuo-999      .
      *                          *-------------------------------------*
      *                          * Se chiave vuota : fine programma    *
      *                          *-------------------------------------*
           if        OK                   =    "V"
                     go to main-900.
      *                      *-----------------------------------------*
      *                      * Read record                             *
      *                      *-----------------------------------------*
           move      spaces               to   OK                     .
           perform   z-mnt-fil-get-000    thru z-mnt-fil-get-999      .
      *                      *-----------------------------------------*
      *                      * Test su esito operazione                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se record non ottenuto si ricicla   *
      *                          * nella gestione                      *
      *                          *-------------------------------------*
           if        OK                   =    "#"
                     go to main-100.
      *                          *-------------------------------------*
      *                          * Se record ottenuto :                *
      *                          * se record non trovato : inserimento *
      *                          * se record trovato     : modifica    *
      *                          *-------------------------------------*
           if        OK                   =    "N"
                     go to main-300
           else      go to main-400.
       main-300.
      *              *-------------------------------------------------*
      *              * Inserimento                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Descrizione della funzione in atto          *
      *                  *---------------------------------------------*
           move      "    Inserimento"    to   y-are-des-fun          .
           perform   z-vis-des-fun-000    thru z-vis-des-fun-999      .
      *                  *---------------------------------------------*
      *                  * Tipo funzionamento : Inserimento            *
      *                  *---------------------------------------------*
           move      "I"                  to   y-are-tip-fun          .
      *                  *---------------------------------------------*
      *                  * Flag di impostazione campi non-chiave       *
      *                  *---------------------------------------------*
           move      spaces               to   y-are-flg-kon          .
      *                  *---------------------------------------------*
      *                  * Flag di almeno una modifica                 *
      *                  *---------------------------------------------*
           move      spaces               to   y-are-flg-aum          .
      *                  *---------------------------------------------*
      *                  * Accettazione dei campi non chiave           *
      *                  *---------------------------------------------*
           perform   z-acc-non-key-000    thru z-acc-non-key-999      .
      *                  *---------------------------------------------*
      *                  * Test su tasto di uscita                     *
      *                  *---------------------------------------------*
           if        v-key                =    "EXIT"
                     go to main-320
           else      go to main-340.
       main-320.
      *                      *-----------------------------------------*
      *                      * Uscita per tasto "EXIT"                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Riciclo nella gestione              *
      *                          *-------------------------------------*
           go to     main-100.
       main-340.
      *                      *-----------------------------------------*
      *                      * Uscita per tasto "DO  "                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Regolarizzazione record file        *
      *                          *-------------------------------------*
           perform   reg-rec-fil-000      thru reg-rec-fil-999        .
      *                          *-------------------------------------*
      *                          * Put record                          *
      *                          *-------------------------------------*
           perform   z-mnt-fil-put-000    thru z-mnt-fil-put-999      .
      *                          *-------------------------------------*
      *                          * Riciclo nella gestione              *
      *                          *-------------------------------------*
           go to     main-100.
       main-400.
      *              *-------------------------------------------------*
      *              * Modifica                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Descrizione della funzione in atto          *
      *                  *---------------------------------------------*
           move      "       Modifica"    to   y-are-des-fun          .
           perform   z-vis-des-fun-000    thru z-vis-des-fun-999      .
      *                  *---------------------------------------------*
      *                  * Tipo funzionamento : Modifica               *
      *                  *---------------------------------------------*
           move      "M"                  to   y-are-tip-fun          .
      *                  *---------------------------------------------*
      *                  * Flag di impostazione campi non-chiave       *
      *                  *---------------------------------------------*
           move      spaces               to   y-are-flg-kon          .
      *                  *---------------------------------------------*
      *                  * Flag di almeno una modifica                 *
      *                  *---------------------------------------------*
           move      spaces               to   y-are-flg-aum          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati del record             *
      *                  *---------------------------------------------*
           perform   vis-dat-rec-000      thru vis-dat-rec-999        .
      *                  *---------------------------------------------*
      *                  * Accettazione dei campi non chiave           *
      *                  *---------------------------------------------*
           perform   z-acc-non-key-000    thru z-acc-non-key-999      .
      *                  *---------------------------------------------*
      *                  * Test su tasto di uscita                     *
      *                  *---------------------------------------------*
           if        v-key                =    "EXIT"
                     go to main-420
           else if   v-key                =    "DO  "
                     go to main-440
           else      go to main-460.
       main-420.
      *                      *-----------------------------------------*
      *                      * Uscita per tasto "EXIT"                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Riciclo nella gestione              *
      *                          *-------------------------------------*
           go to     main-100.
       main-440.
      *                      *-----------------------------------------*
      *                      * Uscita per tasto "DO  "                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Regolarizzazione record file        *
      *                          *-------------------------------------*
           perform   reg-rec-fil-000      thru reg-rec-fil-999        .
      *                          *-------------------------------------*
      *                          * Update record                       *
      *                          *-------------------------------------*
           perform   z-mnt-fil-upd-000    thru z-mnt-fil-upd-999      .
      *                          *-------------------------------------*
      *                          * Riciclo nella gestione              *
      *                          *-------------------------------------*
           go to     main-100.
       main-460.
      *                      *-----------------------------------------*
      *                      * Uscita per tasto "DELT"                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Delete record                       *
      *                          *-------------------------------------*
           perform   z-mnt-fil-del-000    thru z-mnt-fil-del-999      .
      *                          *-------------------------------------*
      *                          * Riciclo nella gestione              *
      *                          *-------------------------------------*
           go to     main-100.
       main-900.
      *              *-------------------------------------------------*
      *              * Close file                                      *
      *              *-------------------------------------------------*
           perform   z-mnt-fil-cls-000    thru z-mnt-fil-cls-999      .
      *              *-------------------------------------------------*
      *              * Close files ausiliari                           *
      *              *-------------------------------------------------*
           perform   z-cls-fls-aux-000    thru z-cls-fls-aux-999      .
       main-950.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   z-dic-fin-pgm-000    thru z-dic-fin-pgm-999      .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       z-dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   OK
           else      move  spaces         to   OK                     .
      *              *-------------------------------------------------*
      *              * Flag di eventuale visualizzazione forzata       *
      *              *-------------------------------------------------*
           move      s-sts                to   w-cnt-mfu-vis-sgr      .
       z-dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       z-dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       z-dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       z-vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      y-are-080-tra        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      y-are-080-tra        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      y-are-080-tra        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       z-vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione della descrizione della funzione in atto  *
      *    *-----------------------------------------------------------*
       z-vis-des-fun-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      66                   to   v-pos                  .
           move      y-are-des-fun        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       z-vis-des-fun-999.
           exit.

      *    *===========================================================*
      *    * Open file                                                 *
      *    *-----------------------------------------------------------*
       z-mnt-fil-opn-000.
           move      "OP"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsff"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sff                 .
      *
           if        f-sts                =    e-not-err
                     go to z-mnt-fil-opn-999.
           move      "ME"                 to   v-ope                  .
           move      "Attenzione : l'accesso all'archivio non e' possib
      -              "ile !"              to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "#"                  to   OK                     .
       z-mnt-fil-opn-999.
           exit.

      *    *===========================================================*
      *    * Close file                                                *
      *    *-----------------------------------------------------------*
       z-mnt-fil-cls-000.
           move      "CL"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsff"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sff                 .
       z-mnt-fil-cls-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione record file                               *
      *    *-----------------------------------------------------------*
       z-mnt-fil-nor-000.
           move      "NO"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsff"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sff                 .
       z-mnt-fil-nor-999.
           exit.

      *    *===========================================================*
      *    * Read record                                               *
      *    *                                                           *
      *    * Uscita  : OK = "#" : errore generico                      *
      *    *                "S" : record esistente                     *
      *    *                "N" : record non esistente                 *
      *    *-----------------------------------------------------------*
       z-mnt-fil-get-000.
           move      "RD"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsff"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sff                 .
           if        f-sts                =    e-use-err
                     move  "#"            to   OK
           else if   f-sts                =    e-not-fnd
                     move  "N"            to   OK
           else      move  "S"            to   OK                     .
      *              *-------------------------------------------------*
      *              * Eventuali normalizzazioni                       *
      *              *-------------------------------------------------*
           if        rf-sff-dtr-ftf       not  numeric
                     move  zero           to   rf-sff-dtr-ftf         .
       z-mnt-fil-get-999.
           exit.

      *    *===========================================================*
      *    * Put record                                                *
      *    *-----------------------------------------------------------*
       z-mnt-fil-put-000.
           move      "PT"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsff"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sff                 .
       z-mnt-fil-put-999.
           exit.

      *    *===========================================================*
      *    * Force Put record                                          *
      *    *-----------------------------------------------------------*
       z-mnt-fil-upd-000.
           move      "FP"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsff"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sff                 .
       z-mnt-fil-upd-999.
           exit.

      *    *===========================================================*
      *    * Delete record                                             *
      *    *-----------------------------------------------------------*
       z-mnt-fil-del-000.
           move      "DE"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsff"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sff                 .
       z-mnt-fil-del-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Abilitazione tasto di funzione EXIT             *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk(11)              .
      *              *-------------------------------------------------*
      *              * Se in impostazione campi chiave : no DELT       *
      *              *-------------------------------------------------*
           if        y-are-tip-fun        =    "K"
                     go to exe-acc-cmp-200.
      *              *-------------------------------------------------*
      *              * Se in inserimento : no DELT                     *
      *              *-------------------------------------------------*
           if        y-are-tip-fun        =    "I"
                     go to exe-acc-cmp-200.
      *              *-------------------------------------------------*
      *              * Se gia' avvenuta almeno una modifica : no DELT  *
      *              *-------------------------------------------------*
           if        y-are-flg-aum        not  = spaces
                     go to exe-acc-cmp-200.
      *              *-------------------------------------------------*
      *              * Abilitazione tasto di funzione DELT             *
      *              *-------------------------------------------------*
           move      "DELT"               to   v-pfk(12)              .
      *              *-------------------------------------------------*
      *              * Salvataggio parametri di impostazione           *
      *              *-------------------------------------------------*
           move      v-tip                to   y-are-sav-tip          .
           move      v-car                to   y-are-sav-car          .
           move      v-lin                to   y-are-sav-lin          .
           move      v-pos                to   y-are-sav-pos          .
           if        v-tip                =    "N"
                     move  v-dec          to   y-are-sav-dec
                     move  v-sgn          to   y-are-sav-sgn
                     move  v-edm          to   y-are-sav-edm
                     move  v-msk          to   y-are-sav-msk
                     move  v-num          to   y-are-sav-num
           else if   v-tip                =    "D"
                     move  v-dat          to   y-are-sav-dat
           else if   v-tip                =    "T"
                     move  v-ldt          to   y-are-sav-ldt
                     move  v-txt          to   y-are-sav-txt
           else      move  v-alf          to   y-are-sav-alf          .
           move      v-ufk                to   y-are-sav-ufk          .
       exe-acc-cmp-200.
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Memorizzazione segnale di campo modificato      *
      *              *-------------------------------------------------*
           move      v-mod                to   y-are-sav-mod          .
      *              *-------------------------------------------------*
      *              * Test se premuto tasto di funzione DELT          *
      *              *-------------------------------------------------*
           if        v-key                not  = "DELT"
                     go to exe-acc-cmp-900.
      *              *-------------------------------------------------*
      *              * Se il campo impostato ha modificato il valore   *
      *              * precedente : ripetizione impostazione           *
      *              *-------------------------------------------------*
           if        y-are-sav-mod        =    spaces
                     go to exe-acc-cmp-400.
       exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Ripristino parametri di impostazione            *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      y-are-sav-tip        to   v-tip                  .
           move      y-are-sav-car        to   v-car                  .
           move      y-are-sav-lin        to   v-lin                  .
           move      y-are-sav-pos        to   v-pos                  .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  y-are-sav-dec  to   v-dec
                     move  y-are-sav-sgn  to   v-sgn
                     move  y-are-sav-edm  to   v-edm
                     move  y-are-sav-msk  to   v-msk
                     move  y-are-sav-num  to   v-num
           else if   v-tip                =    "D"
                     move  y-are-sav-dat  to   v-dat
           else if   v-tip                =    "T"
                     move  y-are-sav-ldt  to   v-ldt
                     move  y-are-sav-txt  to   v-txt
           else      move  y-are-sav-alf  to   v-alf                  .
           move      y-are-sav-ufk        to   v-ufk                  .
      *              *-------------------------------------------------*
      *              * Ritorno alla impostazione                       *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-200.
       exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Salvataggio linee 23 e 24 di note operative     *
      *              *-------------------------------------------------*
           move      "GL"                 to   v-ope                  .
           move      23                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   y-are-sav-l23          .
           move      "GL"                 to   v-ope                  .
           move      24                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   y-are-sav-l24          .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative attuali            *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      spaces               to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Richiesta conferma annullamento                 *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "Conferma operazione di annullamento (S/N/E) ?"
                                          to   v-not                  .
           move      "N"                  to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DELT"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "EXIT"               to   v-pfk (3)              .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                =    spaces
                     if      v-alf        =    "S"
                             move  "DELT" to   v-key
                             go to exe-acc-cmp-500
                     else if v-alf        =    "N"
                             move  "UP  " to   v-key
                             go to exe-acc-cmp-500
                     else    move  "EXIT" to   v-key                  .
       exe-acc-cmp-500.
      *              *-------------------------------------------------*
      *              * Se function key DELT o EXIT si esce             *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to exe-acc-cmp-999.
      *              *-------------------------------------------------*
      *              * Ripristino linee 23 e 24 di note operative      *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      y-are-sav-l23        to   v-nt1                  .
           move      y-are-sav-l24        to   v-nt2                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Ripristino parametri e poi reimpostazione       *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-300.
       exe-acc-cmp-900.
      *              *-------------------------------------------------*
      *              * Flag globale di avvenuta almeno una modifica    *
      *              *-------------------------------------------------*
           if        y-are-sav-mod        not  = spaces
                     move  "#"            to   y-are-flg-aum          .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Open files ausiliari                                      *
      *    *-----------------------------------------------------------*
       z-opn-fls-aux-000.
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [zcc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zcc                 .
      *              *-------------------------------------------------*
      *              * [zci]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione imposta           *
      *              *-------------------------------------------------*
           perform   det-imp-iva-opn-000  thru det-imp-iva-opn-999    .
       z-opn-fls-aux-999.
           exit.

      *    *===========================================================*
      *    * Close files ausiliari                                     *
      *    *-----------------------------------------------------------*
       z-cls-fls-aux-000.
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [zcc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzcc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zcc                 .
      *              *-------------------------------------------------*
      *              * [zci]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione imposta          *
      *              *-------------------------------------------------*
           perform   det-imp-iva-cls-000  thru det-imp-iva-cls-999    .
       z-cls-fls-aux-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *                                                           *
      *    * Uscita  : OK = spaces : continua l'esecuzione             *
      *    *                "#"    : terminazione programma            *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Test se programma eseguibile                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su flag di eventuale visualizzazione   *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-vis-sgr    not  = "V"
                     go to pre-exe-pgm-002.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "ME"                 to   v-ope                  .
           move      "Programma non eseguibile dall'utente !            
      -              "        "           to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   OK                     .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pre-exe-pgm-999.
       pre-exe-pgm-002.
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts a video (prima videata)           *
      *    *-----------------------------------------------------------*
       z-vis-pmt-vid-000.
      *              *-------------------------------------------------*
      *              * Numero protocollo                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      19                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero protocollo :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Data registrazione                              *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      52                   to   v-pos                  .
           move      "Data registrazione :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Riga di trattini                                *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * 'Codice causale contabile :'                    *
      *              *-------------------------------------------------*
      *              *-------------------------------------------------*
      *              * 'Tipo movimento iva       :'                    *
      *              *-------------------------------------------------*
      *              *-------------------------------------------------*
      *              * Fincatura per castelletto iva                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "       Codice iva       Imponibile          Impost
      -              "a            Totale           "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Sottolineatura                              *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "       ----------    ---------------    ----------
      -              "-----    ---------------      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * 'Totali :'                                      *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Totali :"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       z-vis-pmt-vid-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi chiave                                 *
      *    *                                                           *
      *    * Uscita  : OK = spaces : continua l'esecuzione             *
      *    *                "#"    : uscita dal primo campo d'imposta- *
      *    *                         zione                             *
      *    *-----------------------------------------------------------*
       z-acc-cmp-key-000.
       z-acc-cmp-key-100.
      *              *-------------------------------------------------*
      *              * Numero protocollo                               *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      04                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      "DOWN"               to   v-pfk(1)               .
           move      "DO  "               to   v-pfk(2)               .
           move      rf-sff-num-ftf       to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           move      v-num                to   rf-sff-num-ftf         .
      *                  *---------------------------------------------*
      *                  * Se premuta function-key 'EXIT' si esce      *
      *                  *---------------------------------------------*
           if        v-key                =    "EXIT"
                     move   "#"           to   OK
                     go to  z-acc-cmp-key-999.
      *                  *---------------------------------------------*
      *                  * Controllo chiavi impostate                  *
      *                  *---------------------------------------------*
           move      spaces               to   OK                     .
           perform   cnt-cmp-key-000      thru cnt-cmp-key-999        .
           if        OK                   not  = spaces
                     move   spaces        to   OK
                     go to  z-acc-cmp-key-100.
       z-acc-cmp-key-999.
           exit.

      *    *===========================================================*
      *    * Controllo impostazione campi chiave                       *
      *    *                                                           *
      *    * Uscita  : OK = "#"        : Controllo non superato        *
      *    *-----------------------------------------------------------*
       cnt-cmp-key-000.
       cnt-cmp-key-999.
           exit.

      *    *===========================================================*
      *    * Test se chiave vuota                                      *
      *    *                                                           *
      *    * Uscita  : OK = "V"        : Chiave vuota                  *
      *    *                Altrimenti : Chiave non vuota              *
      *    *-----------------------------------------------------------*
       z-tst-key-vuo-000.
       z-tst-key-vuo-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione dati del record da modificare             *
      *    *-----------------------------------------------------------*
       vis-dat-rec-000.
      *              *-------------------------------------------------*
      *              * Visualizzazione data registrazione              *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      04                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      rf-sff-dtr-ftf       to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-dat-rec-050.
      *              *-------------------------------------------------*
      *              * Visualizzazione castelletto iva                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione linea iniziale               *
      *                  *---------------------------------------------*
           move      12                   to   w-wrk-ctr-lin          .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione                          *
      *                  *---------------------------------------------*
           move      zero                 to   w-wrk-ctr-001          .
       vis-dat-rec-100.
           add       1                    to   w-wrk-ctr-001          .
           if        w-wrk-ctr-001        >    6
                     go to  vis-dat-rec-400.
                     
                     
                     
           if        rf-sff-iva-cod
                    (w-wrk-ctr-001)       =    zero
                     go to  vis-dat-rec-400.
                     
                     
           if        rf-sff-iva-cod
                    (w-wrk-ctr-001)       =    zero and
                     rf-sff-iva-ibl
                    (w-wrk-ctr-001)       =    zero and
                     rf-sff-iva-imp
                    (w-wrk-ctr-001)       =    zero
                     go to  vis-dat-rec-400.
      *                  *---------------------------------------------*
      *                  * Codice iva in comodo ridefinito             *
      *                  *---------------------------------------------*
           move      rf-sff-iva-cod
                    (w-wrk-ctr-001)       to   w-wrk-cod-iva          .
      *                  *---------------------------------------------*
      *                  * Incremento numero di linea                  *
      *                  *---------------------------------------------*
           add       1                    to   w-wrk-ctr-lin          .
      *                  *---------------------------------------------*
      *                  * Codice iva                                  *
      *                  *---------------------------------------------*
           move      rf-sff-iva-cod
                    (w-wrk-ctr-001)       to   w-edt-iva-cod          .
           perform   edt-cod-iva-000      thru edt-cod-iva-999        .
      *
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      02                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "BD"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      13                   to   v-pos                  .
           move      w-edt-iva-cie        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Imponibile                                  *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      22                   to   v-pos                  .
           move      rf-sff-iva-ibl
                    (w-wrk-ctr-001)       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Imposta o esenzione                         *
      *                  *---------------------------------------------*
           if        w-edt-iva-cod-003    >    2 and
                     w-edt-iva-cod-003    <    8
                     go to  vis-dat-rec-200.
      *                      *-----------------------------------------*
      *                      * Caso imposta                            *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rf-sff-iva-imp
                    (w-wrk-ctr-001)       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     vis-dat-rec-300.
       vis-dat-rec-200.
      *                      *-----------------------------------------*
      *                      * Caso esenzione                          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione record [zci]        *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *                          *-------------------------------------*
      *                          * Composizione chiave                 *
      *                          *-------------------------------------*
           move      w-wrk-cod-iva-345    to   rf-zci-cod-iva         .
      *                          *-------------------------------------*
      *                          * Lettura record [zci]                *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODIVA    "         to   f-key                  .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *                              *---------------------------------*
      *                              * Test su esito lettura           *
      *                              *---------------------------------*
           if        f-sts                =    e-not-fnd
                     move   all "."       to   rf-zci-des-doc         .
           move      rf-zci-des-doc       to   v-alf                  .
      *                          *-------------------------------------*
      *                          * Visualizzazione descriz. esenzione  *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      41                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dat-rec-300.
      *                  *---------------------------------------------*
      *                  * Totale riga                                 *
      *                  *---------------------------------------------*
           move      zero                 to   v-num                  .
           add       rf-sff-iva-ibl
                    (w-wrk-ctr-001)
                     rf-sff-iva-imp
                    (w-wrk-ctr-001)     giving v-num                  .
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      60                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Riciclo a riga castelletto successiva       *
      *                  *---------------------------------------------*
           go to     vis-dat-rec-100.
       vis-dat-rec-400.
      *              *-------------------------------------------------*
      *              * Memorizzazione numero righe castelletto         *
      *              *-------------------------------------------------*
           if        w-wrk-ctr-001        >    6
                     move   6             to   w-wrk-ctr-001          .
           move      w-wrk-ctr-001        to   w-cst-max-rig          .
      *              *-------------------------------------------------*
      *              * Totale castelletto                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di totale documento forzato a "F" per  *
      *                  * consentire la visualizzazione del totale    *
      *                  * documento contenuto nel record              *
      *                  *---------------------------------------------*
           move      "F"                  to   w-tot-flg-frz          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           perform   vis-tot-cst-000      thru vis-tot-cst-999        .
      *                  *---------------------------------------------*
      *                  * Flag di totale documento a spaces           *
      *                  *---------------------------------------------*
           move      spaces               to   w-tot-flg-frz          .
       vis-dat-rec-800.
      *              *-------------------------------------------------*
      *              * Eventuale literal per Scissione Pagamenti       *
      *              *-------------------------------------------------*
       vis-dat-rec-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-dat-rec-999.
       vis-dat-rec-999.
           exit.

      *    *===========================================================*
      *    * Calcolo e visualizzazione totale castelletto iva          *
      *    *-----------------------------------------------------------*
       vis-tot-cst-000.
      *              *-------------------------------------------------*
      *              * Calcolo totale imponibile e totale imposta      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Azzeramento work-area totali castelletto    *
      *                  *---------------------------------------------*
           move      zero                 to   w-tot-ibl-iva
                                               w-tot-imp-iva          .
      *                  *---------------------------------------------*
      *                  * Ciclo di scansione                          *
      *                  *---------------------------------------------*
           move      zero                 to   w-tot-ctr-001          .
       vis-tot-cst-100.
           add       1                    to   w-tot-ctr-001          .
           if        w-tot-ctr-001        >    6
                     go to  vis-tot-cst-200.
           add       rf-sff-iva-ibl
                    (w-tot-ctr-001)       to   w-tot-ibl-iva          .
           add       rf-sff-iva-imp
                    (w-tot-ctr-001)       to   w-tot-imp-iva          .
           go to     vis-tot-cst-100.
       vis-tot-cst-200.
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale imponibile           *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      20                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-tot-ibl-iva        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale imposta              *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      20                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tot-imp-iva        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale documento            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Calcolo totale documento                *
      *                      *-----------------------------------------*
           if        w-tot-flg-frz        not  = spaces
                     go to  vis-tot-cst-300.
           add       w-tot-ibl-iva
                     w-tot-imp-iva      giving rf-sff-iva-tdo         .
       vis-tot-cst-300.
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      20                   to   v-lin                  .
           move      60                   to   v-pos                  .
           move      rf-sff-iva-tdo       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tot-cst-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi non-chiave                             *
      *    *-----------------------------------------------------------*
       z-acc-non-key-000.
      *              *-------------------------------------------------*
      *              * Definizione numero massimo righe impostate nel  *
      *              * castelletto iva                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se siamo in modifica e' gia' stato definito *
      *                  * in fase di visualizzazione dati record      *
      *                  *---------------------------------------------*
           if        y-are-tip-fun        =    "M"
                     go to  z-acc-non-key-020.
      *                  *---------------------------------------------*
      *                  * Altrimenti si e' in impostazione e quindi   *
      *                  * si azzera                                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-cst-max-rig          .
       z-acc-non-key-020.
      *              *-------------------------------------------------*
      *              * Codice causale contabile                        *
      *              *-------------------------------------------------*
       z-acc-non-key-080.
      *              *-------------------------------------------------*
      *              * Castelletto iva                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Azzeramento contatore numero riga           *
      *                  *---------------------------------------------*
           move      zero                 to   w-cst-ctr-rig          .
       z-acc-non-key-100.
      *                  *---------------------------------------------*
      *                  * Incremento contatore numero riga            *
      *                  *---------------------------------------------*
           add       1                    to   w-cst-ctr-rig          .
      *                  *---------------------------------------------*
      *                  * Test se raggiunto il massimo consentito     *
      *                  *---------------------------------------------*
           if        w-cst-ctr-rig        >    6
                     move   6             to   w-cst-ctr-rig
                     go to  z-acc-non-key-200.
      *                  *---------------------------------------------*
      *                  * Aggiornamento numero righe impostate        *
      *                  *---------------------------------------------*
           if        w-cst-ctr-rig        >    w-cst-max-rig
                     move   w-cst-ctr-rig to   w-cst-max-rig          .
       z-acc-non-key-110.
      *                  *---------------------------------------------*
      *                  * Preparazione numero linea                   *
      *                  *---------------------------------------------*
           add       12
                     w-cst-ctr-rig      giving w-wrk-ctr-lin          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione segnale di inserimento riga *
      *                  *---------------------------------------------*
           move      spaces               to   w-cst-flg-ins          .
      *                  *---------------------------------------------*
      *                  * Richiamo routine di accettazione riga di    *
      *                  * castelletto                                 *
      *                  *---------------------------------------------*
           perform   acc-rig-cst-000      thru acc-rig-cst-999        .
      *                  *---------------------------------------------*
      *                  * Se function-key 'DELT' o 'EXIT'si esce      *
      *                  *---------------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to z-acc-non-key-999.
      *                  *---------------------------------------------*
      *                  * Se premuta function-key 'UP  '              *
      *                  *---------------------------------------------*
           if        v-key                not  = "UP"
                     go to  z-acc-non-key-120.
           if        rf-sff-iva-cod
                     (w-cst-ctr-rig)      =    zero
                     subtract  1          from w-cst-max-rig          .
           subtract  1                    from w-cst-ctr-rig          .
           if        w-cst-ctr-rig        =    zero
                     go to  z-acc-non-key-020
           else      go to  z-acc-non-key-110.
       z-acc-non-key-120.
      *                  *---------------------------------------------*
      *                  * Se function-key 'REMV'                      *
      *                  *---------------------------------------------*
           if        v-key                not  = "REMV"
                     go to  z-acc-non-key-140.
      *                      *-----------------------------------------*
      *                      * Compattamento castelletto verso l'alto  *
      *                      *-----------------------------------------*
           perform   cmp-cst-alt-000      thru cmp-cst-alt-999        .
      *                      *-----------------------------------------*
      *                      * Ritorno impostazione della stessa riga  *
      *                      *-----------------------------------------*
           go to     z-acc-non-key-110.
       z-acc-non-key-140.
      *                  *---------------------------------------------*
      *                  * Se function-key 'INSR'                      *
      *                  *---------------------------------------------*
           if        v-key                not  = "INSR"
                     go to  z-acc-non-key-150.
      *                      *-----------------------------------------*
      *                      * Compattamento castelletto verso il bas- *
      *                      * so                                      *
      *                      *-----------------------------------------*
           perform   cmp-cst-bas-000      thru cmp-cst-bas-999        .
      *                      *-----------------------------------------*
      *                      * Ritorno impostazione della stessa riga  *
      *                      *-----------------------------------------*
           go to     z-acc-non-key-110.
       z-acc-non-key-150.
      *                  *---------------------------------------------*
      *                  * Se function-key 'DO  ' si esce se almeno la *
      *                  * prima riga di castelletto non e' vuota      *
      *                  *---------------------------------------------*
           if        v-key                not  = "DO  "
                     go to  z-acc-non-key-160.
           if        rf-sff-iva-cod (1)   =    zero and
                     rf-sff-iva-ibl (1)   =    zero and
                     rf-sff-iva-imp (1)   =    zero
                     go to  z-acc-non-key-110
           else      go to  z-acc-non-key-999.
       z-acc-non-key-160.
      *                  *---------------------------------------------*
      *                  * Test se si deve uscire dal castelletto      *
      *                  *---------------------------------------------*
           if        rf-sff-iva-cod
                     (w-cst-ctr-rig)      not  = zero
                     go to  z-acc-non-key-100.
           if        w-cst-ctr-rig        not  = w-cst-max-rig
                     go to  z-acc-non-key-100.
           if        w-cst-ctr-rig        =    1
                     go to  z-acc-non-key-110.
           subtract  1                    from w-cst-max-rig          .
           subtract  1                    from w-cst-ctr-rig          .
           go to     z-acc-non-key-200.
       z-acc-non-key-200.
      *              *-------------------------------------------------*
      *              * Totale documento                                *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      20                   to   v-lin                  .
           move      60                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "DO  "               to   v-pfk (3)              .
           move      rf-sff-iva-tdo       to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                  *---------------------------------------------*
      *                  * Se function-key 'DELT' o 'EXIT'si esce      *
      *                  *---------------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to z-acc-non-key-999.
      *                  *---------------------------------------------*
      *                  * Se function-key 'UP' si torna all'imposta-  *
      *                  * zione dell'ultima riga di castelletto impo- *
      *                  * stata                                       *
      *                  *---------------------------------------------*
           if        v-key                not  = "UP  "
                     go to  z-acc-non-key-220.
           add       1                    to   w-cst-max-rig          .
           if        w-cst-max-rig        >    6
                     move   6             to   w-cst-max-rig          .
           add       1                    to   w-cst-ctr-rig          .
           if        w-cst-ctr-rig        >    6
                     move   6             to   w-cst-ctr-rig          .
                     go to  z-acc-non-key-110.
       z-acc-non-key-220.
      *                  *---------------------------------------------*
      *                  * Se il campo e' stato variato rispetto al    *
      *                  * valore precedente si attiva il flag di for- *
      *                  * zatura totale documento                     *
      *                  *---------------------------------------------*
           if        v-num                not  = rf-sff-iva-tdo
                     move   "F"           to   w-tot-flg-frz
           else      move   spaces        to   w-tot-flg-frz          .
      *                  *---------------------------------------------*
      *                  * Movimento valore in record file             *
      *                  *---------------------------------------------*
           move      v-num                to   rf-sff-iva-tdo         .
      *                  *---------------------------------------------*
      *                  * Se function-key 'DO' si esce                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to z-acc-non-key-999.
      *              *-------------------------------------------------*
      *              * Visualizzazione secondo video                   *
      *              *-------------------------------------------------*
           perform   vis-vid-002-000      thru   vis-vid-002-999      .
       z-acc-non-key-300.
      *              *-------------------------------------------------*
      *              * Codice archivio                                 *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      07                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "DO  "               to   v-pfk (3)              .
           move      "FIND"               to   v-pfk (4)              .
           move      "INSR"               to   v-pfk (5)              .
           move      rf-sff-cod-fnt       to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                  *---------------------------------------------*
      *                  * Se function-key 'DELT' o 'EXIT'si esce      *
      *                  *---------------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to z-acc-non-key-999.
      *                  *---------------------------------------------*
      *                  * Movimento valore in record file             *
      *                  *---------------------------------------------*
           move      v-num                to   rf-sff-cod-fnt         .
      *                  *---------------------------------------------*
      *                  * Se premuta function-key 'FIND' esegue una   *
      *                  * interrogazione sull'archivio clienti o for- *
      *                  * nitori                                      *
      *                  *---------------------------------------------*
           if        v-key                not  = "FIND"
                     go to  z-acc-non-key-310.
           perform   fnd-arc-fnt-000      thru fnd-arc-fnt-999        .
      *                      *-----------------------------------------*
      *                      * Test se avvenuta selezione              *
      *                      *-----------------------------------------*
           if        OK                   =    "R"
                     move   spaces        to   OK
                     go to  z-acc-non-key-300.
      *                      *-----------------------------------------*
      *                      * Visualizzazione codice partita selezio- *
      *                      * nato                                    *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      07                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rf-sff-cod-fnt       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       z-acc-non-key-310.
      *                  *---------------------------------------------*
      *                  * Se premuta function-key 'INSR' di accede al *
      *                  * programma di gestione archivio clienti o    *
      *                  * fornitori                                   *
      *                  *---------------------------------------------*
           if        v-key                not  = "INSR"
                     go to  z-acc-non-key-320.
           perform   ins-arc-fnt-000      thru ins-arc-fnt-999        .
           go to     z-acc-non-key-300.
       z-acc-non-key-320.
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione archivio        *
      *                  *---------------------------------------------*
           perform   vis-des-arc-000      thru vis-des-arc-999        .
      *                  *---------------------------------------------*
      *                  * Se premuta function-key 'UP'                *
      *                  *---------------------------------------------*
           if        v-key                not  = "UP  "
                     go to  z-acc-non-key-340.
      *                      *-----------------------------------------*
      *                      * Test di ammissibilita'                  *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err and
                     rf-sff-cod-fnt       not  = zero
                     go to  z-acc-non-key-300.
      *                      *-----------------------------------------*
      *                      * Richiamo routine di visualizzazione vi- *
      *                      * deo precedente                          *
      *                      *-----------------------------------------*
           perform   vis-vid-001-000      thru vis-vid-001-999        .
      *                      *-----------------------------------------*
      *                      * Ritorno a impostazione castelletto      *
      *                      *-----------------------------------------*
           go to     z-acc-non-key-080.
       z-acc-non-key-340.
      *                  *---------------------------------------------*
      *                  * Controllo valore impostato                  *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  z-acc-non-key-300.
      *                  *---------------------------------------------*
      *                  * Se function-key 'DO' si esce                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to z-acc-non-key-999.
       z-acc-non-key-400.
      *              *-------------------------------------------------*
      *              * Data documento                                  *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      10                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "DO  "               to   v-pfk (3)              .
           move      rf-sff-ddo-ftf       to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                  *---------------------------------------------*
      *                  * Se function-key 'DELT' o 'EXIT'si esce      *
      *                  *---------------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to z-acc-non-key-999.
      *                  *---------------------------------------------*
      *                  * Movimento valore in record file             *
      *                  *---------------------------------------------*
           move      v-dat                to   rf-sff-ddo-ftf         .
      *                  *---------------------------------------------*
      *                  * Se premuta function-key 'UP' si torna alla  *
      *                  * impostazione del campo precedente           *
      *                  *---------------------------------------------*
           if        v-key                not  = "UP  "
                     go to  z-acc-non-key-410.
      *                      *-----------------------------------------*
      *                      * Altrimenti vuol dire che e' stata sal-  *
      *                      * tata l'impostazione del codice archivio *
      *                      * e si torna all'impostazione pagina pre- *
      *                      * cedente                                 *
      *                      *-----------------------------------------*
           perform   vis-vid-001-000      thru vis-vid-001-999        .
           go to     z-acc-non-key-080.
       z-acc-non-key-410.
      *                  *---------------------------------------------*
      *                  * Se function-key 'DO' si esce                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to z-acc-non-key-999.
       z-acc-non-key-450.
      *              *-------------------------------------------------*
      *              * Data acquisizione documento                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Accettazione                                *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      10                   to   v-lin                  .
           move      71                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "DO  "               to   v-pfk (3)              .
           move      rf-sff-dtr-ftf       to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                  *---------------------------------------------*
      *                  * Se function-key 'DELT' o 'EXIT'si esce      *
      *                  *---------------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to z-acc-non-key-999.
      *                  *---------------------------------------------*
      *                  * Movimento valore in record file             *
      *                  *---------------------------------------------*
           move      v-dat                to   rf-sff-ddo-ftf         .
      *                  *---------------------------------------------*
      *                  * Se premuta function-key 'UP' si torna alla  *
      *                  * impostazione del campo precedente           *
      *                  *---------------------------------------------*
           if        v-key                not  = "UP  "
                     go to  z-acc-non-key-460.
      *                      *-----------------------------------------*
      *                      * Altrimenti vuol dire che e' stata sal-  *
      *                      * tata l'impostazione del codice archivio *
      *                      * e si torna all'impostazione pagina pre- *
      *                      * cedente                                 *
      *                      *-----------------------------------------*
           perform   vis-vid-001-000      thru vis-vid-001-999        .
           go to     z-acc-non-key-080.
       z-acc-non-key-460.
      *                  *---------------------------------------------*
      *                  * Se function-key 'DO' si esce                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to z-acc-non-key-999.
       z-acc-non-key-500.
      *              *-------------------------------------------------*
      *              * Numero documento                                *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "DO  "               to   v-pfk (3)              .
           move      rf-sff-ndo-ftf       to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                  *---------------------------------------------*
      *                  * Se function-key 'DELT' o 'EXIT'si esce      *
      *                  *---------------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to z-acc-non-key-999.
      *                  *---------------------------------------------*
      *                  * Movimento valore in record file             *
      *                  *---------------------------------------------*
           move      v-alf                to   rf-sff-ndo-ftf         .
      *                  *---------------------------------------------*
      *                  * Se premuta function-key 'UP' si torna alla  *
      *                  * impostazione del campo precedente           *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     go to  z-acc-non-key-400.
      *                  *---------------------------------------------*
      *                  * Se function-key 'DO' si esce                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to z-acc-non-key-999.
       z-acc-non-key-600.
      *              *-------------------------------------------------*
      *              * Codice numerazione iva                          *
      *              *-------------------------------------------------*
       z-acc-non-key-700.
      *              *-------------------------------------------------*
      *              * Numero protocollo iva                           *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      14                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "DO  "               to   v-pfk (3)              .
           move      rf-sff-npt-iva       to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                  *---------------------------------------------*
      *                  * Se function-key 'DELT' o 'EXIT'si esce      *
      *                  *---------------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to z-acc-non-key-999.
      *                  *---------------------------------------------*
      *                  * Movimento valore in record file             *
      *                  *---------------------------------------------*
           move      v-num                to   rf-sff-npt-iva         .
      *                  *---------------------------------------------*
      *                  * Se premuta function-key 'UP' si torna alla  *
      *                  * impostazione del campo precedente           *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     go to  z-acc-non-key-500.
      *                  *---------------------------------------------*
      *                  * Se function-key 'DO' si esce                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to z-acc-non-key-999.
       z-acc-non-key-725.
      *              *-------------------------------------------------*
      *              * Flag di competenza                              *
      *              *-------------------------------------------------*
       z-acc-non-key-750.
      *              *-------------------------------------------------*
      *              * Flag di stampa giornale                         *
      *              *-------------------------------------------------*
       z-acc-non-key-775.
      *              *-------------------------------------------------*
      *              * Regime fiscale particolare                      *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-flg-rfp-lun    to   v-car                  .
           move      w-exp-flg-rfp-num    to   v-ldt                  .
           move      "NSRE#"              to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      19                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-flg-rfp-tbl    to   v-txt                  .
      *
           if        rf-sff-flg-rfp       =    spaces or
                     rf-sff-flg-rfp       =    "N"
                     move  01             to   v-num
           else if   rf-sff-flg-rfp       =    "S"
                     move  02             to   v-num
           else if   rf-sff-flg-rfp       =    "R"
                     move  03             to   v-num
           else if   rf-sff-flg-rfp       =    "E"
                     move  04             to   v-num
           else      move  zero           to   v-num                  .
      *
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "DO  "               to   v-pfk (3)              .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                  *---------------------------------------------*
      *                  * Se function-key 'DELT' o 'EXIT'si esce      *
      *                  *---------------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to z-acc-non-key-999.
      *                  *---------------------------------------------*
      *                  * Movimento valore in record file             *
      *                  *---------------------------------------------*
           if        v-num                =    01
                     move  "N"            to   rf-sff-flg-rfp
           else if   v-num                =    02
                     move  "S"            to   rf-sff-flg-rfp
           else if   v-num                =    03
                     move  "R"            to   rf-sff-flg-rfp
           else if   v-num                =    04
                     move  "E"            to   rf-sff-flg-rfp
           else      move  space          to   rf-sff-flg-rfp         .
      *                  *---------------------------------------------*
      *                  * Controllo valore impostato                  *
      *                  *---------------------------------------------*
           if        rf-sff-flg-rfp       not  = spaces and
                     rf-sff-flg-rfp       not  = "N"    and
                     rf-sff-flg-rfp       not  = "S"    and
                     rf-sff-flg-rfp       not  = "R"    and
                     rf-sff-flg-rfp       not  = "E"
                     go to  z-acc-non-key-775.
      *                  *---------------------------------------------*
      *                  * Se premuta function-key 'UP' si torna alla  *
      *                  * impostazione del campo precedente           *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     go to  z-acc-non-key-700.
      *                  *---------------------------------------------*
      *                  * Se function-key 'DO' si esce                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to z-acc-non-key-999.
       z-acc-non-key-800.
      *                  *---------------------------------------------*
      *                  * Conferma impostazioni                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#SAV"               to   v-not                  .
           move      "S"                  to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "EXIT"               to   v-pfk (3)              .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Test su risposta dell'utente                    *
      *              *-------------------------------------------------*
           if        v-key                not  = spaces
                     go to  z-acc-non-key-810.
      *                  *---------------------------------------------*
      *                  * Se tasto "S"                                *
      *                  *---------------------------------------------*
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
                     go to  z-acc-non-key-999
      *                  *---------------------------------------------*
      *                  * Se tasto "E"                                *
      *                  *---------------------------------------------*
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
                     go to  z-acc-non-key-999.
      *                  *---------------------------------------------*
      *                  * Se tasto "N"                                *
      *                  *---------------------------------------------*
           go to     z-acc-non-key-300.
       z-acc-non-key-810.
           if        v-key                =    "UP  "
                     go to  z-acc-non-key-750.
       z-acc-non-key-999.
           exit.

      *    *===========================================================*
      *    * Routine di compattamento castelletto verso l'alto         *
      *    *-----------------------------------------------------------*
       cmp-cst-alt-000.
      *              *-------------------------------------------------*
      *              * Se si e' sull'ultima riga impostata             *
      *              *-------------------------------------------------*
           if        w-cst-ctr-rig        not  = w-cst-max-rig
                     go to  cmp-cst-alt-100.
      *                  *---------------------------------------------*
      *                  * Azzeramento valori record file              *
      *                  *---------------------------------------------*
           move      zero                 to   rf-sff-iva-cod
                                              (w-cst-ctr-rig)
                                               rf-sff-iva-ibl
                                              (w-cst-ctr-rig)
                                               rf-sff-iva-imp
                                              (w-cst-ctr-rig)
                                               w-cst-tot-rig          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione a spazi                     *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     cmp-cst-alt-900.
       cmp-cst-alt-100.
      *              *-------------------------------------------------*
      *              * Compattamento record                            *
      *              *-------------------------------------------------*
           move      w-cst-ctr-rig        to   w-wrk-ctr-001
                                               w-wrk-ctr-002          .
           add       1                    to   w-wrk-ctr-002          .
       cmp-cst-alt-200.
           move      rf-sff-iva-rig
                    (w-wrk-ctr-002)       to   rf-sff-iva-rig
                                              (w-wrk-ctr-001)         .
           add       1                    to   w-wrk-ctr-001
                                               w-wrk-ctr-002          .
           if        w-wrk-ctr-002        not  > w-cst-max-rig
                     go to  cmp-cst-alt-200.
      *              *-------------------------------------------------*
      *              * Azzeramento ultima riga                         *
      *              *-------------------------------------------------*
           move      zero                 to   rf-sff-iva-cod
                                              (w-cst-max-rig)
                                               rf-sff-iva-ibl
                                              (w-cst-max-rig)
                                               rf-sff-iva-imp
                                              (w-cst-max-rig)         .
      *              *-------------------------------------------------*
      *              * Visualizzazione castelletto compattato          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione numero linea dell'ultima im- *
      *                  * postazione                                  *
      *                  *---------------------------------------------*
           add       12
                     w-cst-max-rig      giving w-cst-max-lin          .
      *                  *---------------------------------------------*
      *                  * Numero linea in comodo di lavoro            *
      *                  *---------------------------------------------*
           move      w-wrk-ctr-lin        to   w-wrk-ctr-001
                                               w-wrk-ctr-002          .
           add       1                    to   w-wrk-ctr-002          .
       cmp-cst-alt-300.
      *                  *---------------------------------------------*
      *                  * Fetch della linea superiore                 *
      *                  *---------------------------------------------*
           move      "FL"                 to   v-ope                  .
           move      w-wrk-ctr-002        to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione nella linea inferiore       *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      w-wrk-ctr-001        to   v-lin                  .
           move      01                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Incremento contatori                        *
      *                  *---------------------------------------------*
           add       1                    to   w-wrk-ctr-001
                                               w-wrk-ctr-002          .
      *                  *---------------------------------------------*
      *                  * Test se oltre il massimo numero di riga     *
      *                  *---------------------------------------------*
           if        w-wrk-ctr-002        not  > w-cst-max-lin
                     go to  cmp-cst-alt-300.
      *                  *---------------------------------------------*
      *                  * Visualizzazione a blank dell'ultima riga    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      w-cst-max-lin        to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Decremento numero di righe impostate        *
      *                  *---------------------------------------------*
           subtract  1                    from   w-cst-max-rig        .
       cmp-cst-alt-900.
      *                      *-----------------------------------------*
      *                      * Visualizzazione totale castelletto      *
      *                      *-----------------------------------------*
           perform   vis-tot-cst-000      thru vis-tot-cst-999        .
       cmp-cst-alt-999.
           exit.

      *    *===========================================================*
      *    * Routine di compattamento castelletto verso il basso       *
      *    *-----------------------------------------------------------*
       cmp-cst-bas-000.
      *              *-------------------------------------------------*
      *              * Se si e' su una riga vuota si esce              *
      *              *-------------------------------------------------*
           if        rf-sff-iva-cod
                     (w-cst-ctr-rig)      =    zero
                     go to  cmp-cst-bas-999.
      *              *-------------------------------------------------*
      *              * Test se inserimento ammissibile                 *
      *              *-------------------------------------------------*
           if        w-cst-max-rig        =    6
                     go to  cmp-cst-bas-999.
      *                  *---------------------------------------------*
      *                  * Incremento numero di righe impostate        *
      *                  *---------------------------------------------*
           add       1                    to   w-cst-max-rig          .
           if        w-cst-max-rig        >    6
                     move   6             to   w-cst-max-rig          .
      *              *-------------------------------------------------*
      *              * Compattamento record                            *
      *              *-------------------------------------------------*
           move      w-cst-max-rig        to   w-wrk-ctr-001
                                               w-wrk-ctr-002          .
           subtract  1                    from w-wrk-ctr-001          .
       cmp-cst-bas-100.
           if        w-wrk-ctr-001        =    zero
                     go to  cmp-cst-bas-110.
           move      rf-sff-iva-rig
                    (w-wrk-ctr-001)       to   rf-sff-iva-rig
                                              (w-wrk-ctr-002)         .
           subtract  1                    from w-wrk-ctr-001          .
           subtract  1                    from w-wrk-ctr-002          .
           if        w-wrk-ctr-002        not  < w-cst-ctr-rig
                     go to  cmp-cst-bas-100.
       cmp-cst-bas-110.
      *              *-------------------------------------------------*
      *              * Azzeramento riga da cui si inserisce            *
      *              *-------------------------------------------------*
           move      zero                 to   rf-sff-iva-cod
                                              (w-cst-ctr-rig)
                                               rf-sff-iva-ibl
                                              (w-cst-ctr-rig)
                                               rf-sff-iva-imp
                                              (w-cst-ctr-rig)         .
      *              *-------------------------------------------------*
      *              * Visualizzazione castelletto compattato          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione numero linea dell'ultima im- *
      *                  * postazione                                  *
      *                  *---------------------------------------------*
           add       12
                     w-cst-max-rig      giving w-cst-max-lin          .
      *                  *---------------------------------------------*
      *                  * Numero linea in comodo di lavoro            *
      *                  *---------------------------------------------*
           move      w-cst-max-lin        to   w-wrk-ctr-001
                                               w-wrk-ctr-002          .
           subtract  1                    from w-wrk-ctr-001          .
       cmp-cst-bas-200.
      *                  *---------------------------------------------*
      *                  * Fetch della linea inferiore                 *
      *                  *---------------------------------------------*
           move      "FL"                 to   v-ope                  .
           move      w-wrk-ctr-001        to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione nella linea superiore       *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      w-wrk-ctr-002        to   v-lin                  .
           move      01                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Decremento contatori                        *
      *                  *---------------------------------------------*
           subtract  1                    from w-wrk-ctr-001          .
           subtract  1                    from w-wrk-ctr-002          .
      *                  *---------------------------------------------*
      *                  * Test si e' arrivati alla linea da cui si e' *
      *                  * fatto 'INSR'                                *
      *                  *---------------------------------------------*
           if        w-wrk-ctr-002        not  < w-wrk-ctr-lin
                     go to  cmp-cst-bas-200.
      *                  *---------------------------------------------*
      *                  * Visualizzazione a blank della linea da cui  *
      *                  * si e' fatto 'INSR'                          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       cmp-cst-bas-999.
           exit.

      *    *===========================================================*
      *    * Tasto funzione "INSR" su tabella causali contabili        *
      *    *-----------------------------------------------------------*
       ins-tbl-cau-000.
      *              *-------------------------------------------------*
      *              * Test se programma di gestione file gia' attivo  *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pcge0300"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to  ins-tbl-cau-999.
      *              *-------------------------------------------------*
      *              * Salvataggio del video attuale                   *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Richiamo programma di gestione archivi interes- *
      *              * sato                                            *
      *              *-------------------------------------------------*
           move      "pgm/cge/prg/obj/pcge0300"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * Ripristino del video                            *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       ins-tbl-cau-999.
           exit.

      *    *===========================================================*
      *    * Accettazione riga di castelletto iva                      *
      *    *-----------------------------------------------------------*
       acc-rig-cst-000.
      *              *-------------------------------------------------*
      *              * Codice iva                                      *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "B"                  to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      13                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "DO  "               to   v-pfk (3)              .
           move      "FIND"               to   v-pfk (4)              .
           move      "REMV"               to   v-pfk (5)              .
           move      "INSR"               to   v-pfk (6)              .
           move      rf-sff-iva-cod
                    (w-cst-ctr-rig)       to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999      .
      *                  *---------------------------------------------*
      *                  * Se function-key 'DELT' o 'EXIT' si esce     *
      *                  *---------------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to acc-rig-cst-999.
      *                  *---------------------------------------------*
      *                  * Se valore impostato uguale a zero e il co-  *
      *                  * dice iva precedente non era zero, si forza  *
      *                  * la function key 'REMV'                      *
      *                  *---------------------------------------------*
           if        v-num                =    zero and
                     rf-sff-iva-cod
                    (w-cst-ctr-rig)       not  = zero
                     move   "REMV"        to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Se function-key 'REMV' si esce              *
      *                  *---------------------------------------------*
           if        v-key                =    "REMV"
                     go to acc-rig-cst-999.
      *                  *---------------------------------------------*
      *                  * Se valore impostato diverso da quello pre-  *
      *                  * cedente si attiva segnale di impostazione   *
      *                  * in sospeso                                  *
      *                  *---------------------------------------------*
           if        rf-sff-iva-cod       
                    (w-cst-ctr-rig)       not  = v-num
                     move   "#"           to   w-cst-flg-ins          .
      *                  *---------------------------------------------*
      *                  * Se valore impostato uguale a zero e si e'   *
      *                  * in 'INSR' si attiva segnale di impostazione *
      *                  * in sospeso                                  *
      *                  *---------------------------------------------*
           if        rf-sff-iva-cod       
                    (w-cst-ctr-rig)       =    zero and
                     w-cst-ctr-rig        <    w-cst-max-rig
                     move   "#"           to   w-cst-flg-ins          .
      *                  *---------------------------------------------*
      *                  * Movimento valore in record file             *
      *                  *---------------------------------------------*
           move      v-num                to   rf-sff-iva-cod
                                              (w-cst-ctr-rig)         .
      *                  *---------------------------------------------*
      *                  * Se premuta function-key 'FIND' esegue una   *
      *                  * interrogazione sulla tabella esenzioni      *
      *                  *---------------------------------------------*
           if        v-key                not  = "FIND"
                     go to  acc-rig-cst-010.
           perform   fnd-tbl-tes-000      thru fnd-tbl-tes-999        .
      *                      *-----------------------------------------*
      *                      * Test se avvenuta selezione              *
      *                      *-----------------------------------------*
           if        OK                   =    "R"
                     move   spaces        to   OK
                     go to  acc-rig-cst-000
           else      move   rf-sff-iva-cod
                           (w-cst-ctr-rig)
                                          to   w-wrk-cod-iva          .
                     go to  acc-rig-cst-400.
       acc-rig-cst-010.
      *                  *---------------------------------------------*
      *                  * Controllo valore impostato                  *
      *                  *---------------------------------------------*
           move      spaces               to   OK                     .
           perform   cnt-cod-iva-000      thru cnt-cod-iva-999        .
           if        OK                   not  = spaces
                     move   spaces        to   OK
                     go to  acc-rig-cst-000.
      *                  *---------------------------------------------*
      *                  * Se function-key 'DO' 'DOWN' 'UP' o 'INSR',  *
      *                  * si esce solo se flag di impostazione in so- *
      *                  * speso non attivo                            *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  " or
                     v-key                =    "DOWN" or
                     v-key                =    "UP  " or
                     v-key                =    "INSR"
                     if     w-cst-flg-ins =    spaces
                            go to  acc-rig-cst-999
                     else   go to  acc-rig-cst-000.
      *              *-------------------------------------------------*
      *              * Se codice iva a zero si torna a reimpostare, ma *
      *              * se e' l'ultima riga si esce con 'DOWN'          *
      *              *-------------------------------------------------*
           if        w-wrk-cod-iva        =    zero
                     if    w-cst-ctr-rig  =    w-cst-max-rig
                           move   "DOWN"  to   v-key
                           go to  acc-rig-cst-999
                     else  go to  acc-rig-cst-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del codice iva           *
      *              *-------------------------------------------------*
           move      w-wrk-cod-iva        to   w-edt-iva-cod          .
      *
           if        w-edt-iva-cod-003    =    0
                     go to  acc-rig-cst-100
           else if   w-edt-iva-cod-003    =    1
                     go to  acc-rig-cst-200
           else if   w-edt-iva-cod-003    =    3
                     go to  acc-rig-cst-400
           else if   w-edt-iva-cod-003    =    4
                     go to  acc-rig-cst-400
           else if   w-edt-iva-cod-003    =    5
                     go to  acc-rig-cst-400
           else if   w-edt-iva-cod-003    =    6
                     go to  acc-rig-cst-400
           else if   w-edt-iva-cod-003    =    7
                     go to  acc-rig-cst-500
           else if   w-edt-iva-cod-003    =    9
                     go to  acc-rig-cst-700
           else      go to  acc-rig-cst-000.
       acc-rig-cst-100.
      *              *-------------------------------------------------*
      *              * Aliquota normale                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Accettazione imponibile                     *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      22                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "REMV"               to   v-pfk (3)              .
           move      rf-sff-iva-ibl
                    (w-cst-ctr-rig)       to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                      *-----------------------------------------*
      *                      * Se function-key 'DELT' o 'EXIT'si esce  *
      *                      *-----------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Se function-key 'REMV' si esce          *
      *                      *-----------------------------------------*
           if        v-key                =    "REMV"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Movimento valore in record file         *
      *                      *-----------------------------------------*
           move      v-num                to   rf-sff-iva-ibl
                                              (w-cst-ctr-rig)         .
      *                      *-----------------------------------------*
      *                      * Se function-key 'UP' si torna all'impo- *
      *                      * stazione precedente                     *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to  acc-rig-cst-000.
      *                      *-----------------------------------------*
      *                      * Controllo valore impostato              *
      *                      *-----------------------------------------*
           if        rf-sff-iva-ibl
                    (w-cst-ctr-rig)       =    zero
                     go to  acc-rig-cst-100.
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale riga                 *
      *                  *---------------------------------------------*
           perform   vis-tot-rig-000      thru vis-tot-rig-999        .
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale castelletto          *
      *                  *---------------------------------------------*
           perform   vis-tot-cst-000      thru vis-tot-cst-999        .
      *                  *---------------------------------------------*
      *                  * Preparazione default per imposta            *
      *                  *---------------------------------------------*
           move      rf-sff-iva-ibl
                    (w-cst-ctr-rig)       to   d-imp-iva-ibl-iva      .
           move      rf-sff-iva-cod
                    (w-cst-ctr-rig)       to   d-imp-iva-cod-iva      .
           perform   cal-imp-iva-000      thru cal-imp-iva-999        .
           move      d-imp-iva-ims-iva    to   rf-sff-iva-imp
                                              (w-cst-ctr-rig)         .
       acc-rig-cst-110.
      *                  *---------------------------------------------*
      *                  * Accettazione imposta                        *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "REMV"               to   v-pfk (3)              .
           move      rf-sff-iva-imp
                    (w-cst-ctr-rig)       to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                      *-----------------------------------------*
      *                      * Se function-key 'DELT' o 'EXIT'si esce  *
      *                      *-----------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Se function-key 'REMV' si esce          *
      *                      *-----------------------------------------*
           if        v-key                =    "REMV"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Movimento valore in record file         *
      *                      *-----------------------------------------*
           move      v-num                to   rf-sff-iva-imp
                                              (w-cst-ctr-rig)         .
      *                      *-----------------------------------------*
      *                      * Se function-key 'UP' si torna all'impo- *
      *                      * stazione precedente                     *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to  acc-rig-cst-100.
      *                      *-----------------------------------------*
      *                      * Controllo valore impostato              *
      *                      *-----------------------------------------*
           if        rf-sff-iva-imp
                    (w-cst-ctr-rig)       =    zero
                     go to  acc-rig-cst-110.
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale riga                 *
      *                  *---------------------------------------------*
           perform   vis-tot-rig-000      thru vis-tot-rig-999        .
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale castelletto          *
      *                  *---------------------------------------------*
           perform   vis-tot-cst-000      thru vis-tot-cst-999        .
           go to     acc-rig-cst-999.
       acc-rig-cst-200.
      *              *-------------------------------------------------*
      *              * Aliquota di scorporo                            *
      *              *-------------------------------------------------*
           add       rf-sff-iva-ibl
                    (w-cst-ctr-rig)
                     rf-sff-iva-imp
                    (w-cst-ctr-rig)     giving w-cst-tot-rig          .
      *                  *---------------------------------------------*
      *                  * Accettazione valore da scorporare           *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      60                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "REMV"               to   v-pfk (3)              .
           move      w-cst-tot-rig        to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                      *-----------------------------------------*
      *                      * Se function-key 'DELT' o 'EXIT'si esce  *
      *                      *-----------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Se function-key 'REMV' si esce          *
      *                      *-----------------------------------------*
           if        v-key                =    "REMV"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Movimento valore in comodo di lavoro    *
      *                      *-----------------------------------------*
           move      v-num                to   w-cst-tot-rig          .
      *                      *-----------------------------------------*
      *                      * Se function-key 'UP' si torna all'impo- *
      *                      * stazione precedente                     *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to  acc-rig-cst-000.
      *                      *-----------------------------------------*
      *                      * Controllo valore impostato              *
      *                      *-----------------------------------------*
           if        w-cst-tot-rig        =    zero
                     go to  acc-rig-cst-200.
      *                  *---------------------------------------------*
      *                  * Calcolo di imponibile e imposta             *
      *                  *---------------------------------------------*
           move      w-cst-tot-rig        to   w-wrk-num-s13          .
           multiply  100                  by   w-wrk-num-s13          .
           divide    w-wrk-cod-iva-345    into w-wrk-num-s13
                                        giving rf-sff-iva-ibl
                                              (w-cst-ctr-rig)         .
           subtract  rf-sff-iva-ibl
                    (w-cst-ctr-rig)       from w-cst-tot-rig
                                        giving rf-sff-iva-imp
                                              (w-cst-ctr-rig)         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione imponibile                  *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      22                   to   v-pos                  .
           move      rf-sff-iva-ibl
                    (w-cst-ctr-rig)       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione imposta                     *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rf-sff-iva-imp
                    (w-cst-ctr-rig)       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale castelletto          *
      *                  *---------------------------------------------*
           perform   vis-tot-cst-000      thru vis-tot-cst-999        .
           go to     acc-rig-cst-999.
       acc-rig-cst-400.
      *              *-------------------------------------------------*
      *              * Aliquota di esenzione                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [zci]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *                  *---------------------------------------------*
      *                  * Composizione chiave                         *
      *                  *---------------------------------------------*
           move      w-wrk-cod-iva-345    to   rf-zci-cod-iva         .
      *                  *---------------------------------------------*
      *                  * Lettura record [zci]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODIVA    "         to   f-key                  .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo di esenzione         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione di v-alf                   *
      *                      *-----------------------------------------*
           if        f-sts                =    e-not-fnd
                     move   all "."       to   rf-zci-des-doc         .
           move      rf-zci-des-doc       to   v-alf                  .
      *                      *-----------------------------------------*
      *                      * Visualizzazione                         *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      41                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Test su esito lettura                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  acc-rig-cst-000.
      *                  *---------------------------------------------*
      *                  * Accettazione imponibile                     *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      22                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "REMV"               to   v-pfk (3)              .
           move      rf-sff-iva-ibl
                    (w-cst-ctr-rig)       to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                      *-----------------------------------------*
      *                      * Se function-key 'DELT' o 'EXIT'si esce  *
      *                      *-----------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Se function-key 'REMV' si esce          *
      *                      *-----------------------------------------*
           if        v-key                =    "REMV"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Movimento valore in record file         *
      *                      *-----------------------------------------*
           move      v-num                to   rf-sff-iva-ibl
                                              (w-cst-ctr-rig)         .
      *                      *-----------------------------------------*
      *                      * Se function-key 'UP' si torna all'impo- *
      *                      * stazione precedente                     *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to  acc-rig-cst-000.
      *                      *-----------------------------------------*
      *                      * Controllo valore impostato              *
      *                      *-----------------------------------------*
           if        rf-sff-iva-ibl
                    (w-cst-ctr-rig)       =    zero
                     go to  acc-rig-cst-400.
      *                  *---------------------------------------------*
      *                  * Azzeramento valore imposta                  *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Azzeramento valore imposta                  *
      *                  *---------------------------------------------*
           move      zero                 to   rf-sff-iva-imp
                                              (w-cst-ctr-rig)         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale riga                 *
      *                  *---------------------------------------------*
           perform   vis-tot-rig-000      thru vis-tot-rig-999        .
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale castelletto          *
      *                  *---------------------------------------------*
           perform   vis-tot-cst-000      thru vis-tot-cst-999        .
           go to     acc-rig-cst-999.
       acc-rig-cst-500.
      *              *-------------------------------------------------*
      *              * Aliquota indetraibile                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Accettazione imponibile                     *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      22                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "REMV"               to   v-pfk (3)              .
           move      rf-sff-iva-ibl
                    (w-cst-ctr-rig)       to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                      *-----------------------------------------*
      *                      * Se function-key 'DELT' o 'EXIT'si esce  *
      *                      *-----------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Se function-key 'REMV' si esce          *
      *                      *-----------------------------------------*
           if        v-key                =    "REMV"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Movimento valore in record file         *
      *                      *-----------------------------------------*
           move      v-num                to   rf-sff-iva-ibl
                                              (w-cst-ctr-rig)         .
      *                      *-----------------------------------------*
      *                      * Se function-key 'UP' si torna all'impo- *
      *                      * stazione precedente                     *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to  acc-rig-cst-000.
      *                      *-----------------------------------------*
      *                      * Controllo valore impostato              *
      *                      *-----------------------------------------*
           if        rf-sff-iva-ibl
                    (w-cst-ctr-rig)       =    zero
                     go to  acc-rig-cst-500.
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale riga                 *
      *                  *---------------------------------------------*
           perform   vis-tot-rig-000      thru vis-tot-rig-999        .
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale castelletto          *
      *                  *---------------------------------------------*
           perform   vis-tot-cst-000      thru vis-tot-cst-999        .
      *                  *---------------------------------------------*
      *                  * Preparazione default per imposta            *
      *                  *---------------------------------------------*
           subtract  700                  from rf-sff-iva-cod
                                              (w-cst-ctr-rig)         .
           move      rf-sff-iva-ibl
                    (w-cst-ctr-rig)       to   d-imp-iva-ibl-iva      .
           move      rf-sff-iva-cod
                    (w-cst-ctr-rig)       to   d-imp-iva-cod-iva      .
           perform   cal-imp-iva-000      thru cal-imp-iva-999        .
           move      d-imp-iva-ims-iva    to   rf-sff-iva-imp
                                              (w-cst-ctr-rig)         .
           add       700                  to   rf-sff-iva-cod
                                              (w-cst-ctr-rig)         .
       acc-rig-cst-510.
      *                  *---------------------------------------------*
      *                  * Accettazione imposta                        *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "REMV"               to   v-pfk (3)              .
           move      rf-sff-iva-imp
                    (w-cst-ctr-rig)       to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                      *-----------------------------------------*
      *                      * Se function-key 'DELT' o 'EXIT'si esce  *
      *                      *-----------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Se function-key 'REMV' si esce          *
      *                      *-----------------------------------------*
           if        v-key                =    "REMV"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Movimento valore in record file         *
      *                      *-----------------------------------------*
           move      v-num                to   rf-sff-iva-imp
                                              (w-cst-ctr-rig)         .
      *                      *-----------------------------------------*
      *                      * Se function-key 'UP' si torna all'impo- *
      *                      * stazione precedente                     *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to  acc-rig-cst-500.
      *                      *-----------------------------------------*
      *                      * Controllo valore impostato              *
      *                      *-----------------------------------------*
           if        rf-sff-iva-imp
                    (w-cst-ctr-rig)       =    zero
                     go to  acc-rig-cst-510.
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale riga                 *
      *                  *---------------------------------------------*
           perform   vis-tot-rig-000      thru vis-tot-rig-999        .
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale castelletto          *
      *                  *---------------------------------------------*
           perform   vis-tot-cst-000      thru vis-tot-cst-999        .
           go to     acc-rig-cst-999.
       acc-rig-cst-700.
      *              *-------------------------------------------------*
      *              * Aliquota per sola iva                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Azzeramento imponibile                      *
      *                  *---------------------------------------------*
           move      zero                 to   rf-sff-iva-ibl
                                              (w-cst-ctr-rig)         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione imponibile                  *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      22                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      rf-sff-iva-ibl
                    (w-cst-ctr-rig)       to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-cst-710.
      *                  *---------------------------------------------*
      *                  * Accettazione imposta                        *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (1)              .
           move      "UP  "               to   v-pfk (2)              .
           move      "REMV"               to   v-pfk (3)              .
           move      rf-sff-iva-imp
                    (w-cst-ctr-rig)       to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *                      *-----------------------------------------*
      *                      * Se function-key 'DELT' o 'EXIT'si esce  *
      *                      *-----------------------------------------*
           if        v-key                =    "DELT" or
                     v-key                =    "EXIT"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Se function-key 'REMV' si esce          *
      *                      *-----------------------------------------*
           if        v-key                =    "REMV"
                     go to  acc-rig-cst-999.
      *                      *-----------------------------------------*
      *                      * Movimento valore in record file         *
      *                      *-----------------------------------------*
           move      v-num                to   rf-sff-iva-imp
                                              (w-cst-ctr-rig)         .
      *                      *-----------------------------------------*
      *                      * Se function-key 'UP' si torna all'impo- *
      *                      * stazione precedente                     *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to  acc-rig-cst-000.
      *                      *-----------------------------------------*
      *                      * Controllo valore impostato              *
      *                      *-----------------------------------------*
           if        rf-sff-iva-imp
                    (w-cst-ctr-rig)       =    zero
                     go to  acc-rig-cst-710.
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale riga                 *
      *                  *---------------------------------------------*
           perform   vis-tot-rig-000      thru vis-tot-rig-999        .
      *                  *---------------------------------------------*
      *                  * Visualizzazione totale castelletto          *
      *                  *---------------------------------------------*
           perform   vis-tot-cst-000      thru vis-tot-cst-999        .
       acc-rig-cst-999.
           exit.

      *    *===========================================================*
      *    * Tasto funzione "FIND" su tabella titoli di esenzione iva  *
      *    *                                                           *
      *    * Uscita  : OK = "R"        : Campo da reimpostare          *
      *    *                spaces     : E' stato selezionato un codi- *
      *    *                             ce iva                        *
      *    *-----------------------------------------------------------*
       fnd-tbl-tes-000.
      *              *-------------------------------------------------*
      *              * Test se programma di interrogazione gia' attivo *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pcge0410"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to  fnd-tbl-tes-999.
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. per possibili- *
      *              * ta' di function-key "SLCT" durante l'interroga- *
      *              * zione                                           *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "fkselect"           to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      04                   to   s-car                  .
           move      "SLCT"               to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo programma di interrogazione            *
      *              *-------------------------------------------------*
           move      "pgm/cge/prg/obj/pcge0410"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * Estrazione di eventuale variabile di i.p.c. de- *
      *              * terminata da function-key "SLCT" durante l'in-  *
      *              * terrogazione                                    *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "cod-iva"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                not  = spaces
                     move   "R"           to   OK
                     go to  fnd-tbl-tes-999
           else      move   s-num         to   rf-sff-iva-cod
                                              (w-cst-ctr-rig)         .
      *              *-------------------------------------------------*
      *              * Visualizzazione codice iva selezionato          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "B"                  to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      13                   to   v-pos                  .
           move      rf-sff-iva-cod
                    (w-cst-ctr-rig)       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       fnd-tbl-tes-999.
           exit.

      *    *===========================================================*
      *    * Controllo codice iva                                      *
      *    *-----------------------------------------------------------*
       cnt-cod-iva-000.
       cnt-cod-iva-999.
           exit.

      *    *===========================================================*
      *    * Calcolo imposta dato codice iva e imponibile              *
      *    *-----------------------------------------------------------*
       cal-imp-iva-000.
      *              *-------------------------------------------------*
      *              * Determinazione                                  *
      *              *-------------------------------------------------*
           move      "DI"                 to   d-imp-iva-tip-ope      .
           perform   det-imp-iva-cll-000  thru det-imp-iva-cll-999    .
       cal-imp-iva-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione totale riga                               *
      *    *-----------------------------------------------------------*
       vis-tot-rig-000.
           add       rf-sff-iva-ibl
                    (w-cst-ctr-rig)
                     rf-sff-iva-imp
                    (w-cst-ctr-rig)     giving w-cst-tot-rig          .
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "GB"                 to   v-edm                  .
           move      w-wrk-ctr-lin        to   v-lin                  .
           move      60                   to   v-pos                  .
           move      w-cst-tot-rig        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tot-rig-999.
           exit.

      *    *===========================================================*
      *    * Tasto funzione "FIND" su archivio clienti                 *
      *    *                                                           *
      *    * Uscita  : OK = "R"        : Campo da reimpostare          *
      *    *                spaces     : E' stato selezionato un codi- *
      *    *                             ce cliente                    *
      *    *-----------------------------------------------------------*
       fnd-arc-cli-000.
      *              *-------------------------------------------------*
      *              * Test se programma di interrogazione gia' attivo *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pcge4010"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to  fnd-arc-cli-999.
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. per possibili- *
      *              * ta' di function-key "SLCT" durante l'interroga- *
      *              * zione                                           *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "fkselect"           to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      04                   to   s-car                  .
           move      "SLCT"               to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo programma di interrogazione            *
      *              *-------------------------------------------------*
           move      "pgm/cge/prg/obj/pcge4010"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * Estrazione di eventuale variabile di i.p.c. de- *
      *              * terminata da function-key "SLCT" durante l'in-  *
      *              * terrogazione                                    *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "cod-cli"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                not  = spaces
                     move   "R"           to   OK
                     go to  fnd-arc-cli-999
           else      move   s-num         to   rf-sff-cod-fnt         .
       fnd-arc-cli-999.
           exit.

      *    *===========================================================*
      *    * Tasto funzione "FIND" su archivio fornitori               *
      *    *                                                           *
      *    * Uscita  : OK = "R"        : Campo da reimpostare          *
      *    *                spaces     : E' stato selezionato un codi- *
      *    *                             ce fornitori                  *
      *    *-----------------------------------------------------------*
       fnd-arc-fnt-000.
      *              *-------------------------------------------------*
      *              * Test se programma di interrogazione gia' attivo *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pcge5010"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to  fnd-arc-fnt-999.
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. per possibili- *
      *              * ta' di function-key "SLCT" durante l'interroga- *
      *              * zione                                           *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "fkselect"           to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      04                   to   s-car                  .
           move      "SLCT"               to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo programma di interrogazione            *
      *              *-------------------------------------------------*
           move      "pgm/cge/prg/obj/pcge5010"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * Estrazione di eventuale variabile di i.p.c. de- *
      *              * terminata da function-key "SLCT" durante l'in-  *
      *              * terrogazione                                    *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "cod-fnt"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                not  = spaces
                     move   "R"           to   OK
                     go to  fnd-arc-fnt-999
           else      move   s-num         to   rf-sff-cod-fnt         .
       fnd-arc-fnt-999.
           exit.

      *    *===========================================================*
      *    * Tasto funzione "INSR" su archivio clienti                 *
      *    *-----------------------------------------------------------*
       ins-arc-cli-000.
      *              *-------------------------------------------------*
      *              * Test se programma di gestione file gia' attivo  *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pcge4000"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to  ins-arc-cli-999.
      *              *-------------------------------------------------*
      *              * Salvataggio del video attuale                   *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Richiamo programma di gestione archivi interes- *
      *              * sato                                            *
      *              *-------------------------------------------------*
           move      "pgm/cge/prg/obj/pcge4000"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * Ripristino del video                            *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       ins-arc-cli-999.
           exit.

      *    *===========================================================*
      *    * Tasto funzione "INSR" su archivio fornitori               *
      *    *-----------------------------------------------------------*
       ins-arc-fnt-000.
      *              *-------------------------------------------------*
      *              * Test se programma di gestione file gia' attivo  *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pcge5000"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to  ins-arc-fnt-999.
      *              *-------------------------------------------------*
      *              * Salvataggio del video attuale                   *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Richiamo programma di gestione archivi interes- *
      *              * sato                                            *
      *              *-------------------------------------------------*
           move      "pgm/cge/prg/obj/pcge5000"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat                                            .
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * Ripristino del video                            *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       ins-arc-fnt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione video nr. 1                               *
      *    *-----------------------------------------------------------*
       vis-vid-001-000.
      *              *-------------------------------------------------*
      *              * Video in OFF                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Cancellazione area video destinata ai dati      *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      07                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts video nr. 1             *
      *              *-------------------------------------------------*
           perform   z-vis-pmt-vid-000    thru z-vis-pmt-vid-999      .
      *              *-------------------------------------------------*
      *              * Visualizzazione dati record video nr. 1         *
      *              *-------------------------------------------------*
           perform   vis-dat-rec-000      thru vis-dat-rec-999        .
      *              *-------------------------------------------------*
      *              * Video in ON                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-vid-001-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione video nr. 2                               *
      *    *-----------------------------------------------------------*
       vis-vid-002-000.
      *              *-------------------------------------------------*
      *              * Video in OFF                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Cancellazione area video destinata ai dati      *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      07                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Visualizzazione promts video nr. 2              *
      *              *-------------------------------------------------*
           perform   vis-pmt-vi2-000      thru vis-pmt-vi2-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione dati record video nr. 2         *
      *              *-------------------------------------------------*
           perform   vis-dar-vi2-000      thru vis-dar-vi2-999        .
      *              *-------------------------------------------------*
      *              * Video in ON                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-vid-002-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts video nr. 2                       *
      *    *-----------------------------------------------------------*
       vis-pmt-vi2-000.
      *              *-------------------------------------------------*
      *              * Codice cliente o fornitore o niente             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice fornitore           :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-pmt-vi2-100.
      *              *-------------------------------------------------*
      *              * Eventuale fornitore bolla doganale              *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Fornitore bolla doganale   :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Data   documento                                *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data   documento           :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Data acquisizione documento                     *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      29                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      "Data acquisizione documento :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Numero documento                                *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero documento           :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Numero giornale iva                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Numero giornale iva        :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Sigla numerazione                               *
      *              *-------------------------------------------------*
      *              *-------------------------------------------------*
      *              * Protocollo iva                                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Protocollo iva             :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Flag di competenza                              *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Flag di anno precedente    :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Flag di stampa giornale                         *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Flag di stampa giornale    :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Regime fiscale particolare                      *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Regime fiscale particolare :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-pmt-vi2-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione dati record video nr. 2                   *
      *    *-----------------------------------------------------------*
       vis-dar-vi2-000.
      *              *-------------------------------------------------*
      *              * Codice archivio clienti o fornitori             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      07                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rf-sff-cod-fnt       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Ragione sociale cliente o fornitore             *
      *              *-------------------------------------------------*
           perform   vis-des-arc-000      thru vis-des-arc-999        .
      *              *-------------------------------------------------*
      *              * Data documento                                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      10                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rf-sff-ddo-ftf       to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Data acquisizione documento                     *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      10                   to   v-lin                  .
           move      71                   to   v-pos                  .
           move      rf-sff-dtr-ftf       to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Numero documento                                *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rf-sff-ndo-ftf       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Numero giornale iva                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "9"                  to   v-edm                  .
           move      13                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rf-sff-num-giv       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Protocollo iva                                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      11                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      14                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rf-sff-npt-iva       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Regime fiscale particolare                      *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-flg-rfp-lun    to   v-car                  .
           move      w-exp-flg-rfp-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      19                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-flg-rfp-tbl    to   v-txt                  .
      *
           if        rf-sff-flg-rfp       =    spaces or
                     rf-sff-flg-rfp       =    "N"
                     move  01             to   v-num
           else if   rf-sff-flg-rfp       =    "S"
                     move  02             to   v-num
           else if   rf-sff-flg-rfp       =    "R"
                     move  03             to   v-num
           else if   rf-sff-flg-rfp       =    "E"
                     move  04             to   v-num
           else      move  zero           to   v-num                  .
      *
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dar-vi2-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione ragione sociale cliente/fornitore         *
      *    *-----------------------------------------------------------*
       vis-des-arc-000.
      *              *-------------------------------------------------*
      *              * Se codice partita zero si visualizza a spazi    *
      *              *-------------------------------------------------*
           if        rf-sff-cod-fnt       =    zero
                     move   spaces        to   v-alf
                     go to  vis-des-arc-900.
       vis-des-arc-200.
      *                      *-----------------------------------------*
      *                      * Ragione sociale fornitore               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione record file         *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *                          *-------------------------------------*
      *                          * Preparazione chiave per lettura     *
      *                          *-------------------------------------*
           move      rf-sff-cod-fnt       to   rf-fnt-cod-fnt         .
      *                          *-------------------------------------*
      *                          * Lettura                             *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *                              *---------------------------------*
      *                              * Test su esito lettura           *
      *                              *---------------------------------*
           if        f-sts                =    e-not-err
                     move   rf-fnt-rag-soc
                                          to   v-alf
           else      move   all "."       to   v-alf                  .
       vis-des-arc-900.
      *                      *-----------------------------------------*
      *                      * Visualizzazione descrizione partita     *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      41                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-des-arc-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione record file                              *
      *    *-----------------------------------------------------------*
       reg-rec-fil-000.
       reg-rec-fil-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per editing del codice iva                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/wedtzci0.wks"                   .

      *    *===========================================================*
      *    * Subroutines per determinazione imposta Iva in base ad un  *
      *    * imponibile                                                *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/dimpiva0.dts"                   .


