       Identification Division.
       Program-Id.                                 pscf8010           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    scf                 *
      *                                Settore:    xml                 *
      *                                   Fase:    scf801              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 17/01/19    *
      *                       Ultima revisione:    NdK del 29/04/25    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Interrogazione su fatture 'xml' ricevute    *
      *                                                                *
      * -------------------------------------------------------------- *
      *                                                                *
      *            N.B.:   Per convenzione, gli Altri dati gestionali  *
      *                    definiti come 'Asw', cioe' nello standard   *
      *                    di AssoSoftware, vengono soppressi in       *
      *                    visualizzazione                             *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      *    *===========================================================*
      *    * File Control [rlt]                                        *
      *    *-----------------------------------------------------------*
           select  optional  rlt   assign  to disk          f-rlt-pat
                             organization  is relative
                             access   mode is dynamic
                             relative key  is               w-rlt-krn
                             file  status is                f-rlt-sts .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Tipo documento in chiave                          *
      *            *---------------------------------------------------*
               10  srt-tip-key            pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Numero documento del fornitore in chiave          *
      *            *---------------------------------------------------*
               10  srt-num-key            pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Data documento del fornitore in chiave            *
      *            *---------------------------------------------------*
               10  srt-dat-key            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data caricamento in chiave                        *
      *            *---------------------------------------------------*
               10  srt-dca-key            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Protocollo registrazione in chiave                *
      *            *---------------------------------------------------*
               10  srt-prt-key            pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Codice fornitore in chiave                        *
      *            *---------------------------------------------------*
               10  srt-fnt-key            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Nome file XML in chiave                           *
      *            *---------------------------------------------------*
               10  srt-xml-key            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale fornitore in chiave               *
      *            *---------------------------------------------------*
               10  srt-rag-key            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Totale documento in chiave                        *
      *            *---------------------------------------------------*
               10  srt-tot-key            pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Righe documento in chiave                         *
      *            *---------------------------------------------------*
               10  srt-rig-key            pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Nome file fattura fornitore                       *
      *            *---------------------------------------------------*
               10  srt-nom-xml            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Righe documento                                   *
      *            *---------------------------------------------------*
               10  srt-rig-doc            pic  9(03)                  .

      *    *===========================================================*
      *    * File Description [rlt]                                    *
      *    *-----------------------------------------------------------*
       fd  rlt.
      *    *-----------------------------------------------------------*
      *    * Record                                                    *
      *    *-----------------------------------------------------------*
       01  rlt-rec.
      *        *-------------------------------------------------------*
      *        * Dati relativi alla linea                              *
      *        *-------------------------------------------------------*
           05  rlt-rec-lin.
               10  filler  occurs  80     pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area ausiliaria per controlli i-o su [rlt]                *
      *    *-----------------------------------------------------------*
       01  f-rlt.
      *        *-------------------------------------------------------*
      *        * File name                                             *
      *        *-------------------------------------------------------*
           05  f-rlt-nam                  pic  x(04) value spaces     .
      *        *-------------------------------------------------------*
      *        * File pathname                                         *
      *        *-------------------------------------------------------*
           05  f-rlt-pat                  pic  x(40) value spaces     .
      *        *-------------------------------------------------------*
      *        * File status                                           *
      *        *-------------------------------------------------------*
           05  f-rlt-sts                  pic  x(02) value "00"       .

      *    *===========================================================*
      *    * Seconda area ausiliaria per controlli i-o su [rlt]        *
      *    *-----------------------------------------------------------*
       01  w-rlt.
      *        *-------------------------------------------------------*
      *        * Record number interessato dall'operazione di i-o      *
      *        *-------------------------------------------------------*
           05  w-rlt-krn                  pic  9(07) value zero       .
      *        *-------------------------------------------------------*
      *        * Max record number memorizzato in assoluto             *
      *        *-------------------------------------------------------*
           05  w-rlt-max                  pic  9(07) value zero       .
      *        *-------------------------------------------------------*
      *        * Contatore records per singolo documento               *
      *        *-------------------------------------------------------*
           05  w-rlt-ctr                  pic  9(07) value zero       .
      *        *-------------------------------------------------------*
      *        * Indice per scansione records per singolo documento    *
      *        *-------------------------------------------------------*
           05  w-rlt-inx                  pic  9(07) value zero       .
      *        *-------------------------------------------------------*
      *        * Status di uscita da 'Start' e 'Next'                  *
      *        *-------------------------------------------------------*
           05  w-rlt-sts                  pic  x(02) value "00"       .

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "scf"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "xml"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "scf801"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pscf8010"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "INTERROGAZIONE SU FATTURE 'XML' RICEVUTE"       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine qry-rou-pri-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-qry-rou-pri      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
               10  w-cnt-exe-rou-sro      pic  9(02)                  .
               10  w-cnt-exe-rou-srm      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste pre esecuzione interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico interrogazione        *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento automatico interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-aut      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di Si/No primo giro di esecuzione            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-prm-gir      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento qry-routine       *
      *        *-------------------------------------------------------*
           05  w-cnt-qry.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-qry-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-liv.
                   15  w-cnt-qry-sav-l05  pic  x(64)                  .
                   15  w-cnt-qry-sav-l04  pic  x(64)                  .
                   15  w-cnt-qry-sav-l03  pic  x(64)                  .
                   15  w-cnt-qry-sav-l02  pic  x(64)                  .
                   15  w-cnt-qry-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Literals                                              *
      *        *-------------------------------------------------------*
           05  w-cnt-lit.
               10  w-cnt-lit-t80          pic  x(80) value all "="    .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [xft]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/fls/rec/rfxft"                          .
      *        *-------------------------------------------------------*
      *        * [xfr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/fls/rec/rfxfr"                          .
      *        *-------------------------------------------------------*
      *        * [xfx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/fls/rec/rfxfx"                          .
      *        *-------------------------------------------------------*
      *        * [xfz]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/fls/rec/rfxfz"                          .
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .

      *    *===========================================================*
      *    * Work-area richieste per interrogazione                    *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Data caricamento                                      *
      *        *-------------------------------------------------------*
           05  rr-dat-car                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Data registrazione min - max                          *
      *        *-------------------------------------------------------*
           05  rr-dat-min                 pic  9(07)                  .
           05  rr-dat-max                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice fornitore                                      *
      *        *-------------------------------------------------------*
           05  rr-cod-fnt                 pic  9(07)                  .
           05  rr-cod-fnt-rag             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Tipo movimento da ricercare                           *
      *        *-------------------------------------------------------*
           05  rr-tdo-sdi                 pic  x(05)                  .
           05  rr-tdo-sdi-des             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Numero documento da ricercare                         *
      *        *-------------------------------------------------------*
           05  rr-num-doc                 pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Si/no senza codice fornitore                          *
      *        *                                                       *
      *        *  - 1 : No                                             *
      *        *  - 2 : Si                                             *
      *        *-------------------------------------------------------*
           05  rr-sns-cdf                 pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Test su registrazione                                 *
      *        *                                                       *
      *        * - 1 : Tutti i documenti                               *
      *        * - 2 : Solo quelli registrati                          *
      *        * - 3 : Solo quelli da registrare                       *
      *        *-------------------------------------------------------*
           05  rr-snx-reg                 pic  9(01)                  .

      *    *===========================================================*
      *    * Link-area per accettazione codice fornitore               *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/acmnfnt0.acl"                   .

      *    *===========================================================*
      *    * Work-area per variabili di i.p.c.                         *
      *    *-----------------------------------------------------------*
       01  w-ipc.
      *        *-------------------------------------------------------*
      *        * Codice fornitore                                      *
      *        *-------------------------------------------------------*
           05  w-ipc-cod-fnt              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Numero documento                                      *
      *        *-------------------------------------------------------*
           05  w-ipc-num-doc              pic  x(10)                  .

      *    *===========================================================*
      *    * Work per subroutines di Find                              *
      *    *-----------------------------------------------------------*
       01  w-fnd.
      *        *-------------------------------------------------------*
      *        * Work per Find su tipi documento fattura elettronica   *
      *        *-------------------------------------------------------*
           05  w-fnd-tdo-sdi.
               10  w-fnd-tdo-sdi-sel      pic  x(01)                  .
               10  w-fnd-tdo-sdi-tdo      pic  x(05)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [fnt]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-fnt.
               10  w-let-arc-fnt-flg      pic  x(01)                  .
               10  w-let-arc-fnt-cod      pic  9(07)                  .
               10  w-let-arc-fnt-rag      pic  x(40)                  .
               10  w-let-arc-fnt-via      pic  x(40)                  .
               10  w-let-arc-fnt-loc      pic  x(40)                  .
               10  w-let-arc-fnt-naz      pic  x(03)                  .
               10  w-let-arc-fnt-piv      pic  9(11)                  .
               10  w-let-arc-fnt-cfi      pic  x(20)                  .
               10  w-let-arc-fnt-cge      pic  9(07)                  .
               10  w-let-arc-fnt-ass      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [xfx]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-xfx.
               10  w-let-arc-xfx-flg      pic  x(01)                  .
               10  w-let-arc-xfx-fil      pic  x(40)                  .
               10  w-let-arc-xfx-prg      pic  9(05)                  .
               10  w-let-arc-xfx-val.
                   15  w-let-arc-xfx-800 occurs 20
                                          pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [xfz]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-xfz.
               10  w-let-arc-xfz-flg      pic  x(01)                  .
               10  w-let-arc-xfz-tip      pic  9(02)                  .
               10  w-let-arc-xfz-cod      pic  x(10)                  .
               10  w-let-arc-xfz-des      pic  x(80)                  .

      *    *===========================================================*
      *    * Work-area per ridefinizione contenuto del mark-point      *
      *    *-----------------------------------------------------------*
       01  w-mpn.
           05  w-mpn-nom-xml              pic  x(40)                  .
           05  w-mpn-tip-doc              pic  x(05)                  .
           05  w-mpn-num-doc              pic  x(10)                  .
           05  w-mpn-dat-doc              pic  9(07)                  .
           05  w-mpn-dat-car              pic  9(07)                  .
           05  w-mpn-cod-fnt              pic  9(07)                  .
           05  w-mpn-num-rig              pic  9(03)                  .
           05  w-mpn-rag-fnt              pic  x(40)                  .
           05  w-mpn-tot-ftf              pic s9(11)                  .

      *    *===========================================================*
      *    * Work per subroutines di Vis                               *
      *    *-----------------------------------------------------------*
       01  w-vis.
      *        *-------------------------------------------------------*
      *        * Work per Vis : Numero protocollo                      *
      *        *-------------------------------------------------------*
           05  w-vis-num-prt.
               10  w-vis-num-prt-num      pic  9(09)                  .
               10  w-vis-num-prt-num-r    redefines
                   w-vis-num-prt-num.
                   15  w-vis-num-prt-saa  pic  9(03)                  .
                   15  w-vis-num-prt-prg  pic  9(06)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Test su registrazione                      *
      *        *-------------------------------------------------------*
           05  w-exp-snx-reg.
               10  w-exp-snx-reg-num      pic  9(02)       value 3    .
               10  w-exp-snx-reg-lun      pic  9(02)       value 20   .
               10  w-exp-snx-reg-tbl.
                   15  filler             pic  x(20) value
                            "Tutti i documenti   "                    .
                   15  filler             pic  x(20) value
                            "solo Registrati     "                    .
                   15  filler             pic  x(20) value
                            "solo Da registrare  "                    .
      *        *-------------------------------------------------------*
      *        * Work per : Tipi fattura elettronica                   *
      *        *-------------------------------------------------------*
           05  w-exp-tdo-sdi.
               10  w-exp-tdo-sdi-num      pic  9(02)       value 18   .
               10  w-exp-tdo-sdi-lun      pic  9(02)       value 40   .
               10  w-exp-tdo-sdi-tbl.
                   15  filler             pic  x(40) value
                            "TD01 - Fattura                          ".
                   15  filler             pic  x(40) value
                            "TD02 - acconto/anticipo su fattura      ".
                   15  filler             pic  x(40) value
                            "TD03 - acconto/anticipo su parcella     ".
                   15  filler             pic  x(40) value
                            "TD04 - nota di credito                  ".
                   15  filler             pic  x(40) value
                            "TD05 - nota di debito                   ".
                   15  filler             pic  x(40) value
                            "TD06 - parcella                         ".
                   15  filler             pic  x(40) value
                            "TD16 - integrazione fattura rev. ch. int".
                   15  filler             pic  x(40) value
                            "TD17 - integrazione/autofatt. acq. s.es.".
                   15  filler             pic  x(40) value
                            "TD18 - acquisto beni intracomunitari    ".
                   15  filler             pic  x(40) value
                            "TD19 - integrazione acquisto beni ex 17 ".
                   15  filler             pic  x(40) value
                            "TD20 - autofattura per regolariz. ex 6  ".
                   15  filler             pic  x(40) value
                            "TD21 - autofattura per splafonamento    ".
                   15  filler             pic  x(40) value
                            "TD22 - estrazione beni da Deposito IVA  ".
                   15  filler             pic  x(40) value
                            "TD23 - estrazione beni da Dep.IVA con v.".
                   15  filler             pic  x(40) value
                            "TD24 - fattura differita di cui art. 21.".
                   15  filler             pic  x(40) value
                            "TD25 - fattura differita art. 21,co4,3p.".
                   15  filler             pic  x(40) value
                            "TD26 - cessione di beni ammortizz.      ".
                   15  filler             pic  x(40) value
                            "TD27 - fattura per autoconsumo o per c. ".
      *        *-------------------------------------------------------*
      *        * Work per : Si/no senza codice fornitore               *
      *        *-------------------------------------------------------*
           05  w-exp-sns-cdf.
               10  w-exp-sns-cdf-num      pic  9(02)       value 2    .
               10  w-exp-sns-cdf-lun      pic  9(02)       value 02   .
               10  w-exp-sns-cdf-tbl.
                   15  filler             pic  x(02) value "No"       .
                   15  filler             pic  x(02) value "Si"       .

      *    *===========================================================*
      *    * Work-area di espansione record trattato                   *
      *    *-----------------------------------------------------------*
       01  w-exp-rec.
           05  w-exp-rec-xfr-tip          pic  x(01)                  .
           05  w-exp-rec-xfr-ctr          pic  9(02)                  .
           05  w-exp-rec-xfr-flg          pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det descrizione da tabella                   *
      *        *-------------------------------------------------------*
           05  w-det-des-tab.
               10  w-det-des-tab-tab      pic  x(03)                  .
               10  w-det-des-tab-tip      pic  x(01)                  .
               10  w-det-des-tab-lun      pic  9(03)                  .
               10  w-det-des-tab-val      pic  x(05)                  .
               10  w-det-des-tab-des.
                   15  filler occurs 400  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det totali documento                         *
      *        *-------------------------------------------------------*
           05  w-det-tot-doc.
               10  w-det-tot-doc-rig      pic  9(05)                  .

      *    *===========================================================*
      *    * Work-area per totali                                      *
      *    *-----------------------------------------------------------*
       01  w-tot.
      *        *-------------------------------------------------------*
      *        * Totali selezione                                      *
      *        *-------------------------------------------------------*
           05  w-tot-gen-doc              pic  9(09)                  .
           05  w-tot-gen-tot              pic s9(13)                  .

      *    *===========================================================*
      *    * Work-area di editing                                      *
      *    *-----------------------------------------------------------*
       01  w-edt.
           05  w-edt-dat.
               10  w-edt-dat-wrk.
                   15  w-edt-dat-wrk-edi  pic  x(10)                  .
                   15  w-edt-dat-wrk-edo  pic  x(10)                  .
                   15  w-edt-dat-wrk-aaa  pic  x(04)                  .
                   15  w-edt-dat-wrk-mmm  pic  x(02)                  .
                   15  w-edt-dat-wrk-ggg  pic  x(02)                  .

      *    *===========================================================*
      *    * Work-area di bufferizzazione elementi                     *
      *    *-----------------------------------------------------------*
       01  w-buf.
      *        *-------------------------------------------------------*
      *        * Work per : visualizzazione                            *
      *        *-------------------------------------------------------*
           05  w-buf-vis.
               10  w-buf-vis-pmt-ele      pic  x(30)                  .
               10  w-buf-vis-val-ele      pic  x(46)                  .
               10  w-buf-vis-ctr-pnt      pic  9(05)                  .
               10  w-buf-vis-ctr-mvx      pic  9(03) value 12         .
               10  w-buf-vis-ctr-mvi      pic  9(05)                  .
               10  w-buf-vis-ctr-lvi      pic  9(02)                  .
               10  w-buf-vis-ctr-002      pic  9(05)                  .
               10  w-buf-vis-ctr-003      pic  9(05)                  .
               10  w-buf-vis-ctr-004      pic  9(02)                  .
               10  w-buf-vis-val-txt.
                   15  w-buf-vis-val-rig  occurs 9
                                          pic  x(45)                  .
      *        *-------------------------------------------------------*
      *        * Work per : numero linea                               *
      *        *-------------------------------------------------------*
           05  w-buf-tot-lin              pic  9(04)                  .
           05  w-buf-lit-att              pic  x(05)                  .
           05  w-buf-lit-tot              pic  x(05)                  .

      *    *===========================================================*
      *    * Area di comunicazione per movimento di contabilita'       *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/pcge300z.pgl"                   .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  filler                 pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/werrbox0.cpw"                   .

      *    *===========================================================*
      *    * Work-area per operazioni sulle date                       *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wnrgdat0.cpw"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Segnale primo giro di esecuzione                *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-prm-gir      .
      *              *-------------------------------------------------*
      *              * Se no richieste : a esecuzione interrogazione   *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-500.
       main-250.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : crescente             *
      *              *-------------------------------------------------*
           move      ">"                  to   w-cnt-exe-rou-srt      .
      *              *-------------------------------------------------*
      *              * Normalizzazione ordinamento sort                *
      *              *-------------------------------------------------*
           move      04                   to   w-cnt-exe-rou-sro      .
           move      10                   to   w-cnt-exe-rou-srm      .
       main-300.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-500.
      *              *-------------------------------------------------*
      *              * Esecuzione interrogazione                       *
      *              *-------------------------------------------------*
           perform   exe-int-err-000      thru exe-int-err-999        .
      *              *-------------------------------------------------*
      *              * Se no richieste : a fine programma              *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Test su flag di sort                            *
      *              *-------------------------------------------------*
           if        w-cnt-qry-rou-pri    not  = "S"
                     go to main-600.
           if        w-cnt-exe-rou-srt    =    ">" or
                     w-cnt-exe-rou-srt    =    "<"
                     go to main-500.
       main-600.
      *              *-------------------------------------------------*
      *              * Test se fine esecuzione da operatore            *
      *              *-------------------------------------------------*
           if        w-cnt-qry-rou-pri    not  = spaces
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Segnale non piu' primo giro di esecuzione       *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-prm-gir      .
      *              *-------------------------------------------------*
      *              * Test se tipo esecuzione ciclico                 *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S" or
                     w-cnt-fun-snx-cic    not  = "S"
                     go to main-750
           else      go to main-250.
       main-750.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione interrogazione                                 *
      *    *-----------------------------------------------------------*
       exe-int-err-000.
      *              *-------------------------------------------------*
      *              * Open files per interrogazione                   *
      *              *-------------------------------------------------*
           perform   qry-opn-fls-000      thru qry-opn-fls-999        .
       exe-int-err-100.
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito           *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to exe-int-err-200
           else      go to exe-int-err-300.
       exe-int-err-200.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di interrogazione vero e proprio      *
      *                  *---------------------------------------------*
           perform   qry-rou-pri-000      thru qry-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * A chiusura files per interrogazione         *
      *                  *---------------------------------------------*
           go to     exe-int-err-900.
       exe-int-err-300.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * A chiusura files per interrogazione         *
      *                  *---------------------------------------------*
           go to     exe-int-err-900.
       exe-int-err-900.
      *              *-------------------------------------------------*
      *              * Close files per interrogazione                  *
      *              *-------------------------------------------------*
           perform   qry-cls-fls-000      thru qry-cls-fls-999        .
       exe-int-err-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Routine principale                       *
      *    *-----------------------------------------------------------*
       qry-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-rou-pri      .
      *              *-------------------------------------------------*
      *              * Determinazione function-keys in Mark-points     *
      *              *-------------------------------------------------*
           perform   qry-det-fky-000      thru qry-det-fky-999        .
      *              *-------------------------------------------------*
      *              * Begin o Begin Automatico                        *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-aut    =    "S"
                     move   "BA"          to   v-ope
           else      move   "BE"          to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Inizializzazione marker di primo giro           *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   qry-str-ini-000      thru qry-str-ini-999        .
           if        w-cnt-qry-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-qry-flg-sub
                     go to  qry-rou-pri-600.
       qry-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-qry-sav-l05      .
           move      w-rot-l04            to   w-cnt-qry-sav-l04      .
           move      w-rot-l03            to   w-cnt-qry-sav-l03      .
           move      w-rot-l02            to   w-cnt-qry-sav-l02      .
           move      w-rot-l01            to   w-cnt-qry-sav-l01      .
       qry-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   qry-let-seq-000      thru qry-let-seq-999        .
           if        w-cnt-qry-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-qry-flg-sub
                     go to  qry-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   qry-tst-max-000      thru qry-tst-max-999        .
           if        w-cnt-qry-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-qry-flg-sub
                     go to  qry-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   qry-sel-rec-000      thru qry-sel-rec-999        .
           if        w-cnt-qry-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-qry-flg-sub
                     go to  qry-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   qry-cmp-rot-000      thru qry-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-qry-mrk-uno    not  = spaces
                     go to qry-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   qry-rou-pri-790      thru qry-rou-pri-791        .
           perform   qry-rou-pri-750      thru qry-rou-pri-751        .
           perform   qry-rou-pri-740      thru qry-rou-pri-741        .
           perform   qry-rou-pri-730      thru qry-rou-pri-731        .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-qry-sav-l05
                     go to qry-rou-pri-310.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l05    to   w-rot-l05              .
           move      w-cnt-qry-sav-l04    to   w-rot-l04              .
           move      w-cnt-qry-sav-l03    to   w-rot-l03              .
           move      w-cnt-qry-sav-l02    to   w-rot-l02              .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           perform   qry-rou-pri-830      thru qry-rou-pri-831        .
           perform   qry-rou-pri-840      thru qry-rou-pri-841        .
           perform   qry-rou-pri-850      thru qry-rou-pri-851        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-750      thru qry-rou-pri-751        .
           perform   qry-rou-pri-740      thru qry-rou-pri-741        .
           perform   qry-rou-pri-730      thru qry-rou-pri-731        .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-qry-sav-l04
                     go to qry-rou-pri-320.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l04    to   w-rot-l04              .
           move      w-cnt-qry-sav-l03    to   w-rot-l03              .
           move      w-cnt-qry-sav-l02    to   w-rot-l02              .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           perform   qry-rou-pri-830      thru qry-rou-pri-831        .
           perform   qry-rou-pri-840      thru qry-rou-pri-841        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-740      thru qry-rou-pri-741        .
           perform   qry-rou-pri-730      thru qry-rou-pri-731        .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-qry-sav-l03
                     go to qry-rou-pri-330.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l03    to   w-rot-l03              .
           move      w-cnt-qry-sav-l02    to   w-rot-l02              .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           perform   qry-rou-pri-830      thru qry-rou-pri-831        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-730      thru qry-rou-pri-731        .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-qry-sav-l02
                     go to qry-rou-pri-340.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l02    to   w-rot-l02              .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-qry-sav-l01
                     go to qry-rou-pri-400.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
       qry-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Livello di dettaglio                            *
      *              *-------------------------------------------------*
           perform   qry-liv-det-000      thru qry-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione : fine ciclo         *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-qry-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     qry-rou-pri-100.
       qry-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-mrk-uno    =    spaces
                     go to qry-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Fine di tutti i livelli                         *
      *              *-------------------------------------------------*
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           perform   qry-rou-pri-830      thru qry-rou-pri-831        .
           perform   qry-rou-pri-840      thru qry-rou-pri-841        .
           perform   qry-rou-pri-850      thru qry-rou-pri-851        .
           perform   qry-rou-pri-890      thru qry-rou-pri-891        .
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Stop                                            *
      *              *-------------------------------------------------*
           move      "ST"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Subroutine di avanzamento pagina                *
      *              *-------------------------------------------------*
           perform   qry-pag-adv-000      thru qry-pag-adv-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     qry-rou-pri-900.
       qry-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   qry-nes-ela-000      thru qry-nes-ela-999        .
           go to     qry-rou-pri-900.
       qry-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-711.
           perform   qry-ini-lr1-000      thru qry-ini-lr1-999        .
       qry-rou-pri-711.
           exit.
       qry-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-721.
           perform   qry-ini-lr2-000      thru qry-ini-lr2-999        .
       qry-rou-pri-721.
           exit.
       qry-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-731.
           perform   qry-ini-lr3-000      thru qry-ini-lr3-999        .
       qry-rou-pri-731.
           exit.
       qry-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-741.
           perform   qry-ini-lr4-000      thru qry-ini-lr4-999        .
       qry-rou-pri-741.
           exit.
       qry-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-751.
           perform   qry-ini-lr5-000      thru qry-ini-lr5-999        .
       qry-rou-pri-751.
           exit.
       qry-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-791.
           perform   qry-ini-cic-000      thru qry-ini-cic-999        .
       qry-rou-pri-791.
           exit.
       qry-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-811.
           perform   qry-fin-lr1-000      thru qry-fin-lr1-999        .
       qry-rou-pri-811.
           exit.
       qry-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-821.
           perform   qry-fin-lr2-000      thru qry-fin-lr2-999        .
       qry-rou-pri-821.
           exit.
       qry-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-831.
           perform   qry-fin-lr3-000      thru qry-fin-lr3-999        .
       qry-rou-pri-831.
           exit.
       qry-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-841.
           perform   qry-fin-lr4-000      thru qry-fin-lr4-999        .
       qry-rou-pri-841.
           exit.
       qry-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-851.
           perform   qry-fin-lr5-000      thru qry-fin-lr5-999        .
       qry-rou-pri-851.
           exit.
       qry-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-891.
           perform   qry-fin-cic-000      thru qry-fin-cic-999        .
       qry-rou-pri-891.
           exit.
       qry-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Subroutine di avanzamento pagina         *
      *    *-----------------------------------------------------------*
       qry-pag-adv-000.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Test su esito interazione con operatore         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se continuazione normale                    *
      *                  *---------------------------------------------*
           if        v-key                =    spaces
                     go to qry-pag-adv-999.
      *                  *---------------------------------------------*
      *                  * Se interruzione forzata da operatore        *
      *                  *---------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "#"            to   w-cnt-qry-flg-int
                     go to qry-pag-adv-999.
      *                  *---------------------------------------------*
      *                  * Se function-key prevista                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Trattamento function-key                *
      *                      *-----------------------------------------*
           perform   qry-trt-fun-000      thru qry-trt-fun-999        .
      *                      *-----------------------------------------*
      *                      * Test su rientro da trattamento f-key    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se fine ciclo interrogazione   *
      *                          *-------------------------------------*
           if        w-cnt-qry-flg-int    =    spaces
                     go to qry-pag-adv-000.
       qry-pag-adv-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Determinazione eventuale variabile di i.p.c.    *
      *              * relativa al codice fornitore                    *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "cod-fnt"            to   s-var                  .
           move      "-"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move   s-num         to   w-ipc-cod-fnt
           else      move   zero          to   w-ipc-cod-fnt          .
      *              *-------------------------------------------------*
      *              * Determinazione eventuale variabile di i.p.c.    *
      *              * relativa al numero documento                    *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "num-doc"            to   s-var                  .
           move      "-"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move   s-alf         to   w-ipc-num-doc
           else      move   spaces        to   w-ipc-num-doc          .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione della presenza della va- *
      *              * riabile di i.p.c. per il numero documento       *
      *              *-------------------------------------------------*
           if        w-ipc-num-doc        not  = spaces
                     go to pre-tip-fun-200
           else      go to pre-tip-fun-600.
       pre-tip-fun-200.
      *              *-------------------------------------------------*
      *              * Se variabile di i.p.c. esistente                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * No richieste ad utente                      *
      *                  *---------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-ric      .
      *                  *---------------------------------------------*
      *                  * No funzionamento ciclico                    *
      *                  *---------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-cic      .
      *                  *---------------------------------------------*
      *                  * No funzionamento automatico                 *
      *                  *---------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-aut      .
      *                  *---------------------------------------------*
      *                  * Preparazione richieste                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Data caricamento                        *
      *                      *-----------------------------------------*
           move      zero                 to   rr-dat-car             .
      *                      *-----------------------------------------*
      *                      * Data minima                             *
      *                      *-----------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *
           move      s-dat                to   w-det-nrg-dat-dtb      .
           move      60                   to   w-det-nrg-dat-ngd      .
           perform   det-nrg-dat-000      thru det-nrg-dat-999        .
           move      w-det-nrg-dat-dtd    to   rr-dat-min             .
      *                      *-----------------------------------------*
      *                      * Data massima                            *
      *                      *-----------------------------------------*
           move      w-det-nrg-dat-dtb    to   rr-dat-max             .
      *
           move      w-ipc-cod-fnt        to   rr-cod-fnt             .
           move      rr-cod-fnt           to   w-let-arc-fnt-cod      .
           perform   let-arc-fnt-000      thru let-arc-fnt-999        .
           move      w-let-arc-fnt-rag    to   rr-cod-fnt-rag         .
      *
           move      spaces               to   rr-tdo-sdi             .
           move      spaces               to   rr-tdo-sdi-des         .
           move      w-ipc-num-doc        to   rr-num-doc             .
           move      zero                 to   rr-sns-cdf             .
           move      2                    to   rr-snx-reg             .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pre-tip-fun-999.
       pre-tip-fun-600.
      *              *-------------------------------------------------*
      *              * Se nessuna variabile di i.p.c.                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Si richieste ad utente                      *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *                  *---------------------------------------------*
      *                  * Si funzionamento ciclico                    *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-cic      .
      *                  *---------------------------------------------*
      *                  * No funzionamento automatico                 *
      *                  *---------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-aut      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pre-tip-fun-999.
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice fornitore       *
      *              *-------------------------------------------------*
           perform   cod-mne-fnt-opn-000  thru cod-mne-fnt-opn-999    .
       rou-opn-fls-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     rou-opn-fls-999.
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice fornitore      *
      *              *-------------------------------------------------*
           perform   cod-mne-fnt-cls-000  thru cod-mne-fnt-cls-999    .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
       acc-ric-sel-050.
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Abilitazione tasto Do                       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
       acc-ric-sel-150.
      *                  *---------------------------------------------*
      *                  * Data caricamento                            *
      *                  *---------------------------------------------*
           perform   acc-dat-car-000      thru acc-dat-car-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
       acc-ric-sel-200.
      *                  *---------------------------------------------*
      *                  * Data registrazione iniziale                 *
      *                  *---------------------------------------------*
           perform   acc-dat-min-000      thru acc-dat-min-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-150.
       acc-ric-sel-250.
      *                  *---------------------------------------------*
      *                  * Data registrazione finale                   *
      *                  *---------------------------------------------*
           perform   acc-dat-max-000      thru acc-dat-max-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-200.
       acc-ric-sel-300.
      *                  *---------------------------------------------*
      *                  * Codice fornitore                            *
      *                  *---------------------------------------------*
           perform   acc-cod-fnt-000      thru acc-cod-fnt-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-250.
       acc-ric-sel-400.
      *                  *---------------------------------------------*
      *                  * Tipo documento da ricercare                 *
      *                  *---------------------------------------------*
           perform   acc-tdo-sdi-000      thru acc-tdo-sdi-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-300.
       acc-ric-sel-500.
      *                  *---------------------------------------------*
      *                  * Numero documento da ricercare               *
      *                  *---------------------------------------------*
           perform   acc-num-doc-000      thru acc-num-doc-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-400.
       acc-ric-sel-600.
      *                  *---------------------------------------------*
      *                  * Test su registrazione                       *
      *                  *---------------------------------------------*
           perform   acc-snx-reg-000      thru acc-snx-reg-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-500.
       acc-ric-sel-700.
      *                  *---------------------------------------------*
      *                  * Si/no senza codice fornitore                *
      *                  *---------------------------------------------*
           perform   acc-sns-cdf-000      thru acc-sns-cdf-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-600.
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#CNF"               to   v-not                  .
           move      "S"                  to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else if   v-key                =    "UP  "
                     go to acc-ric-sel-950
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-950.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazioni                         *
      *                      *-----------------------------------------*
           go to     acc-ric-sel-100.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Data caricamento                                *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data caricamento           :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Data min                                        *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Data documento         dal :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Data max                                        *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "                        al :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Codice fornitore                                *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice fornitore           :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Selezioni su                "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      " - Tipo di documento       :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      " - Numero                  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      " - Registrazione contabile :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      " - Mancanza codice fornit. :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Se variabile di i.p.c. per Fornitore            *
      *              *-------------------------------------------------*
           move      w-ipc-cod-fnt        to   rr-cod-fnt             .
           move      rr-cod-fnt           to   w-let-arc-fnt-cod      .
           perform   let-arc-fnt-000      thru let-arc-fnt-999        .
           move      w-let-arc-fnt-rag    to   rr-cod-fnt-rag         .
      *
           perform   vis-cod-fnt-000      thru vis-cod-fnt-999        .
           perform   vis-rag-fnt-000      thru vis-rag-fnt-999        .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Data caricamento                     *
      *    *-----------------------------------------------------------*
       acc-dat-car-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dat-car-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      05                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-dat-car           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dat-car-999.
       acc-dat-car-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dat-car             .
       acc-dat-car-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dat-car-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dat-car-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dat-car-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dat-car-100.
       acc-dat-car-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Data caricamento                        *
      *    *-----------------------------------------------------------*
       vis-dat-car-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      05                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-dat-car           to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-dat-car-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Data registrazione iniz.   *
      *    *-----------------------------------------------------------*
       acc-dat-min-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dat-min-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      07                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      rr-dat-min           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dat-min-999.
       acc-dat-min-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dat-min             .
       acc-dat-min-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dat-min-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dat-min-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dat-min-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dat-min-100.
       acc-dat-min-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Data registrazione finale  *
      *    *-----------------------------------------------------------*
       acc-dat-max-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dat-max-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      08                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      rr-dat-max           to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-dat-max-999.
       acc-dat-max-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   rr-dat-max             .
       acc-dat-max-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-dat-max-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dat-max-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-dat-max-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-dat-max-100.
       acc-dat-max-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Codice fornitore           *
      *    *-----------------------------------------------------------*
       acc-cod-fnt-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Eventuale default                           *
      *                  *---------------------------------------------*
           if        rr-cod-fnt           not  = zero
                     go to acc-cod-fnt-100.
           if        w-ipc-cod-fnt        =    zero
                     go to acc-cod-fnt-100.
           move      w-ipc-cod-fnt        to   rr-cod-fnt             .
       acc-cod-fnt-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-fnt-ope      .
           move      rr-cod-fnt           to   w-cod-mne-fnt-cod      .
           move      10                   to   w-cod-mne-fnt-lin      .
           move      30                   to   w-cod-mne-fnt-pos      .
           move      10                   to   w-cod-mne-fnt-rln      .
           move      41                   to   w-cod-mne-fnt-rps      .
           move      zero                 to   w-cod-mne-fnt-vln      .
           move      zero                 to   w-cod-mne-fnt-vps      .
           move      zero                 to   w-cod-mne-fnt-lln      .
           move      zero                 to   w-cod-mne-fnt-lps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   cod-mne-fnt-cll-000  thru cod-mne-fnt-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-fnt-foi-000  thru cod-mne-fnt-foi-999    .
       acc-cod-fnt-110.
           perform   cod-mne-fnt-cll-000  thru cod-mne-fnt-cll-999    .
           if        w-cod-mne-fnt-ope    =    "F+"
                     go to acc-cod-fnt-115.
           if        w-cod-mne-fnt-ope    =    "AC"
                     go to acc-cod-fnt-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-fnt-115.
           perform   cod-mne-fnt-foi-000  thru cod-mne-fnt-foi-999    .
           go to     acc-cod-fnt-110.
       acc-cod-fnt-120.
           move      w-cod-mne-fnt-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-cod-fnt-999.
       acc-cod-fnt-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-cod-fnt             .
       acc-cod-fnt-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [fnt]                      *
      *                  *---------------------------------------------*
           move      rr-cod-fnt           to   w-let-arc-fnt-cod      .
           perform   let-arc-fnt-000      thru let-arc-fnt-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione dati fornitore               *
      *                  *---------------------------------------------*
           if        rr-cod-fnt           =    zero
                     move  "Tutti"        to   rr-cod-fnt-rag
           else      move  w-let-arc-fnt-rag
                                          to   rr-cod-fnt-rag         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati fornitore              *
      *                  *---------------------------------------------*
           perform   vis-rag-fnt-000      thru vis-rag-fnt-999        .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-fnt-flg    not  = spaces
                     go to acc-cod-fnt-100.
       acc-cod-fnt-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-fnt-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-cod-fnt-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-cod-fnt-100.
       acc-cod-fnt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Codice fornitore          *
      *    *-----------------------------------------------------------*
       vis-cod-fnt-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      10                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-cod-fnt           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-fnt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Ragione sociale fornitore *
      *    *-----------------------------------------------------------*
       vis-rag-fnt-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-cod-fnt-rag       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rag-fnt-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Tipo movimento da ricercare                *
      *    *-----------------------------------------------------------*
       acc-tdo-sdi-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-tdo-sdi-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      rr-tdo-sdi           to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-tdo-sdi-999.
       acc-tdo-sdi-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-tdo-sdi             .
       acc-tdo-sdi-300.
      *              *-------------------------------------------------*
      *              * Se Find                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "FIND"
                     go to acc-tdo-sdi-400.
      *                  *---------------------------------------------*
      *                  * Find su tipi fattura elettronica            *
      *                  *---------------------------------------------*
           perform   fnd-tdo-sdi-000      thru fnd-tdo-sdi-999        .
           if        w-fnd-tdo-sdi-sel    not  = spaces
                     go to acc-tdo-sdi-100.
           move      w-fnd-tdo-sdi-tdo    to   rr-tdo-sdi             .
      *                  *---------------------------------------------*
      *                  * Visualizzazione tipo fattura elettronica    *
      *                  *---------------------------------------------*
           perform   vis-tdo-sdi-000      thru vis-tdo-sdi-999        .
           move      spaces               to   v-key                  .
       acc-tdo-sdi-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore a spazi : visualizzazione literal *
      *                  * 'Tutti' al posto del codice movimento       *
      *                  *---------------------------------------------*
           if        rr-tdo-sdi           not  = spaces
                     go to acc-tdo-sdi-600.
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "Tutti"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-tdo-sdi-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione tipo fattura    *
      *                  *---------------------------------------------*
           perform   vis-tdo-sdi-des-000  thru vis-tdo-sdi-des-999    .
       acc-tdo-sdi-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-tdo-sdi-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-tdo-sdi-100.
       acc-tdo-sdi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : tipo movimento da ricercare             *
      *    *-----------------------------------------------------------*
       vis-tdo-sdi-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-tdo-sdi           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tdo-sdi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : descrizione tipo movimento da ricercare *
      *    *-----------------------------------------------------------*
       vis-tdo-sdi-des-000.
      *              *-------------------------------------------------*
      *              * Determinazione descrizione                      *
      *              *-------------------------------------------------*
           move      04                   to   w-let-arc-xfz-tip      .
           move      rr-tdo-sdi           to   w-let-arc-xfz-cod      .
           perform   let-arc-xfz-000      thru let-arc-xfz-999        .
           move      w-let-arc-xfz-des    to   rr-tdo-sdi-des         .
      *              *-------------------------------------------------*
      *              * Visualizzazione descrizione                     *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-tdo-sdi-des       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tdo-sdi-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Numero documento da ricercare              *
      *    *-----------------------------------------------------------*
       acc-num-doc-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-num-doc-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      15                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-num-doc           to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-num-doc-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-num-doc-999.
       acc-num-doc-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-num-doc             .
       acc-num-doc-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-num-doc-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-num-doc-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-num-doc-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-num-doc-100.
       acc-num-doc-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Numero documento da ricercare           *
      *    *-----------------------------------------------------------*
       vis-num-doc-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-num-doc           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-num-doc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Test su registrazione                *
      *    *-----------------------------------------------------------*
       acc-snx-reg-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-snx-reg-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snx-reg-lun    to   v-car                  .
           move      w-exp-snx-reg-num    to   v-ldt                  .
           move      "TRD#"               to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      16                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-snx-reg-tbl    to   v-txt                  .
           move      rr-snx-reg           to   v-num                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-snx-reg-999.
       acc-snx-reg-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-snx-reg             .
       acc-snx-reg-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        rr-snx-reg           =    zero
                     go to acc-snx-reg-100.
       acc-snx-reg-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-snx-reg-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-snx-reg-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-snx-reg-100.
       acc-snx-reg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Si/no senza codice fornitore         *
      *    *-----------------------------------------------------------*
       acc-sns-cdf-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-sns-cdf-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-sns-cdf-lun    to   v-car                  .
           move      w-exp-sns-cdf-num    to   v-ldt                  .
           move      "NS#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      17                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-sns-cdf-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-sns-cdf           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-sns-cdf-999.
       acc-sns-cdf-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-sns-cdf             .
       acc-sns-cdf-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        rr-sns-cdf           =    zero or
                     rr-sns-cdf           >    2
                     go to acc-sns-cdf-100.
       acc-sns-cdf-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-sns-cdf-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-sns-cdf-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-sns-cdf-100.
       acc-sns-cdf-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
           move      zero                 to   rr-dat-car             .
           move      zero                 to   rr-dat-min             .
           move      zero                 to   rr-dat-max             .
           move      zero                 to   rr-cod-fnt             .
           move      spaces               to   rr-cod-fnt-rag         .
           move      spaces               to   rr-tdo-sdi             .
           move      spaces               to   rr-tdo-sdi-des         .
           move      spaces               to   rr-num-doc             .
           move      zero                 to   rr-sns-cdf             .
           move      zero                 to   rr-snx-reg             .
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Controlli                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su data min e max                      *
      *                  *---------------------------------------------*
           if        rr-dat-min           =    zero or
                     rr-dat-max           =    zero
                     go to tdo-ric-sel-130.
           if        rr-dat-min           not  > rr-dat-max
                     go to tdo-ric-sel-130.
           move      "Data selezionata minima maggiore di quella massima
      -              " !"                 to   w-err-box-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-130.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione messaggio                   *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Uscita con errore                           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Data min - max                                  *
      *              *-------------------------------------------------*
           if        rr-dat-max           not  = zero
                     go to reg-ric-sel-200.
           if        rr-dat-min           =    zero
                     move  9999999        to   rr-dat-max
           else      move  rr-dat-min     to   rr-dat-max             .
       reg-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Test su registrazione                           *
      *              *-------------------------------------------------*
           if        rr-snx-reg           =    zero
                     move  01             to   rr-snx-reg             .
      *              *-------------------------------------------------*
      *              * Si/no senza codice fornitore                    *
      *              *-------------------------------------------------*
           if        rr-sns-cdf           not  = 2
                     move  1              to   rr-sns-cdf             .
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Open files                               *
      *    *-----------------------------------------------------------*
       qry-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [xft]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xft                 .
      *              *-------------------------------------------------*
      *              * [xfr]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfr                 .
      *              *-------------------------------------------------*
      *              * [xfx]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxfx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfx                 .
      *              *-------------------------------------------------*
      *              * [xfz]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxfz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfz                 .
      *              *-------------------------------------------------*
      *              * Open modulo di interfaccia alla contabilita'    *
      *              *-------------------------------------------------*
           perform   mdl-agg-cge-opn-000  thru mdl-agg-cge-opn-999    .
      *              *-------------------------------------------------*
      *              * Open file relative di appoggio [rlt]            *
      *              *-------------------------------------------------*
           perform   fil-rlt-opn-000      thru fil-rlt-opn-999        .
       qry-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Close files                              *
      *    *-----------------------------------------------------------*
       qry-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [xft]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xft                 .
      *              *-------------------------------------------------*
      *              * [xfr]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfr                 .
      *              *-------------------------------------------------*
      *              * [xfx]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxfx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfx                 .
      *              *-------------------------------------------------*
      *              * [xfz]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxfz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfz                 .
      *              *-------------------------------------------------*
      *              * Close modulo di interfaccia alla contabilita'   *
      *              *-------------------------------------------------*
           perform   mdl-agg-cge-cls-000  thru mdl-agg-cge-cls-999    .
      *              *-------------------------------------------------*
      *              * Close file relative di appoggio [rlt]           *
      *              *-------------------------------------------------*
           perform   fil-rlt-cls-000      thru fil-rlt-cls-999        .
       qry-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Esecuzione sort in ordine ascendente oppure     *
      *              *  discendente                                    *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    "<"
                     go to exe-rou-srt-140
           else      go to exe-rou-srt-120.
       exe-rou-srt-120.
      *              *-------------------------------------------------*
      *              * Se ordine ascendente                            *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   int-srt-inp-000
                                          thru int-srt-inp-999
                     output procedure     is   qry-rou-pri-000
                                          thru qry-rou-pri-999        .
      *
           go to     exe-rou-srt-900.
       exe-rou-srt-140.
      *              *-------------------------------------------------*
      *              * Se ordine discendente                           *
      *              *-------------------------------------------------*
           sort      srt                  on   descending srt-key
                     input  procedure     is   int-srt-inp-000
                                          thru int-srt-inp-999
                     output procedure     is   qry-rou-pri-000
                                          thru qry-rou-pri-999        .
      *
           go to     exe-rou-srt-900.
       exe-rou-srt-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-rou-srt-999.
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       int-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
       int-srt-inp-010.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione delle richieste          *
      *              *-------------------------------------------------*
           if        rr-dat-car           not  = zero
                     go to int-srt-inp-030
           else if   rr-cod-fnt           not  = zero
                     go to int-srt-inp-050
           else      go to int-srt-inp-100.
       int-srt-inp-030.
      *              *-------------------------------------------------*
      *              * Start su archivio [xft] per data caricamento    *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "CARNOM    "         to   f-key                  .
           move      rr-dat-car           to   rf-xft-dat-car         .
           move      spaces               to   rf-xft-nom-xml         .
           move      "pgm/scf/fls/ioc/obj/iofxft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xft                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to int-srt-inp-900
           else      go to int-srt-inp-200.
       int-srt-inp-050.
      *              *-------------------------------------------------*
      *              * Start su archivio [xft] per fornitore           *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "FNTDDO    "         to   f-key                  .
           move      rr-cod-fnt           to   rf-xft-cod-fnt         .
           move      rr-dat-min           to   rf-xft-ddo-ftf         .
           move      spaces               to   rf-xft-nom-xml         .
           move      "pgm/scf/fls/ioc/obj/iofxft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xft                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to int-srt-inp-900
           else      go to int-srt-inp-200.
       int-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Start su archivio [xft] per data documento      *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "DDONOM    "         to   f-key                  .
           move      rr-dat-min           to   rf-xft-ddo-ftf         .
           move      spaces               to   rf-xft-nom-xml         .
           move      "pgm/scf/fls/ioc/obj/iofxft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xft                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to int-srt-inp-900
           else      go to int-srt-inp-200.
       int-srt-inp-200.
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale record [xft]                *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xft                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At End'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to int-srt-inp-900.
       int-srt-inp-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione delle richieste      *
      *                  *---------------------------------------------*
           if        rr-dat-car           not  = zero
                     go to int-srt-inp-310
           else if   rr-cod-fnt           not  = zero
                     go to int-srt-inp-320
           else      go to int-srt-inp-330.
       int-srt-inp-310.
      *              *-------------------------------------------------*
      *              * Test su data caricamento                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rf-xft-dat-car       not  = rr-dat-car
                     go to int-srt-inp-900.
      *                  *---------------------------------------------*
      *                  * A selezioni                                 *
      *                  *---------------------------------------------*
           go to     int-srt-inp-400.
       int-srt-inp-320.
      *              *-------------------------------------------------*
      *              * Test su codice fornitore                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rf-xft-cod-fnt       not  = rr-cod-fnt or
                     rf-xft-ddo-ftf       >    rr-dat-max
                     go to int-srt-inp-900.
      *                  *---------------------------------------------*
      *                  * A selezioni                                 *
      *                  *---------------------------------------------*
           go to     int-srt-inp-400.
       int-srt-inp-330.
      *              *-------------------------------------------------*
      *              * Test su data documento                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rf-xft-ddo-ftf       >    rr-dat-max
                     go to int-srt-inp-900.
      *                  *---------------------------------------------*
      *                  * A selezioni                                 *
      *                  *---------------------------------------------*
           go to     int-srt-inp-400.
       int-srt-inp-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su codice fornitore                    *
      *                  *---------------------------------------------*
           if        rr-cod-fnt           =    zero
                     go to int-srt-inp-420.
           if        rf-xft-cod-fnt       not  = rr-cod-fnt
                     go to int-srt-inp-200.
       int-srt-inp-420.
      *                  *---------------------------------------------*
      *                  * Test su tipo documento                      *
      *                  *---------------------------------------------*
           if        rr-tdo-sdi           =    spaces
                     go to int-srt-inp-430.
           if        rf-xft-tdo-ftf       not  = rr-tdo-sdi
                     go to int-srt-inp-200.
       int-srt-inp-430.
      *                  *---------------------------------------------*
      *                  * Test su numero documento                    *
      *                  *---------------------------------------------*
           if        rr-num-doc           =    spaces
                     go to int-srt-inp-440.
           if        rf-xft-ndo-ftf       not  = rr-num-doc
                     go to int-srt-inp-200.
       int-srt-inp-440.
      *                  *---------------------------------------------*
      *                  * Test su data caricamento                    *
      *                  *---------------------------------------------*
           if        rr-dat-car           =    zero
                     go to int-srt-inp-450.
           if        rf-xft-dat-car       not  = rr-dat-car
                     go to int-srt-inp-200.
       int-srt-inp-450.
      *                  *---------------------------------------------*
      *                  * Test su data min                            *
      *                  *---------------------------------------------*
           if        rr-dat-min           =    zero
                     go to int-srt-inp-460.
           if        rf-xft-ddo-ftf       <    rr-dat-min
                     go to int-srt-inp-200.
       int-srt-inp-460.
      *                  *---------------------------------------------*
      *                  * Test su data max                            *
      *                  *---------------------------------------------*
           if        rr-dat-max           =    zero
                     go to int-srt-inp-470.
           if        rf-xft-ddo-ftf       >    rr-dat-max
                     go to int-srt-inp-200.
       int-srt-inp-470.
      *                  *---------------------------------------------*
      *                  * Test su registrazione                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione del selettore    *
      *                      *-----------------------------------------*
           if        rr-snx-reg           =    01
                     go to int-srt-inp-490
           else if   rr-snx-reg           =    02
                     go to int-srt-inp-472
           else      go to int-srt-inp-476.
       int-srt-inp-472.
      *                      *-----------------------------------------*
      *                      * Se solo documenti gia' registrati       *
      *                      *-----------------------------------------*
           if        rf-xft-num-ftf       not  numeric
                     move  zero           to   rf-xft-num-ftf         .
           if        rf-xft-num-ftf       =    zero
                     go to int-srt-inp-200.
       int-srt-inp-474.
      *                      *-----------------------------------------*
      *                      * Selezione su registrazione gia' effet-  *
      *                      * tuata con verifica in primanota         *
      *                      *-----------------------------------------*
           move      "CN"                 to   l-cge-300-tip-ope      .
           move      "F"                  to   l-cge-300-tip-arc      .
           move      rf-xft-cod-fnt       to   l-cge-300-cod-arc      .
           move      rf-xft-ddo-ftf       to   l-cge-300-dat-doc      .
           move      rf-xft-ndo-ftf       to   l-cge-300-num-doc      .
           move      zero                 to   l-cge-300-num-prt      .
           perform   mdl-agg-cge-cll-000  thru mdl-agg-cge-cll-999    .
      *                          *-------------------------------------*
      *                          * Test                                *
      *                          *-------------------------------------*
           if        l-cge-300-exi-sts    =    spaces
                     go to int-srt-inp-200
           else      go to int-srt-inp-490.
       int-srt-inp-476.
      *                      *-----------------------------------------*
      *                      * Se solo documenti da registrare         *
      *                      *-----------------------------------------*
           if        rf-xft-num-ftf       not  numeric
                     move  zero           to   rf-xft-num-ftf         .
           if        rf-xft-num-ftf       not  = zero
                     go to int-srt-inp-200
           else      go to int-srt-inp-478.
       int-srt-inp-478.
      *                      *-----------------------------------------*
      *                      * Selezione su registrazione gia' effet-  *
      *                      * tuata con verifica in primanota         *
      *                      *-----------------------------------------*
           move      "CN"                 to   l-cge-300-tip-ope      .
           move      "F"                  to   l-cge-300-tip-arc      .
           move      rf-xft-cod-fnt       to   l-cge-300-cod-arc      .
           move      rf-xft-ddo-ftf       to   l-cge-300-dat-doc      .
           move      rf-xft-ndo-ftf       to   l-cge-300-num-doc      .
           move      zero                 to   l-cge-300-num-prt      .
           perform   mdl-agg-cge-cll-000  thru mdl-agg-cge-cll-999    .
      *                          *-------------------------------------*
      *                          * Test                                *
      *                          *-------------------------------------*
           if        l-cge-300-exi-sts    not  = spaces
                     go to int-srt-inp-200
           else      go to int-srt-inp-490.
       int-srt-inp-490.
      *              *-------------------------------------------------*
      *              * Test su si/no senza codice fornitore            *
      *              *-------------------------------------------------*
           if        rr-sns-cdf           not  = 2
                     go to int-srt-inp-500.
           if        rf-xft-cod-fnt       not  = zero
                     go to int-srt-inp-200.
       int-srt-inp-500.
      *              *-------------------------------------------------*
      *              * Determinazione numero righe documento           *
      *              *-------------------------------------------------*
           perform   int-srt-inp-rig-000  thru int-srt-inp-rig-999    .
       int-srt-inp-600.
      *              *-------------------------------------------------*
      *              * Preparazione record di Sort                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione iniziale                    *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
      *                  *---------------------------------------------*
      *                  * Chiave di sort                              *
      *                  *---------------------------------------------*
           perform   int-srt-inp-key-000  thru int-srt-inp-key-999    .
       int-srt-inp-650.
      *                  *---------------------------------------------*
      *                  * Dati di sort                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nome file fattura fornitore             *
      *                      *-----------------------------------------*
           move      rf-xft-nom-xml       to   srt-nom-xml            .
      *                      *-----------------------------------------*
      *                      * Righe documento                         *
      *                      *-----------------------------------------*
           move      w-det-tot-doc-rig    to   srt-rig-doc            .
       int-srt-inp-700.
      *              *-------------------------------------------------*
      *              * Rilascio del record al Sort                     *
      *              *-------------------------------------------------*
           release   srt-rec                                          .
       int-srt-inp-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     int-srt-inp-200.
       int-srt-inp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     int-srt-inp-999.
       int-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *                                                           *
      *    * Subroutine per la determinazione del numero di righe      *
      *    *-----------------------------------------------------------*
       int-srt-inp-rig-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-tot-doc-rig      .
       int-srt-inp-rig-100.
      *              *-------------------------------------------------*
      *              * Start su record [xfr]                           *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NOMXML    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      rf-xft-nom-xml       to   rf-xfr-nom-xml         .
           move      zero                 to   rf-xfr-num-prg         .
           move      "pgm/scf/fls/ioc/obj/iofxfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfr                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to int-srt-inp-rig-900.
       int-srt-inp-rig-200.
      *              *-------------------------------------------------*
      *              * Lettura righe [xfr]                             *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfr                 .
      *                  *---------------------------------------------*
      *                  * Se at end : uscita                          *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to int-srt-inp-rig-900.
       int-srt-inp-rig-300.
      *              *-------------------------------------------------*
      *              * Se oltre il massimo : a controllo contatore     *
      *              *-------------------------------------------------*
           if        rf-xfr-nom-xml       not  = rf-xft-nom-xml
                     go to int-srt-inp-rig-900.
       int-srt-inp-rig-400.
      *              *-------------------------------------------------*
      *              * Selezioni sul record                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Selezione su tipo record                    *
      *                  *---------------------------------------------*
           if        rf-xfr-tip-rec       not  = "R"
                     go to int-srt-inp-rig-200.
      *                  *---------------------------------------------*
      *                  * Selezione su tipo elemento                  *
      *                  *---------------------------------------------*
           if        rf-xfr-tip-ele       not  = "linea"
                     go to int-srt-inp-rig-200.
      *                  *---------------------------------------------*
      *                  * Selezione su prompt elemento                *
      *                  *---------------------------------------------*
           if        rf-xfr-pmt-ele       not  = "NumeroLinea"
                     go to int-srt-inp-rig-200.
       int-srt-inp-rig-600.
      *              *-------------------------------------------------*
      *              * Incremento numero records nel buffer            *
      *              *-------------------------------------------------*
           add       1                    to   w-det-tot-doc-rig      .
       int-srt-inp-rig-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     int-srt-inp-rig-200.
       int-srt-inp-rig-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     int-srt-inp-rig-999.
       int-srt-inp-rig-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *                                                           *
      *    * Subroutine per preparazione chiavi di sort                *
      *    *-----------------------------------------------------------*
       int-srt-inp-key-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione preliminare                     *
      *              *-------------------------------------------------*
           move      spaces               to   srt-tip-key            .
           move      zero                 to   srt-num-key            .
           move      zero                 to   srt-dat-key            .
           move      zero                 to   srt-dca-key            .
           move      zero                 to   srt-prt-key            .
           move      zero                 to   srt-fnt-key            .
           move      spaces               to   srt-xml-key            .
           move      spaces               to   srt-rag-key            .
           move      zero                 to   srt-tot-key            .
           move      zero                 to   srt-rig-key            .
       int-srt-inp-key-050.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di ordinamento  *
      *              *-------------------------------------------------*
           go to     int-srt-inp-key-100
                     int-srt-inp-key-200
                     int-srt-inp-key-300
                     int-srt-inp-key-400
                     int-srt-inp-key-500
                     int-srt-inp-key-600
                     int-srt-inp-key-700
                     int-srt-inp-key-800
                     int-srt-inp-key-900
                     int-srt-inp-key-950
                     depending            on   w-cnt-exe-rou-sro      .
       int-srt-inp-key-100.
      *              *-------------------------------------------------*
      *              * 1. per tipo documento                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Completamento chiave                        *
      *                  *---------------------------------------------*
           move      rf-xft-tdo-ftf       to   srt-tip-key            .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     int-srt-inp-key-990.
       int-srt-inp-key-200.
      *              *-------------------------------------------------*
      *              * 2. per numero documento del fornitore           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Completamento chiave                        *
      *                  *---------------------------------------------*
           move      rf-xft-ndo-ftf       to   srt-num-key            .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     int-srt-inp-key-990.
       int-srt-inp-key-300.
      *              *-------------------------------------------------*
      *              * 3. per data documento del fornitore             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Completamento chiave                        *
      *                  *---------------------------------------------*
           move      rf-xft-ddo-ftf       to   srt-dat-key            .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     int-srt-inp-key-990.
       int-srt-inp-key-400.
      *              *-------------------------------------------------*
      *              * 4. per data registrazione                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Completamento chiave                        *
      *                  *---------------------------------------------*
           move      rf-xft-dat-car       to   srt-dca-key            .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     int-srt-inp-key-990.
       int-srt-inp-key-500.
      *              *-------------------------------------------------*
      *              * 5. per protocollo                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Completamento chiave                        *
      *                  *---------------------------------------------*
           move      rf-xft-num-ftf       to   srt-prt-key            .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     int-srt-inp-key-990.
       int-srt-inp-key-600.
      *              *-------------------------------------------------*
      *              * 6. per codice fornitore                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Completamento chiave                        *
      *                  *---------------------------------------------*
           move      rf-xft-cod-fnt       to   srt-fnt-key            .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     int-srt-inp-key-990.
       int-srt-inp-key-700.
      *              *-------------------------------------------------*
      *              * 7. per nome file XML                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Completamento chiave                        *
      *                  *---------------------------------------------*
           move      rf-xft-nom-xml       to   srt-xml-key            .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     int-srt-inp-key-990.
       int-srt-inp-key-800.
      *              *-------------------------------------------------*
      *              * 8. per ragione sociale fornitore                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Completamento chiave                        *
      *                  *---------------------------------------------*
           move      rf-xft-rag-ftf       to   srt-rag-key            .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     int-srt-inp-key-990.
       int-srt-inp-key-900.
      *              *-------------------------------------------------*
      *              * 9. per imponibile documento                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Completamento chiave                        *
      *                  *---------------------------------------------*
           move      rf-xft-tot-ftf       to   srt-tot-key            .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     int-srt-inp-key-990.
       int-srt-inp-key-950.
      *              *-------------------------------------------------*
      *              * 10. per numero righe                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Completamento chiave                        *
      *                  *---------------------------------------------*
           move      w-det-tot-doc-rig    to   srt-rig-key            .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     int-srt-inp-key-990.
       int-srt-inp-key-990.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     int-srt-inp-key-999.
       int-srt-inp-key-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Start iniziale                           *
      *    *-----------------------------------------------------------*
       qry-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-sub      .
       qry-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Messaggio per nessuna registrazione      *
      *    *-----------------------------------------------------------*
       qry-nes-ela-000.
           move      "ME"                 to   v-ope                  .
           move      "Nessun documento entro i limiti assegnati !"
                                          to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Lettura sequenziale                      *
      *    *-----------------------------------------------------------*
       qry-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-sub      .
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
           return    srt    at end
                            move  "#"     to   w-cnt-qry-flg-sub
                            go to qry-let-seq-999.
       qry-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Test se superamento limiti massimi       *
      *    *-----------------------------------------------------------*
       qry-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-sub      .
       qry-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Selezione su record letto                *
      *    *-----------------------------------------------------------*
       qry-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-sub      .
       qry-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Composizione area per tests di rottura   *
      *    *-----------------------------------------------------------*
       qry-cmp-rot-000.
       qry-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Esecuzione per inizio ciclo              *
      *    *-----------------------------------------------------------*
       qry-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
      *              *-------------------------------------------------*
      *              * Normalizzazione totali selezione                *
      *              *-------------------------------------------------*
           move      zero                 to   w-tot-gen-doc          .
           move      zero                 to   w-tot-gen-tot          .
       qry-ini-cic-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                  *---------------------------------------------*
      *                  * Test se interruzione forzata                *
      *                  *---------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-ini-cic-999.
       qry-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Esecuzione per fine ciclo                *
      *    *-----------------------------------------------------------*
       qry-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-cic-100.
      *              *-------------------------------------------------*
      *              * Stampa totale generale                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da stampare                         *
      *                  *---------------------------------------------*
           if        w-tot-gen-doc        not  > 1
                     go to qry-fin-cic-900.
           if        w-tot-gen-tot        not  > zero
                     go to qry-fin-cic-900.
      *                  *---------------------------------------------*
      *                  * Test se numero linee residue sufficienti    *
      *                  *---------------------------------------------*
           if        v-res                >    2
                     go to qry-fin-cic-200.
      *                  *---------------------------------------------*
      *                  * Intestazione pagina                         *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                      *-----------------------------------------*
      *                      * Se interruzione forzata : uscita        *
      *                      *-----------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-fin-cic-999.
       qry-fin-cic-200.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Fincatura per totale                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      49                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      32                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-fin-cic-300.
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing numero documenti                *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<BG"                to   v-edm                  .
           move      w-tot-gen-doc        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      33                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "Selezionati"        to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      " documenti :"       to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * Allineamento a dx.                      *
      *                      *-----------------------------------------*
           move      33                   to   w-all-str-lun          .
           move      w-all-str-alf        to   w-all-str-alf          .
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                      *-----------------------------------------*
      *                      * Prompt per totale                       *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      33                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Editing totale                          *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      02                   to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "<BG"                to   v-edm                  .
           move      w-tot-gen-tot        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Allineamento a dx.                      *
      *                      *-----------------------------------------*
           move      15                   to   w-all-str-lun          .
           move      v-edt                to   w-all-str-alf          .
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                      *-----------------------------------------*
      *                      * Importo totale                          *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      66                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-fin-cic-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     qry-fin-cic-999.
       qry-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 5. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 5. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 4. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 4. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 3. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 3. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 2. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 2. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 1. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 1. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Livello di dettaglio                     *
      *    *-----------------------------------------------------------*
       qry-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-liv-det-050.
      *              *-------------------------------------------------*
      *              * Normalizzazione [xft]                           *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xft                 .
      *              *-------------------------------------------------*
      *              * Lettura [xft]                                   *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NOMXML    "         to   f-key                  .
           move      srt-nom-xml          to   rf-xft-nom-xml         .
           move      "pgm/scf/fls/ioc/obj/iofxft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xft                 .
       qry-liv-det-100.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           if        v-res                >    3
                     go to qry-liv-det-200.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                  *---------------------------------------------*
      *                  * Test se interruzione forzata                *
      *                  *---------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-liv-det-999.
       qry-liv-det-200.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-300.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo documento                              *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           move      rf-xft-tdo-ftf       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Numero documento                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      08                   to   v-pos                  .
           move      rf-xft-ndo-ftf       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Data caricamento                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      v-lnr                to   v-lin                  .
           move      19                   to   v-pos                  .
      *
           move      "+"                  to   v-edm                  .
           move      rf-xft-nom-xml       to   w-mpn-nom-xml          .
           move      rf-xft-tdo-ftf       to   w-mpn-tip-doc          .
           move      rf-xft-ddo-ftf       to   w-mpn-dat-doc          .
           move      rf-xft-dat-car       to   w-mpn-dat-car          .
           move      rf-xft-ndo-ftf       to   w-mpn-num-doc          .
           move      rf-xft-cod-fnt       to   w-mpn-cod-fnt          .
           move      w-det-tot-doc-rig    to   w-mpn-num-rig          .
           move      rf-xft-rag-ftf       to   w-mpn-rag-fnt          .
           move      rf-xft-tot-ftf       to   w-mpn-tot-ftf          .
           move      w-mpn                to   v-cnt                  .
      *
           move      rf-xft-dat-car       to   v-dat                  .
      *
           if        rf-xft-dat-car       =    zero
                     move  rf-xft-ddo-ftf to   v-dat                  .
      *
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Codice fornitore                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      v-lnr                to   v-lin                  .
           move      29                   to   v-pos                  .
           move      rf-xft-cod-fnt       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ragione sociale fornitore                   *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      38                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      37                   to   v-pos                  .
           move      rf-xft-rag-ftf       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Numero righe documento                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      spaces               to   v-edm                  .
           move      v-lnr                to   v-lin                  .
           move      77                   to   v-pos                  .
           move      srt-rig-doc          to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-400.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-420.
      *              *-------------------------------------------------*
      *              * Seconda linea di visualizzazione                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Data documento                              *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      v-lnr                to   v-lin                  .
           move      08                   to   v-pos                  .
           move      rf-xft-ddo-ftf       to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Protocollo di registrazione                 *
      *                  *---------------------------------------------*
           move      rf-xft-num-ftf
                    (01 : 03)             to   w-vis-num-prt-saa      .
           move      rf-xft-num-ftf
                    (06 : 06)             to   w-vis-num-prt-prg      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "P"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      "<B"                 to   v-edm                  .
           move      v-lnr                to   v-lin                  .
           move      19                   to   v-pos                  .
           move      w-vis-num-prt-num    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Nome file                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "["                  to   w-all-str-cat (1)      .
           move      rf-xft-nom-xml       to   w-all-str-cat (2)      .
           move      "]"                  to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                      *-----------------------------------------*
      *                      * Visualizzazione                         *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      35                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      31                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Totale documento                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      02                   to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "<BG"                to   v-edm                  .
           move      rf-xft-tot-ftf       to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Allineamento a dx.                      *
      *                      *-----------------------------------------*
           move      15                   to   w-all-str-lun          .
           move      v-edt                to   w-all-str-alf          .
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                      *-----------------------------------------*
      *                      * Visualizzazione                         *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      66                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Aggiornamento totali                    *
      *                      *-----------------------------------------*
           add       1                    to   w-tot-gen-doc          .
      *
           if        rf-xft-tdo-ftf       =    "TD04 "
                     subtract rf-xft-tot-ftf
                                          from w-tot-gen-tot
           else      add      rf-xft-tot-ftf
                                          to   w-tot-gen-tot          .
       qry-liv-det-800.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     qry-liv-det-999.
       qry-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Function-keys previste in Mark-points    *
      *    *-----------------------------------------------------------*
       qry-det-fky-000.
      *              *-------------------------------------------------*
      *              * Determinazione eventuale function key Slct      *
      *              *-------------------------------------------------*
           move      "GV"                 to   s-ope                  .
           move      "fkselect"           to   s-var                  .
           move      "-"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces and
                     s-alf                =    "SLCT"
                     move   "SLCT"        to   v-pfk(01)
           else      move   spaces        to   v-pfk(01)              .
      *              *-------------------------------------------------*
      *              * Function key Insr                               *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pscf8000"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                =    zero
                     move  "INSR"         to   v-pfk(02)
           else      move  spaces         to   v-pfk(02)              .
      *              *-------------------------------------------------*
      *              * Function keys per espansione documento          *
      *              *-------------------------------------------------*
           move      "[1] "               to   v-pfk (03)             .
           move      "[2] "               to   v-pfk (04)             .
           move      "[3] "               to   v-pfk (05)             .
           move      "[4] "               to   v-pfk (06)             .
      *              *-------------------------------------------------*
      *              * Function keys per ordinamento visualizzazione   *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-sro    >    1
                     move  "LEFT"         to   v-pfk (07)             .
           if        w-cnt-exe-rou-sro    <    w-cnt-exe-rou-srm
                     move  "RGHT"         to   v-pfk (08)             .
           move      "FIND"               to   v-pfk (09)             .
      *              *-------------------------------------------------*
      *              * Altre function keys                             *
      *              *-------------------------------------------------*
           move      spaces               to   v-pfk (10)             .
       qry-det-fky-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Trattamento Function-key selezionata     *
      *    *-----------------------------------------------------------*
       qry-trt-fun-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-trt-fun-050.
      *              *=================================================*
      *              * Trattamento function-key Slct                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su function-key                        *
      *                  *---------------------------------------------*
           if        v-key                not  = "SLCT"
                     go to qry-trt-fun-100.
      *                  *---------------------------------------------*
      *                  * Normalizzazione function-key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Put della variabile di i.p.c.: 'nom-xml'    *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "nom-xml"            to   s-var                  .
           move      "-"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      40                   to   s-car                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-nom-xml        to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Put della variabile di i.p.c.: 'num-doc'    *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "num-doc"            to   s-var                  .
           move      "-"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      10                   to   s-car                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-num-doc        to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Put della variabile di i.p.c.: 'dat-doc'    *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "dat-doc"            to   s-var                  .
           move      "-"                  to   s-dop                  .
           move      "D"                  to   s-tip                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-dat-doc        to   s-dat                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Put della variabile di i.p.c.: 'dat-car'    *
      *                  *---------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "dat-car"            to   s-var                  .
           move      "-"                  to   s-dop                  .
           move      "D"                  to   s-tip                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-dat-car        to   s-dat                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Segnale di interruzione interrogazione      *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-qry-flg-int      .
      *                  *---------------------------------------------*
      *                  * Segnale di uscita dal programma             *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-qry-rou-pri      .
           go to     qry-trt-fun-999.
       qry-trt-fun-100.
      *              *=================================================*
      *              * Trattamento function-key F1, F2, F3 o F4        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su function-key                        *
      *                  *---------------------------------------------*
           if        v-key                not  = "[1] " and
                     v-key                not  = "[2] " and
                     v-key                not  = "[3] " and
                     v-key                not  = "[4] "
                     go to qry-trt-fun-300.
      *                  *---------------------------------------------*
      *                  * Routine per Expand su record [xfr]          *
      *                  *---------------------------------------------*
           perform   exp-rec-xfr-000      thru exp-rec-xfr-999        .
      *                  *---------------------------------------------*
      *                  * Normalizzazione function key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
       qry-trt-fun-300.
      *              *=================================================*
      *              * Se function-key LEFT                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su function-key                        *
      *                  *---------------------------------------------*
           if        v-key                not  = "LEFT"
                     go to qry-trt-fun-400.
      *                  *---------------------------------------------*
      *                  * Tipo ordinamento                            *
      *                  *---------------------------------------------*
           subtract  1                    from w-cnt-exe-rou-sro      .
           if        w-cnt-exe-rou-sro    <    1
                     move  1              to   w-cnt-exe-rou-sro      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione function key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Segnale di interruzione interrogazione      *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-qry-flg-int      .
      *                  *---------------------------------------------*
      *                  * Segnale di sort                             *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-qry-rou-pri      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-400.
      *              *=================================================*
      *              * Se function-key RGHT                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su function-key                        *
      *                  *---------------------------------------------*
           if        v-key                not  = "RGHT"
                     go to qry-trt-fun-500.
      *                  *---------------------------------------------*
      *                  * Tipo ordinamento                            *
      *                  *---------------------------------------------*
           add       1                    to   w-cnt-exe-rou-sro      .
           if        w-cnt-exe-rou-sro    >    w-cnt-exe-rou-srm
                     move  w-cnt-exe-rou-srm
                                          to   w-cnt-exe-rou-sro      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione function key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Segnale di interruzione interrogazione      *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-qry-flg-int      .
      *                  *---------------------------------------------*
      *                  * Segnale di sort                             *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-qry-rou-pri      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-500.
      *              *=================================================*
      *              * Se function-key FIND                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su function-key                        *
      *                  *---------------------------------------------*
           if        v-key                not  = "FIND"
                     go to qry-trt-fun-900.
      *                  *---------------------------------------------*
      *                  * Normalizzazione function key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Segnale di interruzione interrogazione      *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-qry-flg-int      .
      *                  *---------------------------------------------*
      *                  * Segnale di sort                             *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-qry-rou-pri      .
      *                  *---------------------------------------------*
      *                  * Segnale di uscita dal programma per sort    *
      *                  *---------------------------------------------*
           if        w-cnt-exe-rou-srt    =    ">"
                     move  "<"            to   w-cnt-exe-rou-srt
           else      move  ">"            to   w-cnt-exe-rou-srt      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-000.
      *              *-------------------------------------------------*
      *              * Tipo espansione                                 *
      *              *-------------------------------------------------*
           if        v-key                =    "[1] "
                     move  "R"            to   w-exp-rec-xfr-tip
           else if   v-key                =    "[2] "
                     move  "P"            to   w-exp-rec-xfr-tip
           else if   v-key                =    "[3] "
                     move  "I"            to   w-exp-rec-xfr-tip
           else      move  "C"            to   w-exp-rec-xfr-tip      .
      *              *-------------------------------------------------*
      *              * Recupero campi del mark-point                   *
      *              *-------------------------------------------------*
           move      v-cnt                to   w-mpn                  .
       exp-rec-xfr-030.
      *              *-------------------------------------------------*
      *              * Video in 'OFF'                                  *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exp-rec-xfr-050.
      *              *-------------------------------------------------*
      *              * Costruzione box di Expand                       *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      21                   to   v-lto                  .
           move      80                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exp-rec-xfr-100.
      *              *-------------------------------------------------*
      *              * Prompts per Expand                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing data                                *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      w-mpn-dat-doc        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      76                   to   w-all-str-lun          .
           move      06                   to   w-all-str-num          .
      *
           if        w-exp-rec-xfr-tip    =    "R"
                     move  "[RIGHE] -"    to   w-all-str-cat (1)
           else if   w-exp-rec-xfr-tip    =    "P"
                     move  "[PAGAM] -"    to   w-all-str-cat (1)
           else if   w-exp-rec-xfr-tip    =    "I"
                     move  "[IVA] -"      to   w-all-str-cat (1)
           else      move  "[VARIE] -"    to   w-all-str-cat (1)      .
      *
           move      w-mpn-tip-doc        to   w-all-str-cat (2)      .
           move      w-mpn-num-doc        to   w-all-str-cat (3)      .
           move      "DEL"                to   w-all-str-cat (4)      .
           move      v-edt                to   w-all-str-cat (5)      .
           move      w-mpn-rag-fnt        to   w-all-str-cat (6)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Sottolineatura                              *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exp-rec-xfr-200.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di espansione   *
      *              *-------------------------------------------------*
           if        w-exp-rec-xfr-tip    =    "R"
                     go to  exp-rec-xfr-300
           else if   w-exp-rec-xfr-tip    =    "P"
                     go to  exp-rec-xfr-400
           else if   w-exp-rec-xfr-tip    =    "I"
                     go to  exp-rec-xfr-500
           else      go to  exp-rec-xfr-600                           .
       exp-rec-xfr-300.
      *              *-------------------------------------------------*
      *              * Dettaglio righe                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati da visualizzare                *
      *                  *---------------------------------------------*
           perform   exp-rec-xfr-lin-000  thru exp-rec-xfr-lin-999    .
      *                  *---------------------------------------------*
      *                  * Test su record da visualizzare              *
      *                  *---------------------------------------------*
           if        w-rlt-ctr            >    zero
                     go to exp-rec-xfr-350.
           move      "(Nessuna riga di DETTAGLIO)"
                                          to   rlt-rec-lin            .
      *                  *---------------------------------------------*
      *                  * Richiamo subroutine per la scrittura        *
      *                  *---------------------------------------------*
           perform   fil-rlt-wrt-000      thru fil-rlt-wrt-999        .
       exp-rec-xfr-350.
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      zero                 to   w-buf-vis-ctr-pnt      .
           move      w-rlt-ctr            to   w-buf-vis-ctr-mvi      .
           perform   exp-rec-xfr-vis-000  thru exp-rec-xfr-vis-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione numero linee totali         *
      *                  *---------------------------------------------*
           perform   exp-rec-xfr-nlt-000  thru exp-rec-xfr-nlt-999    .
      *                  *---------------------------------------------*
      *                  * Ad accettazione                             *
      *                  *---------------------------------------------*
           go to     exp-rec-xfr-800.
       exp-rec-xfr-400.
      *              *-------------------------------------------------*
      *              * Dati pagamento                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati da visualizzare                *
      *                  *---------------------------------------------*
           perform   exp-rec-xfr-pag-000  thru exp-rec-xfr-pag-999    .
      *                  *---------------------------------------------*
      *                  * Test su record da visualizzare              *
      *                  *---------------------------------------------*
           if        w-rlt-ctr            >    zero
                     go to exp-rec-xfr-450.
           move      "(Nessun elemento per il PAGAMENTO)"
                                          to   rlt-rec-lin            .
      *                  *---------------------------------------------*
      *                  * Richiamo subroutine per la scrittura        *
      *                  *---------------------------------------------*
           perform   fil-rlt-wrt-000      thru fil-rlt-wrt-999        .
       exp-rec-xfr-450.
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      zero                 to   w-buf-vis-ctr-pnt      .
           move      w-rlt-ctr            to   w-buf-vis-ctr-mvi      .
           perform   exp-rec-xfr-vis-000  thru exp-rec-xfr-vis-999    .
      *                  *---------------------------------------------*
      *                  * Ad accettazione                             *
      *                  *---------------------------------------------*
           go to     exp-rec-xfr-800.
       exp-rec-xfr-500.
      *              *-------------------------------------------------*
      *              * Dati Iva                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati da visualizzare                *
      *                  *---------------------------------------------*
           perform   exp-rec-xfr-rie-000  thru exp-rec-xfr-rie-999    .
      *                  *---------------------------------------------*
      *                  * Test su record da visualizzare              *
      *                  *---------------------------------------------*
           if        w-rlt-ctr            >    zero
                     go to exp-rec-xfr-550.
           move      "(Nessuna riga di RIEPILOGO IVA)"
                                          to   rlt-rec-lin            .
      *                  *---------------------------------------------*
      *                  * Richiamo subroutine per la scrittura        *
      *                  *---------------------------------------------*
           perform   fil-rlt-wrt-000      thru fil-rlt-wrt-999        .
       exp-rec-xfr-550.
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      zero                 to   w-buf-vis-ctr-pnt      .
           move      w-rlt-ctr            to   w-buf-vis-ctr-mvi      .
           perform   exp-rec-xfr-vis-000  thru exp-rec-xfr-vis-999    .
      *                  *---------------------------------------------*
      *                  * Ad accettazione                             *
      *                  *---------------------------------------------*
           go to     exp-rec-xfr-800.
       exp-rec-xfr-600.
      *              *-------------------------------------------------*
      *              * Causale, dati Ritenuta e Cassa                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati da visualizzare                *
      *                  *---------------------------------------------*
           perform   exp-rec-xfr-rda-000  thru exp-rec-xfr-rda-999    .
      *                  *---------------------------------------------*
      *                  * Test su record da visualizzare              *
      *                  *---------------------------------------------*
           if        w-rlt-ctr            >    zero
                     go to exp-rec-xfr-650.
           move      "(Nessuna riga di CAUSALE, RITENUTA o CASSA)"
                                          to   rlt-rec-lin            .
      *                  *---------------------------------------------*
      *                  * Richiamo subroutine per la scrittura        *
      *                  *---------------------------------------------*
           perform   fil-rlt-wrt-000      thru fil-rlt-wrt-999        .
       exp-rec-xfr-650.
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      zero                 to   w-buf-vis-ctr-pnt      .
           move      w-rlt-ctr            to   w-buf-vis-ctr-mvi      .
           perform   exp-rec-xfr-vis-000  thru exp-rec-xfr-vis-999    .
      *                  *---------------------------------------------*
      *                  * Ad accettazione                             *
      *                  *---------------------------------------------*
           go to     exp-rec-xfr-800.
       exp-rec-xfr-800.
      *              *=================================================*
      *              * Sottolineatura                                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Prompt per presa visione                        *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      76                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in 'ON'                                   *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exp-rec-xfr-810.
      *              *-------------------------------------------------*
      *              * Accettazione di un carattere per presa visione  *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      20                   to   v-lin                  .
           move      77                   to   v-pos                  .
      *
           if        w-buf-vis-ctr-pnt    >    zero
                     move  "UP  "         to   v-pfk (01)             .
      *
           if        w-buf-vis-ctr-002    not > w-buf-vis-ctr-mvi
                     move  "DOWN"         to   v-pfk (02)             .
      *
           if        w-buf-vis-ctr-pnt    not  < w-buf-vis-ctr-mvx
                     move  "PRSC"         to   v-pfk (07)             .
      *
           if        w-buf-vis-ctr-002    <    w-buf-vis-ctr-mvi
                     move  "NXSC"         to   v-pfk (08)             .
      *
           move      "[1] "               to   v-pfk (13)             .
           move      "[2] "               to   v-pfk (14)             .
           move      "[3] "               to   v-pfk (15)             .
           move      "[4] "               to   v-pfk (16)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exp-rec-xfr-820.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tasto funzione       *
      *              *-------------------------------------------------*
           if        v-key                =    spaces or
                     v-key                =    "RTRN"
                     go to exp-rec-xfr-822
           else if   v-key                =    "UP  "
                     go to exp-rec-xfr-824
           else if   v-key                =    "DOWN"
                     go to exp-rec-xfr-826
           else if   v-key                =    "PRSC"
                     go to exp-rec-xfr-828
           else if   v-key                =    "NXSC"
                     go to exp-rec-xfr-830
           else if   v-key                =    "[1] " or
                     v-key                =    "[2] " or
                     v-key                =    "[3] " or
                     v-key                =    "[4] " or
                     v-key                =    "EXIT"
                     go to exp-rec-xfr-900
           else      go to exp-rec-xfr-900.
       exp-rec-xfr-822.
      *              *-------------------------------------------------*
      *              * Se return                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     exp-rec-xfr-900.
       exp-rec-xfr-824.
      *              *-------------------------------------------------*
      *              * Se Up                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           subtract  1                    from w-buf-vis-ctr-pnt      .
           perform   exp-rec-xfr-vis-000  thru exp-rec-xfr-vis-999    .
      *                  *---------------------------------------------*
      *                  * Normalizzazione function-key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Ad accettazione                             *
      *                  *---------------------------------------------*
           go to     exp-rec-xfr-810.
       exp-rec-xfr-826.
      *              *-------------------------------------------------*
      *              * Se Down                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           add       1                    to   w-buf-vis-ctr-pnt      .
           perform   exp-rec-xfr-vis-000  thru exp-rec-xfr-vis-999    .
      *                  *---------------------------------------------*
      *                  * Normalizzazione function-key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Ad accettazione                             *
      *                  *---------------------------------------------*
           go to     exp-rec-xfr-810.
       exp-rec-xfr-828.
      *              *-------------------------------------------------*
      *              * Se Prsc                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           subtract  12                   from w-buf-vis-ctr-pnt      .
           perform   exp-rec-xfr-vis-000  thru exp-rec-xfr-vis-999    .
      *                  *---------------------------------------------*
      *                  * Normalizzazione function-key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Ad accettazione                             *
      *                  *---------------------------------------------*
           go to     exp-rec-xfr-810.
       exp-rec-xfr-830.
      *              *-------------------------------------------------*
      *              * Se Nxsc                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           add       12                   to   w-buf-vis-ctr-pnt      .
           perform   exp-rec-xfr-vis-000  thru exp-rec-xfr-vis-999    .
      *                  *---------------------------------------------*
      *                  * Normalizzazione function-key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Ad accettazione                             *
      *                  *---------------------------------------------*
           go to     exp-rec-xfr-810.
       exp-rec-xfr-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-999.
       exp-rec-xfr-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *                                                           *
      *    * Subroutine di visualizzazione numero linee totali         *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-nlt-000.
      *              *-------------------------------------------------*
      *              * Trattamento numero pagina                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione numero linee totali          *
      *                  *---------------------------------------------*
           move      w-mpn-num-rig        to   w-buf-tot-lin          .
      *                  *---------------------------------------------*
      *                  * Editing linee totali                        *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-buf-tot-lin        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-edt                to   w-buf-lit-tot          .
      *                  *---------------------------------------------*
      *                  * Preparazione literal                        *
      *                  *---------------------------------------------*
           move      50                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      "Linee dettaglio totali       :"
                                          to   w-all-str-cat (1)      .
           move      w-buf-lit-tot        to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                  *---------------------------------------------*
      *                  * Visualizzazione literal                     *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      spaces               to   v-edm                  .
           move      20                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exp-rec-xfr-nlt-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-nlt-999.
       exp-rec-xfr-nlt-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *                                                           *
      *    * Subroutine di normalizzazione pagina video                *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-pul-000.
      *              *-------------------------------------------------*
      *              * Video in 'OFF'                                  *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
                                         
           move      zero                 to   w-buf-vis-ctr-004      .
       exp-rec-xfr-pul-200.
           add       1                    to   w-buf-vis-ctr-004      .
      *              *-------------------------------------------------*
      *              * Test se oltre le righe consentite               *
      *              *-------------------------------------------------*
           if        w-buf-vis-ctr-004    >    w-buf-vis-ctr-mvx
                     go to exp-rec-xfr-pul-800.
      *              *-------------------------------------------------*
      *              * Visualizzazione linea vuota                     *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      06                   to   v-lin                  .
           add       w-buf-vis-ctr-004    to   v-lin                  .
           move      03                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-pul-200.
       exp-rec-xfr-pul-800.
      *              *-------------------------------------------------*
      *              * Video in 'ON'                                   *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exp-rec-xfr-pul-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-pul-999.
       exp-rec-xfr-pul-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *                                                           *
      *    * Subroutine di visualizzazione testo scorrevole            *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-vis-000.
      *              *-------------------------------------------------*
      *              * Pulizia preliminare pagina video                *
      *              *-------------------------------------------------*
           perform   exp-rec-xfr-pul-000  thru exp-rec-xfr-pul-999    .
       exp-rec-xfr-vis-100.
      *              *-------------------------------------------------*
      *              * Ciclo per 'n' linee video                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Indice per scansione                        *
      *                  *---------------------------------------------*
           move      w-buf-vis-ctr-pnt    to   w-rlt-inx              .
      *                  *---------------------------------------------*
      *                  * Start su file relative di appoggio per le   *
      *                  * righe del documento                         *
      *                  *---------------------------------------------*
           perform   fil-rlt-str-000      thru fil-rlt-str-999        .
      *                  *---------------------------------------------*
      *                  * Puntatore linea video                       *
      *                  *---------------------------------------------*
           move      w-buf-vis-ctr-pnt    to   w-buf-vis-ctr-002      .
      *                  *---------------------------------------------*
      *                  * Contatore linea video                       *
      *                  *---------------------------------------------*
           move      zero                 to   w-buf-vis-ctr-lvi      .
       exp-rec-xfr-vis-200.
      *                  *---------------------------------------------*
      *                  * Read Next da file relative di appoggio per  *
      *                  * le righe del documento                      *
      *                  *---------------------------------------------*
           perform   fil-rlt-nxt-000      thru fil-rlt-nxt-999        .
      *                  *---------------------------------------------*
      *                  * Incremento contatori                        *
      *                  *---------------------------------------------*
           add       1                    to   w-buf-vis-ctr-lvi      .
           add       1                    to   w-buf-vis-ctr-002      .
      *                  *---------------------------------------------*
      *                  * Test se fine file relative di appoggio      *
      *                  *---------------------------------------------*
           if        w-rlt-sts            not  = e-not-err
                     go to exp-rec-xfr-vis-900.
      *                  *---------------------------------------------*
      *                  * Test se oltre il massimo delle linee lette  *
      *                  *---------------------------------------------*
           if        w-buf-vis-ctr-lvi    >    w-buf-vis-ctr-mvx
                     go to exp-rec-xfr-vis-900.
      *                  *---------------------------------------------*
      *                  * Test se finite le linee non vuote           *
      *                  *---------------------------------------------*
           if        w-buf-vis-ctr-002    >    w-buf-vis-ctr-mvi
                     go to exp-rec-xfr-vis-500.
      *                  *---------------------------------------------*
      *                  * Visualizzazione elemento                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      06                   to   v-lin                  .
           add       w-buf-vis-ctr-lvi    to   v-lin                  .
           move      03                   to   v-pos                  .
           move      rlt-rec-lin          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exp-rec-xfr-vis-490.
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     exp-rec-xfr-vis-200.
       exp-rec-xfr-vis-500.
      *              *-------------------------------------------------*
      *              * Linea vuota                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      06                   to   v-lin                  .
           add       w-buf-vis-ctr-lvi    to   v-lin                  .
           move      03                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     exp-rec-xfr-vis-200.
       exp-rec-xfr-vis-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-vis-999.
       exp-rec-xfr-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *                                                           *
      *    * Ciclo di caricamento linee documento                      *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-lin-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio documento per le sub-   *
      *              * routines per il trattamento del file relative   *
      *              * di appoggio [rlt]                               *
      *              *-------------------------------------------------*
           perform   fil-rlt-new-000      thru fil-rlt-new-999        .
       exp-rec-xfr-lin-100.
      *              *-------------------------------------------------*
      *              * Start su [xfr]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NOMXML    "         to   f-key                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-nom-xml        to   rf-xfr-nom-xml         .
           move      zero                 to   rf-xfr-num-prg         .
           move      "pgm/scf/fls/ioc/obj/iofxfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfr                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a riciclo                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exp-rec-xfr-lin-900.
       exp-rec-xfr-lin-200.
      *              *-------------------------------------------------*
      *              * Read-next su archivio [xfr]                     *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfr                 .
      *                  *---------------------------------------------*
      *                  * Se at end : a riciclo                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exp-rec-xfr-lin-900.
       exp-rec-xfr-lin-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-xfr-nom-xml       not  = w-mpn-nom-xml
                     go to exp-rec-xfr-lin-900.
       exp-rec-xfr-lin-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Selezione su tipo record                    *
      *                  *---------------------------------------------*
           if        rf-xfr-tip-rec       not  = "R"
                     go to exp-rec-xfr-lin-200.
      *                  *---------------------------------------------*
      *                  * Selezione su tipo elemento                  *
      *                  *---------------------------------------------*
           if        rf-xfr-tip-ele       not  = "linea"
                     go to exp-rec-xfr-lin-200.
      *                  *---------------------------------------------*
      *                  * Per convenzione, gli elementi definiti come *
      *                  * 'Asw', cioe' nello standard definito da     *
      *                  * AssoSoftware, vengono soppressi dalla       *
      *                  * visualizzazione                             *
      *                  *---------------------------------------------*
           if        rf-xfr-val-ele
                    (01 : 03)             =    "Asw"
                     go to exp-rec-xfr-lin-200.
       exp-rec-xfr-lin-500.
      *              *-------------------------------------------------*
      *              * Caricamento dati                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione prompt                      *
      *                  *---------------------------------------------*
           if        rf-xfr-pmt-ele       =    "NumeroLinea"
                     move  "Numero Linea ................:"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-510
           else if   rf-xfr-pmt-ele       =    "Descrizione"
                     move  "Descrizione                  :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-520
           else if   rf-xfr-pmt-ele       =    "Quantita"
                     move  "Quantita'                    :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-570
           else if   rf-xfr-pmt-ele       =    "DataInizioPeriodo"
                     move  "Data Inizio Periodo          :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-560
           else if   rf-xfr-pmt-ele       =    "DataFinePeriodo"
                     move  "Data Fine Periodo            :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-560
           else if   rf-xfr-pmt-ele       =    "UnitaMisura"
                     move  "Unita' di Misura             :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-520
           else if   rf-xfr-pmt-ele       =    "PrezzoUnitario"
                     move  "Prezzo Unitario              :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-590
           else if   rf-xfr-pmt-ele       =    "PrezzoTotale"
                     move  "Prezzo Totale                :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-590
           else if   rf-xfr-pmt-ele       =    "AliquotaIVA"
                     move  "Aliquota IVA                 :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-595
           else if   rf-xfr-pmt-ele       =    "RiferimentoAmministrazio
      -              "ne"
                     move  "Riferimento Amministrazio    :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-520
           else if   rf-xfr-pmt-ele       =    "Natura"
                     move  "Natura                       :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-540
           else if   rf-xfr-pmt-ele       =    "CodiceTipo"
                     move  "Codice Tipo                  :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-520
           else if   rf-xfr-pmt-ele       =    "CodiceValore"
                     move  "Codice Valore                :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-520
           else if   rf-xfr-pmt-ele       =    "TipoDato"
                     move  "Tipo Dato                    :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-520
           else if   rf-xfr-pmt-ele       =    "RiferimentoTesto"
                     move  "Riferimento Testo            :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-520
           else if   rf-xfr-pmt-ele       =    "RiferimentoNumero"
                     move  "Riferimento Numero           :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-520
           else if   rf-xfr-pmt-ele       =    "RiferimentoData"
                     move  "Riferimento Data             :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-560
           else if   rf-xfr-pmt-ele       =    "Ritenuta"
                     move  "Ritenuta                     :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-520
           else if   rf-xfr-pmt-ele       =    "Tipo"
                     move  "Tipo sconto / maggiorazione  :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-540
           else if   rf-xfr-pmt-ele       =    "Percentuale"
                     move  "%                            :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-520
           else if   rf-xfr-pmt-ele       =    "Importo"
                     move  "Importo                      :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-lin-590
           else      go to  exp-rec-xfr-lin-200.
       exp-rec-xfr-lin-510.
      *                  *---------------------------------------------*
      *                  * Inizializzazione linea                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di linea di commento a spazi       *
      *                      *-----------------------------------------*
           move      spaces               to   w-exp-rec-xfr-flg      .
      *                      *-----------------------------------------*
      *                      * A bufferizzazione testo                 *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-lin-520.
       exp-rec-xfr-lin-520.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione testo                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-txt-000  thru exp-rec-xfr-txt-999    .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-lin-700.
       exp-rec-xfr-lin-540.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione codice e descrizione        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su prompt                          *
      *                      *-----------------------------------------*
           if        rf-xfr-pmt-ele       =    "Natura"
                     go to exp-rec-xfr-lin-545
           else if   rf-xfr-pmt-ele       =    "Tipo"
                     go to exp-rec-xfr-lin-550.
       exp-rec-xfr-lin-545.
      *                      *-----------------------------------------*
      *                      * Natura                                  *
      *                      *-----------------------------------------*
           move      rf-xfr-val-ele       to   w-det-des-tab-val      .
           move      "NAT"                to   w-det-des-tab-tab      .
           move      "C"                  to   w-det-des-tab-tip      .
           move      50                   to   w-det-des-tab-lun      .
           perform   det-des-tab-000      thru det-des-tab-999        .
           move      w-det-des-tab-des    to   w-buf-vis-val-ele      .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-lin-600.
       exp-rec-xfr-lin-550.
      *                      *-----------------------------------------*
      *                      * Tipo sconto / maggiorazione             *
      *                      *-----------------------------------------*
           if        rf-xfr-val-ele       =    "SC"
                     move  "Sconto                       :"
                                          to   w-buf-vis-pmt-ele
           else if   rf-xfr-val-ele       =    "MG"
                     move  "Maggiorazione                :"
                                          to   w-buf-vis-pmt-ele      .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione                         *
      *                      *-----------------------------------------*
           move      rf-xfr-val-ele       to   w-buf-vis-val-ele      .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-lin-600.
       exp-rec-xfr-lin-560.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione data                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-dat-000  thru exp-rec-xfr-dat-999    .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-lin-600.
       exp-rec-xfr-lin-570.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione quantita'                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-qta-000  thru exp-rec-xfr-qta-999    .
      *                      *-----------------------------------------*
      *                      * Test se a spazi                         *
      *                      *-----------------------------------------*
           if        w-buf-vis-val-ele    =    spaces
                     move  "#"            to   w-exp-rec-xfr-flg
                     go to exp-rec-xfr-lin-700.
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-lin-600.
       exp-rec-xfr-lin-580.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione importo                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-imp-000  thru exp-rec-xfr-imp-999    .
      *                      *-----------------------------------------*
      *                      * Test se a spazi                         *
      *                      *-----------------------------------------*
           if        w-buf-vis-val-ele    =    spaces
                     move  "#"            to   w-exp-rec-xfr-flg
                     go to exp-rec-xfr-lin-700.
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-lin-600.
       exp-rec-xfr-lin-590.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione prezzo                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-prz-000  thru exp-rec-xfr-prz-999    .
      *                      *-----------------------------------------*
      *                      * Test se a spazi                         *
      *                      *-----------------------------------------*
           if        w-buf-vis-val-ele    =    spaces
                     move  "#"            to   w-exp-rec-xfr-flg
                     go to exp-rec-xfr-lin-700.
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-lin-600.
       exp-rec-xfr-lin-595.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione aliquota Iva                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su flag di riga di commento        *
      *                      *-----------------------------------------*
           if        w-exp-rec-xfr-flg    not  = spaces
                     go to exp-rec-xfr-lin-700.
      *                      *-----------------------------------------*
      *                      * A bufferizzazione testo                 *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-lin-520.
       exp-rec-xfr-lin-600.
      *              *-------------------------------------------------*
      *              * Scrittura su file relative                      *
      *              *-------------------------------------------------*
           perform   exp-rec-xfr-wrt-000  thru exp-rec-xfr-wrt-999    .
       exp-rec-xfr-lin-700.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-lin-200.
       exp-rec-xfr-lin-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-lin-999.
       exp-rec-xfr-lin-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *                                                           *
      *    * Ciclo di caricamento dati pagamento                       *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-pag-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio documento per le sub-   *
      *              * routines per il trattamento del file relative   *
      *              * di appoggio [rlt]                               *
      *              *-------------------------------------------------*
           perform   fil-rlt-new-000      thru fil-rlt-new-999        .
       exp-rec-xfr-pag-100.
      *              *-------------------------------------------------*
      *              * Start su [xfr]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NOMXML    "         to   f-key                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-nom-xml        to   rf-xfr-nom-xml         .
           move      zero                 to   rf-xfr-num-prg         .
           move      "pgm/scf/fls/ioc/obj/iofxfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfr                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a riciclo                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exp-rec-xfr-pag-900.
       exp-rec-xfr-pag-200.
      *              *-------------------------------------------------*
      *              * Read-next su archivio [xfr]                     *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfr                 .
      *                  *---------------------------------------------*
      *                  * Se at end : a riciclo                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exp-rec-xfr-pag-900.
       exp-rec-xfr-pag-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-xfr-nom-xml       not  = w-mpn-nom-xml
                     go to exp-rec-xfr-pag-900.
       exp-rec-xfr-pag-400.
      *              *-------------------------------------------------*
      *              * Selezione su tipo record                        *
      *              *-------------------------------------------------*
           if        rf-xfr-tip-rec       not  = "P"
                     go to exp-rec-xfr-pag-200.
           if        rf-xfr-tip-ele       not  = "pagam"
                     go to exp-rec-xfr-pag-200.
       exp-rec-xfr-pag-500.
      *              *-------------------------------------------------*
      *              * Caricamento dati                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione prompt                      *
      *                  *---------------------------------------------*
           if        rf-xfr-pmt-ele       =    "CondizioniPagamento"
                     move  "Condizioni di Pagamento      :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-540
           else if   rf-xfr-pmt-ele       =    "Beneficiario"
                     move  "Beneficiario                 :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-520
           else if   rf-xfr-pmt-ele       =    "ModalitaPagamento"
                     move  "Modalita' di Pagamento       :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-540
           else if   rf-xfr-pmt-ele       =    "DataRiferimentoTerminiPa
      -              "gamento"
                     move  "Data Riferimento Termini Pag.:"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-560
           else if   rf-xfr-pmt-ele       =    "GiorniTerminiPagamento"
                     move  "Giorni Termini Pagamento     :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-520
           else if   rf-xfr-pmt-ele       =    "DataScadenzaPagamento"
                     move  "Data Scadenza Pagamento      :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-560
           else if   rf-xfr-pmt-ele       =    "ImportoPagamento"
                     move  "Importo Pagamento            :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-580
           else if   rf-xfr-pmt-ele       =    "CodUfficioPostale"
                     move  "Codice Ufficio Postale       :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-520
           else if   rf-xfr-pmt-ele       =    "CognomeQuietanzante"
                     move  "Cognome Quietanzante         :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-520
           else if   rf-xfr-pmt-ele       =    "NomeQuietanzante"
                     move  "Nome Quietanzante            :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-520
           else if   rf-xfr-pmt-ele       =    "CFQuietanzante"
                     move  "Codice Fiscale Quietanzante  :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-520
           else if   rf-xfr-pmt-ele       =    "TitoloQuietanzante"
                     move  "Titolo Quietanzante          :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-520
           else if   rf-xfr-pmt-ele       =    "IstitutoFinanziario"
                     move  "Istituto Finanziario         :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-520
           else if   rf-xfr-pmt-ele       =    "IBAN"
                     move  "IBAN                         :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-520
           else if   rf-xfr-pmt-ele       =    "ABI"
                     move  "ABI                          :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-520
           else if   rf-xfr-pmt-ele       =    "CAB"
                     move  "CAB                          :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-520
           else if   rf-xfr-pmt-ele       =    "BIC"
                     move  "BIC                          :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-520
           else if   rf-xfr-pmt-ele       =    "ScontoPagamentoAnticipat
      -              "o"
                     move  "Sconto Pagamento Anticipato  :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-580
           else if   rf-xfr-pmt-ele       =    "DataLimitePagamentoAntic
      -              "ipato"
                     move  "Data Limite Pagamento Antic. :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-560
           else if   rf-xfr-pmt-ele       =    "PenalitaPagamentiRitarda
      -              "ti"
                     move  "Penalita' Pagamenti Ritardati:"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-580
           else if   rf-xfr-pmt-ele       =    "DataDecorrenzaPenale"
                     move  "Data Decorrenza Penale       :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-560
           else if   rf-xfr-pmt-ele       =    "CodicePagamento"
                     move  "Codice Pagamento             :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-pag-520
           else      go to  exp-rec-xfr-pag-200.
       exp-rec-xfr-pag-520.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione testo                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-txt-000  thru exp-rec-xfr-txt-999    .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-pag-700.
       exp-rec-xfr-pag-540.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione codice e descrizione        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su prompt                          *
      *                      *-----------------------------------------*
           if        rf-xfr-pmt-ele       =    "CondizioniPagamento"
                     go to exp-rec-xfr-pag-545
           else if   rf-xfr-pmt-ele       =    "ModalitaPagamento"
                     go to exp-rec-xfr-pag-550.
       exp-rec-xfr-pag-545.
      *                      *-----------------------------------------*
      *                      * Condizioni Pagamento                    *
      *                      *-----------------------------------------*
           if        rf-xfr-val-ele       =    "TP01"
                     move  "TP01 - Pagamento a rate                "
                                          to   w-buf-vis-val-ele
           else if   rf-xfr-val-ele       =    "TP02"
                     move  "TP02 - Pagamento completo              "
                                          to   w-buf-vis-val-ele
           else if   rf-xfr-val-ele       =    "TP03"
                     move  "TP03 - Anticipo                        "
                                          to   w-buf-vis-val-ele      .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-pag-600.
       exp-rec-xfr-pag-550.
      *                      *-----------------------------------------*
      *                      * Modalita' Pagamento                     *
      *                      *-----------------------------------------*
           move      rf-xfr-val-ele       to   w-det-des-tab-val      .
           move      "MDP"                to   w-det-des-tab-tab      .
           move      "C"                  to   w-det-des-tab-tip      .
           move      50                   to   w-det-des-tab-lun      .
           perform   det-des-tab-000      thru det-des-tab-999        .
           move      w-det-des-tab-des    to   w-buf-vis-val-ele      .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-pag-600.
       exp-rec-xfr-pag-560.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione data                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-dat-000  thru exp-rec-xfr-dat-999    .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-pag-600.
       exp-rec-xfr-pag-580.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione importo                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-imp-000  thru exp-rec-xfr-imp-999    .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-pag-600.
       exp-rec-xfr-pag-600.
      *              *-------------------------------------------------*
      *              * Scrittura su file relative                      *
      *              *-------------------------------------------------*
           perform   exp-rec-xfr-wrt-000  thru exp-rec-xfr-wrt-999    .
       exp-rec-xfr-pag-700.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-pag-200.
       exp-rec-xfr-pag-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-pag-999.
       exp-rec-xfr-pag-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *                                                           *
      *    * Ciclo di caricamento dati riepilogo Iva                   *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-rie-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio documento per le sub-   *
      *              * routines per il trattamento del file relative   *
      *              * di appoggio [rlt]                               *
      *              *-------------------------------------------------*
           perform   fil-rlt-new-000      thru fil-rlt-new-999        .
       exp-rec-xfr-rie-100.
      *              *-------------------------------------------------*
      *              * Start su [xfr]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NOMXML    "         to   f-key                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-nom-xml        to   rf-xfr-nom-xml         .
           move      zero                 to   rf-xfr-num-prg         .
           move      "pgm/scf/fls/ioc/obj/iofxfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfr                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a riciclo                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exp-rec-xfr-rie-900.
       exp-rec-xfr-rie-200.
      *              *-------------------------------------------------*
      *              * Read-next su archivio [xfr]                     *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfr                 .
      *                  *---------------------------------------------*
      *                  * Se at end : a riciclo                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exp-rec-xfr-rie-900.
       exp-rec-xfr-rie-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-xfr-nom-xml       not  = w-mpn-nom-xml
                     go to exp-rec-xfr-rie-900.
       exp-rec-xfr-rie-400.
      *              *-------------------------------------------------*
      *              * Selezione su tipo record                        *
      *              *-------------------------------------------------*
           if        rf-xfr-tip-rec       not  = "P"
                     go to exp-rec-xfr-rie-200.
           if        rf-xfr-tip-ele       not  = "riepi"
                     go to exp-rec-xfr-rie-200.
       exp-rec-xfr-rie-500.
      *              *-------------------------------------------------*
      *              * Caricamento dati                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione prompt                      *
      *                  *---------------------------------------------*
           if        rf-xfr-pmt-ele       =    "AliquotaIVA"
                     move  "Aliquota IVA                 :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rie-520
           else if   rf-xfr-pmt-ele       =    "Natura"
                     move  "Natura                       :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rie-540
           else if   rf-xfr-pmt-ele       =    "SpeseAccessorie"
                     move  "Spese Accessorie             :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rie-580
           else if   rf-xfr-pmt-ele       =    "Arrotondamento"
                     move  "Arrotondamento               :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rie-580
           else if   rf-xfr-pmt-ele       =    "ImponibileImporto"
                     move  "Imponibile                   :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rie-580
           else if   rf-xfr-pmt-ele       =    "Imposta"
                     move  "Imposta                      :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rie-580
           else if   rf-xfr-pmt-ele       =    "EsigibilitaIVA"
                     move  "Esigibilita' IVA             :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rie-540
           else if   rf-xfr-pmt-ele       =    "RiferimentoNormativo"
                     move  "Riferimento Normativo        :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rie-520
           else      go to  exp-rec-xfr-rie-200.
       exp-rec-xfr-rie-520.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione testo                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-txt-000  thru exp-rec-xfr-txt-999    .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-rie-700.
       exp-rec-xfr-rie-540.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione codice e descrizione        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su prompt                          *
      *                      *-----------------------------------------*
           if        rf-xfr-pmt-ele       =    "Natura"
                     go to exp-rec-xfr-rie-545
           else if   rf-xfr-pmt-ele       =    "EsigibilitaIVA"
                     go to exp-rec-xfr-rie-550.
       exp-rec-xfr-rie-545.
      *                      *-----------------------------------------*
      *                      * Natura                                  *
      *                      *-----------------------------------------*
           move      rf-xfr-val-ele       to   w-det-des-tab-val      .
           move      "NAT"                to   w-det-des-tab-tab      .
           move      "C"                  to   w-det-des-tab-tip      .
           move      50                   to   w-det-des-tab-lun      .
           perform   det-des-tab-000      thru det-des-tab-999        .
           move      w-det-des-tab-des    to   w-buf-vis-val-ele      .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-rie-600.
       exp-rec-xfr-rie-550.
      *                      *-----------------------------------------*
      *                      * Esigibilita' IVA                        *
      *                      *-----------------------------------------*
           if        rf-xfr-val-ele       =    "I"
                     move  "Immediata"    to   w-buf-vis-val-ele
           else if   rf-xfr-val-ele       =    "D"
                     move  "Differita"    to   w-buf-vis-val-ele
           else if   rf-xfr-val-ele       =    "S"
                     move  "Scissione dei pagamenti"
                                          to   w-buf-vis-val-ele      .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-rie-600.
       exp-rec-xfr-rie-560.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione data                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-dat-000  thru exp-rec-xfr-dat-999    .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-rie-600.
       exp-rec-xfr-rie-580.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione importo                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-imp-000  thru exp-rec-xfr-imp-999    .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-rie-600.
       exp-rec-xfr-rie-600.
      *              *-------------------------------------------------*
      *              * Scrittura su file relative                      *
      *              *-------------------------------------------------*
           perform   exp-rec-xfr-wrt-000  thru exp-rec-xfr-wrt-999    .
       exp-rec-xfr-rie-700.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-rie-200.
       exp-rec-xfr-rie-900.
      *              *-------------------------------------------------*
      *              * Importo totale documento                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione prompt                      *
      *                  *---------------------------------------------*
           move      "TOTALE DOCUMENTO ............:"
                                          to   w-buf-vis-pmt-ele     .
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      02                   to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "<BG"                to   v-edm                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-tot-ftf        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione                             *
      *                  *---------------------------------------------*
           move      v-edt                to   w-buf-vis-val-ele      .
      *                  *---------------------------------------------*
      *                  * Scrittura su file relative                  *
      *                  *---------------------------------------------*
           perform   exp-rec-xfr-wrt-000  thru exp-rec-xfr-wrt-999    .
       exp-rec-xfr-rie-980.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-rie-999.
       exp-rec-xfr-rie-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *                                                           *
      *    * Ciclo di caricamento dati ritenuta e cassa previdenziale  *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-rda-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio documento per le sub-   *
      *              * routines per il trattamento del file relative   *
      *              * di appoggio [rlt]                               *
      *              *-------------------------------------------------*
           perform   fil-rlt-new-000      thru fil-rlt-new-999        .
       exp-rec-xfr-rda-100.
      *              *-------------------------------------------------*
      *              * Start su [xfr]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NOMXML    "         to   f-key                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-nom-xml        to   rf-xfr-nom-xml         .
           move      zero                 to   rf-xfr-num-prg         .
           move      "pgm/scf/fls/ioc/obj/iofxfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfr                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a riciclo                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exp-rec-xfr-rda-900.
       exp-rec-xfr-rda-200.
      *              *-------------------------------------------------*
      *              * Read-next su archivio [xfr]                     *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfr                 .
      *                  *---------------------------------------------*
      *                  * Se at end : a riciclo                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exp-rec-xfr-rda-900.
       exp-rec-xfr-rda-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-xfr-nom-xml       not  = w-mpn-nom-xml
                     go to exp-rec-xfr-rda-900.
       exp-rec-xfr-rda-400.
      *              *-------------------------------------------------*
      *              * Selezione su tipo record                        *
      *              *-------------------------------------------------*
           if        rf-xfr-tip-rec       not  = "T"
                     go to exp-rec-xfr-rda-200.
           if        rf-xfr-tip-ele       not  = "docum" and
                     rf-xfr-tip-ele       not  = "riten" and
                     rf-xfr-tip-ele       not  = "previ"
                     go to exp-rec-xfr-rda-200.
       exp-rec-xfr-rda-500.
      *              *-------------------------------------------------*
      *              * Caricamento dati                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione prompt                      *
      *                  *---------------------------------------------*
           if        rf-xfr-pmt-ele       =    "TipoRitenuta"
                     move  "Tipo Ritenuta                :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rda-540
           else if   rf-xfr-pmt-ele       =    "ImportoRitenuta"
                     move  "Importo Ritenuta             :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rda-580
           else if   rf-xfr-pmt-ele       =    "AliquotaRitenuta"
                     move  "Aliquota Ritenuta            :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rda-520
           else if   rf-xfr-pmt-ele       =    "CausalePagamento"
                     move  "Causale Pagamento            :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rda-520
           else if   rf-xfr-pmt-ele       =    "TipoCassa"
                     move  "Tipo Cassa                   :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rda-540
           else if   rf-xfr-pmt-ele       =    "AlCassa"
                     move  "Aliquota Cassa               :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rda-520
           else if   rf-xfr-pmt-ele       =    "ImportoContributoCassa"
                     move  "Importo Contributo Cassa     :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rda-580
           else if   rf-xfr-pmt-ele       =    "ImponibileCassa"
                     move  "Imponibile Cassa             :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rda-580
           else if   rf-xfr-pmt-ele       =    "AliquotaIVA"
                     move  "Aliquota IVA                 :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rda-520
           else if   rf-xfr-pmt-ele       =    "Ritenuta"
                     move  "Ritenuta                     :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rda-520
           else if   rf-xfr-pmt-ele       =    "Natura"
                     move  "Aliquota IVA                 :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rda-520
           else if   rf-xfr-pmt-ele       =    "RiferimentoAmministrazio
      -              "ne"
                     move  "Riferimento Amministrazione  :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rda-520
                     
           else if   rf-xfr-pmt-ele       =    "Causale"
                     move  "Causale                      :"
                                          to   w-buf-vis-pmt-ele
                     go to  exp-rec-xfr-rda-520
           else      go to  exp-rec-xfr-rda-200.
       exp-rec-xfr-rda-520.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione testo                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-txt-000  thru exp-rec-xfr-txt-999    .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-rda-700.
       exp-rec-xfr-rda-540.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione codice e descrizione        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su prompt                          *
      *                      *-----------------------------------------*
           if        rf-xfr-pmt-ele       =    "Tiporitenuta"
                     go to exp-rec-xfr-rda-545
           else if   rf-xfr-pmt-ele       =    "TipoCassa"
                     go to exp-rec-xfr-rda-550.
       exp-rec-xfr-rda-545.
      *                      *-----------------------------------------*
      *                      * Tipo ritenuta                           *
      *                      *-----------------------------------------*
           move      rf-xfr-val-ele       to   w-det-des-tab-val      .
           move      "RDA"                to   w-det-des-tab-tab      .
           move      "C"                  to   w-det-des-tab-tip      .
           move      50                   to   w-det-des-tab-lun      .
           perform   det-des-tab-000      thru det-des-tab-999        .
           move      w-det-des-tab-des    to   w-buf-vis-val-ele      .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-rda-600.
       exp-rec-xfr-rda-550.
      *                      *-----------------------------------------*
      *                      * Tipo Cassa                              *
      *                      *-----------------------------------------*
           move      rf-xfr-val-ele       to   w-det-des-tab-val      .
           move      "CAS"                to   w-det-des-tab-tab      .
           move      "C"                  to   w-det-des-tab-tip      .
           move      50                   to   w-det-des-tab-lun      .
           perform   det-des-tab-000      thru det-des-tab-999        .
           move      w-det-des-tab-des    to   w-buf-vis-val-ele      .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-rda-600.
       exp-rec-xfr-rda-560.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione data                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-dat-000  thru exp-rec-xfr-dat-999    .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-rda-600.
       exp-rec-xfr-rda-580.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione importo                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine                              *
      *                      *-----------------------------------------*
           perform   exp-rec-xfr-imp-000  thru exp-rec-xfr-imp-999    .
      *                      *-----------------------------------------*
      *                      * A scrittura                             *
      *                      *-----------------------------------------*
           go to     exp-rec-xfr-rda-600.
       exp-rec-xfr-rda-600.
      *              *-------------------------------------------------*
      *              * Scrittura su file relative                      *
      *              *-------------------------------------------------*
           perform   exp-rec-xfr-wrt-000  thru exp-rec-xfr-wrt-999    .
       exp-rec-xfr-rda-700.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-rda-200.
       exp-rec-xfr-rda-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-rda-999.
       exp-rec-xfr-rda-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *                                                           *
      *    * Subroutine di scrittura elemento su file relative         *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-wrt-000.
      *              *-------------------------------------------------*
      *              * Assemblaggio prompt e valore                    *
      *              *-------------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      w-buf-vis-pmt-ele    to   w-all-str-cat (1)      .
           move      w-buf-vis-val-ele    to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   rlt-rec-lin            .
      *              *-------------------------------------------------*
      *              * Richiamo subroutine per la scrittura            *
      *              *-------------------------------------------------*
           perform   fil-rlt-wrt-000      thru fil-rlt-wrt-999        .
       exp-rec-xfr-wrt-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-wrt-999.
       exp-rec-xfr-wrt-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *                                                           *
      *    * Subroutine di bufferizzazione testo                       *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-txt-000.
      *              *-------------------------------------------------*
      *              * Valore                                          *
      *              *-------------------------------------------------*
           move      rf-xfr-val-ele       to   w-buf-vis-val-txt      .
      *              *-------------------------------------------------*
      *              * Lettura eventuale estensione                    *
      *              *-------------------------------------------------*
           move      rf-xfr-nom-xml       to   w-let-arc-xfx-fil      .
           move      rf-xfr-num-prg       to   w-let-arc-xfx-prg      .
           perform   let-arc-xfx-000      thru let-arc-xfx-999        .
           if        w-let-arc-xfx-flg    not  = spaces
                     go to exp-rec-xfr-txt-100.
           move      w-let-arc-xfx-val    to   w-buf-vis-val-txt      .
       exp-rec-xfr-txt-100.
      *              *-------------------------------------------------*
      *              * Ciclo per bufferizzare le righe di testo nel    *
      *              * caso superino i 50 caratteri                    *
      *              *-------------------------------------------------*
           move      zero                 to   w-buf-vis-ctr-003      .
       exp-rec-xfr-txt-200.
           add       1                    to   w-buf-vis-ctr-003      .
      *              *-------------------------------------------------*
      *              * Test se oltre le righe consentite               *
      *              *-------------------------------------------------*
           if        w-buf-vis-ctr-003    >    9
                     go to exp-rec-xfr-txt-900.
      *              *-------------------------------------------------*
      *              * Test se a spaces                                *
      *              *-------------------------------------------------*
           if        w-buf-vis-val-rig
                    (w-buf-vis-ctr-003)   =    spaces
                     go to exp-rec-xfr-txt-900.
      *              *-------------------------------------------------*
      *              * Eventuale modifica prompt per righe ripetute    *
      *              *-------------------------------------------------*
           if        w-buf-vis-ctr-003    >    1
                     move  "...                          :"
                                          to   w-buf-vis-pmt-ele      .
      *              *-------------------------------------------------*
      *              * Bufferizzazione                                 *
      *              *-------------------------------------------------*
           move      w-buf-vis-val-rig
                    (w-buf-vis-ctr-003)   to   w-buf-vis-val-ele      .
       exp-rec-xfr-txt-700.
      *              *-------------------------------------------------*
      *              * Scrittura su file relative                      *
      *              *-------------------------------------------------*
           perform   exp-rec-xfr-wrt-000  thru exp-rec-xfr-wrt-999    .
       exp-rec-xfr-txt-800.
      *              *-------------------------------------------------*
      *              * A riciclo                                       *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-txt-200.
       exp-rec-xfr-txt-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-txt-999.
       exp-rec-xfr-txt-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *                                                           *
      *    * Subroutine di editing e bufferizzazione data              *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-dat-000.
      *              *-------------------------------------------------*
      *              * Editing                                         *
      *              *-------------------------------------------------*
           move      rf-xfr-val-ele       to   w-edt-dat-wrk-edi      .
           perform   edt-dat-xml-000      thru edt-dat-xml-999        .
      *              *-------------------------------------------------*
      *              * Bufferizzazione                                 *
      *              *-------------------------------------------------*
           move      w-edt-dat-wrk-edo    to   w-buf-vis-val-ele      .
       exp-rec-xfr-dat-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-dat-999.
       exp-rec-xfr-dat-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *                                                           *
      *    * Subroutine di editing e bufferizzazione quantita'         *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-qta-000.
      *              *-------------------------------------------------*
      *              * Sostituzione '.' con ','                        *
      *              *-------------------------------------------------*
           inspect   rf-xfr-val-ele
                                replacing all  "."
                                          by   ","                    .
      *              *-------------------------------------------------*
      *              * Conversione                                     *
      *              *-------------------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      12                   to   v-car                  .
           move      rf-xfr-val-ele       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Editing                                         *
      *              *-------------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      05                   to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "<BGD"               to   v-edm                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Bufferizzazione                                 *
      *              *-------------------------------------------------*
           move      v-edt                to   w-buf-vis-val-ele      .
       exp-rec-xfr-qta-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-qta-999.
       exp-rec-xfr-qta-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *                                                           *
      *    * Subroutine di editing e bufferizzazione prezzi            *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-prz-000.
      *              *-------------------------------------------------*
      *              * Sostituzione '.' con ','                        *
      *              *-------------------------------------------------*
           inspect   rf-xfr-val-ele
                                replacing all  "."
                                          by   ","                    .
      *              *-------------------------------------------------*
      *              * Conversione                                     *
      *              *-------------------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      12                   to   v-car                  .
           move      rf-xfr-val-ele       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Editing                                         *
      *              *-------------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      05                   to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "<BGD"               to   v-edm                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Bufferizzazione                                 *
      *              *-------------------------------------------------*
           move      v-edt                to   w-buf-vis-val-ele      .
       exp-rec-xfr-prz-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-prz-999.
       exp-rec-xfr-prz-999.
           exit.

      *    *===========================================================*
      *    * Routine per Expand riga a video                           *
      *    *                                                           *
      *    * Subroutine di editing e bufferizzazione importi           *
      *    *-----------------------------------------------------------*
       exp-rec-xfr-imp-000.
      *              *-------------------------------------------------*
      *              * Sostituzione '.' con ','                        *
      *              *-------------------------------------------------*
           inspect   rf-xfr-val-ele
                                replacing all  "."
                                          by   ","                    .
      *              *-------------------------------------------------*
      *              * Conversione                                     *
      *              *-------------------------------------------------*
           move      "CV"                 to   v-ope                  .
           move      12                   to   v-car                  .
           move      rf-xfr-val-ele       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Editing                                         *
      *              *-------------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      02                   to   v-dec                  .
           move      "S"                  to   v-sgn                  .
           move      "<BG"                to   v-edm                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Bufferizzazione                                 *
      *              *-------------------------------------------------*
           move      v-edt                to   w-buf-vis-val-ele      .
       exp-rec-xfr-imp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exp-rec-xfr-imp-999.
       exp-rec-xfr-imp-999.
           exit.

      *    *===========================================================*
      *    * Intestazione per interrogazione                           *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Subroutine di avanzamento pagina                *
      *              *-------------------------------------------------*
           perform   qry-pag-adv-000      thru qry-pag-adv-999        .
      *                  *---------------------------------------------*
      *                  * Se interruzione forzata : uscita            *
      *                  *---------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to int-pag-sta-999.
      *              *-------------------------------------------------*
      *              * Linea di trattini                               *
      *              *-------------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-cnt-lit-t80        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Linea di trattini                               *
      *              *-------------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-cnt-lit-t80        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Fincatura                                       *
      *              *-------------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo      Nr.     Caricata                     For
      -              "nitore                   Righe"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura                                  *
      *              *-------------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "-----  ---------  --------  ----------------------
      -              "------------------------ -----"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       int-pag-sta-500.
      *              *-------------------------------------------------*
      *              * Eventuali indicatori per il tipo ordinamento    *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      05                   to   v-lin                  .
      *
           if        w-cnt-exe-rou-sro    =    01
                     move  02             to   v-pos
           else if   w-cnt-exe-rou-sro    =    02
                     move  09             to   v-pos
           else if   w-cnt-exe-rou-sro    =    03
                     move  14             to   v-pos
           else if   w-cnt-exe-rou-sro    =    04
                     move  20             to   v-pos
           else if   w-cnt-exe-rou-sro    =    05
                     move  24             to   v-pos
           else if   w-cnt-exe-rou-sro    =    06
                     move  31             to   v-pos
           else if   w-cnt-exe-rou-sro    =    07
                     move  41             to   v-pos
           else if   w-cnt-exe-rou-sro    =    08
                     move  52             to   v-pos
           else if   w-cnt-exe-rou-sro    =    09
                     move  72             to   v-pos
           else if   w-cnt-exe-rou-sro    =    10
                     move  78             to   v-pos
           else      move  02             to   v-pos                  .
      *
           if        w-cnt-exe-rou-srt    =    "<"
                     move  "/\"           to   v-alf
           else      move  "\/"           to   v-alf                  .
      *
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Find su tipi fattura elettronica                          *
      *    *-----------------------------------------------------------*
       fnd-tdo-sdi-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di selezione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-fnd-tdo-sdi-sel      .
      *              *-------------------------------------------------*
      *              * Salvataggio del video attuale                   *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione provvisoria di un pop-up per il    *
      *              * tipo fattura elettronica                        *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tdo-sdi-lun    to   v-car                  .
           move      w-exp-tdo-sdi-num    to   v-ldt                  .
           move      spaces               to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      13                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      w-exp-tdo-sdi-tbl    to   v-txt                  .
           move      "EXIT"               to   v-pfk (20)             .
           move      zero                 to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Valore in campo di destinazione                 *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  "TD01"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    02
                     move  "TD02"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    03
                     move  "TD03"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    04
                     move  "TD04"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    05
                     move  "TD05"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    06
                     move  "TD06"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    07
                     move  "TD16"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    08
                     move  "TD17"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    09
                     move  "TD18"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    10
                     move  "TD19"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    11
                     move  "TD20"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    12
                     move  "TD21"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    13
                     move  "TD22"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    14
                     move  "TD23"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    15
                     move  "TD24"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    16
                     move  "TD25"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    17
                     move  "TD26"         to   w-fnd-tdo-sdi-tdo
           else if   v-num                =    18
                     move  "TD27"         to   w-fnd-tdo-sdi-tdo
           else      move  spaces         to   w-fnd-tdo-sdi-tdo      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       fnd-tdo-sdi-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     fnd-tdo-sdi-999.
       fnd-tdo-sdi-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [fnt]                            *
      *    *-----------------------------------------------------------*
       let-arc-fnt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice fornitore a zero                 *
      *              *-------------------------------------------------*
           if        w-let-arc-fnt-cod    =    zero
                     go to let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      w-let-arc-fnt-cod    to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-fnt-400.
       let-arc-fnt-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-fnt-rag-soc       to   w-let-arc-fnt-rag      .
           move      rf-fnt-via-fnt       to   w-let-arc-fnt-via      .
           move      rf-fnt-loc-fnt       to   w-let-arc-fnt-loc      .
           move      rf-fnt-cod-naz       to   w-let-arc-fnt-naz      .
           move      rf-fnt-prt-iva       to   w-let-arc-fnt-piv      .
           move      rf-fnt-cod-fis       to   w-let-arc-fnt-cfi      .
           move      rf-fnt-cod-cge       to   w-let-arc-fnt-cge      .
           move      rf-fnt-cod-iva       to   w-let-arc-fnt-ass      .
      *
           if        rf-fnt-cod-naz       not  = "IT "
                     move  rf-fnt-num-fax to   w-let-arc-fnt-cfi      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-fnt-999.
       let-arc-fnt-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-fnt-flg      .
           move      all   "."            to   w-let-arc-fnt-rag      .
           go to     let-arc-fnt-600.
       let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-rag      .
       let-arc-fnt-600.
           move      spaces               to   w-let-arc-fnt-via      .
           move      spaces               to   w-let-arc-fnt-loc      .
           move      spaces               to   w-let-arc-fnt-naz      .
           move      zero                 to   w-let-arc-fnt-piv      .
           move      spaces               to   w-let-arc-fnt-cfi      .
           move      zero                 to   w-let-arc-fnt-cge      .
           move      zero                 to   w-let-arc-fnt-ass      .
       let-arc-fnt-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [xfz]                         *
      *    *-----------------------------------------------------------*
       let-arc-xfz-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-xfz-flg      .
      *              *-------------------------------------------------*
      *              * Test se tipo codifica a zero                    *
      *              *-------------------------------------------------*
           if        w-let-arc-xfz-tip    =    zero
                     go to let-arc-xfz-500.
      *              *-------------------------------------------------*
      *              * Test se codice a spaces                         *
      *              *-------------------------------------------------*
           if        w-let-arc-xfz-cod    =    spaces
                     go to let-arc-xfz-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione                                 *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxfz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfz                 .
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCDF    "         to   f-key                  .
           move      w-let-arc-xfz-tip    to   rf-xfz-tip-cdf         .
           move      w-let-arc-xfz-cod    to   rf-xfz-cod-cdf         .
           move      "pgm/scf/fls/ioc/obj/iofxfz"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfz                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-xfz-400.
       let-arc-xfz-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-xfz-des-stp       to   w-let-arc-xfz-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-xfz-999.
       let-arc-xfz-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-xfz-flg      .
           move      all   "."            to   w-let-arc-xfz-des      .
           go to     let-arc-xfz-999.
       let-arc-xfz-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-xfz-des      .
       let-arc-xfz-999.
           exit.

      *    *===========================================================*
      *    * Determinazione descrizione per le tabelle                 *
      *    *-----------------------------------------------------------*
       det-des-tab-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valore di output                *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-des-tab-des      .
       det-des-tab-050.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo tabella         *
      *              *-------------------------------------------------*
           if        w-det-des-tab-tab    =    "NAT"
                     go to det-des-tab-100
           else if   w-det-des-tab-tab    =    "MDP"
                     go to det-des-tab-200
           else if   w-det-des-tab-tab    =    "RDA"
                     go to det-des-tab-300
           else if   w-det-des-tab-tab    =    "CAS"
                     go to det-des-tab-400.
       det-des-tab-100.
      *              *=================================================*
      *              * Natura                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura descrizione                         *
      *                  *---------------------------------------------*
           move      05                   to   w-let-arc-xfz-tip      .
           move      w-det-des-tab-val    to   w-let-arc-xfz-cod      .
           perform   let-arc-xfz-000      thru let-arc-xfz-999        .
           move      w-let-arc-xfz-des    to   w-det-des-tab-des      .
      *                  *---------------------------------------------*
      *                  * Ad eventuale assemblaggio                   *
      *                  *---------------------------------------------*
           go to     det-des-tab-800.
       det-des-tab-200.
      *              *=================================================*
      *              * Modalita' di pagamento                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura descrizione                         *
      *                  *---------------------------------------------*
           move      03                   to   w-let-arc-xfz-tip      .
           move      w-det-des-tab-val    to   w-let-arc-xfz-cod      .
           perform   let-arc-xfz-000      thru let-arc-xfz-999        .
           move      w-let-arc-xfz-des    to   w-det-des-tab-des      .
      *                  *---------------------------------------------*
      *                  * Ad eventuale assemblaggio                   *
      *                  *---------------------------------------------*
           go to     det-des-tab-800.
       det-des-tab-300.
      *              *=================================================*
      *              * Tipo ritenuta                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura descrizione                         *
      *                  *---------------------------------------------*
           move      06                   to   w-let-arc-xfz-tip      .
           move      w-det-des-tab-val    to   w-let-arc-xfz-cod      .
           perform   let-arc-xfz-000      thru let-arc-xfz-999        .
           move      w-let-arc-xfz-des    to   w-det-des-tab-des      .
      *                  *---------------------------------------------*
      *                  * Ad eventuale assemblaggio                   *
      *                  *---------------------------------------------*
           go to     det-des-tab-800.
       det-des-tab-400.
      *              *=================================================*
      *              * Tipo cassa                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura descrizione                         *
      *                  *---------------------------------------------*
           move      02                   to   w-let-arc-xfz-tip      .
           move      w-det-des-tab-val    to   w-let-arc-xfz-cod      .
           perform   let-arc-xfz-000      thru let-arc-xfz-999        .
           move      w-let-arc-xfz-des    to   w-det-des-tab-des      .
      *                  *---------------------------------------------*
      *                  * Ad eventuale assemblaggio                   *
      *                  *---------------------------------------------*
           go to     det-des-tab-800.
       det-des-tab-800.
      *              *=================================================*
      *              * Eventuale assemblaggio con il codice            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test sul tipo assemblaggio                  *
      *                  *---------------------------------------------*
           if        w-det-des-tab-tip    not  = "C"
                     go to det-des-tab-900.
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      w-det-des-tab-lun    to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-det-des-tab-val    to   w-all-str-cat (1)      .
           move      "-"                  to   w-all-str-cat (2)      .
           move      w-det-des-tab-des    to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-det-des-tab-des      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     det-des-tab-900.
       det-des-tab-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-des-tab-999.
       det-des-tab-999.
           exit.

      *    *===========================================================*
      *    * Editing di una data in formato XML                        *
      *    *                                                           *
      *    * Valore in input : data in formato AAAA-MM-GG              *
      *    *                                                           *
      *    * Valore in output: data in formato GG/MM/AAAA              *
      *    *-----------------------------------------------------------*
       edt-dat-xml-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valore di output                *
      *              *-------------------------------------------------*
           move      spaces               to   w-edt-dat-wrk-edo      .
      *              *-------------------------------------------------*
      *              * Test se valore in input a spaces                *
      *              *-------------------------------------------------*
           if        w-edt-dat-wrk-edi    =    spaces
                     go to edt-dat-xml-900.
       edt-dat-xml-100.
      *              *-------------------------------------------------*
      *              * Estrazione elementi                             *
      *              *-------------------------------------------------*
           move      w-edt-dat-wrk-edi    to   w-all-str-alf          .
           move      "-"                  to   w-all-str-del          .
           perform   all-str-ext-000      thru all-str-ext-999        .
           move      w-all-str-cat (1)    to   w-edt-dat-wrk-aaa      .
           move      w-all-str-cat (2)    to   w-edt-dat-wrk-mmm      .
           move      w-all-str-cat (3)    to   w-edt-dat-wrk-ggg      .
      *              *-------------------------------------------------*
      *              * Assemblaggio                                    *
      *              *-------------------------------------------------*
           move      10                   to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
           move      w-edt-dat-wrk-ggg    to   w-all-str-cat (1)      .
           move      "/"                  to   w-all-str-cat (2)      .
           move      w-edt-dat-wrk-mmm    to   w-all-str-cat (3)      .
           move      "/"                  to   w-all-str-cat (4)      .
           move      w-edt-dat-wrk-aaa    to   w-all-str-cat (5)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-edt-dat-wrk-edo      .
       edt-dat-xml-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     edt-dat-xml-999.
       edt-dat-xml-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [xfx]                         *
      *    *-----------------------------------------------------------*
       let-arc-xfx-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-xfx-flg      .
      *              *-------------------------------------------------*
      *              * Test se chiave vuota                            *
      *              *-------------------------------------------------*
           if        w-let-arc-xfx-fil    =    spaces or
                     w-let-arc-xfx-prg    =    zero
                     go to let-arc-xfx-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione                                 *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofxfx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfx                 .
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NOMXML"             to   f-key                  .
           move      w-let-arc-xfx-fil    to   rf-xfx-nom-xml         .
           move      w-let-arc-xfx-prg    to   rf-xfx-num-prg         .
           move      "pgm/scf/fls/ioc/obj/iofxfx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-xfx                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-xfx-400.
       let-arc-xfx-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-xfx-val-ele       to   w-let-arc-xfx-val      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-xfx-999.
       let-arc-xfx-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-xfx-flg      .
           move      all   "."            to   w-let-arc-xfx-val      .
           go to     let-arc-xfx-999.
       let-arc-xfx-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-xfx-val      .
       let-arc-xfx-999.
           exit.

      *    *===========================================================*
      *    * File relative di appoggio [rlt] : Open                    *
      *    *-----------------------------------------------------------*
       fil-rlt-opn-000.
      *              *-------------------------------------------------*
      *              * Preparazione area ausiliaria per controlli i-o  *
      *              * su [rlt]                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * File name                                   *
      *                  *---------------------------------------------*
           move      "rlt "               to   f-rlt-nam              .
      *                  *---------------------------------------------*
      *                  * File pathname                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Prelevamento di un pathname unico per   *
      *                      * files temporanei                        *
      *                      *-----------------------------------------*
           move      "UP"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Salvataggio pathname determinato        *
      *                      *-----------------------------------------*
           move      s-pat                to   f-rlt-pat              .
      *                  *---------------------------------------------*
      *                  * File status                                 *
      *                  *---------------------------------------------*
           move      "00"                 to   f-rlt-sts              .
       fil-rlt-opn-100.
      *              *-------------------------------------------------*
      *              * Preparazione seconda area ausiliaria per con-   *
      *              * trolli i-o su [rlt]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Record number interessato dall'operazione   *
      *                  * di i-o                                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-rlt-krn              .
      *                  *---------------------------------------------*
      *                  * Max record number memorizzato in assoluto   *
      *                  *---------------------------------------------*
           move      zero                 to   w-rlt-max              .
      *                  *---------------------------------------------*
      *                  * Contatore records per singolo documento     *
      *                  *---------------------------------------------*
           move      zero                 to   w-rlt-ctr              .
      *                  *---------------------------------------------*
      *                  * Indice per scansione records per singolo    *
      *                  * documento                                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-rlt-inx              .
       fil-rlt-opn-200.
      *              *-------------------------------------------------*
      *              * Open output [rlt]                               *
      *              *-------------------------------------------------*
           open      output rlt                                       .
      *              *-------------------------------------------------*
      *              * Close [rlt]                                     *
      *              *-------------------------------------------------*
           close     rlt                                              .
      *              *-------------------------------------------------*
      *              * Open i-o [rlt]                                  *
      *              *-------------------------------------------------*
           open      i-o    rlt                                       .
       fil-rlt-opn-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     fil-rlt-opn-999.
       fil-rlt-opn-999.
           exit.

      *    *===========================================================*
      *    * File relative di appoggio [rlt] : Close                   *
      *    *-----------------------------------------------------------*
       fil-rlt-cls-000.
      *              *-------------------------------------------------*
      *              * Se file non aperto : ad uscita                  *
      *              *-------------------------------------------------*
           if        f-rlt-pat            =    spaces
                     go to fil-rlt-cls-900.
       fil-rlt-cls-100.
      *              *-------------------------------------------------*
      *              * Close [rlt]                                     *
      *              *-------------------------------------------------*
           close     rlt                                              .
       fil-rlt-cls-200.
      *              *-------------------------------------------------*
      *              * Delete file [rlt]                               *
      *              *-------------------------------------------------*
           move      "PD"                 to   s-ope                  .
           move      f-rlt-pat            to   s-pat                  .
           move      "R"                  to   s-sts                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fil-rlt-cls-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     fil-rlt-cls-999.
       fil-rlt-cls-999.
           exit.

      *    *===========================================================*
      *    * File relative di appoggio [rlt] : Put                     *
      *    *-----------------------------------------------------------*
       fil-rlt-put-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del valore del record num- *
      *              * ber                                             *
      *              *-------------------------------------------------*
           if        w-rlt-krn            not   > w-rlt-max
                     go to fil-rlt-put-300.
       fil-rlt-put-100.
      *              *-------------------------------------------------*
      *              * Aggiornamento del massimo record number finora  *
      *              * scritto                                         *
      *              *-------------------------------------------------*
           move      w-rlt-krn            to   w-rlt-max              .
       fil-rlt-put-200.
      *              *-------------------------------------------------*
      *              * Se il record number da scrivere e' maggiore del *
      *              * massimo finora scritto                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Scrittura record, se non valida : a ri-     *
      *                  * scrittura                                   *
      *                  *---------------------------------------------*
           write     rlt-rec invalid key
                             go to   fil-rlt-put-300.
           go to     fil-rlt-put-900.
       fil-rlt-put-300.
      *              *-------------------------------------------------*
      *              * Se il record number da scrivere non e' maggiore *
      *              * del massimo finora scritto                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Riscrittura record, se non valida : a       *
      *                  * scrittura                                   *
      *                  *---------------------------------------------*
           rewrite   rlt-rec invalid key
                             go to   fil-rlt-put-200.
           go to     fil-rlt-put-900.
       fil-rlt-put-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     fil-rlt-put-999.
       fil-rlt-put-999.
           exit.

      *    *===========================================================*
      *    * File relative di appoggio [rlt] : Get                     *
      *    *-----------------------------------------------------------*
       fil-rlt-get-000.
           read      rlt   with no lock
                           invalid key
                           go to   fil-rlt-get-999.
       fil-rlt-get-999.
           exit.

      *    *===========================================================*
      *    * File relative di appoggio [rlt] : New                     *
      *    *-----------------------------------------------------------*
       fil-rlt-new-000.
      *              *-------------------------------------------------*
      *              * Contatore records per singolo documento a zero  *
      *              *-------------------------------------------------*
           move      zero                 to   w-rlt-ctr              .
       fil-rlt-new-999.
           exit.

      *    *===========================================================*
      *    * File relative di appoggio [rlt] : Write                   *
      *    *-----------------------------------------------------------*
       fil-rlt-wrt-000.
      *              *-------------------------------------------------*
      *              * Incremento contatore records per singolo docu-  *
      *              * mento                                           *
      *              *-------------------------------------------------*
           add       1                    to   w-rlt-ctr              .
      *              *-------------------------------------------------*
      *              * Preparazione record number                      *
      *              *-------------------------------------------------*
           move      w-rlt-ctr            to   w-rlt-krn              .
      *              *-------------------------------------------------*
      *              * Scrittura effettiva                             *
      *              *-------------------------------------------------*
           perform   fil-rlt-put-000      thru fil-rlt-put-999        .
       fil-rlt-wrt-999.
           exit.

      *    *===========================================================*
      *    * File relative di appoggio [rlt] : Start                   *
      *    *-----------------------------------------------------------*
       fil-rlt-str-000.
      *              *-------------------------------------------------*
      *              * Preparazione status di uscita                   *
      *              *-------------------------------------------------*
           if        w-rlt-inx            <    w-rlt-ctr
                     move  e-not-err      to   w-rlt-sts
           else      move  e-end-fil      to   w-rlt-sts              .
       fil-rlt-str-999.
           exit.

      *    *===========================================================*
      *    * File relative di appoggio [rlt] : Read next               *
      *    *-----------------------------------------------------------*
       fil-rlt-nxt-000.
      *              *-------------------------------------------------*
      *              * Se fine file : uscita con errore                *
      *              *-------------------------------------------------*
           if        w-rlt-inx            not < w-rlt-ctr
                     move  e-end-fil      to   w-rlt-sts
                     go to fil-rlt-nxt-999.
      *              *-------------------------------------------------*
      *              * Incremento indice per scansione                 *
      *              *-------------------------------------------------*
           add       1                    to   w-rlt-inx              .
      *              *-------------------------------------------------*
      *              * Preparazione record number                      *
      *              *-------------------------------------------------*
           move      w-rlt-inx            to   w-rlt-krn              .
      *              *-------------------------------------------------*
      *              * Lettura effettiva                               *
      *              *-------------------------------------------------*
           perform   fil-rlt-get-000      thru fil-rlt-get-999        .
      *              *-------------------------------------------------*
      *              * Status di uscita ad Ok                          *
      *              *-------------------------------------------------*
           move      e-not-err            to   w-rlt-sts              .
       fil-rlt-nxt-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice fornitore       *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/acmnfnt0.acs"                   .

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/werrbox0.cps"                   .

      *    *===========================================================*
      *    * Subroutines per operazioni sulle date                     *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wnrgdat0.cps"                   .

      *    *===========================================================*
      *    * Subroutines per modulo aggiornamento contabilita' genera- *
      *    * le, clienti, fornitori, iva                               *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/pcge300z.pgs"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .
