       Identification division.
       Program-Id.                                 pdcf5101           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    dcf                 *
      *                                Settore:    lst                 *
      *                                   Fase:    dcf510              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 23/09/92    *
      *                       Ultima revisione:    NdK del 14/12/99    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione stampa per il programma dcf510   *
      *                                                                *
      *                    Stampa condizioni d'acquisto fornitori      *
      *                    prodotti di vendita                         *
      *                                                                *
      *                    VERSIONE SPECIALE PER ELETTRA               *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.        N-d-K-Sia-PD .
       Object-Computer.        N-d-K-Sia-PD .

       Special-Names.          Decimal-Point     Is Comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Numero progressivo record [dcp] letto             *
      *            *---------------------------------------------------*
               10  srt-ctr-dcp            pic  9(08)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale fornitore in Uppercase            *
      *            *---------------------------------------------------*
               10  srt-rag-key            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice fornitore                                  *
      *            *---------------------------------------------------*
               10  srt-cod-dcf            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Formato di acquisizione                           *
      *            *---------------------------------------------------*
               10  srt-fda-pif            pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Codice classe merceologica materia prima          *
      *            *---------------------------------------------------*
               10  srt-cod-cla            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice gruppo merceologico materia prima          *
      *            *---------------------------------------------------*
               10  srt-cod-gru            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice sottogruppo merceologico materia prima     *
      *            *---------------------------------------------------*
               10  srt-cod-sgr            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice prodotto alfanumerico                      *
      *            *---------------------------------------------------*
               10  srt-alf-pro            pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Descrizione prodotto                              *
      *            *---------------------------------------------------*
               10  srt-des-pro            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale fornitore                         *
      *            *---------------------------------------------------*
               10  srt-rag-soc            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice prodotto per il fornitore                  *
      *            *---------------------------------------------------*
               10  srt-cop-sfn            pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Unita' di misura                                  *
      *            *---------------------------------------------------*
               10  srt-uni-mis            pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Sigla valuta per il prezzo d'acquisto pattuito    *
      *            * con il fornitore                                  *
      *            *---------------------------------------------------*
               10  srt-sgl-vlt            pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Numero decimali per l'acquisto : sono la somma    *
      *            * dei decimali valuta e dei decimali del prezzo     *
      *            * concordato con il fornitore                       *
      *            *---------------------------------------------------*
               10  srt-dec-acq            pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo di applicazione prezzo e sconti              *
      *            * - 01 : Indipendentemente dalla quantita'          *
      *            * - 02 : A seconda della quantita'                  *
      *            *---------------------------------------------------*
               10  srt-tap-pes            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tabella prezzi d'acquisto, e sconti, pattuiti con *
      *            * il fornitore                                      *
      *            *---------------------------------------------------*
               10  srt-tbl-pes.
                   15  srt-ele-pes occurs 06.
                       20  srt-qta-pes    pic  9(06)v9(03)            .
                       20  srt-prz-pes    pic  9(09)                  .
                       20  srt-psr-pes occurs 05
                                          pic  9(02)v9(01)            .
      *            *---------------------------------------------------*
      *            * Data aggiornamento prezzi d'acquisto e sconti     *
      *            * pattuiti con il fornitore                         *
      *            *---------------------------------------------------*
               10  srt-dat-uag            pic  9(07)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "dcf"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "lst"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "dcf510"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pdcf5101"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "     CONDIZIONI D'ACQUISTO PRODOTTI     "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records logici                                            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [zp1]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp1"                          .
      *        *-------------------------------------------------------*
      *        * [zp2]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp2"                          .
      *        *-------------------------------------------------------*
      *        * [zp3]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp3"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [zos]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/azi/fls/rec/rfzos"                          .
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [aaf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfaaf"                          .

      *    *===========================================================*
      *    * Record per le richieste                                   *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Codice dipendenza in uso                              *
      *        *-------------------------------------------------------*
           05  rr-dpz-inu                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice filtro di selezione                            *
      *        *-------------------------------------------------------*
           05  rr-fso-dcp                 pic  9(08)                  .
           05  rr-fso-dcp-alf redefines
               rr-fso-dcp                 pic  x(08)                  .
           05  rr-fso-dcp-des             pic  x(40)                  .
           05  rr-fso-dcp-ord             pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Tipo salto pagina                                     *
      *        * - 01 : No salto pagina                                *
      *        * - 02 : Ad ogni classe                                 *
      *        * - 03 : Ad ogni gruppo                                 *
      *        * - 04 : Ad ogni sottogruppo                            *
      *        *-------------------------------------------------------*
           05  rr-tip-slp                 pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per routine di stampa                           *
      *    *-----------------------------------------------------------*
       01  w-prn.
           05  w-prn-int-pro              pic  x(01)                  .
           05  w-prn-int-fnt              pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per routine stp-srt-inp-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-stp-srt-inp.
           05  w-stp-srt-inp-ctr          pic  9(08)                  .

      *    *===========================================================*
      *    * Work-area per routine prn-liv-det-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-prn-liv-det.
           05  w-prn-liv-det-ctr          pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per routine prn-ini-lr2-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-prn-ini-lr2.
           05  w-prn-ini-lr2-x96          pic  x(96)                  .
           05  w-prn-ini-lr2-pnt          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per tipo ordinamento                                 *
      *    *-----------------------------------------------------------*
       01  w-tip-ord.
      *        *-------------------------------------------------------*
      *        * Tipo ordinamento ottenuto da richiesta al modulo di   *
      *        * filtro, selezione, ordinamento, su file [dcp]         *
      *        * - 01 : Per classe, gruppo, sottogruppo, codice pro-   *
      *        *        dotto                                          *
      *        * - 02 : Per classe, gruppo, sottogruppo, descrizione   *
      *        *        prodotto                                       *
      *        * - 03 : Per codice prodotto                            *
      *        * - 04 : Per descrizione prodotto                       *
      *        *-------------------------------------------------------*
           05  w-tip-ord-tip-ord          pic  9(02)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zp1]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zp1.
               10  w-let-arc-zp1-flg      pic  x(01)                  .
               10  w-let-arc-zp1-cla      pic  9(05)                  .
               10  w-let-arc-zp1-des      pic  x(40)                  .
               10  w-let-arc-zp1-mne      pic  x(05)                  .
               10  w-let-arc-zp1-sud      pic  9(02)                  .
               10  w-let-arc-zp1-sqz      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zp2]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zp2.
               10  w-let-arc-zp2-flg      pic  x(01)                  .
               10  w-let-arc-zp2-cla      pic  9(05)                  .
               10  w-let-arc-zp2-gru      pic  9(05)                  .
               10  w-let-arc-zp2-des      pic  x(40)                  .
               10  w-let-arc-zp2-mne      pic  x(05)                  .
               10  w-let-arc-zp2-sud      pic  9(02)                  .
               10  w-let-arc-zp2-sqz      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zp3]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zp3.
               10  w-let-arc-zp3-flg      pic  x(01)                  .
               10  w-let-arc-zp3-cla      pic  9(05)                  .
               10  w-let-arc-zp3-gru      pic  9(05)                  .
               10  w-let-arc-zp3-sgr      pic  9(05)                  .
               10  w-let-arc-zp3-des      pic  x(40)                  .
               10  w-let-arc-zp3-mne      pic  x(05)                  .
               10  w-let-arc-zp3-sud      pic  9(02)                  .
               10  w-let-arc-zp3-sqz      pic  9(05)                  .

      *    *===========================================================*
      *    * Work area per gestione classe, gruppo e sottogruppo       *
      *    *-----------------------------------------------------------*
       01  w-cgs.
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori generici                   *
      *        *-------------------------------------------------------*
           05  w-cgs-gen.
      *            *---------------------------------------------------*
      *            * Flag di prima intestazione pagina da eseguire     *
      *            *---------------------------------------------------*
               10  w-cgs-gen-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori classe                     *
      *        *-------------------------------------------------------*
           05  w-cgs-cla.
      *            *---------------------------------------------------*
      *            * Si/No intestazione ad inizio classe               *
      *            *---------------------------------------------------*
               10  w-cgs-cla-int          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice classe                                     *
      *            *---------------------------------------------------*
               10  w-cgs-cla-cod          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Mnemonico classe                                  *
      *            *---------------------------------------------------*
               10  w-cgs-cla-mne          pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di sequenza classe                         *
      *            *---------------------------------------------------*
               10  w-cgs-cla-sqz          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione classe                                *
      *            *---------------------------------------------------*
               10  w-cgs-cla-des          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Segnale di classe ulteriormente suddivisa         *
      *            *---------------------------------------------------*
               10  w-cgs-cla-sud          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Flag di intestazione gia' eseguita                *
      *            *---------------------------------------------------*
               10  w-cgs-cla-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori gruppo                     *
      *        *-------------------------------------------------------*
           05  w-cgs-gru.
      *            *---------------------------------------------------*
      *            * Si/No intestazione ad inizio gruppo               *
      *            *---------------------------------------------------*
               10  w-cgs-gru-int          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice gruppo                                     *
      *            *---------------------------------------------------*
               10  w-cgs-gru-cod          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Mnemonico gruppo                                  *
      *            *---------------------------------------------------*
               10  w-cgs-gru-mne          pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di sequenza gruppo                         *
      *            *---------------------------------------------------*
               10  w-cgs-gru-sqz          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione gruppo                                *
      *            *---------------------------------------------------*
               10  w-cgs-gru-des          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Segnale di gruppo ulteriormente suddiviso         *
      *            *---------------------------------------------------*
               10  w-cgs-gru-sud          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Flag di intestazione gia' eseguita                *
      *            *---------------------------------------------------*
               10  w-cgs-gru-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori sottogruppo                *
      *        *-------------------------------------------------------*
           05  w-cgs-sgr.
      *            *---------------------------------------------------*
      *            * Si/No intestazione ad inizio sottogruppo          *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-int          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice sottogruppo                                *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-cod          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Mnemonico sottogruppo                             *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-mne          pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di sequenza sottogruppo                    *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-sqz          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione sottogruppo                           *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-des          pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Flag di intestazione gia' eseguita                *
      *            *---------------------------------------------------*
               10  w-cgs-sgr-fie          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per bufferizzazione valori dettaglio                  *
      *        *-------------------------------------------------------*
           05  w-cgs-det.
      *            *---------------------------------------------------*
      *            * Numero di linee effettive impegnate dalla finca-  *
      *            * tura per il dettaglio e la sottolineatura         *
      *            *---------------------------------------------------*
               10  w-cgs-det-idf          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Per work                                              *
      *        *-------------------------------------------------------*
           05  w-cgs-wrk.
               10  w-cgs-wrk-nln          pic  9(02)                  .
               10  w-cgs-wrk-inx          pic  9(03)                  .
               10  w-cgs-wrk-pnt          pic  9(03)                  .
               10  w-cgs-wrk-car          pic  9(03)                  .
               10  w-cgs-wrk-pos          pic  9(03)                  .
               10  w-cgs-wrk-pfn          pic  9(03)                  .
               10  w-cgs-wrk-des          pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per determinazioni                              *
      *    *-----------------------------------------------------------*
       01  w-det.
           05  filler                     pic  x(01)                  .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
      *            *---------------------------------------------------*
      *            * Codice classe                                     *
      *            *---------------------------------------------------*
               10  w-rot-l05-cod-cla      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
      *            *---------------------------------------------------*
      *            * Codice gruppo                                     *
      *            *---------------------------------------------------*
               10  w-rot-l04-cod-gru      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
      *            *---------------------------------------------------*
      *            * Codice sottogruppo                                *
      *            *---------------------------------------------------*
               10  w-rot-l03-cod-sgr      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
      *            *---------------------------------------------------*
      *            * Contatore records [dcp] letti                     *
      *            *---------------------------------------------------*
               10  w-rot-l02-ctr-dcp      pic  9(08)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
      *            *---------------------------------------------------*
      *            * Codice fornitore                                  *
      *            *---------------------------------------------------*
               10  w-rot-l01-cod-dcf      pic  9(07)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Elaborazioni preliminari su aree titolo         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area nome azienda  *
      *                  *---------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-asx                to   w-cnt-tit-des-azi      .
           move      40                   to   w-cnt-tit-ctr-azi      .
       int-pag-std-100.
           if        w-cnt-tit-chr-azi
                    (w-cnt-tit-ctr-azi)   =    spaces
                     if     w-cnt-tit-ctr-azi
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-azi
                            go to     int-pag-std-100.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza titolo stampato    *
      *                  *---------------------------------------------*
           move      80                   to   w-cnt-tit-ctr-tit      .
       int-pag-std-200.
           if        w-cnt-tit-chr-tit
                    (w-cnt-tit-ctr-tit)   =    spaces
                     if     w-cnt-tit-ctr-tit
                                          >    1
                            subtract  1   from w-cnt-tit-ctr-tit
                            go to     int-pag-std-200.
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale titolo    *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-tit      .
           subtract  w-cnt-tit-ctr-tit    from w-cnt-tit-pos-tit      .
           divide    2                    into w-cnt-tit-pos-tit      .
           add       1                    to   w-cnt-tit-pos-tit      .
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza area data e pagina *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-pag    =    zero
                     move  4              to   w-cnt-tit-ctr-wrk
                     go to int-pag-std-300.
           move      zero                 to   w-cnt-tit-ctr-wrk      .
           inspect   w-cnt-tit-num-pag
                                      tallying w-cnt-tit-ctr-wrk
                                   for leading "0"                    .
       int-pag-std-300.
           subtract  w-cnt-tit-ctr-wrk    from 27
                                        giving w-cnt-tit-ctr-dep      .
           subtract  w-cnt-tit-ctr-wrk    from 5
                                        giving w-cnt-tit-ctr-cif      .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione iniziale data e p. *
      *                  *---------------------------------------------*
           move      p-sel-als-sel        to   w-cnt-tit-pos-dep      .
           subtract  w-cnt-tit-ctr-dep    from w-cnt-tit-pos-dep      .
           add       1                    to   w-cnt-tit-pos-dep      .
      *                  *---------------------------------------------*
      *                  * Determinazione se titolo su una o due linee *
      *                  *---------------------------------------------*
           move      w-cnt-tit-ctr-azi    to   w-cnt-tit-ctr-wrk      .
           add       2                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-tit
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      w-cnt-tit-pos-tit    to   w-cnt-tit-ctr-wrk      .
           add       w-cnt-tit-ctr-tit    to   w-cnt-tit-ctr-wrk      .
           add       1                    to   w-cnt-tit-ctr-wrk      .
           if        w-cnt-tit-ctr-wrk    not  < w-cnt-tit-pos-dep
                     move  2              to   w-cnt-tit-num-lin
                     go to int-pag-std-500.
           move      1                    to   w-cnt-tit-num-lin      .
       int-pag-std-500.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
      *              *-------------------------------------------------*
      *              * Linea di '=' iniziale                           *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "="            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Prima linea titolo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome azienda                                *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-azi    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      w-cnt-tit-des-azi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           if        w-cnt-tit-num-lin    =    2
                     go to int-pag-std-600.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-600.
      *                  *---------------------------------------------*
      *                  * Literal per Data                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           move      "Data :"             to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       7                    to   p-pos                  .
           move      w-cnt-tit-dat-stp    to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Literal per Pag.                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       17                   to   p-pos                  .
           move      "Pag."               to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      w-cnt-tit-ctr-cif    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-dep    to   p-pos                  .
           add       22                   to   p-pos                  .
           move      w-cnt-tit-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Seconda linea titolo                            *
      *              *-------------------------------------------------*
           if        w-cnt-tit-num-lin    not  = 2
                     go to int-pag-std-900.
      *                  *---------------------------------------------*
      *                  * Titolo stampato                             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cnt-tit-ctr-tit    to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cnt-tit-pos-tit    to   p-pos                  .
           move      w-cnt-tit-des-tit    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-900.
      *              *-------------------------------------------------*
      *              * Linea di '-' finale                             *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      p-sel-als-sel        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      all   "-"            to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       2
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [zp1]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
      *              *-------------------------------------------------*
      *              * [zp2]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
      *              *-------------------------------------------------*
      *              * [zp3]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
      *              *-------------------------------------------------*
      *              * Filtro per selezione ed ordinamento [dcp]       *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * Lettura tipo ordinamento da filtro di selezione *
      *              * ed ordinamento per file [dcp]                   *
      *              *-------------------------------------------------*
           move      "TO"                 to   f-ope                  .
           move      rr-fso-dcp-alf       to   f-key                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
           if        f-sts                =    "01"
                     move  01             to   w-tip-ord-tip-ord
           else if   f-sts                =    "02"
                     move  02             to   w-tip-ord-tip-ord
           else if   f-sts                =    "03"
                     move  03             to   w-tip-ord-tip-ord
           else if   f-sts                =    "04"
                     move  04             to   w-tip-ord-tip-ord
           else      move  01             to   w-tip-ord-tip-ord      .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [aaf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaf                 .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [zp1]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
      *              *-------------------------------------------------*
      *              * [zp2]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
      *              *-------------------------------------------------*
      *              * [zp3]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
      *              *-------------------------------------------------*
      *              * Filtro per selezione ed ordinamento [dcp]       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Cancel                                      *
      *                  *---------------------------------------------*
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [aaf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaf                 .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : Si'                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-exe-rou-srt      .
      *              *-------------------------------------------------*
      *              * Esecuzione sort                                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   prn-rou-pri-000
                                          thru prn-rou-pri-999        .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione contatore records [dcp] letti  *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-srt-inp-ctr      .
      *              *-------------------------------------------------*
      *              * Start filtro di ordinamento e selezione per il  *
      *              * file [dcp]                                      *
      *              *-------------------------------------------------*
           move      "ST"                 to   f-ope                  .
           move      rr-fso-dcp           to   f-key                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-999.
       stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Read Next filtro di ordinamento e selezione per *
      *              * file [dcp]                                      *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Test se at end                              *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-999.
      *              *-------------------------------------------------*
      *              * Incremento contatore records [dcp] letti        *
      *              *-------------------------------------------------*
           add       1                    to   w-stp-srt-inp-ctr      .
      *              *-------------------------------------------------*
      *              * Start su file [aaf]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "PRFNFM    "         to   f-key                  .
           move      01                   to   rf-aaf-tip-mag         .
           move      rf-dcp-num-pro       to   rf-aaf-num-pro         .
           move      zero                 to   rf-aaf-cod-dcf         .
           move      spaces               to   rf-aaf-fda-pif         .
           move      "pgm/dcf/fls/ioc/obj/iofaaf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaf                 .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-100.
       stp-srt-inp-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale record [aaf]                *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaf                 .
      *                  *---------------------------------------------*
      *                  * Test se 'At end'                            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-aaf-tip-mag       not  = 01             or
                     rf-aaf-num-pro       not  = rf-dcp-num-pro
                     go to stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Lettura record [dcf]                            *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      rf-aaf-cod-dcf       to   rf-dcf-cod-fnt         .
           move      spaces               to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
           if        f-sts                not  = e-not-err
                     move  spaces         to   rf-dcf-rag-key
                     move  all "."        to   rf-dcf-rag-soc         .
      *              *-------------------------------------------------*
      *              * Preparazione record di Sort                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione iniziale                    *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
      *                  *---------------------------------------------*
      *                  * Chiave di sort                              *
      *                  *---------------------------------------------*
           move      w-stp-srt-inp-ctr    to   srt-ctr-dcp            .
           move      rf-dcf-rag-key       to   srt-rag-key            .
           move      rf-aaf-cod-dcf       to   srt-cod-dcf            .
           move      rf-aaf-fda-pif       to   srt-fda-pif            .
      *                  *---------------------------------------------*
      *                  * Dati di sort                                *
      *                  *---------------------------------------------*
           move      rf-dcp-cla-pro       to   srt-cod-cla            .
           move      rf-dcp-gru-pro       to   srt-cod-gru            .
           move      rf-dcp-sgr-pro       to   srt-cod-sgr            .
           move      rf-dcp-alf-pro       to   srt-alf-pro            .
           move      rf-dcp-des-pro       to   srt-des-pro            .
           move      rf-dcf-rag-soc       to   srt-rag-soc            .
           move      rf-aaf-cop-sfn       to   srt-cop-sfn            .
           if        rf-aaf-snx-tum       not  = "S"
                     move  rf-dcp-umi-ven to   srt-uni-mis
           else      move  rf-aaf-umf-tum to   srt-uni-mis            .
           move      rf-aaf-sgl-vlt       to   srt-sgl-vlt            .
           move      rf-aaf-dec-vlt       to   srt-dec-acq            .
           add       rf-aaf-dec-prz       to   srt-dec-acq            .
           move      rf-aaf-tap-pes       to   srt-tap-pes            .
           move      rf-aaf-qta-pes (1)   to   srt-qta-pes (1)        .
           move      rf-aaf-qta-pes (2)   to   srt-qta-pes (2)        .
           move      rf-aaf-qta-pes (3)   to   srt-qta-pes (3)        .
           move      rf-aaf-qta-pes (4)   to   srt-qta-pes (4)        .
           move      rf-aaf-qta-pes (5)   to   srt-qta-pes (5)        .
           move      rf-aaf-qta-pes (6)   to   srt-qta-pes (6)        .
           move      rf-aaf-prz-pes (1)   to   srt-prz-pes (1)        .
           move      rf-aaf-prz-pes (2)   to   srt-prz-pes (2)        .
           move      rf-aaf-prz-pes (3)   to   srt-prz-pes (3)        .
           move      rf-aaf-prz-pes (4)   to   srt-prz-pes (4)        .
           move      rf-aaf-prz-pes (5)   to   srt-prz-pes (5)        .
           move      rf-aaf-prz-pes (6)   to   srt-prz-pes (6)        .
           move      rf-aaf-psr-pes (1, 1)
                                          to   srt-psr-pes (1, 1)     .
           move      rf-aaf-psr-pes (1, 2)
                                          to   srt-psr-pes (1, 2)     .
           move      rf-aaf-psr-pes (1, 3)
                                          to   srt-psr-pes (1, 3)     .
           move      rf-aaf-psr-pes (1, 4)
                                          to   srt-psr-pes (1, 4)     .
           move      rf-aaf-psr-pes (1, 5)
                                          to   srt-psr-pes (1, 5)     .
           move      rf-aaf-psr-pes (2, 1)
                                          to   srt-psr-pes (2, 1)     .
           move      rf-aaf-psr-pes (2, 2)
                                          to   srt-psr-pes (2, 2)     .
           move      rf-aaf-psr-pes (2, 3)
                                          to   srt-psr-pes (2, 3)     .
           move      rf-aaf-psr-pes (2, 4)
                                          to   srt-psr-pes (2, 4)     .
           move      rf-aaf-psr-pes (2, 5)
                                          to   srt-psr-pes (2, 5)     .
           move      rf-aaf-psr-pes (3, 1)
                                          to   srt-psr-pes (3, 1)     .
           move      rf-aaf-psr-pes (3, 2)
                                          to   srt-psr-pes (3, 2)     .
           move      rf-aaf-psr-pes (3, 3)
                                          to   srt-psr-pes (3, 3)     .
           move      rf-aaf-psr-pes (3, 4)
                                          to   srt-psr-pes (3, 4)     .
           move      rf-aaf-psr-pes (3, 5)
                                          to   srt-psr-pes (3, 5)     .
           move      rf-aaf-psr-pes (4, 1)
                                          to   srt-psr-pes (4, 1)     .
           move      rf-aaf-psr-pes (4, 2)
                                          to   srt-psr-pes (4, 2)     .
           move      rf-aaf-psr-pes (4, 3)
                                          to   srt-psr-pes (4, 3)     .
           move      rf-aaf-psr-pes (4, 4)
                                          to   srt-psr-pes (4, 4)     .
           move      rf-aaf-psr-pes (4, 5)
                                          to   srt-psr-pes (4, 5)     .
           move      rf-aaf-psr-pes (5, 1)
                                          to   srt-psr-pes (5, 1)     .
           move      rf-aaf-psr-pes (5, 2)
                                          to   srt-psr-pes (5, 2)     .
           move      rf-aaf-psr-pes (5, 3)
                                          to   srt-psr-pes (5, 3)     .
           move      rf-aaf-psr-pes (5, 4)
                                          to   srt-psr-pes (5, 4)     .
           move      rf-aaf-psr-pes (5, 5)
                                          to   srt-psr-pes (5, 5)     .
           move      rf-aaf-psr-pes (6, 1)
                                          to   srt-psr-pes (6, 1)     .
           move      rf-aaf-psr-pes (6, 2)
                                          to   srt-psr-pes (6, 2)     .
           move      rf-aaf-psr-pes (6, 3)
                                          to   srt-psr-pes (6, 3)     .
           move      rf-aaf-psr-pes (6, 4)
                                          to   srt-psr-pes (6, 4)     .
           move      rf-aaf-psr-pes (6, 5)
                                          to   srt-psr-pes (6, 5)     .
           move      rf-aaf-uda-pes       to   srt-dat-uag            .
      *              *-------------------------------------------------*
      *              * Rilascio del record al Sort                     *
      *              *-------------------------------------------------*
           release   srt-rec                                          .
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale record [aaf]     *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-200.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessuna registrazione entro i limiti assegnati !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
           return    srt    at end
                            move  "#"     to   w-cnt-prn-flg-sub
                            go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-cmp-rot-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-cmp-rot-600.
       prn-cmp-rot-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice pro-  *
      *              *   dotto                                         *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   prodotto                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione area per rottura classe        *
      *                  *---------------------------------------------*
           move      srt-cod-cla          to   w-rot-l05-cod-cla      .
      *                  *---------------------------------------------*
      *                  * Composizione area per rottura gruppo        *
      *                  *---------------------------------------------*
           move      srt-cod-gru          to   w-rot-l04-cod-gru      .
      *                  *---------------------------------------------*
      *                  * Composizione area per rottura sottogruppo   *
      *                  *---------------------------------------------*
           move      srt-cod-sgr          to   w-rot-l03-cod-sgr      .
      *                  *---------------------------------------------*
      *                  * A composizione altre elementi di rottura    *
      *                  *---------------------------------------------*
           go to     prn-cmp-rot-800.
       prn-cmp-rot-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice prodotto                           *
      *              * - Per descrizione prodotto                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione area rottura classe         *
      *                  *---------------------------------------------*
           move      zero                 to   w-rot-l05-cod-cla      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione area rottura gruppo         *
      *                  *---------------------------------------------*
           move      zero                 to   w-rot-l04-cod-gru      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione area rottura sottogruppo    *
      *                  *---------------------------------------------*
           move      zero                 to   w-rot-l03-cod-sgr      .
      *                  *---------------------------------------------*
      *                  * A composizione altre elementi di rottura    *
      *                  *---------------------------------------------*
           go to     prn-cmp-rot-800.
       prn-cmp-rot-800.
      *              *-------------------------------------------------*
      *              * Contatore records [dcp] letti                   *
      *              *-------------------------------------------------*
           move      srt-ctr-dcp          to   w-rot-l02-ctr-dcp      .
      *              *-------------------------------------------------*
      *              * Codice fornitore                                *
      *              *-------------------------------------------------*
           move      srt-cod-dcf          to   w-rot-l01-cod-dcf      .
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Azzeramento totali generali                     *
      *              *-------------------------------------------------*
           perform   azz-tot-gen-000      thru azz-tot-gen-999        .
       prn-ini-cic-100.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo ordinamento       *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-ini-cic-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-ini-cic-600.
       prn-ini-cic-300.
      *              *-------------------------------------------------*
      *              * Se ordinamento per Classe, gruppo e sottogruppo *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione numero di linee effettive im-  *
      *                  * pegnate dalla fincatura per il dettaglio e  *
      *                  * la relativa sottolineatura                  *
      *                  *---------------------------------------------*
           move      2                    to   w-cgs-det-idf          .
      *                  *---------------------------------------------*
      *                  * Preparazione segnali di richiesta intesta-  *
      *                  * zione per inizio classe gruppo sottogruppo  *
      *                  *---------------------------------------------*
           if        rr-tip-slp           =    02
                     move  "S"            to   w-cgs-cla-int
                     move  "N"            to   w-cgs-gru-int
                     move  "N"            to   w-cgs-sgr-int
           else if   rr-tip-slp           =    03
                     move  "S"            to   w-cgs-cla-int
                     move  "S"            to   w-cgs-gru-int
                     move  "N"            to   w-cgs-sgr-int
           else if   rr-tip-slp           =    04
                     move  "S"            to   w-cgs-cla-int
                     move  "S"            to   w-cgs-gru-int
                     move  "S"            to   w-cgs-sgr-int
           else      move  "N"            to   w-cgs-cla-int
                     move  "N"            to   w-cgs-gru-int
                     move  "N"            to   w-cgs-sgr-int          .
      *                  *---------------------------------------------*
      *                  * Flag di prima intestazione : non eseguita   *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-gen-fie          .
      *                  *---------------------------------------------*
      *                  * Flag di intestazione classe : non eseguita  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-cla-fie          .
      *                  *---------------------------------------------*
      *                  * Flag di intestazione gruppo : non eseguita  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-gru-fie          .
      *                  *---------------------------------------------*
      *                  * Flag di intestazione sottogruppo : non ese- *
      *                  * guita                                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-sgr-fie          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-cic-999.
       prn-ini-cic-600.
      *              *-------------------------------------------------*
      *              * Se ordinamento per Codice o Descrizione         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Intestazione foglio                         *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                      *-----------------------------------------*
      *                      * Test se interruzione forzata            *
      *                      *-----------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-cic-999.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-cic-999.
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-ini-lr5-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-ini-lr5-600.
       prn-ini-lr5-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice pro-  *
      *              *   dotto                                         *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   prodotto                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati classe                         *
      *                  *---------------------------------------------*
           move      w-rot-l05-cod-cla    to   w-let-arc-zp1-cla      .
           perform   let-arc-zp1-000      thru let-arc-zp1-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione dati classe                 *
      *                  *---------------------------------------------*
           move      w-rot-l05-cod-cla    to   w-cgs-cla-cod          .
           move      w-let-arc-zp1-des    to   w-cgs-cla-des          .
           move      w-let-arc-zp1-mne    to   w-cgs-cla-mne          .
           move      w-let-arc-zp1-sqz    to   w-cgs-cla-sqz          .
           move      w-let-arc-zp1-sud    to   w-cgs-cla-sud          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di classe gia' inte-   *
      *                  * stata                                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-cla-fie          .
      *                  *---------------------------------------------*
      *                  * Azzeramento totali per classe               *
      *                  *---------------------------------------------*
           perform   azz-tot-cla-000      thru azz-tot-cla-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-lr5-999.
       prn-ini-lr5-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice prodotto                           *
      *              * - Per descrizione prodotto                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     prn-ini-lr5-999.
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-ini-lr4-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-ini-lr4-600.
       prn-ini-lr4-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice pro-  *
      *              *   dotto                                         *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   prodotto                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati gruppo                         *
      *                  *---------------------------------------------*
           move      w-rot-l05-cod-cla    to   w-let-arc-zp2-cla      .
           move      w-rot-l04-cod-gru    to   w-let-arc-zp2-gru      .
           perform   let-arc-zp2-000      thru let-arc-zp2-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione dati gruppo                 *
      *                  *---------------------------------------------*
           move      w-rot-l04-cod-gru    to   w-cgs-gru-cod          .
           move      w-let-arc-zp2-des    to   w-cgs-gru-des          .
           move      w-let-arc-zp2-mne    to   w-cgs-gru-mne          .
           move      w-let-arc-zp2-sqz    to   w-cgs-gru-sqz          .
           move      w-let-arc-zp2-sud    to   w-cgs-gru-sud          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di gruppo gia' inte-   *
      *                  * stato                                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-gru-fie          .
      *                  *---------------------------------------------*
      *                  * Azzeramento totali per gruppo               *
      *                  *---------------------------------------------*
           perform   azz-tot-gru-000      thru azz-tot-gru-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-ini-lr4-999.
       prn-ini-lr4-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice prodotto                           *
      *              * - Per descrizione prodotto                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     prn-ini-lr4-999.
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo ordinamento     *
      *              *-------------------------------------------------*
           if        w-tip-ord-tip-ord    =    01 or
                     w-tip-ord-tip-ord    =    02
                     go to prn-ini-lr3-300
           else if   w-tip-ord-tip-ord    =    03 or
                     w-tip-ord-tip-ord    =    04
                     go to prn-ini-lr3-600.
       prn-ini-lr3-300.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per classe, gruppo, sottogruppo, codice pro-  *
      *              *   dotto                                         *
      *              * - Per classe, gruppo, sottogruppo, descrizione  *
      *              *   prodotto                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura dati sottogruppo                    *
      *                  *---------------------------------------------*
           move      w-rot-l05-cod-cla    to   w-let-arc-zp3-cla      .
           move      w-rot-l04-cod-gru    to   w-let-arc-zp3-gru      .
           move      w-rot-l03-cod-sgr    to   w-let-arc-zp3-sgr      .
           perform   let-arc-zp3-000      thru let-arc-zp3-999        .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione dati sottogruppo            *
      *                  *---------------------------------------------*
           move      w-rot-l03-cod-sgr    to   w-cgs-sgr-cod          .
           move      w-let-arc-zp3-des    to   w-cgs-sgr-des          .
           move      w-let-arc-zp3-mne    to   w-cgs-sgr-mne          .
           move      w-let-arc-zp3-sqz    to   w-cgs-sgr-sqz          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di sottogruppo gia'    *
      *                  * intestato                                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-cgs-sgr-fie          .
      *                  *---------------------------------------------*
      *                  * Azzeramento totali per sottogruppo          *
      *                  *---------------------------------------------*
           perform   azz-tot-sgr-000      thru azz-tot-sgr-999        .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dei flags di intesta-  *
      *                  * zione gia' eseguita                         *
      *                  *---------------------------------------------*
           if        w-cgs-cla-fie        =    spaces
                     go to prn-ini-lr3-350
           else if   w-cgs-gru-fie        =    spaces
                     go to prn-ini-lr3-450
           else      go to prn-ini-lr3-500.
       prn-ini-lr3-350.
      *                  *---------------------------------------------*
      *                  * Se classe non ancora intestata              *
      *                  *---------------------------------------------*
       prn-ini-lr3-355.
      *                      *-----------------------------------------*
      *                      * Flag di intestazione eseguita per :     *
      *                      * - Classe                                *
      *                      * - Gruppo                                *
      *                      * - Sottogruppo                           *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cgs-cla-fie          .
           move      "#"                  to   w-cgs-gru-fie          .
           move      "#"                  to   w-cgs-sgr-fie          .
       prn-ini-lr3-360.
      *                      *-----------------------------------------*
      *                      * Se intestazione generale non ancora e-  *
      *                      * seguita                                 *
      *                      *-----------------------------------------*
           if        w-cgs-gen-fie        not  = spaces
                     go to prn-ini-lr3-370.
      *                          *-------------------------------------*
      *                          * Flag di intestazione generale gia'  *
      *                          * eseguita                            *
      *                          *-------------------------------------*
           move      "#"                  to   w-cgs-gen-fie          .
       prn-ini-lr3-365.
      *                          *-------------------------------------*
      *                          * Intestazione pagina                 *
      *                          *-------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr3-999.
      *                          *-------------------------------------*
      *                          * A test su suddivisione classe       *
      *                          *-------------------------------------*
           go to     prn-ini-lr3-375.
       prn-ini-lr3-370.
      *                      *-----------------------------------------*
      *                      * Se intestazione generale gia' eseguita  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se richiesta comunque una intesta-  *
      *                          * zione ad inizio classe : ad inte-   *
      *                          * stazione pagina                     *
      *                          *-------------------------------------*
           if        w-cgs-cla-int        =    "S"
                     go to prn-ini-lr3-365.
       prn-ini-lr3-375.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda se classe suddivi- *
      *                      * sa oppure no                            *
      *                      *-----------------------------------------*
           if        w-cgs-cla-sud        =    02
                     go to prn-ini-lr3-385
           else      go to prn-ini-lr3-380.
       prn-ini-lr3-380.
      *                      *-----------------------------------------*
      *                      * Se classe non suddivisa                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Intestazione per la sola classe     *
      *                          *-------------------------------------*
           perform   sta-int-cla-000      thru sta-int-cla-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr3-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr3-999.
       prn-ini-lr3-385.
      *                      *-----------------------------------------*
      *                      * Se classe suddivisa                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Deviazione a seconda se gruppo sud- *
      *                          * diviso oppure no                    *
      *                          *-------------------------------------*
           if        w-cgs-gru-sud        =    02
                     go to prn-ini-lr3-395
           else      go to prn-ini-lr3-390.
       prn-ini-lr3-390.
      *                          *-------------------------------------*
      *                          * Se gruppo non suddiviso             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Intestazione per classe e grup- *
      *                              * po                              *
      *                              *---------------------------------*
           perform   sta-int-gru-000      thru sta-int-gru-999        .
      *                              *---------------------------------*
      *                              * Se interruzione forzata : usci- *
      *                              * ta                              *
      *                              *---------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr3-999.
      *                              *---------------------------------*
      *                              * Uscita                          *
      *                              *---------------------------------*
           go to     prn-ini-lr3-999.
       prn-ini-lr3-395.
      *                          *-------------------------------------*
      *                          * Se gruppo suddiviso                 *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Intestazione per classe, grup-  *
      *                              * po, sottogruppo                 *
      *                              *---------------------------------*
           perform   sta-int-sgr-000      thru sta-int-sgr-999        .
      *                              *---------------------------------*
      *                              * Se interruzione forzata : usci- *
      *                              * ta                              *
      *                              *---------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr3-999.
      *                              *---------------------------------*
      *                              * Uscita                          *
      *                              *---------------------------------*
           go to     prn-ini-lr3-999.
       prn-ini-lr3-450.
      *                  *---------------------------------------------*
      *                  * Se gruppo non ancora intestato              *
      *                  *---------------------------------------------*
       prn-ini-lr3-455.
      *                      *-----------------------------------------*
      *                      * Flag di intestazione eseguita per :     *
      *                      * - Gruppo                                *
      *                      * - Sottogruppo                           *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cgs-gru-fie          .
           move      "#"                  to   w-cgs-sgr-fie          .
       prn-ini-lr3-460.
      *                      *-----------------------------------------*
      *                      * Se richiesta comunque una intestazione  *
      *                      * ad inizio gruppo                        *
      *                      *-----------------------------------------*
           if        w-cgs-gru-int        not  = "S"
                     go to prn-ini-lr3-465.
      *                          *-------------------------------------*
      *                          * Intestazione pagina                 *
      *                          *-------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr3-999.
       prn-ini-lr3-465.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda se gruppo suddivi- *
      *                      * so oppure no                            *
      *                      *-----------------------------------------*
           if        w-cgs-gru-sud        =    02
                     go to prn-ini-lr3-475
           else      go to prn-ini-lr3-470.
       prn-ini-lr3-470.
      *                      *-----------------------------------------*
      *                      * Se gruppo non suddiviso                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Intestazione per classe e gruppo    *
      *                          *-------------------------------------*
           perform   sta-int-gru-000      thru sta-int-gru-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr3-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr3-999.
       prn-ini-lr3-475.
      *                      *-----------------------------------------*
      *                      * Se gruppo suddiviso                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Intestazione per classe, gruppo, e  *
      *                          * sottogruppo                         *
      *                          *-------------------------------------*
           perform   sta-int-sgr-000      thru sta-int-sgr-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr3-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr3-999.
       prn-ini-lr3-500.
      *                  *---------------------------------------------*
      *                  * Se sottogruppo non ancora intestato         *
      *                  *---------------------------------------------*
       prn-ini-lr3-505.
      *                      *-----------------------------------------*
      *                      * Flag di intestazione eseguita per :     *
      *                      * - Sottogruppo                           *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cgs-sgr-fie          .
       prn-ini-lr3-510.
      *                      *-----------------------------------------*
      *                      * Se richiesta comunque una intestazione  *
      *                      * ad inizio sottogruppo                   *
      *                      *-----------------------------------------*
           if        w-cgs-sgr-int        not  = "S"
                     go to prn-ini-lr3-515.
      *                          *-------------------------------------*
      *                          * Intestazione pagina                 *
      *                          *-------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr3-999.
       prn-ini-lr3-515.
      *                          *-------------------------------------*
      *                          * Intestazione per classe, gruppo, e  *
      *                          * sottogruppo                         *
      *                          *-------------------------------------*
           perform   sta-int-sgr-000      thru sta-int-sgr-999        .
      *                          *-------------------------------------*
      *                          * Se interruzione forzata : uscita    *
      *                          *-------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-lr3-999.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     prn-ini-lr3-999.
       prn-ini-lr3-600.
      *              *-------------------------------------------------*
      *              * Se tipo ordinamento :                           *
      *              * - Per codice prodotto                           *
      *              * - Per descrizione prodotto                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     prn-ini-lr3-999.
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Flag di intestazione prodotto                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-prn-int-pro          .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Flag di intestazione fornitore                  *
      *              *-------------------------------------------------*
           move      "#"                  to   w-prn-int-fnt          .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Stampa riga di dettaglio                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    2
                     go to prn-liv-det-100.
      *                      *-----------------------------------------*
      *                      * Reintestazione                          *
      *                      *-----------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
      *                      *-----------------------------------------*
      *                      * Fincatura per dettaglio                 *
      *                      *-----------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       prn-liv-det-100.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Eventuale intestazione prodotto             *
      *                  *---------------------------------------------*
           if        w-prn-int-pro        =    spaces
                     go to prn-liv-det-150.
           move      spaces               to   w-prn-int-pro          .
      *                      *-----------------------------------------*
      *                      * Codice prodotto                         *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      srt-alf-pro          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Descrizione prodotto                    *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      017                  to   p-pos                  .
           move      srt-des-pro          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-150.
      *                  *---------------------------------------------*
      *                  * Eventuale intestazione fornitore            *
      *                  *---------------------------------------------*
           if        w-prn-int-fnt        =    spaces
                     go to prn-liv-det-200.
           move      spaces               to   w-prn-int-fnt          .
      *                      *-----------------------------------------*
      *                      * Codice fornitore                        *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      060                  to   p-pos                  .
           move      spaces               to   p-edm                  .
           move      srt-cod-dcf          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-200.
      *                  *---------------------------------------------*
      *                  * Codice prodotto per il fornitore            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      070                  to   p-pos                  .
           move      srt-cop-sfn          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Unita' di misura                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      086                  to   p-pos                  .
           move      srt-uni-mis          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Sigla valuta solo se non base               *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      091                  to   p-pos                  .
           if        srt-sgl-vlt          not  = c-sgl
                     move  srt-sgl-vlt    to   p-alf
           else      move  spaces         to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Prezzo d'acquisto                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      srt-dec-acq          to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "BG"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      095                  to   p-pos                  .
           move      srt-prz-pes (1)      to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Percentuale di sconto 1                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      109                  to   p-pos                  .
           move      "BD"                 to   p-edm                  .
           move      srt-psr-pes (1, 1)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Percentuale di sconto 2                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      114                  to   p-pos                  .
           move      "BD"                 to   p-edm                  .
           move      srt-psr-pes (1, 2)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Percentuale di sconto 3                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      119                  to   p-pos                  .
           move      "BD"                 to   p-edm                  .
           move      srt-psr-pes (1, 3)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Data ultimo aggiornamento                   *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      p-lnr                to   p-lin                  .
           move      125                  to   p-pos                  .
           move      srt-dat-uag          to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-300.
      *              *-------------------------------------------------*
      *              * Eventuale stampa % di sconto 4 e 5              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se esistono % di sconto 4 e 5          *
      *                  *---------------------------------------------*
           if        srt-psr-pes (1, 4)   =    zero and
                     srt-psr-pes (1, 5)   =    zero
                     go to prn-liv-det-400.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Percentuale di sconto 4                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      109                  to   p-pos                  .
           move      "BD"                 to   p-edm                  .
           move      srt-psr-pes (1, 4)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Percentuale di sconto 5                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      p-lnr                to   p-lin                  .
           move      114                  to   p-pos                  .
           move      "BD"                 to   p-edm                  .
           move      srt-psr-pes (1, 5)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-liv-det-400.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio                                       *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Preparazione parametri intestazione standard    *
      *              *-------------------------------------------------*
           move      "CONDIZIONI D'ACQUISTO PRODOTTI DI VENDITA"
                                          to   w-cnt-tit-des-tit      .
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-cnt-tit-dat-stp      .
           move      p-pag                to   w-cnt-tit-num-pag      .
           add       1                    to   w-cnt-tit-num-pag      .
      *              *-------------------------------------------------*
      *              * Intestazione standard                           *
      *              *-------------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per interruzione forzata          *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  int-pag-sta-999.
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Fincatura per il livello di dettaglio                     *
      *    *-----------------------------------------------------------*
       int-fin-det-000.
      *              *-------------------------------------------------*
      *              * Interlinea subordinata                          *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       02
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura                                       *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "                         Prodotto                 
      -              "        Fornitore    Suo codice    Udm        Prez
      -              "zo       % di sconto    Ult.agg."
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura fincatura                        *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      132                  to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      001                  to   p-pos                  .
           move      "--------------------------------------------------
      -              "------  ---------  --------------  ---  ----------
      -              "------  --------------  --------"
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "VP"                 to   p-ope                  .
           add       1
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-fin-det-999.
           exit.

      *    *===========================================================*
      *    * Stampa intestazione classe                                *
      *    *-----------------------------------------------------------*
       sta-int-cla-000.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      11                   to   w-cgs-wrk-nln          .
           add       w-cgs-det-idf        to   w-cgs-wrk-nln          .
           if        p-res                >    w-cgs-wrk-nln
                     go to sta-int-cla-200.
       sta-int-cla-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Test se interruzione forzata                    *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-int-cla-999.
       sta-int-cla-200.
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la fincatura       *
      *              *-------------------------------------------------*
           subtract  40                   from p-sel-als-sel
                                        giving w-cgs-wrk-pfn          .
           divide    2                    into w-cgs-wrk-pfn          .
           add       1                    to   w-cgs-wrk-pfn          .
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       3
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini superiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "="              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione classe                 *
      *              *-------------------------------------------------*
           move      w-cgs-cla-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione classe     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la classe          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione classe                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini inferiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura per dettaglio                         *
      *              *-------------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       sta-int-cla-999.
           exit.

      *    *===========================================================*
      *    * Stampa intestazione classe e gruppo                       *
      *    *-----------------------------------------------------------*
       sta-int-gru-000.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      12                   to   w-cgs-wrk-nln          .
           add       w-cgs-det-idf        to   w-cgs-wrk-nln          .
           if        p-res                >    w-cgs-wrk-nln
                     go to sta-int-gru-200.
       sta-int-gru-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Test se interruzione forzata                    *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-int-gru-999.
       sta-int-gru-200.
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la fincatura       *
      *              *-------------------------------------------------*
           subtract  40                   from p-sel-als-sel
                                        giving w-cgs-wrk-pfn          .
           divide    2                    into w-cgs-wrk-pfn          .
           add       1                    to   w-cgs-wrk-pfn          .
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       3
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini superiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "="              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione classe                 *
      *              *-------------------------------------------------*
           move      w-cgs-cla-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione classe     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la classe          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione classe                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione gruppo                 *
      *              *-------------------------------------------------*
           move      w-cgs-gru-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione gruppo     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per il gruppo          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione gruppo                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini inferiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura per dettaglio                         *
      *              *-------------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       sta-int-gru-999.
           exit.

      *    *===========================================================*
      *    * Stampa intestazione classe, gruppo, sottogruppo           *
      *    *-----------------------------------------------------------*
       sta-int-sgr-000.
      *              *-------------------------------------------------*
      *              * Test se righe residue sufficienti               *
      *              *-------------------------------------------------*
           move      13                   to   w-cgs-wrk-nln          .
           add       w-cgs-det-idf        to   w-cgs-wrk-nln          .
           if        p-res                >    w-cgs-wrk-nln
                     go to sta-int-sgr-200.
       sta-int-sgr-100.
      *              *-------------------------------------------------*
      *              * Intestazione pagina                             *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Test se interruzione forzata                    *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to sta-int-sgr-999.
       sta-int-sgr-200.
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la fincatura       *
      *              *-------------------------------------------------*
           subtract  40                   from p-sel-als-sel
                                        giving w-cgs-wrk-pfn          .
           divide    2                    into w-cgs-wrk-pfn          .
           add       1                    to   w-cgs-wrk-pfn          .
      *              *-------------------------------------------------*
      *              * Posizionamento verticale subordinato            *
      *              *-------------------------------------------------*
           move      "VS"                 to   p-ope                  .
           add       3
                     p-lnr              giving p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini superiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "="              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione classe                 *
      *              *-------------------------------------------------*
           move      w-cgs-cla-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione classe     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per la classe          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione classe                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione gruppo                 *
      *              *-------------------------------------------------*
           move      w-cgs-gru-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione gruppo     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per il gruppo          *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione gruppo                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Preparazioni descrizione sottogruppo            *
      *              *-------------------------------------------------*
           move      w-cgs-sgr-des        to   w-cgs-wrk-des          .
           if        w-cgs-wrk-des        =    spaces
                     move  "...."         to   w-cgs-wrk-des          .
      *              *-------------------------------------------------*
      *              * Determinazione lunghezza descrizione sottogrup- *
      *              * po                                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-cgs-wrk-inx          .
           inspect   w-cgs-wrk-des    
                                      tallying w-cgs-wrk-inx    
                                          for  trailing spaces        .
           move      40                   to   w-cgs-wrk-pnt          .
           subtract  w-cgs-wrk-inx        from w-cgs-wrk-pnt          .
           move      w-cgs-wrk-pnt        to   w-cgs-wrk-car          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione per il sottogruppo     *
      *              *-------------------------------------------------*
           subtract  w-cgs-wrk-car        from p-sel-als-sel
                                        giving w-cgs-wrk-pos          .
           divide    2                    into w-cgs-wrk-pos          .
           add       1                    to   w-cgs-wrk-pos          .
      *              *-------------------------------------------------*
      *              * Descrizione sottogruppo                         *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-cgs-wrk-car        to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pos        to   p-pos                  .
           move      w-cgs-wrk-des        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Trattini inferiori                              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-cgs-wrk-pfn        to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Fincatura per dettaglio                         *
      *              *-------------------------------------------------*
           perform   int-fin-det-000      thru int-fin-det-999        .
       sta-int-sgr-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali generali                               *
      *    *-----------------------------------------------------------*
       azz-tot-gen-000.
       azz-tot-gen-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali per classe                             *
      *    *-----------------------------------------------------------*
       azz-tot-cla-000.
       azz-tot-cla-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali per gruppo                             *
      *    *-----------------------------------------------------------*
       azz-tot-gru-000.
       azz-tot-gru-999.
           exit.

      *    *===========================================================*
      *    * Azzeramento totali per sottogruppo                        *
      *    *-----------------------------------------------------------*
       azz-tot-sgr-000.
       azz-tot-sgr-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zp1]                             *
      *    *-----------------------------------------------------------*
       let-arc-zp1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp1-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice classe a zero                    *
      *              *-------------------------------------------------*
           if        w-let-arc-zp1-cla    =    zero
                     go to let-arc-zp1-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLA    "         to   f-key                  .
           move      w-let-arc-zp1-cla    to   rf-zp1-cod-cla         .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zp1-400.
       let-arc-zp1-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zp1-des-cla       to   w-let-arc-zp1-des      .
           move      rf-zp1-mne-cla       to   w-let-arc-zp1-mne      .
           move      rf-zp1-ult-sud       to   w-let-arc-zp1-sud      .
           move      rf-zp1-sqz-num       to   w-let-arc-zp1-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zp1-999.
       let-arc-zp1-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zp1-flg      .
           move      all   "."            to   w-let-arc-zp1-des      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-let-arc-zp1-cla    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-let-arc-zp1-mne      .
           go to     let-arc-zp1-600.
       let-arc-zp1-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp1-des      .
           move      spaces               to   w-let-arc-zp1-mne      .
       let-arc-zp1-600.
           move      zero                 to   w-let-arc-zp1-sud      .
           move      zero                 to   w-let-arc-zp1-sqz      .
       let-arc-zp1-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zp2]                             *
      *    *-----------------------------------------------------------*
       let-arc-zp2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp2-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice gruppo a zero                    *
      *              *-------------------------------------------------*
           if        w-let-arc-zp2-gru    =    zero
                     go to let-arc-zp2-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODGRU    "         to   f-key                  .
           move      w-let-arc-zp2-cla    to   rf-zp2-cod-cla         .
           move      w-let-arc-zp2-gru    to   rf-zp2-cod-gru         .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zp2-400.
       let-arc-zp2-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zp2-des-gru       to   w-let-arc-zp2-des      .
           move      rf-zp2-mne-gru       to   w-let-arc-zp2-mne      .
           move      rf-zp2-ult-sud       to   w-let-arc-zp2-sud      .
           move      rf-zp2-sqz-num       to   w-let-arc-zp2-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zp2-999.
       let-arc-zp2-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zp2-flg      .
           move      all   "."            to   w-let-arc-zp2-des      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-let-arc-zp2-gru    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-let-arc-zp2-mne      .
           go to     let-arc-zp2-600.
       let-arc-zp2-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp2-des      .
           move      spaces               to   w-let-arc-zp2-mne      .
       let-arc-zp2-600.
           move      zero                 to   w-let-arc-zp2-sud      .
           move      zero                 to   w-let-arc-zp2-sqz      .
       let-arc-zp2-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zp3]                             *
      *    *-----------------------------------------------------------*
       let-arc-zp3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp3-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice sottogruppo a zero               *
      *              *-------------------------------------------------*
           if        w-let-arc-zp3-sgr    =    zero
                     go to let-arc-zp3-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODSGR    "         to   f-key                  .
           move      w-let-arc-zp3-cla    to   rf-zp3-cod-cla         .
           move      w-let-arc-zp3-gru    to   rf-zp3-cod-gru         .
           move      w-let-arc-zp3-sgr    to   rf-zp3-cod-sgr         .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zp3-400.
       let-arc-zp3-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zp3-des-sgr       to   w-let-arc-zp3-des      .
           move      rf-zp3-mne-sgr       to   w-let-arc-zp3-mne      .
           move      rf-zp3-ult-sud       to   w-let-arc-zp3-sud      .
           move      rf-zp3-sqz-num       to   w-let-arc-zp3-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zp3-999.
       let-arc-zp3-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zp3-flg      .
           move      all   "."            to   w-let-arc-zp3-des      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-let-arc-zp3-sgr    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-let-arc-zp3-mne      .
           go to     let-arc-zp3-600.
       let-arc-zp3-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp3-des      .
           move      spaces               to   w-let-arc-zp3-mne      .
       let-arc-zp3-600.
           move      zero                 to   w-let-arc-zp3-sud      .
           move      zero                 to   w-let-arc-zp3-sqz      .
       let-arc-zp3-999.
           exit.

