       Identification Division.
       Program-Id.                                 pdtp400a           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    dtp                 *
      *                                Settore:    int                 *
      *                                   Fase:    dtp400              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 26/11/91    *
      *                       Ultima revisione:    NdK del 08/02/06    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esplosioni ed implosioni a video            *
      *                                                                *
      *                    Sottoprogramma per esecuzione funzione di : *
      *                                                                *
      *                    Esplosione scalare distinta base per un     *
      *                    prodotto di vendita                         *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     d-K-b-Snc-PD .
       Object-Computer.     d-K-b-Snc-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [rel]                                        *
      *    *-----------------------------------------------------------*
           select  optional  rel   assign  to disk     f-rel-pat
                             organization  is relative
                             access   mode is dynamic
                             relative key  is          f-rel-krn
                             file status   is          f-rel-sts      .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [rel]                                    *
      *    *-----------------------------------------------------------*
       fd  rel  label record standard.
      *    *-----------------------------------------------------------*
      *    * Record                                                    *
      *    *-----------------------------------------------------------*
       01  rel-rec.
      *        *-------------------------------------------------------*
      *        * Tipo di componente                                    *
      *        *  - 02 : Semilavorato                                  *
      *        *  - 03 : Materia prima                                 *
      *        *  - 99 : Sub-distinta virtuale                         *
      *        *-------------------------------------------------------*
           05  rel-tip-com                pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice numerico del componente                        *
      *        *-------------------------------------------------------*
           05  rel-num-com                pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice alfanumerico del componente                    *
      *        *-------------------------------------------------------*
           05  rel-alf-com                pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Descrizione del componente                            *
      *        *-------------------------------------------------------*
           05  rel-des-com                pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Unita' di misura del componente                       *
      *        *-------------------------------------------------------*
           05  rel-umi-com                pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Numero decimali quantita' del componente              *
      *        *-------------------------------------------------------*
           05  rel-deq-com                pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Quantita' di impiego, moltiplicatore                  *
      *        *-------------------------------------------------------*
           05  rel-ipm-com                pic  9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Quantita' di impiego, divisore                        *
      *        *-------------------------------------------------------*
           05  rel-ipd-com                pic  9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Quantita' di impiego, quantita' totale                *
      *        *-------------------------------------------------------*
           05  rel-qtt-com                pic  9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Annotazioni sull'impiego                              *
      *        *-------------------------------------------------------*
           05  rel-not-com                pic  x(40)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area ausiliaria per controllo i-o su [rel]                *
      *    *-----------------------------------------------------------*
       01  f-rel.
      *        *-------------------------------------------------------*
      *        * File name                                             *
      *        *-------------------------------------------------------*
           05  f-rel-nam                  pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * File pathname                                         *
      *        *-------------------------------------------------------*
           05  f-rel-pat                  pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * File status                                           *
      *        *-------------------------------------------------------*
           05  f-rel-sts                  pic  x(02)                  .
      *        *-------------------------------------------------------*
      *        * Record number per input-output                        *
      *        *-------------------------------------------------------*
           05  f-rel-krn                  pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Max record number scritto                             *
      *        *-------------------------------------------------------*
           05  f-rel-kms                  pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Record number per scrittura                           *
      *        *-------------------------------------------------------*
           05  f-rel-put                  pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Record number per lettura                             *
      *        *-------------------------------------------------------*
           05  f-rel-get                  pic  9(07)                  .

      *    *===========================================================*
      *    * Descrizione tipo interrogazione per l'overlay             *
      *    *-----------------------------------------------------------*
       01  w-des-tit-pgm-ovy              pic  x(40)       value
                     " ESPLOSIONE SCALARE PRODOTTO DI VENDITA "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-tip-fun-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-tip-fun      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine qry-rou-pri-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-qry-rou-pri      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste pre esecuzione interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico interrogazione        *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento automatico interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-aut      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di Si/No primo giro di esecuzione            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-prm-gir      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento qry-routine       *
      *        *-------------------------------------------------------*
           05  w-cnt-qry.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-qry-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-liv.
                   15  w-cnt-qry-sav-l05  pic  x(64)                  .
                   15  w-cnt-qry-sav-l04  pic  x(64)                  .
                   15  w-cnt-qry-sav-l03  pic  x(64)                  .
                   15  w-cnt-qry-sav-l02  pic  x(64)                  .
                   15  w-cnt-qry-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Literals                                              *
      *        *-------------------------------------------------------*
           05  w-cnt-lit.
               10  w-cnt-lit-t80          pic  x(80) value all "="    .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [dps]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dps/fls/rec/rfdps"                          .
      *        *-------------------------------------------------------*
      *        * [dpm]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dpm/fls/rec/rfdpm"                          .
      *        *-------------------------------------------------------*
      *        * [lgt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dtp/fls/rec/rflgt"                          .
      *        *-------------------------------------------------------*
      *        * [lgr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dtp/fls/rec/rflgr"                          .
      *        *-------------------------------------------------------*
      *        * [lgv]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dtp/fls/rec/rflgv"                          .

      *    *===========================================================*
      *    * Work-area per variabili di i.p.c. eventualmente passate   *
      *    * dal chiamante                                             *
      *    *-----------------------------------------------------------*
       01  w-ipc.
      *        *-------------------------------------------------------*
      *        * Per tipo di chiamante del sottoprogramma              *
      *        *-------------------------------------------------------*
           05  w-ipc-tdc-mos.
      *            *---------------------------------------------------*
      *            * Si/No variabile di i.p.c. relativa al tipo di     *
      *            * chiamante del sottoprogramma                      *
      *            *---------------------------------------------------*
               10  w-ipc-tdc-mos-snx      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Valore della variabile di i.p.c. relativa al tipo *
      *            * di chiamante del sottoprogramma                   *
      *            * - M : Il main                                     *
      *            * - S : Un altro sottoprogramma                     *
      *            *---------------------------------------------------*
               10  w-ipc-tdc-mos-val      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per ammissibilita' tasto Slct                         *
      *        *-------------------------------------------------------*
           05  w-ipc-snx-slc.
      *            *---------------------------------------------------*
      *            * Si/No variabile di i.p.c. relativa all'ammissibi- *
      *            * lita' del tasto Slct                              *
      *            *---------------------------------------------------*
               10  w-ipc-snx-slc-snx      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Valore della variabile di i.p.c. relativa all'am- *
      *            * missibilita' del tasto Slct                       *
      *            * - S : Si                                          *
      *            * - N : No                                          *
      *            *---------------------------------------------------*
               10  w-ipc-snx-slc-val      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Per codice numerico dell'assieme di tipo prodotto di  *
      *        * vendita                                               *
      *        *-------------------------------------------------------*
           05  w-ipc-num-ass.
      *            *---------------------------------------------------*
      *            * Si/No variabile di i.p.c. relativa al codice nu-  *
      *            * merico dell'assieme di tipo prodotto di vendita   *
      *            *---------------------------------------------------*
               10  w-ipc-num-ass-snx      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Valore della variabile di i.p.c. relativa al co-  *
      *            * dice numerico dell'assieme di tipo prodotto di    *
      *            * vendita                                           *
      *            *---------------------------------------------------*
               10  w-ipc-num-ass-val      pic  9(07)                  .

      *    *===========================================================*
      *    * Work-area richieste per interrogazione                    *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Codice numerico per l'assieme di tipo prodotto di     *
      *        * vendita                                               *
      *        *-------------------------------------------------------*
           05  rr-num-ass                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice alfanumerico per l'assieme di tipo prodotto di *
      *        * vendita                                               *
      *        *-------------------------------------------------------*
           05  rr-alf-ass                 pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Descrizione per l'assieme di tipo prodotto di vendita *
      *        *-------------------------------------------------------*
           05  rr-des-ass                 pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Unita' di misura per l'assieme di tipo prodotto di    *
      *        * vendita                                               *
      *        *-------------------------------------------------------*
           05  rr-umi-ass                 pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Numero decimali quantita' per l'assieme di tipo pro-  *
      *        * dotto di vendita                                      *
      *        *-------------------------------------------------------*
           05  rr-deq-ass                 pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Quantita' da esplodere per l'assieme di tipo prodotto *
      *        * di vendita                                            *
      *        *-------------------------------------------------------*
           05  rr-qde-ass                 pic  9(08)v9(03)            .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcp.
               10  w-let-arc-dcp-flg      pic  x(01)                  .
               10  w-let-arc-dcp-num      pic  9(07)                  .
               10  w-let-arc-dcp-alf      pic  x(14)                  .
               10  w-let-arc-dcp-des      pic  x(40)                  .
               10  w-let-arc-dcp-tpr      pic  x(01)                  .
               10  w-let-arc-dcp-umi      pic  x(03)                  .
               10  w-let-arc-dcp-deq      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dps]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dps.
               10  w-let-arc-dps-flg      pic  x(01)                  .
               10  w-let-arc-dps-num      pic  9(07)                  .
               10  w-let-arc-dps-alf      pic  x(14)                  .
               10  w-let-arc-dps-des      pic  x(40)                  .
               10  w-let-arc-dps-umi      pic  x(03)                  .
               10  w-let-arc-dps-deq      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [lgv]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-lgv.
               10  w-let-arc-lgv-flg      pic  x(01)                  .
               10  w-let-arc-lgv-num      pic  9(07)                  .
               10  w-let-arc-lgv-alf      pic  x(14)                  .
               10  w-let-arc-lgv-des      pic  x(40)                  .
               10  w-let-arc-lgv-umi      pic  x(03)                  .
               10  w-let-arc-lgv-deq      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dpm]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dpm.
               10  w-let-arc-dpm-flg      pic  x(01)                  .
               10  w-let-arc-dpm-num      pic  9(07)                  .
               10  w-let-arc-dpm-alf      pic  x(14)                  .
               10  w-let-arc-dpm-des      pic  x(40)                  .
               10  w-let-arc-dpm-umi      pic  x(03)                  .
               10  w-let-arc-dpm-deq      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [lgt]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-lgt.
               10  w-let-arc-lgt-flg      pic  x(01)                  .
               10  w-let-arc-lgt-tip      pic  9(02)                  .
               10  w-let-arc-lgt-num      pic  9(07)                  .
               10  w-let-arc-lgt-dis      pic  x(20)                  .
               10  w-let-arc-lgt-com.
                   15  w-let-arc-lgt-rco
                               occurs 03  pic  x(40)                  .

      *    *===========================================================*
      *    * Link-area per accettazione codice prodotto 'dcp'          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acoddcp0.acl"                   .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale                         *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .
               10  w-err-box-err-m02      pic  x(65)                  .
               10  w-err-box-err-m03      pic  x(65)                  .

      *    *===========================================================*
      *    * Work-area per ridefinizione contenuto del mark-point      *
      *    *-----------------------------------------------------------*
       01  w-mpn.
      *        *-------------------------------------------------------*
      *        * Numero record per il file di appoggio [rel]           *
      *        *-------------------------------------------------------*
           05  w-mpn-num-rel              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Tipo di componente                                    *
      *        *-------------------------------------------------------*
           05  w-mpn-tip-com              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice numerico del componente                        *
      *        *-------------------------------------------------------*
           05  w-mpn-num-com              pic  9(07)                  .

      *    *===========================================================*
      *    * Work per subroutine di esplosione scalare distinta base   *
      *    *-----------------------------------------------------------*
       01  w-esp-scl-dtp.
      *        *-------------------------------------------------------*
      *        * Parametri in input                                    *
      *        *-------------------------------------------------------*
           05  w-esp-scl-dtp-inp.
      *            *---------------------------------------------------*
      *            * Funzione da eseguire                              *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-fun      pic  x(05)                  .
      *            *---------------------------------------------------*
      *            * Tipo magazzino per l'assieme da esplodere         *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-tde      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice numerico magazzino da esplodere            *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-nde      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice alfanumerico magazzino da esplodere        *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-ade      pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Quantita' da esplodere per l'assieme              *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-qde      pic s9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Parametri in output                                   *
      *        *-------------------------------------------------------*
           05  w-esp-scl-dtp-out.
      *            *---------------------------------------------------*
      *            * Status di uscita dalle funzioni                   *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-sts      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo di elemento trovato nella scansione          *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-tip      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice numerico elemento trovato                  *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-num      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice alfanumerico elemento trovato              *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-alf      pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Livello di profondita' elemento trovato           *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-liv      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Quantita' totale relativa all'elemento trovato    *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-qta      pic s9(08)v9(03)            .
      *            *---------------------------------------------------*
      *            * Flag di anagrafica elemento esistente             *
      *            *  - Spaces : Si                                    *
      *            *  - #      : No                                    *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-ana      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Descrizione da anagrafica elemento                *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-des      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Unita' di misura da anagrafica elemento           *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-umi      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Numero decimali quantita' da anagrafica elemento  *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-dec      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di lavoro                                        *
      *        *-------------------------------------------------------*
           05  w-esp-scl-dtp-war.
      *            *---------------------------------------------------*
      *            * Livello di profondita' interno                    *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-wlp      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Salvataggio livello di profondita' interno attu-  *
      *            * ale                                               *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-wls      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Segnale di prossima operazione da eseguire        *
      *            *  - S : Start sul livello di profondita' attuale   *
      *            *  - U : Incremento di un livello e quindi 'start'  *
      *            *        sul livello di profondita' aumentato       *
      *            *  - N : Read Next sul livello di profondita' attu- *
      *            *        ale                                        *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-wpo      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tabella per ogni livello, max 50                  *
      *            *---------------------------------------------------*
               10  w-esp-scl-dtp-wtb occurs 50.
      *                *-----------------------------------------------*
      *                * Tipo di elemento                              *
      *                *  - 01 : Prodotto finito                       *
      *                *  - 02 : Semilavorato                          *
      *                *  - 03 : Materia prima                         *
      *                *  - 99 : Subdistinta virtuale                  *
      *                *-----------------------------------------------*
                   15  w-esp-scl-dtp-wti  pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Codice numerico elemento                      *
      *                *-----------------------------------------------*
                   15  w-esp-scl-dtp-wnu  pic  9(07)                  .
      *                *-----------------------------------------------*
      *                * Codice alfanumerico elemento                  *
      *                *-----------------------------------------------*
                   15  w-esp-scl-dtp-wal  pic  x(14)                  .
      *                *-----------------------------------------------*
      *                * Numero progressivo di riga distinta           *
      *                *-----------------------------------------------*
                   15  w-esp-scl-dtp-wrg  pic  9(05)                  .
      *                *-----------------------------------------------*
      *                * Quantita' relativa all'elemento               *
      *                *-----------------------------------------------*
                   15  w-esp-scl-dtp-wqt  pic s9(08)v9(03)            .
      *                *-----------------------------------------------*
      *                * Elemento anagraficamente esistente            *
      *                *  - Spaces : Si                                *
      *                *  - #      : No                                *
      *                *-----------------------------------------------*
                   15  w-esp-scl-dtp-wes  pic  x(01)                  .
      *                *-----------------------------------------------*
      *                * Descrizione anagrafica per l'elemento         *
      *                *-----------------------------------------------*
                   15  w-esp-scl-dtp-wde  pic  x(40)                  .
      *                *-----------------------------------------------*
      *                * Unita' di misura per l'elemento               *
      *                *-----------------------------------------------*
                   15  w-esp-scl-dtp-wum  pic  x(03)                  .
      *                *-----------------------------------------------*
      *                * Numero decimali per quantita'                 *
      *                *-----------------------------------------------*
                   15  w-esp-scl-dtp-wnd  pic  9(01)                  .

      *    *===========================================================*
      *    * Work-area per routine di visualizzazione                  *
      *    *-----------------------------------------------------------*
       01  w-vis.
      *        *-------------------------------------------------------*
      *        * Comodo per numero pagina di stampa                    *
      *        *-------------------------------------------------------*
           05  w-vis-num-pag              pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Area per centratura titolo                            *
      *        *-------------------------------------------------------*
           05  w-cen-tit.
               10  w-cen-tit-asx          pic  x(40)                  .
               10  w-cen-tit-ctr          pic  9(02)                  .
               10  w-cen-tit-cen          pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per quantita' da esplodere in alto a destra      *
      *        *-------------------------------------------------------*
           05  w-vis-qde.
               10  w-vis-qde-edt          pic  x(18)                  .
               10  w-vis-qde-umi          pic  x(03)                  .
               10  w-vis-qde-qta          pic  x(14)                  .
               10  w-vis-qde-ctr          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per editing codice numerico a alfanumerico     *
      *        *-------------------------------------------------------*
           05  w-vis-edt-cod              pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Work per displacement di visualizzazione              *
      *        *-------------------------------------------------------*
           05  w-vis-dsp-vis              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per visualizzazione a piede video, in pre mark-  *
      *        * point, della quantita' di impiego, sia moltiplicatore *
      *        * che divisore                                          *
      *        *-------------------------------------------------------*
           05  w-vis-med.
               10  w-vis-med-edt          pic  x(30)                  .
               10  w-vis-med-ipm          pic  x(14)                  .
               10  w-vis-med-ipd          pic  x(14)                  .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  filler                 pic  x(01)                  .

      *================================================================*
       Linkage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
           05  i-ide-sap                  pic  x(03)                  .
           05  i-ide-arg                  pic  x(03)                  .
           05  i-ide-set                  pic  x(03)                  .
           05  i-ide-fas                  pic  x(06)                  .
           05  i-ide-pro                  pic  x(10)                  .
           05  i-ide-des                  pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per richiamo overlay per l'esecuzione effettiva *
      *    * del tipo di interrogazione                                *
      *    *-----------------------------------------------------------*
       01  w-ovy-exe.
      *        *-------------------------------------------------------*
      *        * Pathname per il richiamo della overlay                *
      *        *-------------------------------------------------------*
           05  w-ovy-exe-pat.
      *            *---------------------------------------------------*
      *            * Prefisso comune                                   *
      *            *---------------------------------------------------*
               10  w-ovy-exe-pre          pic  x(16)                  .
      *            *---------------------------------------------------*
      *            * Postfisso variabile                               *
      *            *---------------------------------------------------*
               10  w-ovy-exe-pos          pic  x(10)                  .
      *        *-------------------------------------------------------*
      *        * Salvataggio per il postfisso variabile                *
      *        *-------------------------------------------------------*
           05  w-ovy-exe-inx              pic  9(02)                  .
           05  w-ovy-exe-spv occurs 20    pic  x(10)                  .

      *    *===========================================================*
      *    * Work-area per tipi interrogazione                         *
      *    *-----------------------------------------------------------*
       01  w-tin.
      *        *-------------------------------------------------------*
      *        * Tabella tipi interrogazione e dati ad essi associati  *
      *        *-------------------------------------------------------*
           05  w-tin-tbl-tin.
      *            *---------------------------------------------------*
      *            * Indice per puntamento su elemento in tabella ed   *
      *            * altri indici di comodo                            *
      *            *---------------------------------------------------*
               10  w-tin-ele-inx          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Comodo per caricamento iniziale elementi          *
      *            *---------------------------------------------------*
               10  w-tin-ele-wci.
                   15  w-tin-ele-wci-des  pic  x(50)                  .
                   15  w-tin-ele-wci-ast  pic  x(01)                  .
                   15  w-tin-ele-wci-alf  pic  x(10)                  .
                   15  filler             pic  x(01)                  .
                   15  w-tin-ele-wci-ovy  pic  x(10)                  .
      *            *---------------------------------------------------*
      *            * Numero effettivo di elementi in tabella           *
      *            *---------------------------------------------------*
               10  w-tin-ele-num          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero di elementi selezionabili per impostazio-  *
      *            * ne, cioe' escludendo quelli finali asteriscati    *
      *            *---------------------------------------------------*
               10  w-tin-ele-nes          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero di elementi per pagina                     *
      *            *---------------------------------------------------*
               10  w-tin-ele-nep          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero di pagine totali con elementi selezionabi- *
      *            * li                                                *
      *            *---------------------------------------------------*
               10  w-tin-ele-npt          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina attualmente visualizzata            *
      *            *---------------------------------------------------*
               10  w-tin-ele-pag          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Max numero di elementi in tabella                 *
      *            *---------------------------------------------------*
               10  w-tin-ele-max          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Elementi per tipi interrogazione                  *
      *            *---------------------------------------------------*
               10  w-tin-ele-tin occurs 50.
      *                *-----------------------------------------------*
      *                * Codice numerico tipo interrogazione           *
      *                *-----------------------------------------------*
                   15  w-tin-num-tin      pic  9(04)                  .
      *                *-----------------------------------------------*
      *                * Sigla alfanumerica tipo interrogazione        *
      *                *-----------------------------------------------*
                   15  w-tin-alf-tin      pic  x(10)                  .
      *                *-----------------------------------------------*
      *                * Descrizione tipo interrogazione               *
      *                *-----------------------------------------------*
                   15  w-tin-des-tin      pic  x(50)                  .
      *                *-----------------------------------------------*
      *                * Overlay da richiamare per il tipo di interro- *
      *                * gazione                                       *
      *                *-----------------------------------------------*
                   15  w-tin-ovy-tin      pic  x(10)                  .

      *    *===========================================================*
      *    * Work-area per sottoprogrammi attivi della fase            *
      *    *-----------------------------------------------------------*
       01  w-spg.
      *        *-------------------------------------------------------*
      *        * Work per test se sottoprogramma gia' attivo, codice   *
      *        * alfanumerico del tipo di interrogazione               *
      *        *-------------------------------------------------------*
           05  w-spg-alf-gat              pic  x(10)                  .
      *        *-------------------------------------------------------*
      *        * Work per test se sottoprogramma gia' attivo, risposta *
      *        * - Spaces : No                                         *
      *        * - S      : Si                                         *
      *        *-------------------------------------------------------*
           05  w-spg-snx-gat              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Tabella dei sottoprogrammi attivi                     *
      *        *-------------------------------------------------------*
           05  w-spg-tbl-spg.
      *            *---------------------------------------------------*
      *            * Indice per puntamento in tabella                  *
      *            *---------------------------------------------------*
               10  w-spg-ele-inx          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero effettivo di elementi in tabella           *
      *            *---------------------------------------------------*
               10  w-spg-ele-num          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Max numero di elementi in tabella                 *
      *            *---------------------------------------------------*
               10  w-spg-ele-max          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Elementi per sottoprogrammi attivi                *
      *            *---------------------------------------------------*
               10  w-spg-ele-spg occurs 99.
      *                *-----------------------------------------------*
      *                * Sigla alfanumerica tipo interrogazione        *
      *                *-----------------------------------------------*
                   15  w-spg-alf-tin      pic  x(10)                  .

      ******************************************************************
       Procedure Division                using i-ide
                                               w-ovy-exe
                                               w-tin
                                               w-spg                  .
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
           if        w-cnt-pre-tip-fun    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Segnale primo giro di esecuzione                *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-prm-gir      .
      *              *-------------------------------------------------*
      *              * Se no richieste : a esecuzione interrogazione   *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-500.
       main-250.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-500.
      *              *-------------------------------------------------*
      *              * Esecuzione programma di interrogazione          *
      *              *-------------------------------------------------*
           perform   qry-rou-pri-000      thru qry-rou-pri-999        .
      *              *-------------------------------------------------*
      *              * Se no richieste : a fine programma              *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Test se fine esecuzione da operatore            *
      *              *-------------------------------------------------*
           if        w-cnt-qry-rou-pri    not  = spaces
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Segnale non piu' primo giro di esecuzione       *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-prm-gir      .
      *              *-------------------------------------------------*
      *              * Test se tipo esecuzione ciclico                 *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S" or
                     w-cnt-fun-snx-cic    not  = "S"
                     go to main-750
           else      go to main-250.
       main-750.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Esecuzione routine post-esecuzione programma    *
      *              *-------------------------------------------------*
           perform   pos-exe-pgm-000      thru pos-exe-pgm-999        .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      w-des-tit-pgm-ovy    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Routine principale                       *
      *    *-----------------------------------------------------------*
       qry-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-rou-pri      .
      *              *-------------------------------------------------*
      *              * Determinazione function-keys in Mark-points     *
      *              *-------------------------------------------------*
           perform   qry-det-fky-000      thru qry-det-fky-999        .
      *              *-------------------------------------------------*
      *              * Begin o Begin Automatico                        *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-aut    =    "S"
                     move   "BA"          to   v-ope
           else      move   "BE"          to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           perform   qry-opn-fls-000      thru qry-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Inizializzazione marker di primo giro           *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   qry-str-ini-000      thru qry-str-ini-999        .
           if        w-cnt-qry-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-qry-flg-sub
                     go to  qry-rou-pri-600.
       qry-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-qry-sav-l05      .
           move      w-rot-l04            to   w-cnt-qry-sav-l04      .
           move      w-rot-l03            to   w-cnt-qry-sav-l03      .
           move      w-rot-l02            to   w-cnt-qry-sav-l02      .
           move      w-rot-l01            to   w-cnt-qry-sav-l01      .
       qry-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   qry-let-seq-000      thru qry-let-seq-999        .
           if        w-cnt-qry-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-qry-flg-sub
                     go to  qry-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   qry-tst-max-000      thru qry-tst-max-999        .
           if        w-cnt-qry-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-qry-flg-sub
                     go to  qry-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   qry-sel-rec-000      thru qry-sel-rec-999        .
           if        w-cnt-qry-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-qry-flg-sub
                     go to  qry-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   qry-cmp-rot-000      thru qry-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-qry-mrk-uno    not  = spaces
                     go to qry-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   qry-rou-pri-790      thru qry-rou-pri-791        .
           perform   qry-rou-pri-750      thru qry-rou-pri-751        .
           perform   qry-rou-pri-740      thru qry-rou-pri-741        .
           perform   qry-rou-pri-730      thru qry-rou-pri-731        .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-qry-sav-l05
                     go to qry-rou-pri-310.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l05    to   w-rot-l05              .
           move      w-cnt-qry-sav-l04    to   w-rot-l04              .
           move      w-cnt-qry-sav-l03    to   w-rot-l03              .
           move      w-cnt-qry-sav-l02    to   w-rot-l02              .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           perform   qry-rou-pri-830      thru qry-rou-pri-831        .
           perform   qry-rou-pri-840      thru qry-rou-pri-841        .
           perform   qry-rou-pri-850      thru qry-rou-pri-851        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-750      thru qry-rou-pri-751        .
           perform   qry-rou-pri-740      thru qry-rou-pri-741        .
           perform   qry-rou-pri-730      thru qry-rou-pri-731        .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-qry-sav-l04
                     go to qry-rou-pri-320.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l04    to   w-rot-l04              .
           move      w-cnt-qry-sav-l03    to   w-rot-l03              .
           move      w-cnt-qry-sav-l02    to   w-rot-l02              .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           perform   qry-rou-pri-830      thru qry-rou-pri-831        .
           perform   qry-rou-pri-840      thru qry-rou-pri-841        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-740      thru qry-rou-pri-741        .
           perform   qry-rou-pri-730      thru qry-rou-pri-731        .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-qry-sav-l03
                     go to qry-rou-pri-330.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l03    to   w-rot-l03              .
           move      w-cnt-qry-sav-l02    to   w-rot-l02              .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           perform   qry-rou-pri-830      thru qry-rou-pri-831        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-730      thru qry-rou-pri-731        .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-qry-sav-l02
                     go to qry-rou-pri-340.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l02    to   w-rot-l02              .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-720      thru qry-rou-pri-721        .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
           go to     qry-rou-pri-400.
       qry-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-qry-sav-l01
                     go to qry-rou-pri-400.
           move      w-rot                to   w-cnt-qry-sav-rot      .
           move      w-cnt-qry-sav-l01    to   w-rot-l01              .
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           move      w-cnt-qry-sav-rot    to   w-rot                  .
           perform   qry-rou-pri-710      thru qry-rou-pri-711        .
       qry-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Livello di dettaglio                            *
      *              *-------------------------------------------------*
           perform   qry-liv-det-000      thru qry-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione : fine ciclo         *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-qry-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     qry-rou-pri-100.
       qry-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-mrk-uno    =    spaces
                     go to qry-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Fine di tutti i livelli                         *
      *              *-------------------------------------------------*
           perform   qry-rou-pri-810      thru qry-rou-pri-811        .
           perform   qry-rou-pri-820      thru qry-rou-pri-821        .
           perform   qry-rou-pri-830      thru qry-rou-pri-831        .
           perform   qry-rou-pri-840      thru qry-rou-pri-841        .
           perform   qry-rou-pri-850      thru qry-rou-pri-851        .
           perform   qry-rou-pri-890      thru qry-rou-pri-891        .
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Stop                                            *
      *              *-------------------------------------------------*
           move      "ST"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Subroutine di avanzamento pagina                *
      *              *-------------------------------------------------*
           perform   qry-pag-adv-000      thru qry-pag-adv-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     qry-rou-pri-900.
       qry-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   qry-nes-ela-000      thru qry-nes-ela-999        .
           go to     qry-rou-pri-900.
       qry-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-711.
           perform   qry-ini-lr1-000      thru qry-ini-lr1-999        .
       qry-rou-pri-711.
           exit.
       qry-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-721.
           perform   qry-ini-lr2-000      thru qry-ini-lr2-999        .
       qry-rou-pri-721.
           exit.
       qry-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-731.
           perform   qry-ini-lr3-000      thru qry-ini-lr3-999        .
       qry-rou-pri-731.
           exit.
       qry-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-741.
           perform   qry-ini-lr4-000      thru qry-ini-lr4-999        .
       qry-rou-pri-741.
           exit.
       qry-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-751.
           perform   qry-ini-lr5-000      thru qry-ini-lr5-999        .
       qry-rou-pri-751.
           exit.
       qry-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-791.
           perform   qry-ini-cic-000      thru qry-ini-cic-999        .
       qry-rou-pri-791.
           exit.
       qry-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-811.
           perform   qry-fin-lr1-000      thru qry-fin-lr1-999        .
       qry-rou-pri-811.
           exit.
       qry-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-821.
           perform   qry-fin-lr2-000      thru qry-fin-lr2-999        .
       qry-rou-pri-821.
           exit.
       qry-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-831.
           perform   qry-fin-lr3-000      thru qry-fin-lr3-999        .
       qry-rou-pri-831.
           exit.
       qry-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-841.
           perform   qry-fin-lr4-000      thru qry-fin-lr4-999        .
       qry-rou-pri-841.
           exit.
       qry-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-851.
           perform   qry-fin-lr5-000      thru qry-fin-lr5-999        .
       qry-rou-pri-851.
           exit.
       qry-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-rou-pri-891.
           perform   qry-fin-cic-000      thru qry-fin-cic-999        .
       qry-rou-pri-891.
           exit.
       qry-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   qry-cls-fls-000      thru qry-cls-fls-999        .
       qry-rou-pri-950.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Subroutine di avanzamento pagina         *
      *    *-----------------------------------------------------------*
       qry-pag-adv-000.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Test su esito interazione con operatore         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se continuazione normale                    *
      *                  *---------------------------------------------*
           if        v-key                =    spaces
                     go to qry-pag-adv-999.
      *                  *---------------------------------------------*
      *                  * Se interruzione forzata da operatore        *
      *                  *---------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "#"            to   w-cnt-qry-flg-int
                     go to qry-pag-adv-999.
      *                  *---------------------------------------------*
      *                  * Se function-key prevista                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Trattamento function-key                *
      *                      *-----------------------------------------*
           perform   qry-trt-fun-000      thru qry-trt-fun-999        .
      *                      *-----------------------------------------*
      *                      * Test su rientro da trattamento f-key    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se fine ciclo interrogazione   *
      *                          *-------------------------------------*
           if        w-cnt-qry-flg-int    =    spaces
                     go to qry-pag-adv-000.
       qry-pag-adv-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Lettura della variabile eventuale di i.p.c. per *
      *              * il tipo di chiamante del sottoprogramma, se il  *
      *              * main oppure se un altro sottoprogramma          *
      *              *-------------------------------------------------*
           perform   ipc-tdc-mos-000      thru ipc-tdc-mos-999        .
      *              *-------------------------------------------------*
      *              * Lettura della variabile eventuale di i.p.c. per *
      *              * l'ammissibilita' del tasto Slct                 *
      *              *-------------------------------------------------*
           perform   ipc-snx-slc-000      thru ipc-snx-slc-999        .
      *              *-------------------------------------------------*
      *              * Lettura della variabile eventuale di i.p.c. per *
      *              * il codice numerico dell'assieme di tipo pro-    *
      *              * dotto di vendita                                *
      *              *-------------------------------------------------*
           perform   ipc-num-ass-000      thru ipc-num-ass-999        .
      *              *-------------------------------------------------*
      *              * Memorizzazione sottoprogramma in attivita'      *
      *              *-------------------------------------------------*
           move      "ESCPRO    "         to   w-spg-alf-gat          .
           perform   mem-spg-att-000      thru mem-spg-att-999        .
      *              *-------------------------------------------------*
      *              * Se memorizzazione non avvenuta : uscita con er- *
      *              * rore                                            *
      *              *-------------------------------------------------*
           if        w-spg-snx-gat        not  = spaces
                     move  "#"            to   w-cnt-pre-exe-pgm
                     go to pre-exe-pgm-999.
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Routine post-esecuzione programma                         *
      *    *-----------------------------------------------------------*
       pos-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Eliminazione sottoprogramma in attivita'        *
      *              *-------------------------------------------------*
           move      "ESCPRO    "         to   w-spg-alf-gat          .
           perform   eli-spg-att-000      thru eli-spg-att-999        .
       pos-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura della variabile eventuale di i.p.c. per il tipo   *
      *    * di chiamante del sottoprogramma, se il main o un altro    *
      *    * sottoprogramma                                            *
      *    *-----------------------------------------------------------*
       ipc-tdc-mos-000.
      *              *-------------------------------------------------*
      *              * Estrazione della variabile 'tdc-mos' dallo      *
      *              * stesso livello di profondita'                   *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "tdc-mos"            to   s-var                  .
           move      "="                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito dell'operazione *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     go to ipc-tdc-mos-200
           else      go to ipc-tdc-mos-400.
       ipc-tdc-mos-200.
      *              *-------------------------------------------------*
      *              * Se variabile esistente                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile esistente              *
      *                  *---------------------------------------------*
           move      "S"                  to   w-ipc-tdc-mos-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile                      *
      *                  *---------------------------------------------*
           move      s-alf                to   w-ipc-tdc-mos-val      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-tdc-mos-999.
       ipc-tdc-mos-400.
      *              *-------------------------------------------------*
      *              * Se variabile non esistente                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile non esistente          *
      *                  *---------------------------------------------*
           move      "N"                  to   w-ipc-tdc-mos-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile a spaces             *
      *                  *---------------------------------------------*
           move      spaces               to   w-ipc-tdc-mos-val      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-tdc-mos-999.
       ipc-tdc-mos-999.
           exit.

      *    *===========================================================*
      *    * Lettura della variabile eventuale di i.p.c. per l'ammis-  *
      *    * sibilita' del tasto Slct                                  *
      *    *-----------------------------------------------------------*
       ipc-snx-slc-000.
      *              *-------------------------------------------------*
      *              * Estrazione della variabile 'snx-slc' dallo      *
      *              * stesso livello di profondita'                   *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "snx-slc"            to   s-var                  .
           move      "="                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito dell'operazione *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     go to ipc-snx-slc-200
           else      go to ipc-snx-slc-400.
       ipc-snx-slc-200.
      *              *-------------------------------------------------*
      *              * Se variabile esistente                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile esistente              *
      *                  *---------------------------------------------*
           move      "S"                  to   w-ipc-snx-slc-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile                      *
      *                  *---------------------------------------------*
           move      s-alf                to   w-ipc-snx-slc-val      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-snx-slc-999.
       ipc-snx-slc-400.
      *              *-------------------------------------------------*
      *              * Se variabile non esistente                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile non esistente          *
      *                  *---------------------------------------------*
           move      "N"                  to   w-ipc-snx-slc-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile a spaces             *
      *                  *---------------------------------------------*
           move      spaces               to   w-ipc-snx-slc-val      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-snx-slc-999.
       ipc-snx-slc-999.
           exit.

      *    *===========================================================*
      *    * Lettura della variabile eventuale di i.p.c. per il codice *
      *    * numerico dell'assieme di tipo prodotto di vendita         *
      *    *-----------------------------------------------------------*
       ipc-num-ass-000.
      *              *-------------------------------------------------*
      *              * Estrazione della variabile 'num-ass' dal livel- *
      *              * lo di profondita' precedente o dallo stesso li- *
      *              * vello di profondita' applicativa a seconda se   *
      *              * il sottoprogramma e' stato richiamato dal main  *
      *              * oppure da un sottoprogramma dello stesso livel- *
      *              * lo                                              *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "num-ass"            to   s-var                  .
           if        w-ipc-tdc-mos-snx    =    "S" and
                     w-ipc-tdc-mos-val    =    "M"
                     move  "-"            to   s-dop
           else      move  "="            to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito dell'operazione *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     go to ipc-num-ass-200
           else      go to ipc-num-ass-400.
       ipc-num-ass-200.
      *              *-------------------------------------------------*
      *              * Se variabile esistente                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile esistente              *
      *                  *---------------------------------------------*
           move      "S"                  to   w-ipc-num-ass-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile                      *
      *                  *---------------------------------------------*
           move      s-num                to   w-ipc-num-ass-val      .
      *                  *---------------------------------------------*
      *                  * Se valore della variabile a zero : come se  *
      *                  * variabile non esistente                     *
      *                  *---------------------------------------------*
           if        w-ipc-num-ass-val    =    zero
                     go to ipc-num-ass-400.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-num-ass-999.
       ipc-num-ass-400.
      *              *-------------------------------------------------*
      *              * Se variabile non esistente                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di variabile non esistente          *
      *                  *---------------------------------------------*
           move      "N"                  to   w-ipc-num-ass-snx      .
      *                  *---------------------------------------------*
      *                  * Valore della variabile a zero               *
      *                  *---------------------------------------------*
           move      zero                 to   w-ipc-num-ass-val      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ipc-num-ass-999.
       ipc-num-ass-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-tip-fun      .
       pre-tip-fun-100.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se variabile di i.p.c. re- *
      *              * lativa al codice numerico dell'assieme esisten- *
      *              * te oppure no                                    *
      *              *-------------------------------------------------*
           if        w-ipc-num-ass-snx    =    "S"
                     go to pre-tip-fun-300.
       pre-tip-fun-200.
      *              *-------------------------------------------------*
      *              * Se variabile non esistente                      *
      *              *-------------------------------------------------*
       pre-tip-fun-210.
      *                  *---------------------------------------------*
      *                  * Si/No richieste ad utente : Si              *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *                  *---------------------------------------------*
      *                  * Si/No funzionamento ciclico : Si            *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-cic      .
      *                  *---------------------------------------------*
      *                  * Si/No funzionamento automatico : Si         *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-aut      .
       pre-tip-fun-220.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pre-tip-fun-999.
       pre-tip-fun-300.
      *              *-------------------------------------------------*
      *              * Se variabile esistente                          *
      *              *-------------------------------------------------*
       pre-tip-fun-310.
      *                  *---------------------------------------------*
      *                  * Open file [dcp]                             *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
       pre-tip-fun-320.
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcp]                      *
      *                  *---------------------------------------------*
           move      w-ipc-num-ass-val    to   w-let-arc-dcp-num      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
       pre-tip-fun-330.
      *                  *---------------------------------------------*
      *                  * Close file [dcp]                            *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
       pre-tip-fun-340.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se record [dcp] esi-   *
      *                  * stente oppure no                            *
      *                  *---------------------------------------------*
           if        w-let-arc-dcp-flg    not  = spaces
                     go to pre-tip-fun-700.
       pre-tip-fun-400.
      *                  *---------------------------------------------*
      *                  * Se record [dcp] esistente                   *
      *                  *---------------------------------------------*
       pre-tip-fun-410.
      *                      *-----------------------------------------*
      *                      * Preparazione dati per richieste da ana- *
      *                      * grafica prodotto                        *
      *                      *-----------------------------------------*
       pre-tip-fun-411.
      *                          *-------------------------------------*
      *                          * Codice numerico                     *
      *                          *-------------------------------------*
           move      w-let-arc-dcp-num    to   rr-num-ass             .
      *                          *-------------------------------------*
      *                          * Codice alfanumerico                 *
      *                          *-------------------------------------*
           move      w-let-arc-dcp-alf    to   rr-alf-ass             .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      w-let-arc-dcp-des    to   rr-des-ass             .
      *                          *-------------------------------------*
      *                          * Unita' di misura                    *
      *                          *-------------------------------------*
           move      w-let-arc-dcp-umi    to   rr-umi-ass             .
      *                          *-------------------------------------*
      *                          * Numero decimali quantita'           *
      *                          *-------------------------------------*
           move      w-let-arc-dcp-deq    to   rr-deq-ass             .
       pre-tip-fun-420.
      *                      *-----------------------------------------*
      *                      * Preparazione dati per richieste forzati *
      *                      *-----------------------------------------*
       pre-tip-fun-421.
      *                          *-------------------------------------*
      *                          * Quantita' da esplodere              *
      *                          *-------------------------------------*
           move      1                    to   rr-qde-ass             .
       pre-tip-fun-430.
      *                      *-----------------------------------------*
      *                      * Open file [lgt]                         *
      *                      *-----------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dtp/fls/ioc/obj/ioflgt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgt                 .
       pre-tip-fun-440.
      *                      *-----------------------------------------*
      *                      * Lettura archivio [lgt] per il prodotto  *
      *                      * di vendita                              *
      *                      *-----------------------------------------*
           move      01                   to   w-let-arc-lgt-tip      .
           move      rr-num-ass           to   w-let-arc-lgt-num      .
           perform   let-arc-lgt-000      thru let-arc-lgt-999        .
       pre-tip-fun-450.
      *                      *-----------------------------------------*
      *                      * Close file [lgt]                        *
      *                      *-----------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dtp/fls/ioc/obj/ioflgt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgt                 .
       pre-tip-fun-460.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda se record [lgt]    *
      *                      * esistente oppure no                     *
      *                      *-----------------------------------------*
           if        w-let-arc-lgt-flg    not  = spaces
                     go to pre-tip-fun-600.
       pre-tip-fun-500.
      *                      *-----------------------------------------*
      *                      * Se record [lgt] esistente               *
      *                      *-----------------------------------------*
       pre-tip-fun-510.
      *                          *-------------------------------------*
      *                          * Si/No richieste ad utente : No      *
      *                          *-------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-ric      .
      *                          *-------------------------------------*
      *                          * Si/No funzionamento ciclico : No    *
      *                          *-------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-cic      .
      *                          *-------------------------------------*
      *                          * Si/No funzionamento automatico : Si *
      *                          *-------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-aut      .
       pre-tip-fun-520.
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     pre-tip-fun-999.
       pre-tip-fun-600.
      *                      *-----------------------------------------*
      *                      * Se record [lgt] non esistente           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Emissione messaggio di errore       *
      *                          *-------------------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "Distinta base per prodotto "
                                delimited by   size
                     rr-alf-ass
                                delimited by   spaces
                     " non esistente !"
                                delimited by   size
                                          into w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                          *-------------------------------------*
      *                          * Status di uscita ad errore          *
      *                          *-------------------------------------*
           move      "#"                  to   w-cnt-pre-tip-fun      .
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     pre-tip-fun-999.
       pre-tip-fun-700.
      *                  *---------------------------------------------*
      *                  * Se record [dcp] non esistente               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Preparazione codice numerico editato    *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-let-arc-dcp-num    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Emissione messaggio di errore           *
      *                      *-----------------------------------------*
           move      spaces               to   w-err-box-err-msg      .
           string    "Anagrafica prodotto codice ("
                                delimited by   size
                     v-edt
                                delimited by   spaces
                     ") non esistente in archivio !"
                                delimited by   size
                                          into w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * Status di uscita ad errore              *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-pre-tip-fun      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     pre-tip-fun-999.
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice prodotto 'dcp'  *
      *              *-------------------------------------------------*
           perform   cod-cod-dcp-opn-000  thru cod-cod-dcp-opn-999    .
      *              *-------------------------------------------------*
      *              * Open file relative di appoggio [rel]            *
      *              *-------------------------------------------------*
           perform   fil-rel-opn-000      thru fil-rel-opn-999        .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [dps]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
      *              *-------------------------------------------------*
      *              * [dpm]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * [lgt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dtp/fls/ioc/obj/ioflgt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgt                 .
      *              *-------------------------------------------------*
      *              * [lgr]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dtp/fls/ioc/obj/ioflgr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgr                 .
      *              *-------------------------------------------------*
      *              * [lgv]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dtp/fls/ioc/obj/ioflgv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgv                 .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice prodotto 'dcp' *
      *              *-------------------------------------------------*
           perform   cod-cod-dcp-cls-000  thru cod-cod-dcp-cls-999    .
      *              *-------------------------------------------------*
      *              * Close file relative di appoggio [rel]           *
      *              *-------------------------------------------------*
           perform   fil-rel-cls-000      thru fil-rel-cls-999        .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [dps]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
      *              *-------------------------------------------------*
      *              * [dpm]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *              *-------------------------------------------------*
      *              * [lgt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dtp/fls/ioc/obj/ioflgt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgt                 .
      *              *-------------------------------------------------*
      *              * [lgr]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dtp/fls/ioc/obj/ioflgr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgr                 .
      *              *-------------------------------------------------*
      *              * [lgv]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dtp/fls/ioc/obj/ioflgv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgv                 .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Codice assieme                              *
      *                  *---------------------------------------------*
           perform   acc-cod-ass-000      thru acc-cod-ass-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
       acc-ric-sel-200.
      *                  *---------------------------------------------*
      *                  * Quantita' da esplodere                      *
      *                  *---------------------------------------------*
           perform   acc-qde-ass-000      thru acc-qde-ass-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-100.
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "Conferma esecuzione esplosione scalare (S/N/E) ?"
                                          to   v-not                  .
           move      "S"                  to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else if   v-key                =    "UP  "
                     go to acc-ric-sel-950
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-950.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazioni                         *
      *                      *-----------------------------------------*
           go to     acc-ric-sel-100.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Prompts                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice assieme                              *
      *                  *---------------------------------------------*
           perform   pmt-cod-ass-000      thru pmt-cod-ass-999        .
      *                  *---------------------------------------------*
      *                  * Quantita' da esplodere                      *
      *                  *---------------------------------------------*
           perform   pmt-qde-ass-000      thru pmt-qde-ass-999        .
       pmt-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Se questo e' il primo ciclo di esecuzione : si  *
      *              * esce                                            *
      *              *-------------------------------------------------*
           if        w-cnt-fun-prm-gir    =    "S"
                     go to pmt-ric-sel-999.
       pmt-ric-sel-400.
      *              *-------------------------------------------------*
      *              * Visualizzazione valori                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice assieme                              *
      *                  *---------------------------------------------*
           perform   vis-cod-ass-000      thru vis-cod-ass-999        .
      *                  *---------------------------------------------*
      *                  * Quantita' da esplodere                      *
      *                  *---------------------------------------------*
           perform   vis-qde-ass-000      thru vis-qde-ass-999        .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Codice assieme di tipo prodotto di vendita       *
      *    *-----------------------------------------------------------*
       pmt-cod-ass-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      24                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice prodotto        :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cod-ass-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Quantita' da esplodere                           *
      *    *-----------------------------------------------------------*
       pmt-qde-ass-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      24                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Quantita' da esplodere :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-qde-ass-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Codice assieme di tipo prodotto di vendita *
      *    *-----------------------------------------------------------*
       acc-cod-ass-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cod-ass-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-dcp-ope      .
           move      "A"                  to   w-cod-cod-dcp-tac      .
           move      rr-num-ass           to   w-cod-cod-dcp-num      .
           move      rr-alf-ass           to   w-cod-cod-dcp-alf      .
           move      05                   to   w-cod-cod-dcp-lin      .
           move      26                   to   w-cod-cod-dcp-pos      .
           move      05                   to   w-cod-cod-dcp-dln      .
           move      41                   to   w-cod-cod-dcp-dps      .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-dcp-cll-000  thru cod-cod-dcp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dcp-foi-000  thru cod-cod-dcp-foi-999    .
       acc-cod-ass-110.
           perform   cod-cod-dcp-cll-000  thru cod-cod-dcp-cll-999    .
           if        w-cod-cod-dcp-ope    =    "F+"
                     go to acc-cod-ass-115.
           if        w-cod-cod-dcp-ope    =    "AC"
                     go to acc-cod-ass-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-ass-115.
           perform   cod-cod-dcp-foi-000  thru cod-cod-dcp-foi-999    .
           go to     acc-cod-ass-110.
       acc-cod-ass-120.
           move      w-cod-cod-dcp-num    to   v-num                  .
           move      w-cod-cod-dcp-alf    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-cod-ass-999.
       acc-cod-ass-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-num-ass             .
           move      v-alf                to   rr-alf-ass             .
       acc-cod-ass-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cod-ass-420.
      *                  *---------------------------------------------*
      *                  * Lettura archivio [dcp]                      *
      *                  *---------------------------------------------*
           move      rr-num-ass           to   w-let-arc-dcp-num      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione, unita' di mi-   *
      *                  * sura, e numero decimali quantita' assieme   *
      *                  *---------------------------------------------*
           move      w-let-arc-dcp-des    to   rr-des-ass             .
           move      w-let-arc-dcp-umi    to   rr-umi-ass             .
           move      w-let-arc-dcp-deq    to   rr-deq-ass             .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-des-ass-000      thru vis-des-ass-999        .
      *                  *---------------------------------------------*
      *                  * Se valore non trovato : reimpostazione      *
      *                  *---------------------------------------------*
           if        w-let-arc-dcp-flg    not  = spaces
                     go to acc-cod-ass-100.
      *                  *---------------------------------------------*
      *                  * Se valore a spaces : reimpostazione a meno  *
      *                  * che non sia stato premuto 'Up'              *
      *                  *---------------------------------------------*
           if        rr-alf-ass           not  = spaces
                     go to acc-cod-ass-440.
           if        v-key                =    "UP  "
                     go to acc-cod-ass-600
           else      go to acc-cod-ass-100.
       acc-cod-ass-440.
      *                  *---------------------------------------------*
      *                  * Test che la distinta base per il prodotto   *
      *                  * finito esista in archivio [lgt]             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica [lgt]                *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "TNMASS"             to   f-key                  .
           move      01                   to   rf-lgt-tpm-ass         .
           move      rr-num-ass           to   rf-lgt-nrm-ass         .
           move      "pgm/dtp/fls/ioc/obj/ioflgt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgt                 .
      *                      *-----------------------------------------*
      *                      * Test di esistenza                       *
      *                      *-----------------------------------------*
           if        f-sts                =    e-not-err
                     go to acc-cod-ass-460.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Non esiste una distinta base per il prodotto di ve
      -              "ndita !        "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-cod-ass-100.
       acc-cod-ass-460.
      *                  *---------------------------------------------*
      *                  * Fine controlli                              *
      *                  *---------------------------------------------*
           go to     acc-cod-ass-600.
       acc-cod-ass-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cod-ass-625.
      *                  *---------------------------------------------*
      *                  * Normalizzazione e visualizzazione della     *
      *                  * quantita' da esplodere in funzione del      *
      *                  * numero decimali quantita'                   *
      *                  *---------------------------------------------*
           if        rr-deq-ass           =    zero
                     divide   1000        into rr-qde-ass
                     multiply 1000        by   rr-qde-ass
           else if   rr-deq-ass           =    1
                     divide   100         into rr-qde-ass
                     multiply 100         by   rr-qde-ass
           else if   rr-deq-ass           =    2
                     divide   10          into rr-qde-ass
                     multiply 10          by   rr-qde-ass
           else if   rr-deq-ass           =    3
                     divide   1           into rr-qde-ass
                     multiply 1           by   rr-qde-ass
           else      divide   1000        into rr-qde-ass
                     multiply 1000        by   rr-qde-ass             .
           perform   vis-qde-ass-000      thru vis-qde-ass-999        .
       acc-cod-ass-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-cod-ass-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-cod-ass-100.
       acc-cod-ass-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice assieme                          *
      *    *-----------------------------------------------------------*
       vis-cod-ass-000.
      *              *-------------------------------------------------*
      *              * Visualizzazione codice alfanumerico             *
      *              *-------------------------------------------------*
           perform   vis-alf-ass-000      thru vis-alf-ass-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione descrizione                     *
      *              *-------------------------------------------------*
           perform   vis-des-ass-000      thru vis-des-ass-999        .
       vis-cod-ass-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice alfanumerico assieme             *
      *    *-----------------------------------------------------------*
       vis-alf-ass-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      14                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      rr-alf-ass           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-alf-ass-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Descrizione assieme                     *
      *    *-----------------------------------------------------------*
       vis-des-ass-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-des-ass           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-des-ass-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Quantita' da esplodere                     *
      *    *-----------------------------------------------------------*
       acc-qde-ass-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-qde-ass-025.
      *                  *---------------------------------------------*
      *                  * Eventuale preparazione del default          *
      *                  *---------------------------------------------*
           if        rr-qde-ass           =    zero
                     move  1              to   rr-qde-ass             .
       acc-qde-ass-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      rr-deq-ass           to   v-dec                  .
           if        v-dec                not  = zero and
                     v-dec                not  = 1    and
                     v-dec                not  = 2    and
                     v-dec                not  = 3
                     move  zero           to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "GB<"                to   v-edm                  .
           move      08                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      rr-qde-ass           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-qde-ass-999.
       acc-qde-ass-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-qde-ass             .
       acc-qde-ass-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-qde-ass-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-qde-ass-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-qde-ass-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-qde-ass-100.
       acc-qde-ass-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Quantita' da esplodere                  *
      *    *-----------------------------------------------------------*
       vis-qde-ass-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      rr-deq-ass           to   v-dec                  .
           if        v-dec                not  = zero and
                     v-dec                not  = 1    and
                     v-dec                not  = 2    and
                     v-dec                not  = 3
                     move  zero           to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "GB<"                to   v-edm                  .
           move      08                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      rr-qde-ass           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-qde-ass-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Controllo su codice assieme                     *
      *              *-------------------------------------------------*
           if        rr-num-ass           not  = zero
                     go to tdo-ric-sel-200.
           move      "Manca il codice del prodotto di vendita           
      -              "               "    to   w-err-box-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Normalizzazione se controlli tutti superati     *
      *              *-------------------------------------------------*
       tdo-ric-sel-210.
      *                  *---------------------------------------------*
      *                  * Quantita' da esplodere                      *
      *                  *---------------------------------------------*
           if        rr-qde-ass           =    zero
                     move  1              to   rr-qde-ass             .
       tdo-ric-sel-300.
      *              *-------------------------------------------------*
      *              * Uscita per controlli superati                   *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
       tdo-ric-sel-905.
      *                  *---------------------------------------------*
      *                  * Emissione messaggio d'errore                *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
       tdo-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Se non e' il primo giro di esecuzione : uscita, *
      *              * conservando le impostazioni precedenti come de- *
      *              * faults                                          *
      *              *-------------------------------------------------*
           if        w-cnt-fun-prm-gir    =    "N"
                     go to nor-ric-sel-999.
       nor-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Normalizzazioni                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice numerico per l'assieme               *
      *                  *---------------------------------------------*
           move      zero                 to   rr-num-ass             .
      *                  *---------------------------------------------*
      *                  * Codice alfanumerico per l'assieme           *
      *                  *---------------------------------------------*
           move      spaces               to   rr-alf-ass             .
      *                  *---------------------------------------------*
      *                  * Descrizione per l'assieme                   *
      *                  *---------------------------------------------*
           move      spaces               to   rr-des-ass             .
      *                  *---------------------------------------------*
      *                  * Unita' di misura per l'assieme              *
      *                  *---------------------------------------------*
           move      spaces               to   rr-umi-ass             .
      *                  *---------------------------------------------*
      *                  * Numero decimali quantita' per l'assieme     *
      *                  *---------------------------------------------*
           move      zero                 to   rr-deq-ass             .
      *                  *---------------------------------------------*
      *                  * Quantita' da esplodere                      *
      *                  *---------------------------------------------*
           move      zero                 to   rr-qde-ass             .
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su tre righe          *
      *    *-----------------------------------------------------------*
       box-msg-e03-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      10                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 03                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m03    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e03-999.
           exit.

      *    *===========================================================*
      *    * Memorizzazione sottoprogramma in attivita'                *
      *    *-----------------------------------------------------------*
       mem-spg-att-000.
      *              *-------------------------------------------------*
      *              * Se numero elementi in tabella gia' pari al mas- *
      *              * simo numero di elementi possibili : uscita per  *
      *              * memorizzazione non avvenuta                     *
      *              *-------------------------------------------------*
           if        w-spg-ele-num        =    w-spg-ele-max
                     move  "N"            to   w-spg-snx-gat
                     go to mem-spg-att-999.
      *              *-------------------------------------------------*
      *              * Incremento numero elementi in tabella           *
      *              *-------------------------------------------------*
           add       1                    to   w-spg-ele-num          .
      *              *-------------------------------------------------*
      *              * Memorizzazione codice alfanumerico del tipo di  *
      *              * interrogazione                                  *
      *              *-------------------------------------------------*
           move      w-spg-alf-gat        to   w-spg-alf-tin
                                              (w-spg-ele-num)         .
      *              *-------------------------------------------------*
      *              * Uscita per memorizzazione avvenuta              *
      *              *-------------------------------------------------*
           move      spaces               to   w-spg-snx-gat          .
       mem-spg-att-999.
           exit.

      *    *===========================================================*
      *    * Eliminazione sottoprogramma in attivita'                  *
      *    *-----------------------------------------------------------*
       eli-spg-att-000.
      *              *-------------------------------------------------*
      *              * Se numero elementi in tabella a zero : uscita   *
      *              *-------------------------------------------------*
           if        w-spg-ele-num        =    zero
                     go to eli-spg-att-999.
      *              *-------------------------------------------------*
      *              * Se l'ultimo elemento in tabella non e' pari a   *
      *              * quello da eliminare : uscita                    *
      *              *-------------------------------------------------*
           if        w-spg-alf-tin
                    (w-spg-ele-num)       not  = w-spg-alf-gat
                     go to eli-spg-att-999.
      *              *-------------------------------------------------*
      *              * Decremento numero elementi in tabella           *
      *              *-------------------------------------------------*
           subtract  1                    from w-spg-ele-num          .
       eli-spg-att-999.
           exit.

      *    *===========================================================*
      *    * Test se sottoprogramma gia' attivo                        *
      *    *-----------------------------------------------------------*
       tst-spg-gat-000.
      *              *-------------------------------------------------*
      *              * Risposta a : non gia' attivo                    *
      *              *-------------------------------------------------*
           move      spaces               to   w-spg-snx-gat          .
      *              *-------------------------------------------------*
      *              * Se codice alfanumerico del tipo di interroga-   *
      *              * zione a spaces : uscita                         *
      *              *-------------------------------------------------*
           if        w-spg-alf-gat        =    spaces
                     go to tst-spg-gat-999.
      *              *-------------------------------------------------*
      *              * Indice per scansione su tabella a zero          *
      *              *-------------------------------------------------*
           move      zero                 to   w-spg-ele-inx          .
       tst-spg-gat-200.
      *              *-------------------------------------------------*
      *              * Incremento indice per scansione su tabella      *
      *              *-------------------------------------------------*
           add       1                    to   w-spg-ele-inx          .
      *              *-------------------------------------------------*
      *              * Se oltre numero elementi memorizzati : uscita   *
      *              *-------------------------------------------------*
           if        w-spg-ele-inx        >    w-spg-ele-num
                     go to tst-spg-gat-999.
      *              *-------------------------------------------------*
      *              * Se l'elemento non e' quello cercato : riciclo   *
      *              * su elemento successivo                          *
      *              *-------------------------------------------------*
           if        w-spg-alf-tin
                    (w-spg-ele-inx)       not  = w-spg-alf-gat
                     go to tst-spg-gat-200.
       tst-spg-gat-400.
      *              *-------------------------------------------------*
      *              * Risposta a : gia' attivo                        *
      *              *-------------------------------------------------*
           move      "S"                  to   w-spg-snx-gat          .
       tst-spg-gat-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Open files                               *
      *    *-----------------------------------------------------------*
       qry-opn-fls-000.
       qry-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Close files                              *
      *    *-----------------------------------------------------------*
       qry-cls-fls-000.
       qry-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Start iniziale                           *
      *    *-----------------------------------------------------------*
       qry-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-sub      .
       qry-str-ini-100.
      *              *-------------------------------------------------*
      *              * Esecuzione funzione New per file relative di    *
      *              * appoggio [rel]                                  *
      *              *-------------------------------------------------*
           perform   fil-rel-new-000      thru fil-rel-new-999        .
       qry-str-ini-200.
      *              *-------------------------------------------------*
      *              * Inizializzazione subroutine di esplosione sca-  *
      *              * lare distinta base                              *
      *              *-------------------------------------------------*
           move      "E-INI"              to   w-esp-scl-dtp-fun      .
           move      01                   to   w-esp-scl-dtp-tde      .
           move      rr-num-ass           to   w-esp-scl-dtp-nde      .
           move      rr-alf-ass           to   w-esp-scl-dtp-ade      .
           move      rr-qde-ass           to   w-esp-scl-dtp-qde      .
           perform   esp-scl-dtp-000      thru esp-scl-dtp-999        .
       qry-str-ini-300.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     qry-str-ini-999.
       qry-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Messaggio per nessuna registrazione      *
      *    *-----------------------------------------------------------*
       qry-nes-ela-000.
      *              *-------------------------------------------------*
      *              * Messaggio di errore                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Composizione 1. riga                        *
      *                  *---------------------------------------------*
           move      "Non esiste alcuna riga di distinta da visualizzare
      -              "               "    to   w-err-box-err-msg      .
      *                  *---------------------------------------------*
      *                  * Composizione 2. riga                        *
      *                  *---------------------------------------------*
           move      spaces               to   w-err-box-err-m02      .
           string    "per il prodotto di vendita con codice "
                                delimited by   size
                     rr-alf-ass
                                delimited by   spaces
                     " !"
                                delimited by   size
                                          into w-err-box-err-m02      .
      *                  *---------------------------------------------*
      *                  * Emissione messaggio in due righe            *
      *                  *---------------------------------------------*
           perform   box-msg-e02-000      thru box-msg-e02-999        .
       qry-nes-ela-100.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     qry-nes-ela-999.
       qry-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Lettura sequenziale                      *
      *    *-----------------------------------------------------------*
       qry-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-sub      .
       qry-let-seq-100.
      *                  *---------------------------------------------*
      *                  * Lettura elemento successivo da esplosione   *
      *                  * scalare distinta base                       *
      *                  *---------------------------------------------*
           move      "E-GET"              to   w-esp-scl-dtp-fun      .
           perform   esp-scl-dtp-000      thru esp-scl-dtp-999        .
      *                  *---------------------------------------------*
      *                  * Se fine scansione distinta : status di u-   *
      *                  * scita ad errore ed uscita                   *
      *                  *---------------------------------------------*
           if        w-esp-scl-dtp-sts    not  = spaces
                     move  "#"            to   w-cnt-qry-flg-sub
                     go to qry-let-seq-999.
       qry-let-seq-200.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     qry-let-seq-999.
       qry-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Test se superamento limiti massimi       *
      *    *-----------------------------------------------------------*
       qry-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-sub      .
       qry-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Selezione su record letto                *
      *    *-----------------------------------------------------------*
       qry-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-sub      .
       qry-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Composizione area per tests di rottura   *
      *    *-----------------------------------------------------------*
       qry-cmp-rot-000.
       qry-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Esecuzione per inizio ciclo              *
      *    *-----------------------------------------------------------*
       qry-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
      *              *-------------------------------------------------*
      *              * Numero pagina a zero                            *
      *              *-------------------------------------------------*
           move      zero                 to   w-vis-num-pag          .
      *              *-------------------------------------------------*
      *              * Intestazione per visualizzazione                *
      *              *-------------------------------------------------*
           perform   vis-int-pag-000      thru vis-int-pag-999        .
      *              *-------------------------------------------------*
      *              * Se interruzione forzata : uscita                *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-ini-cic-999.
       qry-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Esecuzione per fine ciclo                *
      *    *-----------------------------------------------------------*
       qry-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 5. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 5. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 4. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 4. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 3. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 3. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 2. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 2. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Inizio 1. livello di rottura             *
      *    *-----------------------------------------------------------*
       qry-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Fine 1. livello di rottura               *
      *    *-----------------------------------------------------------*
       qry-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Livello di dettaglio                     *
      *    *-----------------------------------------------------------*
       qry-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
      *              *-------------------------------------------------*
      *              * Test se numero linee residue sufficienti        *
      *              *-------------------------------------------------*
           if        v-res                >    6
                     go to qry-liv-det-100.
       qry-liv-det-050.
      *              *-------------------------------------------------*
      *              * Intestazione per visualizzazione                *
      *              *-------------------------------------------------*
           perform   vis-int-pag-000      thru vis-int-pag-999        .
      *              *-------------------------------------------------*
      *              * Se interruzione forzata : uscita                *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to qry-liv-det-999.
       qry-liv-det-100.
      *              *-------------------------------------------------*
      *              * Scrittura file relative di appoggio [rel]       *
      *              *-------------------------------------------------*
       qry-liv-det-110.
      *                  *---------------------------------------------*
      *                  * Esecuzione funzione Inc per file relative   *
      *                  * di appoggio [rel]                           *
      *                  *---------------------------------------------*
           perform   fil-rel-inc-000      thru fil-rel-inc-999        .
       qry-liv-det-120.
      *                  *---------------------------------------------*
      *                  * Normalizzazione area record [rel]           *
      *                  *---------------------------------------------*
           move      spaces               to   rel-rec                .
       qry-liv-det-130.
      *                  *---------------------------------------------*
      *                  * Preparazione area record [rel]              *
      *                  *---------------------------------------------*
       qry-liv-det-135.
      *                      *-----------------------------------------*
      *                      * Tipo componente                         *
      *                      *-----------------------------------------*
           move      w-esp-scl-dtp-tip    to   rel-tip-com            .
           if        rel-tip-com          not  = 01    and
                     rel-tip-com          not  = 02    and
                     rel-tip-com          not  = 03    and
                     rel-tip-com          not  = 99
                     move  zero           to   rel-tip-com            .
       qry-liv-det-140.
      *                      *-----------------------------------------*
      *                      * Codice numerico componente              *
      *                      *-----------------------------------------*
           if        rel-tip-com          =    zero
                     move  zero           to   rel-num-com
           else      move  w-esp-scl-dtp-num
                                          to   rel-num-com            .
       qry-liv-det-145.
      *                      *-----------------------------------------*
      *                      * Codice alfanumerico componente          *
      *                      *-----------------------------------------*
           if        rel-tip-com          =    01 or
                     rel-tip-com          =    02 or
                     rel-tip-com          =    03 or
                     rel-tip-com          =    04
                     move  w-esp-scl-dtp-alf
                                          to   rel-alf-com
           else      move  spaces         to   rel-alf-com            .
       qry-liv-det-150.
      *                      *-----------------------------------------*
      *                      * Descrizione componente                  *
      *                      *-----------------------------------------*
           if        rel-tip-com          =    01 or
                     rel-tip-com          =    02 or
                     rel-tip-com          =    03 or
                     rel-tip-com          =    04
                     move  w-esp-scl-dtp-des
                                          to   rel-des-com
           else      move  spaces         to   rel-alf-com            .
       qry-liv-det-155.
      *                      *-----------------------------------------*
      *                      * Unita' di misura del componente         *
      *                      *-----------------------------------------*
           if        rel-tip-com          =    01 or
                     rel-tip-com          =    02 or
                     rel-tip-com          =    03 or
                     rel-tip-com          =    04
                     move  w-esp-scl-dtp-umi
                                          to   rel-umi-com
           else      move  spaces         to   rel-umi-com            .
       qry-liv-det-160.
      *                      *-----------------------------------------*
      *                      * Numero decimali quantita' del componen- *
      *                      * te                                      *
      *                      *-----------------------------------------*
           if        rel-tip-com          =    01 or
                     rel-tip-com          =    02 or
                     rel-tip-com          =    03 or
                     rel-tip-com          =    04
                     move  w-esp-scl-dtp-dec
                                          to   rel-deq-com
           else      move  zero           to   rel-deq-com            .
       qry-liv-det-165.
      *                      *-----------------------------------------*
      *                      * Quantita' di impiego, moltiplicatore    *
      *                      *-----------------------------------------*
           if        rel-tip-com          =    01 or
                     rel-tip-com          =    02 or
                     rel-tip-com          =    03 or
                     rel-tip-com          =    04
                     move  rf-lgr-qta-ipm to   rel-ipm-com
           else      move  1              to   rel-ipm-com            .
       qry-liv-det-170.
      *                      *-----------------------------------------*
      *                      * Quantita' di impiego, divisore          *
      *                      *-----------------------------------------*
           if        rel-tip-com          =    01 or
                     rel-tip-com          =    02 or
                     rel-tip-com          =    03 or
                     rel-tip-com          =    04
                     move  rf-lgr-qta-ipd to   rel-ipd-com
           else      move  1              to   rel-ipd-com            .
       qry-liv-det-175.
      *                      *-----------------------------------------*
      *                      * Quantita' di impiego, quantita' totale  *
      *                      *-----------------------------------------*
           if        rel-tip-com          =    01 or
                     rel-tip-com          =    02 or
                     rel-tip-com          =    03 or
                     rel-tip-com          =    04
                     move  w-esp-scl-dtp-qta
                                          to   rel-qtt-com
           else      move  1              to   rel-qtt-com            .
       qry-liv-det-180.
      *                      *-----------------------------------------*
      *                      * Annotazioni sull'impiego                *
      *                      *-----------------------------------------*
           if        rel-tip-com          =    01 or
                     rel-tip-com          =    02 or
                     rel-tip-com          =    03 or
                     rel-tip-com          =    04
                     move  rf-lgr-not-cpt to   rel-not-com
           else      move  spaces         to   rel-not-com            .
       qry-liv-det-200.
      *                  *---------------------------------------------*
      *                  * Esecuzione funzione Put su file relative    *
      *                  * di appoggio [rel]                           *
      *                  *---------------------------------------------*
           perform   fil-rel-put-000      thru fil-rel-put-999        .
       qry-liv-det-300.
      *              *-------------------------------------------------*
      *              * Interlinea                                      *
      *              *-------------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-400.
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
       qry-liv-det-425.
      *                  *---------------------------------------------*
      *                  * Calcolo del displacement di visualizzazione,*
      *                  * facendo attenzione a non superare il massi- *
      *                  * mo livello di indentazione consentito       *
      *                  *---------------------------------------------*
           move      w-esp-scl-dtp-liv    to   w-vis-dsp-vis          .
           if        w-vis-dsp-vis        >    07
                     move  07             to   w-vis-dsp-vis          .
           subtract  1                    from w-vis-dsp-vis          .
           multiply  3                    by   w-vis-dsp-vis          .
       qry-liv-det-450.
      *                  *---------------------------------------------*
      *                  * Livello di profondita'                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      spaces               to   v-sgn                  .
           move      "9"                  to   v-edm                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           add       w-vis-dsp-vis        to   v-pos                  .
           move      w-esp-scl-dtp-liv    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-475.
      *                  *---------------------------------------------*
      *                  * Parentesi tonda chiusa                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      03                   to   v-pos                  .
           add       w-vis-dsp-vis        to   v-pos                  .
           move      ")"                  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-500.
      *                  *---------------------------------------------*
      *                  * Parentesi quadra aperta                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      04                   to   v-pos                  .
           add       w-vis-dsp-vis        to   v-pos                  .
           move      "["                  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-525.
      *                  *---------------------------------------------*
      *                  * Tipo di componente                          *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      05                   to   v-pos                  .
           add       w-vis-dsp-vis        to   v-pos                  .
           if        w-esp-scl-dtp-tip    =    01
                     move  "P"            to   v-alf
           else if   w-esp-scl-dtp-tip    =    02
                     move  "S"            to   v-alf
           else if   w-esp-scl-dtp-tip    =    03
                     move  "M"            to   v-alf
           else if   w-esp-scl-dtp-tip    =    99
                     move  "D"            to   v-alf
           else      move  "?"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-550.
      *                  *---------------------------------------------*
      *                  * Parentesi quadra chiusa                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      06                   to   v-pos                  .
           add       w-vis-dsp-vis        to   v-pos                  .
           move      "]"                  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-575.
      *                  *---------------------------------------------*
      *                  * Codice alfanumerico componente              *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      14                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      08                   to   v-pos                  .
           add       w-vis-dsp-vis        to   v-pos                  .
           move      "+"                  to   v-edm                  .
           move      f-rel-put            to   w-mpn-num-rel          .
           if        w-esp-scl-dtp-tip    =    02 or
                     w-esp-scl-dtp-tip    =    03 or
                     w-esp-scl-dtp-tip    =    99
                     move  w-esp-scl-dtp-tip
                                          to   w-mpn-tip-com
                     move  w-esp-scl-dtp-num
                                          to   w-mpn-num-com
           else      move  zero           to   w-mpn-tip-com
                     move  zero           to   w-mpn-num-com          .
           move      w-mpn                to   v-cnt                  .
           move      w-esp-scl-dtp-alf    to   v-alf                 .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-600.
      *                  *---------------------------------------------*
      *                  * Descrizione componente                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      23                   to   v-pos                  .
           add       w-vis-dsp-vis        to   v-pos                  .
           move      w-esp-scl-dtp-des    to   v-alf                 .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-liv-det-700.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     qry-liv-det-999.
       qry-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Intestazione per interrogazione                           *
      *    *-----------------------------------------------------------*
       vis-int-pag-000.
      *              *-------------------------------------------------*
      *              * Se si e' al primo avanzamento pagina si richia- *
      *              * ma la funzione di abilitazione della funzione   *
      *              * pre-mark-point                                  *
      *              *-------------------------------------------------*
           if        v-pag                not  = zero
                     go to vis-int-pag-050.
           move      "PM"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-int-pag-050.
      *              *-------------------------------------------------*
      *              * Subroutine di avanzamento pagina                *
      *              *-------------------------------------------------*
           perform   qry-pag-adv-000      thru qry-pag-adv-999        .
      *              *-------------------------------------------------*
      *              * Se interruzione forzata : uscita                *
      *              *-------------------------------------------------*
           if        w-cnt-qry-flg-int    not  = spaces
                     go to vis-int-pag-999.
      *              *-------------------------------------------------*
      *              * Incremento numero pagina                        *
      *              *-------------------------------------------------*
           add       1                    to   w-vis-num-pag          .
       vis-int-pag-100.
      *              *-------------------------------------------------*
      *              * Linea 1.                                        *
      *              *-------------------------------------------------*
       vis-int-pag-110.
      *                  *---------------------------------------------*
      *                  * Linea di trattini                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-cnt-lit-t80        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-int-pag-200.
      *              *-------------------------------------------------*
      *              * Linea 2.                                        *
      *              *-------------------------------------------------*
       vis-int-pag-210.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-int-pag-220.
      *                  *---------------------------------------------*
      *                  * Sigla programma in alto a sinistra          *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-int-pag-230.
      *                  *---------------------------------------------*
      *                  * Titolo centrale                             *
      *                  *---------------------------------------------*
       vis-int-pag-240.
      *                      *-----------------------------------------*
      *                      * Composizione codice                     *
      *                      *-----------------------------------------*
       vis-int-pag-241.
      *                          *-------------------------------------*
      *                          * Se codice alfanumerico diverso da   *
      *                          * spaces, lo si pone in area editata  *
      *                          * per il codice                       *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Test                            *
      *                              *---------------------------------*
           if        rr-alf-ass           =    spaces
                     go to vis-int-pag-242.
      *                              *---------------------------------*
      *                              * Esecuzione                      *
      *                              *---------------------------------*
           move      rr-alf-ass           to   w-vis-edt-cod          .
      *                              *---------------------------------*
      *                              * A completamento composizione    *
      *                              *---------------------------------*
           go to     vis-int-pag-243.
       vis-int-pag-242.
      *                          *-------------------------------------*
      *                          * Altrimenti si edita il codice nume- *
      *                          * rico                                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Preparazione                    *
      *                              *---------------------------------*
           move      spaces               to   w-vis-edt-cod          .
      *                              *---------------------------------*
      *                              * Editing                         *
      *                              *---------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      rr-num-ass           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Composizione                    *
      *                              *---------------------------------*
           string    "[P]("
                                delimited by   size
                     v-edt
                                delimited by   spaces
                     ")"
                                delimited by   size
                                          into w-vis-edt-cod          .
      *                              *---------------------------------*
      *                              * A completamento composizione    *
      *                              *---------------------------------*
           go to     vis-int-pag-243.
       vis-int-pag-243.
      *                      *-----------------------------------------*
      *                      * Completamento composizione              *
      *                      *-----------------------------------------*
           move      spaces               to   w-cen-tit-asx          .
           string    "ESPLOSIONE SCALARE PER : "
                                delimited by   size
                     w-vis-edt-cod
                                delimited by   size
                                          into w-cen-tit-asx          .
       vis-int-pag-244.
      *                      *-----------------------------------------*
      *                      * Centratura del titolo                   *
      *                      *-----------------------------------------*
           move      spaces               to   w-cen-tit-cen          .
           move      zero                 to   w-cen-tit-ctr          .
           inspect   w-cen-tit-asx    tallying w-cen-tit-ctr
                                  for trailing spaces                 .
           divide    2                    into w-cen-tit-ctr          .
           add       1                    to   w-cen-tit-ctr          .
           move      w-cen-tit-asx        to   w-cen-tit-cen
                                              (w-cen-tit-ctr :)       .
       vis-int-pag-245.
      *                      *-----------------------------------------*
      *                      * Visualizzazione titolo centrato         *
      *                      *-----------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      21                   to   v-pos                  .
           move      w-cen-tit-cen        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-int-pag-250.
      *                  *---------------------------------------------*
      *                  * Quantita' da esplodere                      *
      *                  *---------------------------------------------*
       vis-int-pag-255.
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
       vis-int-pag-256.
      *                          *-------------------------------------*
      *                          * Preparazione unita' di misura       *
      *                          *-------------------------------------*
           move      rr-umi-ass           to   w-vis-qde-umi          .
       vis-int-pag-257.
      *                          *-------------------------------------*
      *                          * Preparazione quantita' editata      *
      *                          *-------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      rr-deq-ass           to   v-dec                  .
           if        v-dec                not  = zero and
                     v-dec                not  = 1    and
                     v-dec                not  = 2    and
                     v-dec                not  = 3
                     move  zero           to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "GB<"                to   v-edm                  .
           move      rr-qde-ass           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-vis-qde-qta          .
       vis-int-pag-258.
      *                          *-------------------------------------*
      *                          * Concatenazione                      *
      *                          *-------------------------------------*
           if        w-vis-qde-qta        =    spaces
                     move  spaces         to   w-vis-qde-edt
                     go to vis-int-pag-259.
           if        w-vis-qde-umi        =    spaces
                     move  w-vis-qde-qta  to   w-vis-qde-edt
                     go to vis-int-pag-259.
           move      spaces               to   w-vis-qde-edt          .
           string    w-vis-qde-umi
                                delimited by   spaces
                     ":"
                                delimited by   size
                     w-vis-qde-qta
                                delimited by   size
                                          into w-vis-qde-edt          .
       vis-int-pag-259.
      *                      *-----------------------------------------*
      *                      * Visualizzazione                         *
      *                      *-----------------------------------------*
           move      zero                 to   w-vis-qde-ctr          .
           inspect   w-vis-qde-edt    tallying w-vis-qde-ctr
                                  for trailing spaces                 .
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           if        w-vis-qde-ctr        =    18
                     move    18           to   v-car
           else      move    18           to   v-car
                     subtract w-vis-qde-ctr
                                          from v-car                  .
           move      v-lnr                to   v-lin                  .
           move      80                   to   v-pos                  .
           subtract  v-car                from v-pos                  .
           add       1                    to   v-pos                  .
           move      w-vis-qde-edt        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-int-pag-300.
      *              *-------------------------------------------------*
      *              * Linea 3.                                        *
      *              *-------------------------------------------------*
       vis-int-pag-310.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-int-pag-320.
      *                  *---------------------------------------------*
      *                  * Linea di trattini                           *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-cnt-lit-t80        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-int-pag-400.
      *              *-------------------------------------------------*
      *              * Linea 4.                                        *
      *              *-------------------------------------------------*
       vis-int-pag-410.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-int-pag-420.
      *                  *---------------------------------------------*
      *                  * Linea di fincatura                          *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "     Livello - Tipo componente - Codice componente
      -              " - Descrizione componente     "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-int-pag-500.
      *              *-------------------------------------------------*
      *              * Linea 4.                                        *
      *              *-------------------------------------------------*
       vis-int-pag-510.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-int-pag-520.
      *                  *---------------------------------------------*
      *                  * Linea di sottolineatura fincatura           *
      *                  *---------------------------------------------*
           move      "PF"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      v-lnr                to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-int-pag-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Function-keys previste in Mark-points    *
      *    *-----------------------------------------------------------*
       qry-det-fky-000.
      *              *-------------------------------------------------*
      *              * Function key Expd                               *
      *              *-------------------------------------------------*
           move      "EXPD"               to   v-pfk (01)             .
       qry-det-fky-100.
      *              *-------------------------------------------------*
      *              * Function key Find                               *
      *              *-------------------------------------------------*
           move      "FIND"               to   v-pfk (02)             .
       qry-det-fky-200.
      *              *-------------------------------------------------*
      *              * Function key Pf1                                *
      *              *-------------------------------------------------*
           move      "[1] "               to   v-pfk (03)             .
       qry-det-fky-300.
      *              *-------------------------------------------------*
      *              * Tutte le altre function keys forzate a No       *
      *              *-------------------------------------------------*
           move      spaces               to   v-pfk (04)             .
           move      spaces               to   v-pfk (05)             .
           move      spaces               to   v-pfk (06)             .
           move      spaces               to   v-pfk (07)             .
           move      spaces               to   v-pfk (08)             .
           move      spaces               to   v-pfk (09)             .
           move      spaces               to   v-pfk (10)             .
       qry-det-fky-999.
           exit.

      *    *===========================================================*
      *    * Interrogazione : Trattamento Function-key selezionata     *
      *    *-----------------------------------------------------------*
       qry-trt-fun-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-qry-flg-int      .
       qry-trt-fun-050.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda della function-key         *
      *              *-------------------------------------------------*
           if        v-key                =    "-PM-"
                     go to qry-trt-fun-100
           else if   v-key                =    "EXPD"
                     go to qry-trt-fun-500
           else if   v-key                =    "FIND"
                     go to qry-trt-fun-600
           else if   v-key                =    "[1] "
                     go to qry-trt-fun-700
           else      go to qry-trt-fun-900.
       qry-trt-fun-100.
      *              *-------------------------------------------------*
      *              * Se funzione pre Mark-Point                      *
      *              *-------------------------------------------------*
       qry-trt-fun-110.
      *                  *---------------------------------------------*
      *                  * Esecuzione funzione Get da file relative    *
      *                  * di appoggio [rel]                           *
      *                  *---------------------------------------------*
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-num-rel        to   f-rel-get              .
           perform   fil-rel-get-000      thru fil-rel-get-999        .
      *                  *---------------------------------------------*
      *                  * Se record non esistente, a visualizzazione  *
      *                  * a spaces                                    *
      *                  *---------------------------------------------*
           if        f-rel-get            =    zero
                     go to qry-trt-fun-180.
       qry-trt-fun-120.
      *                      *-----------------------------------------*
      *                      * Linea di trattini                       *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-130.
      *                      *-----------------------------------------*
      *                      * Linea 1.                                *
      *                      *-----------------------------------------*
       qry-trt-fun-131.
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           if        rel-tip-com          =    01
                     move  "Prodotto di vendita   :"
                                          to   v-alf
           else if   rel-tip-com          =    02
                     move  "Semilavorato          :"
                                          to   v-alf
           else if   rel-tip-com          =    03
                     move  "Materia prima         :"
                                          to   v-alf
           else if   rel-tip-com          =    99
                     move  "Sub-distinta virtuale :"
                                          to   v-alf
           else      move  spaces         to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-132.
      *                          *-------------------------------------*
      *                          * Codice alfanumerico                 *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      14                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      25                   to   v-pos                  .
           move      rel-alf-com          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-133.
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rel-des-com          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-140.
      *                      *-----------------------------------------*
      *                      * Linea 2.                                *
      *                      *-----------------------------------------*
       qry-trt-fun-141.
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Quantita' di impiego  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-142.
      *                          *-------------------------------------*
      *                          * Unita' di misura                    *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      25                   to   v-pos                  .
           move      rel-umi-com          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-143.
      *                          *-------------------------------------*
      *                          * Quantita' di impiego, moltiplicato- *
      *                          * re e divisore                       *
      *                          *-------------------------------------*
       qry-trt-fun-144.
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      rel-deq-com          to   v-dec                  .
           if        v-dec                not  = 1 and
                     v-dec                not  = 2 and
                     v-dec                not  = 3
                     move  zero           to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "G<"                 to   v-edm                  .
           move      rel-ipm-com          to   v-num                  .
           if        v-num                =    zero
                     move  1              to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-vis-med-ipm          .
       qry-trt-fun-146.
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      rel-deq-com          to   v-dec                  .
           if        v-dec                not  = 1 and
                     v-dec                not  = 2 and
                     v-dec                not  = 3
                     move  zero           to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "G<"                 to   v-edm                  .
           move      rel-ipd-com          to   v-num                  .
           if        v-num                =    zero
                     move  1              to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-vis-med-ipd          .
       qry-trt-fun-147.
           if        rel-ipd-com          =    zero or
                     rel-ipd-com          =    1
                     move  w-vis-med-ipm  to   w-vis-med-edt
                     go to qry-trt-fun-149.
       qry-trt-fun-148.
           move      spaces               to   w-vis-med-edt          .
           string    w-vis-med-ipm
                                delimited by   spaces
                     "/"
                                delimited by   size
                     w-vis-med-ipd
                                delimited by   spaces
                                          into w-vis-med-edt          .
       qry-trt-fun-149.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      30                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      29                   to   v-pos                  .
           move      w-vis-med-edt        to   v-alf                  .
           move      w-vis-med-edt        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-150.
      *                      *-----------------------------------------*
      *                      * Linea 3.                                *
      *                      *-----------------------------------------*
       qry-trt-fun-151.
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Quantita' totale      :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-152.
      *                          *-------------------------------------*
      *                          * Unita' di misura                    *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      25                   to   v-pos                  .
           move      rel-umi-com          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-153.
      *                          *-------------------------------------*
      *                          * Quantita' totale                    *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      rel-deq-com          to   v-dec                  .
           if        v-dec                not  = 1 and
                     v-dec                not  = 2 and
                     v-dec                not  = 3
                     move  zero           to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "G<"                 to   v-edm                  .
           move      20                   to   v-lin                  .
           move      29                   to   v-pos                  .
           move      rel-qtt-com          to   v-num                  .
           if        v-num                =    zero
                     move  1              to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-160.
      *                      *-----------------------------------------*
      *                      * Linea 4.                                *
      *                      *-----------------------------------------*
       qry-trt-fun-161.
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Note                  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-162.
      *                          *-------------------------------------*
      *                          * Annotazioni sull'impiego            *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      25                   to   v-pos                  .
           move      rel-not-com          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-170.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-180.
      *                  *---------------------------------------------*
      *                  * Visualizzazione a spaces                    *
      *                  *---------------------------------------------*
       qry-trt-fun-181.
      *                      *-----------------------------------------*
      *                      * Linea di trattini                       *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-182.
      *                      *-----------------------------------------*
      *                      * Linea 1. a spaces                       *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-183.
      *                      *-----------------------------------------*
      *                      * Linea 2. a spaces                       *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-184.
      *                      *-----------------------------------------*
      *                      * Linea 3. a spaces                       *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-185.
      *                      *-----------------------------------------*
      *                      * Linea 4. a spaces                       *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       qry-trt-fun-190.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-500.
      *              *-------------------------------------------------*
      *              * Se function-key Expd                            *
      *              *-------------------------------------------------*
       qry-trt-fun-505.
      *                  *---------------------------------------------*
      *                  * Normalizzazione function key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo di elemento   *
      *                  *---------------------------------------------*
           move      v-cnt                to   w-mpn                  .
           if        w-mpn-tip-com        =    02
                     go to qry-trt-fun-510
           else if   w-mpn-tip-com        =    03
                     go to qry-trt-fun-530
           else if   w-mpn-tip-com        =    99
                     go to qry-trt-fun-550
           else      go to qry-trt-fun-999.
       qry-trt-fun-510.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento 02 : semilavorato          *
      *                  *---------------------------------------------*
       qry-trt-fun-512.
      *                      *-----------------------------------------*
      *                      * Se programma di implosione scalare se-  *
      *                      * milavorato gia' attivo : uscita         *
      *                      *-----------------------------------------*
           move      "ISCSEM    "         to   w-spg-alf-gat          .
           perform   tst-spg-gat-000      thru tst-spg-gat-999        .
           if        w-spg-snx-gat        not  = spaces
                     go to qry-trt-fun-999.
       qry-trt-fun-514.
      *                      *-----------------------------------------*
      *                      * Preparazione pathname completo per l'e- *
      *                      * secuzione del sottoprogramma da richia- *
      *                      * mare, ricercando nella tabella dei tipi *
      *                      * interrogazione; se non trovato : uscita *
      *                      *-----------------------------------------*
           move      zero                 to   w-tin-ele-inx          .
       qry-trt-fun-516.
           add       1                    to   w-tin-ele-inx          .
           if        w-tin-ele-inx        >    w-tin-ele-num
                     go to qry-trt-fun-999.
           if        w-tin-alf-tin
                    (w-tin-ele-inx)       not  = "ISCSEM    "
                     go to qry-trt-fun-516.
           if        w-tin-ovy-tin
                    (w-tin-ele-inx)       =    spaces
                     go to qry-trt-fun-999.
           move      w-tin-ovy-tin
                    (w-tin-ele-inx)       to   w-ovy-exe-pos          .
       qry-trt-fun-518.
      *                      *-----------------------------------------*
      *                      * Scrittura variabile di i.p.c. 'num-com' *
      *                      * per lo stesso livello di profondita'    *
      *                      * applicativa per il codice numerico del  *
      *                      * componente di tipo semilavorato da      *
      *                      * implodere                               *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "num-com"            to   s-var                  .
           move      "="                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      07                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-num-com        to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       qry-trt-fun-520.
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           add       1                    to   w-ovy-exe-inx          .
           move      w-ovy-exe-pos        to   w-ovy-exe-spv
                                              (w-ovy-exe-inx)         .
           call      w-ovy-exe-pat       using i-ide
                                               w-ovy-exe
                                               w-tin
                                               w-spg                  .
       qry-trt-fun-522.
      *                      *-----------------------------------------*
      *                      * Cancellazione del sottoprogramma        *
      *                      *-----------------------------------------*
           move      w-ovy-exe-spv
                    (w-ovy-exe-inx)       to   w-ovy-exe-pos          .
           cancel    w-ovy-exe-pat                                    .
           subtract  1                    from w-ovy-exe-inx          .
       qry-trt-fun-524.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-530.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento 03 : materia prima         *
      *                  *---------------------------------------------*
       qry-trt-fun-532.
      *                      *-----------------------------------------*
      *                      * Se programma di implosione scalare ma-  *
      *                      * teria prima gia' attivo : uscita        *
      *                      *-----------------------------------------*
           move      "ISCMAP    "         to   w-spg-alf-gat          .
           perform   tst-spg-gat-000      thru tst-spg-gat-999        .
           if        w-spg-snx-gat        not  = spaces
                     go to qry-trt-fun-999.
       qry-trt-fun-534.
      *                      *-----------------------------------------*
      *                      * Preparazione pathname completo per l'e- *
      *                      * secuzione del sottoprogramma da richia- *
      *                      * mare, ricercando nella tabella dei tipi *
      *                      * interrogazione; se non trovato : uscita *
      *                      *-----------------------------------------*
           move      zero                 to   w-tin-ele-inx          .
       qry-trt-fun-536.
           add       1                    to   w-tin-ele-inx          .
           if        w-tin-ele-inx        >    w-tin-ele-num
                     go to qry-trt-fun-999.
           if        w-tin-alf-tin
                    (w-tin-ele-inx)       not  = "ISCMAP    "
                     go to qry-trt-fun-536.
           if        w-tin-ovy-tin
                    (w-tin-ele-inx)       =    spaces
                     go to qry-trt-fun-999.
           move      w-tin-ovy-tin
                    (w-tin-ele-inx)       to   w-ovy-exe-pos          .
       qry-trt-fun-538.
      *                      *-----------------------------------------*
      *                      * Scrittura variabile di i.p.c. 'num-com' *
      *                      * per lo stesso livello di profondita'    *
      *                      * applicativa per il codice numerico del  *
      *                      * componente di tipo materia prima da im- *
      *                      * plodere                                 *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "num-com"            to   s-var                  .
           move      "="                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      07                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-num-com        to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       qry-trt-fun-540.
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           add       1                    to   w-ovy-exe-inx          .
           move      w-ovy-exe-pos        to   w-ovy-exe-spv
                                              (w-ovy-exe-inx)         .
           call      w-ovy-exe-pat       using i-ide
                                               w-ovy-exe
                                               w-tin
                                               w-spg                  .
       qry-trt-fun-542.
      *                      *-----------------------------------------*
      *                      * Cancellazione del sottoprogramma        *
      *                      *-----------------------------------------*
           move      w-ovy-exe-spv
                    (w-ovy-exe-inx)       to   w-ovy-exe-pos          .
           cancel    w-ovy-exe-pat                                    .
           subtract  1                    from w-ovy-exe-inx          .
       qry-trt-fun-544.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-550.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento 99 : sub-distinta virtuale *
      *                  *---------------------------------------------*
       qry-trt-fun-552.
      *                      *-----------------------------------------*
      *                      * Se programma di implosione scalare sub- *
      *                      * distinta virtuale gia' attivo : uscita  *
      *                      *-----------------------------------------*
           move      "ISCSDV    "         to   w-spg-alf-gat          .
           perform   tst-spg-gat-000      thru tst-spg-gat-999        .
           if        w-spg-snx-gat        not  = spaces
                     go to qry-trt-fun-999.
       qry-trt-fun-554.
      *                      *-----------------------------------------*
      *                      * Preparazione pathname completo per l'e- *
      *                      * secuzione del sottoprogramma da richia- *
      *                      * mare, ricercando nella tabella dei tipi *
      *                      * interrogazione; se non trovato : uscita *
      *                      *-----------------------------------------*
           move      zero                 to   w-tin-ele-inx          .
       qry-trt-fun-556.
           add       1                    to   w-tin-ele-inx          .
           if        w-tin-ele-inx        >    w-tin-ele-num
                     go to qry-trt-fun-999.
           if        w-tin-alf-tin
                    (w-tin-ele-inx)       not  = "ISCSDV    "
                     go to qry-trt-fun-556.
           if        w-tin-ovy-tin
                    (w-tin-ele-inx)       =    spaces
                     go to qry-trt-fun-999.
           move      w-tin-ovy-tin
                    (w-tin-ele-inx)       to   w-ovy-exe-pos          .
       qry-trt-fun-558.
      *                      *-----------------------------------------*
      *                      * Scrittura variabile di i.p.c. 'num-com' *
      *                      * per lo stesso livello di profondita'    *
      *                      * applicativa per il codice numerico del  *
      *                      * componente di tipo sub-distiinta virtu- *
      *                      * ale da implodere                        *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "num-com"            to   s-var                  .
           move      "="                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      07                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-num-com        to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       qry-trt-fun-560.
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           add       1                    to   w-ovy-exe-inx          .
           move      w-ovy-exe-pos        to   w-ovy-exe-spv
                                              (w-ovy-exe-inx)         .
           call      w-ovy-exe-pat       using i-ide
                                               w-ovy-exe
                                               w-tin
                                               w-spg                  .
       qry-trt-fun-562.
      *                      *-----------------------------------------*
      *                      * Cancellazione del sottoprogramma        *
      *                      *-----------------------------------------*
           move      w-ovy-exe-spv
                    (w-ovy-exe-inx)       to   w-ovy-exe-pos          .
           cancel    w-ovy-exe-pat                                    .
           subtract  1                    from w-ovy-exe-inx          .
       qry-trt-fun-564.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-600.
      *              *-------------------------------------------------*
      *              * Se function-key Find                            *
      *              *-------------------------------------------------*
       qry-trt-fun-605.
      *                  *---------------------------------------------*
      *                  * Normalizzazione function key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo di elemento   *
      *                  *---------------------------------------------*
           move      v-cnt                to   w-mpn                  .
           if        w-mpn-tip-com        =    02
                     go to qry-trt-fun-610
           else if   w-mpn-tip-com        =    03
                     go to qry-trt-fun-630
           else if   w-mpn-tip-com        =    99
                     go to qry-trt-fun-650
           else      go to qry-trt-fun-999.
       qry-trt-fun-610.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento 02 : semilavorato          *
      *                  *---------------------------------------------*
       qry-trt-fun-612.
      *                      *-----------------------------------------*
      *                      * Se programma di implosione riepilogata  *
      *                      * semilavorato gia' attivo : uscita       *
      *                      *-----------------------------------------*
           move      "IRISEM    "         to   w-spg-alf-gat          .
           perform   tst-spg-gat-000      thru tst-spg-gat-999        .
           if        w-spg-snx-gat        not  = spaces
                     go to qry-trt-fun-999.
       qry-trt-fun-614.
      *                      *-----------------------------------------*
      *                      * Preparazione pathname completo per l'e- *
      *                      * secuzione del sottoprogramma da richia- *
      *                      * mare, ricercando nella tabella dei tipi *
      *                      * interrogazione; se non trovato : uscita *
      *                      *-----------------------------------------*
           move      zero                 to   w-tin-ele-inx          .
       qry-trt-fun-616.
           add       1                    to   w-tin-ele-inx          .
           if        w-tin-ele-inx        >    w-tin-ele-num
                     go to qry-trt-fun-999.
           if        w-tin-alf-tin
                    (w-tin-ele-inx)       not  = "IRISEM    "
                     go to qry-trt-fun-616.
           if        w-tin-ovy-tin
                    (w-tin-ele-inx)       =    spaces
                     go to qry-trt-fun-999.
           move      w-tin-ovy-tin
                    (w-tin-ele-inx)       to   w-ovy-exe-pos          .
       qry-trt-fun-618.
      *                      *-----------------------------------------*
      *                      * Scrittura variabile di i.p.c. 'num-com' *
      *                      * per lo stesso livello di profondita'    *
      *                      * applicativa per il codice numerico del  *
      *                      * componente di tipo semilavorato da      *
      *                      * implodere                               *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "num-com"            to   s-var                  .
           move      "="                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      07                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-num-com        to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       qry-trt-fun-620.
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           add       1                    to   w-ovy-exe-inx          .
           move      w-ovy-exe-pos        to   w-ovy-exe-spv
                                              (w-ovy-exe-inx)         .
           call      w-ovy-exe-pat       using i-ide
                                               w-ovy-exe
                                               w-tin
                                               w-spg                  .
       qry-trt-fun-622.
      *                      *-----------------------------------------*
      *                      * Cancellazione del sottoprogramma        *
      *                      *-----------------------------------------*
           move      w-ovy-exe-spv
                    (w-ovy-exe-inx)       to   w-ovy-exe-pos          .
           cancel    w-ovy-exe-pat                                    .
           subtract  1                    from w-ovy-exe-inx          .
       qry-trt-fun-624.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-630.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento 03 : materia prima         *
      *                  *---------------------------------------------*
       qry-trt-fun-632.
      *                      *-----------------------------------------*
      *                      * Se programma di implosione riepilogata  *
      *                      * materia prima gia' attivo : uscita      *
      *                      *-----------------------------------------*
           move      "IRIMAP    "         to   w-spg-alf-gat          .
           perform   tst-spg-gat-000      thru tst-spg-gat-999        .
           if        w-spg-snx-gat        not  = spaces
                     go to qry-trt-fun-999.
       qry-trt-fun-634.
      *                      *-----------------------------------------*
      *                      * Preparazione pathname completo per l'e- *
      *                      * secuzione del sottoprogramma da richia- *
      *                      * mare, ricercando nella tabella dei tipi *
      *                      * interrogazione; se non trovato : uscita *
      *                      *-----------------------------------------*
           move      zero                 to   w-tin-ele-inx          .
       qry-trt-fun-636.
           add       1                    to   w-tin-ele-inx          .
           if        w-tin-ele-inx        >    w-tin-ele-num
                     go to qry-trt-fun-999.
           if        w-tin-alf-tin
                    (w-tin-ele-inx)       not  = "IRIMAP    "
                     go to qry-trt-fun-636.
           if        w-tin-ovy-tin
                    (w-tin-ele-inx)       =    spaces
                     go to qry-trt-fun-999.
           move      w-tin-ovy-tin
                    (w-tin-ele-inx)       to   w-ovy-exe-pos          .
       qry-trt-fun-638.
      *                      *-----------------------------------------*
      *                      * Scrittura variabile di i.p.c. 'num-com' *
      *                      * per lo stesso livello di profondita'    *
      *                      * applicativa per il codice numerico del  *
      *                      * componente di tipo materia prima da im- *
      *                      * plodere                                 *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "num-com"            to   s-var                  .
           move      "="                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      07                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-num-com        to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       qry-trt-fun-640.
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           add       1                    to   w-ovy-exe-inx          .
           move      w-ovy-exe-pos        to   w-ovy-exe-spv
                                              (w-ovy-exe-inx)         .
           call      w-ovy-exe-pat       using i-ide
                                               w-ovy-exe
                                               w-tin
                                               w-spg                  .
       qry-trt-fun-642.
      *                      *-----------------------------------------*
      *                      * Cancellazione del sottoprogramma        *
      *                      *-----------------------------------------*
           move      w-ovy-exe-spv
                    (w-ovy-exe-inx)       to   w-ovy-exe-pos          .
           cancel    w-ovy-exe-pat                                    .
           subtract  1                    from w-ovy-exe-inx          .
       qry-trt-fun-644.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-650.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento 99 : sub-distinta virtuale *
      *                  *---------------------------------------------*
       qry-trt-fun-652.
      *                      *-----------------------------------------*
      *                      * Se programma di implosione riepilogata  *
      *                      * sub-distinta virtuale gia' attivo : u-  *
      *                      * scita                                   *
      *                      *-----------------------------------------*
           move      "IRISDV    "         to   w-spg-alf-gat          .
           perform   tst-spg-gat-000      thru tst-spg-gat-999        .
           if        w-spg-snx-gat        not  = spaces
                     go to qry-trt-fun-999.
       qry-trt-fun-654.
      *                      *-----------------------------------------*
      *                      * Preparazione pathname completo per l'e- *
      *                      * secuzione del sottoprogramma da richia- *
      *                      * mare, ricercando nella tabella dei tipi *
      *                      * interrogazione; se non trovato : uscita *
      *                      *-----------------------------------------*
           move      zero                 to   w-tin-ele-inx          .
       qry-trt-fun-656.
           add       1                    to   w-tin-ele-inx          .
           if        w-tin-ele-inx        >    w-tin-ele-num
                     go to qry-trt-fun-999.
           if        w-tin-alf-tin
                    (w-tin-ele-inx)       not  = "IRISDV    "
                     go to qry-trt-fun-656.
           if        w-tin-ovy-tin
                    (w-tin-ele-inx)       =    spaces
                     go to qry-trt-fun-999.
           move      w-tin-ovy-tin
                    (w-tin-ele-inx)       to   w-ovy-exe-pos          .
       qry-trt-fun-658.
      *                      *-----------------------------------------*
      *                      * Scrittura variabile di i.p.c. 'num-com' *
      *                      * per lo stesso livello di profondita'    *
      *                      * applicativa per il codice numerico del  *
      *                      * componente di tipo sub-distiinta virtu- *
      *                      * ale da implodere                        *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "num-com"            to   s-var                  .
           move      "="                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      07                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-num-com        to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       qry-trt-fun-660.
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           add       1                    to   w-ovy-exe-inx          .
           move      w-ovy-exe-pos        to   w-ovy-exe-spv
                                              (w-ovy-exe-inx)         .
           call      w-ovy-exe-pat       using i-ide
                                               w-ovy-exe
                                               w-tin
                                               w-spg                  .
       qry-trt-fun-662.
      *                      *-----------------------------------------*
      *                      * Cancellazione del sottoprogramma        *
      *                      *-----------------------------------------*
           move      w-ovy-exe-spv
                    (w-ovy-exe-inx)       to   w-ovy-exe-pos          .
           cancel    w-ovy-exe-pat                                    .
           subtract  1                    from w-ovy-exe-inx          .
       qry-trt-fun-664.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-700.
      *              *-------------------------------------------------*
      *              * Se function-key Pf1                             *
      *              *-------------------------------------------------*
       qry-trt-fun-705.
      *                  *---------------------------------------------*
      *                  * Normalizzazione function key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo di elemento   *
      *                  *---------------------------------------------*
           move      v-cnt                to   w-mpn                  .
           if        w-mpn-tip-com        =    02
                     go to qry-trt-fun-710
           else if   w-mpn-tip-com        =    03
                     go to qry-trt-fun-730
           else if   w-mpn-tip-com        =    99
                     go to qry-trt-fun-750
           else      go to qry-trt-fun-999.
       qry-trt-fun-710.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento 02 : semilavorato          *
      *                  *---------------------------------------------*
       qry-trt-fun-712.
      *                      *-----------------------------------------*
      *                      * Se programma di implosione ad un livel- *
      *                      * lo semilavorato gia' attivo : uscita    *
      *                      *-----------------------------------------*
           move      "IULSEM    "         to   w-spg-alf-gat          .
           perform   tst-spg-gat-000      thru tst-spg-gat-999        .
           if        w-spg-snx-gat        not  = spaces
                     go to qry-trt-fun-999.
       qry-trt-fun-714.
      *                      *-----------------------------------------*
      *                      * Preparazione pathname completo per l'e- *
      *                      * secuzione del sottoprogramma da richia- *
      *                      * mare, ricercando nella tabella dei tipi *
      *                      * interrogazione; se non trovato : uscita *
      *                      *-----------------------------------------*
           move      zero                 to   w-tin-ele-inx          .
       qry-trt-fun-716.
           add       1                    to   w-tin-ele-inx          .
           if        w-tin-ele-inx        >    w-tin-ele-num
                     go to qry-trt-fun-999.
           if        w-tin-alf-tin
                    (w-tin-ele-inx)       not  = "IULSEM    "
                     go to qry-trt-fun-716.
           if        w-tin-ovy-tin
                    (w-tin-ele-inx)       =    spaces
                     go to qry-trt-fun-999.
           move      w-tin-ovy-tin
                    (w-tin-ele-inx)       to   w-ovy-exe-pos          .
       qry-trt-fun-718.
      *                      *-----------------------------------------*
      *                      * Scrittura variabile di i.p.c. 'num-com' *
      *                      * per lo stesso livello di profondita'    *
      *                      * applicativa per il codice numerico del  *
      *                      * componente di tipo semilavorato da      *
      *                      * implodere                               *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "num-com"            to   s-var                  .
           move      "="                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      07                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-num-com        to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       qry-trt-fun-720.
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           add       1                    to   w-ovy-exe-inx          .
           move      w-ovy-exe-pos        to   w-ovy-exe-spv
                                              (w-ovy-exe-inx)         .
           call      w-ovy-exe-pat       using i-ide
                                               w-ovy-exe
                                               w-tin
                                               w-spg                  .
       qry-trt-fun-722.
      *                      *-----------------------------------------*
      *                      * Cancellazione del sottoprogramma        *
      *                      *-----------------------------------------*
           move      w-ovy-exe-spv
                    (w-ovy-exe-inx)       to   w-ovy-exe-pos          .
           cancel    w-ovy-exe-pat                                    .
           subtract  1                    from w-ovy-exe-inx          .
       qry-trt-fun-724.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-730.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento 03 : materia prima         *
      *                  *---------------------------------------------*
       qry-trt-fun-732.
      *                      *-----------------------------------------*
      *                      * Se programma di implosione ad un livel- *
      *                      * lo materia prima gia' attivo : uscita   *
      *                      *-----------------------------------------*
           move      "IULMAP    "         to   w-spg-alf-gat          .
           perform   tst-spg-gat-000      thru tst-spg-gat-999        .
           if        w-spg-snx-gat        not  = spaces
                     go to qry-trt-fun-999.
       qry-trt-fun-734.
      *                      *-----------------------------------------*
      *                      * Preparazione pathname completo per l'e- *
      *                      * secuzione del sottoprogramma da richia- *
      *                      * mare, ricercando nella tabella dei tipi *
      *                      * interrogazione; se non trovato : uscita *
      *                      *-----------------------------------------*
           move      zero                 to   w-tin-ele-inx          .
       qry-trt-fun-736.
           add       1                    to   w-tin-ele-inx          .
           if        w-tin-ele-inx        >    w-tin-ele-num
                     go to qry-trt-fun-999.
           if        w-tin-alf-tin
                    (w-tin-ele-inx)       not  = "IULMAP    "
                     go to qry-trt-fun-736.
           if        w-tin-ovy-tin
                    (w-tin-ele-inx)       =    spaces
                     go to qry-trt-fun-999.
           move      w-tin-ovy-tin
                    (w-tin-ele-inx)       to   w-ovy-exe-pos          .
       qry-trt-fun-738.
      *                      *-----------------------------------------*
      *                      * Scrittura variabile di i.p.c. 'num-com' *
      *                      * per lo stesso livello di profondita'    *
      *                      * applicativa per il codice numerico del  *
      *                      * componente di tipo materia prima da im- *
      *                      * plodere                                 *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "num-com"            to   s-var                  .
           move      "="                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      07                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-num-com        to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       qry-trt-fun-740.
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           add       1                    to   w-ovy-exe-inx          .
           move      w-ovy-exe-pos        to   w-ovy-exe-spv
                                              (w-ovy-exe-inx)         .
           call      w-ovy-exe-pat       using i-ide
                                               w-ovy-exe
                                               w-tin
                                               w-spg                  .
       qry-trt-fun-742.
      *                      *-----------------------------------------*
      *                      * Cancellazione del sottoprogramma        *
      *                      *-----------------------------------------*
           move      w-ovy-exe-spv
                    (w-ovy-exe-inx)       to   w-ovy-exe-pos          .
           cancel    w-ovy-exe-pat                                    .
           subtract  1                    from w-ovy-exe-inx          .
       qry-trt-fun-744.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-750.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento 99 : sub-distinta virtuale *
      *                  *---------------------------------------------*
       qry-trt-fun-752.
      *                      *-----------------------------------------*
      *                      * Se programma di implosione ad un livel- *
      *                      * lo sub-distinta virtuale gia' attivo :  *
      *                      * uscita                                  *
      *                      *-----------------------------------------*
           move      "IULSDV    "         to   w-spg-alf-gat          .
           perform   tst-spg-gat-000      thru tst-spg-gat-999        .
           if        w-spg-snx-gat        not  = spaces
                     go to qry-trt-fun-999.
       qry-trt-fun-754.
      *                      *-----------------------------------------*
      *                      * Preparazione pathname completo per l'e- *
      *                      * secuzione del sottoprogramma da richia- *
      *                      * mare, ricercando nella tabella dei tipi *
      *                      * interrogazione; se non trovato : uscita *
      *                      *-----------------------------------------*
           move      zero                 to   w-tin-ele-inx          .
       qry-trt-fun-756.
           add       1                    to   w-tin-ele-inx          .
           if        w-tin-ele-inx        >    w-tin-ele-num
                     go to qry-trt-fun-999.
           if        w-tin-alf-tin
                    (w-tin-ele-inx)       not  = "IULSDV    "
                     go to qry-trt-fun-756.
           if        w-tin-ovy-tin
                    (w-tin-ele-inx)       =    spaces
                     go to qry-trt-fun-999.
           move      w-tin-ovy-tin
                    (w-tin-ele-inx)       to   w-ovy-exe-pos          .
       qry-trt-fun-758.
      *                      *-----------------------------------------*
      *                      * Scrittura variabile di i.p.c. 'num-com' *
      *                      * per lo stesso livello di profondita'    *
      *                      * applicativa per il codice numerico del  *
      *                      * componente di tipo sub-distiinta virtu- *
      *                      * ale da implodere                        *
      *                      *-----------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "num-com"            to   s-var                  .
           move      "="                  to   s-dop                  .
           move      "N"                  to   s-tip                  .
           move      07                   to   s-car                  .
           move      zero                 to   s-dec                  .
           move      spaces               to   s-sgn                  .
           move      v-cnt                to   w-mpn                  .
           move      w-mpn-num-com        to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       qry-trt-fun-760.
      *                      *-----------------------------------------*
      *                      * Richiamo del sottoprogramma             *
      *                      *-----------------------------------------*
           add       1                    to   w-ovy-exe-inx          .
           move      w-ovy-exe-pos        to   w-ovy-exe-spv
                                              (w-ovy-exe-inx)         .
           call      w-ovy-exe-pat       using i-ide
                                               w-ovy-exe
                                               w-tin
                                               w-spg                  .
       qry-trt-fun-762.
      *                      *-----------------------------------------*
      *                      * Cancellazione del sottoprogramma        *
      *                      *-----------------------------------------*
           move      w-ovy-exe-spv
                    (w-ovy-exe-inx)       to   w-ovy-exe-pos          .
           cancel    w-ovy-exe-pat                                    .
           subtract  1                    from w-ovy-exe-inx          .
       qry-trt-fun-764.
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-900.
      *              *-------------------------------------------------*
      *              * Se function-key non riconosciuta                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione function key                *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     qry-trt-fun-999.
       qry-trt-fun-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [dcp]                         *
      *    *-----------------------------------------------------------*
       let-arc-dcp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcp-num    =    zero  
                     go to let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      w-let-arc-dcp-num    to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcp-400.
       let-arc-dcp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           if        rf-dcp-tip-pro       =    01
                     move  "M"            to   w-let-arc-dcp-tpr
           else if   rf-dcp-tip-pro       =    02
                     move  "S"            to   w-let-arc-dcp-tpr
           else if   rf-dcp-tip-pro       =    03
                     move  "I"            to   w-let-arc-dcp-tpr
           else if   rf-dcp-tip-pro       =    09
                     move  "X"            to   w-let-arc-dcp-tpr
           else      move  spaces         to   w-let-arc-dcp-tpr      .
           move      rf-dcp-alf-pro       to   w-let-arc-dcp-alf      .
           move      rf-dcp-des-pro       to   w-let-arc-dcp-des      .
           move      rf-dcp-umi-ven       to   w-let-arc-dcp-umi      .
           move      rf-dcp-dec-qta       to   w-let-arc-dcp-deq      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcp-999.
       let-arc-dcp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcp-flg      .
           move      all   "."            to   w-let-arc-dcp-des      .
           go to     let-arc-dcp-600.
       let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-des      .
       let-arc-dcp-600.
           move      spaces               to   w-let-arc-dcp-alf      .
           move      spaces               to   w-let-arc-dcp-tpr      .
           move      spaces               to   w-let-arc-dcp-umi      .
           move      zero                 to   w-let-arc-dcp-deq      .
       let-arc-dcp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [dps]                         *
      *    *-----------------------------------------------------------*
       let-arc-dps-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dps-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dps-num    =    zero  
                     go to let-arc-dps-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMSEM"             to   f-key                  .
           move      w-let-arc-dps-num    to   rf-dps-num-sem         .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dps-400.
       let-arc-dps-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dps-alf-sem       to   w-let-arc-dps-alf      .
           move      rf-dps-des-sem       to   w-let-arc-dps-des      .
           move      rf-dps-umi-prd       to   w-let-arc-dps-umi      .
           move      rf-dps-dec-qta       to   w-let-arc-dps-deq      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dps-999.
       let-arc-dps-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dps-flg      .
           move      all   "."            to   w-let-arc-dps-des      .
           go to     let-arc-dps-600.
       let-arc-dps-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dps-des      .
       let-arc-dps-600.
           move      spaces               to   w-let-arc-dps-alf      .
           move      spaces               to   w-let-arc-dps-umi      .
           move      zero                 to   w-let-arc-dps-deq      .
       let-arc-dps-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [lgv]                         *
      *    *-----------------------------------------------------------*
       let-arc-lgv-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-lgv-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-lgv-num    =    zero  
                     go to let-arc-lgv-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMLGV"             to   f-key                  .
           move      w-let-arc-lgv-num    to   rf-lgv-num-lgv         .
           move      "pgm/dtp/fls/ioc/obj/ioflgv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgv                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-lgv-400.
       let-arc-lgv-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-lgv-alf-lgv       to   w-let-arc-lgv-alf      .
           move      rf-lgv-des-lgv       to   w-let-arc-lgv-des      .
           move      rf-lgv-umi-prd       to   w-let-arc-lgv-umi      .
           move      rf-lgv-dec-qta       to   w-let-arc-lgv-deq      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-lgv-999.
       let-arc-lgv-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-lgv-flg      .
           move      all   "."            to   w-let-arc-lgv-des      .
           go to     let-arc-lgv-600.
       let-arc-lgv-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-lgv-des      .
       let-arc-lgv-600.
           move      spaces               to   w-let-arc-lgv-alf      .
           move      spaces               to   w-let-arc-lgv-umi      .
           move      zero                 to   w-let-arc-lgv-deq      .
       let-arc-lgv-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [dpm]                         *
      *    *-----------------------------------------------------------*
       let-arc-dpm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dpm-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dpm-num    =    zero  
                     go to let-arc-dpm-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMMAP"             to   f-key                  .
           move      w-let-arc-dpm-num    to   rf-dpm-num-map         .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dpm-400.
       let-arc-dpm-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dpm-alf-map       to   w-let-arc-dpm-alf      .
           move      rf-dpm-des-map       to   w-let-arc-dpm-des      .
           move      rf-dpm-umi-prd       to   w-let-arc-dpm-umi      .
           move      rf-dpm-dec-qta       to   w-let-arc-dpm-deq      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dpm-999.
       let-arc-dpm-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dpm-flg      .
           move      all   "."            to   w-let-arc-dpm-des      .
           go to     let-arc-dpm-600.
       let-arc-dpm-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dpm-des      .
       let-arc-dpm-600.
           move      spaces               to   w-let-arc-dpm-alf      .
           move      spaces               to   w-let-arc-dpm-umi      .
           move      zero                 to   w-let-arc-dpm-deq      .
       let-arc-dpm-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [lgt]                         *
      *    *-----------------------------------------------------------*
       let-arc-lgt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-lgt-flg      .
      *              *-------------------------------------------------*
      *              * Test se tipo assieme a zero                     *
      *              *-------------------------------------------------*
           if        w-let-arc-lgt-tip    =    zero  
                     go to let-arc-lgt-500.
      *              *-------------------------------------------------*
      *              * Test se codice assieme a zero                   *
      *              *-------------------------------------------------*
           if        w-let-arc-lgt-num    =    zero  
                     go to let-arc-lgt-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "TNMASS"             to   f-key                  .
           move      w-let-arc-lgt-tip    to   rf-lgt-tpm-ass         .
           move      w-let-arc-lgt-num    to   rf-lgt-nrm-ass         .
           move      "pgm/dtp/fls/ioc/obj/ioflgt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgt                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-lgt-400.
       let-arc-lgt-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-lgt-sig-dis       to   w-let-arc-lgt-dis      .
           move      rf-lgt-rcm-ass (1)   to   w-let-arc-lgt-rco (1)  .
           move      rf-lgt-rcm-ass (2)   to   w-let-arc-lgt-rco (2)  .
           move      rf-lgt-rcm-ass (3)   to   w-let-arc-lgt-rco (3)  .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-lgt-999.
       let-arc-lgt-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-lgt-flg      .
       let-arc-lgt-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-lgt-dis      .
           move      spaces               to   w-let-arc-lgt-rco (1)  .
           move      spaces               to   w-let-arc-lgt-rco (2)  .
           move      spaces               to   w-let-arc-lgt-rco (3)  .
       let-arc-lgt-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per accettazione codice prodotto 'dcp'        *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acoddcp0.acs"                   .

      *    *===========================================================*
      *    * Subroutine di esplosione scalare distinta base            *
      *    *                                                           *
      *    * ----------------                                          *
      *    *                                                           *
      *    * Attenzione : Questa routine utilizza numerosi file, che   *
      *    *              sono di seguito elencati. Essi vengono tut-  *
      *    *              ti trattati in lettura, ma nel far questo    *
      *    *              vengono rovinate le Start eventualmente ese- *
      *    *              guite su di essi.                            *
      *    *                                                           *
      *    *              Pertanto i programmi che intendono utilizza- *
      *    *              re la seguente routine non devono assoluta-  *
      *    *              mente utilizzare come files principali i fi- *
      *    *              les utilizzati :                             *
      *    *                                                           *
      *    *                  - [lgt]                                  *
      *    *                  - [lgr]                                  *
      *    *                  - [dcp]                                  *
      *    *                  - [dps]                                  *
      *    *                  - [dpm]                                  *
      *    *                  - [lgv]                                  *
      *    *                                                           *
      *    *              Inoltre non e' possibile utilizzare nel ci-  *
      *    *              clo principale nemmeno i moduli di filtro    *
      *    *              per ordinamento e/o selezione anagrafiche,   *
      *    *              in quanto questi, in alcune circostanze,     *
      *    *              utilizzano a loro volta come files guida i   *
      *    *              files :                                      *
      *    *                                                           *
      *    *                  - [dcp]                                  *
      *    *                  - [dps]                                  *
      *    *                  - [dpm]                                  *
      *    *                                                           *
      *    *              Nei casi in cui si dovesse assolutamente a-  *
      *    *              vere un file guida tra quelli non consentiti *
      *    *              da questa routine, sara' necessario :        *
      *    *                                                           *
      *    *                  - Preparare preventivamente un file tem- *
      *    *                    poraneo di appoggio come file guida    *
      *    *                                                           *
      *    *                  - Utilizzare tale file temporaneo di ap- *
      *    *                    poggio come file guida                 *
      *    *                                                           *
      *    *                  - Cancellare tale file temporaneo di ap- *
      *    *                    poggio alla fine dell'esecuzione       *
      *    *                                                           *
      *    *                  Nota : Il file di appoggio temporaneo    *
      *    *                         puo' essere costituito da un fi-  *
      *    *                         le di sort, in quanto questa ro-  *
      *    *                         utine non utilizza il sort.       *
      *    *                                                           *
      *    * ----------------                                          *
      *    *                                                           *
      *    * Presume che preventivamente siano stati definiti ed aper- *
      *    * ti i seguenti files:                                      *
      *    *                                                           *
      *    *  - [lgt] : Testate distinte base                          *
      *    *  - [lgr] : Righe distinte base                            *
      *    *  - [dcp] : Anagrafica prodotti finiti                     *
      *    *  - [dps] : Anagrafica semilavorati                        *
      *    *  - [dpm] : Anagrafica materie prime                       *
      *    *  - [lgv] : Anagrafica subdistinte virtuali                *
      *    *                                                           *
      *    * ----------------                                          *
      *    *                                                           *
      *    * - Funzione 'E-INI'                                        *
      *    *                                                           *
      *    *   Deve necessariamente essere richiamata, per ogni esplo- *
      *    *   sione da eseguire, prima delle altre funzioni.          *
      *    *                                                           *
      *    *   - Input  : w-esp-scl-dtp-fun = 'E-INI'                  *
      *    *                                                           *
      *    *              w-esp-scl-dtp-tde = Tipo codice magazzino da *
      *    *                                  esplodere                *
      *    *                                   - 01 : Prodotto finito  *
      *    *                                   - 02 : Semilavorato     *
      *    *                                   - 99 : Subdistinta vir- *
      *    *                                          tuale            *
      *    *                                                           *
      *    *              w-esp-scl-dtp-nde = Codice numerico magazzi- *
      *    *                                  no da esplodere o codice *
      *    *                                  numerico della subdis-   *
      *    *                                  tinta virtuale           *
      *    *                                                           *
      *    *              w-esp-scl-dtp-ade = Codice alfanumerico cor- *
      *    *                                  rispondente al codice    *
      *    *                                  numerico precedente      *
      *    *                                                           *
      *    *              w-esp-scl-dtp-qde = Quantita' da esplodere   *
      *    *                                                           *
      *    *   - Output : w-esp-scl-dtp-tip = Tipo di elemento         *
      *    *                                                           *
      *    *              w-esp-scl-dtp-num = Codice numerico dell'e-  *
      *    *                                  lemento                  *
      *    *                                                           *
      *    *              w-esp-scl-dtp-alf = Codice alfanumerico del- *
      *    *                                  l'elemento               *
      *    *                                                           *
      *    *              w-esp-scl-dtp-liv = Livello di profondita'   *
      *    *                                  relativo all'elemento,   *
      *    *                                  forzato a zero           *
      *    *                                                           *
      *    *              w-esp-scl-dtp-qta = Quantita' totale relati- *
      *    *                                  va all'elemento          *
      *    *                                                           *
      *    *              w-esp-scl-dtp-ana = Segnale di anagrafica e- *
      *    *                                  sistente                 *
      *    *                                   - Spaces : Si           *
      *    *                                   - '#'    : No           *
      *    *                                                           *
      *    *              w-esp-scl-dtp-des = Descrizione da anagrafi- *
      *    *                                  ca elemento              *
      *    *                                                           *
      *    *              w-esp-scl-dtp-umi = Unita' di misura da ana- *
      *    *                                  grafica elemento         *
      *    *                                                           *
      *    *              w-esp-scl-dtp-dec = Numero decimali quantita'*
      *    *                                  da anagrafica elemento   *
      *    *                                                           *
      *    *              rf-dcp, oppure    = Anagrafica elemento, a   *
      *    *              rf-dps, oppure      seconda del tipo ele-    *
      *    *              rf-dpm, oppure      mento, se anagrafica e-  *
      *    *              rf-lgv              sistente                 *
      *    *                                                           *
      *    * ----------------                                          *
      *    *                                                           *
      *    * - Funzione 'E-GET'                                        *
      *    *                                                           *
      *    *   Ottenimento dell'elemento successivo relativo all'es-   *
      *    *   plosione scalare.                                       *
      *    *                                                           *
      *    *   - Input  : w-esp-scl-dtp-fun = 'E-GET'                  *
      *    *                                                           *
      *    *   - Output : w-esp-scl-dtp-sts = Status di uscita         *
      *    *                                   - Spaces : Ok, elemento *
      *    *                                              successivo a *
      *    *                                              disposizione *
      *    *                                   - '#'    : Fine elemen- *
      *    *                                              ti nella di- *
      *    *                                              stinta       *
      *    *                                                           *
      *    *              w-esp-scl-dtp-tip = Tipo di elemento trovato *
      *    *                                  nella scansione          *
      *    *                                   - 01 : Prodotto finito  *
      *    *                                   - 02 : Semilavorato     *
      *    *                                   - 03 : Materia prima    *
      *    *                                   - 99 : Subdistinta vir- *
      *    *                                          tuale            *
      *    *                                                           *
      *    *              w-esp-scl-dtp-num = Codice numerico dell'e-  *
      *    *                                  lemento trovato nella    *
      *    *                                  scansione                *
      *    *                                                           *
      *    *              w-esp-scl-dtp-alf = Codice alfanumerico del- *
      *    *                                  l'elemento trovato nel-  *
      *    *                                  la scansione             *
      *    *                                                           *
      *    *              w-esp-scl-dtp-liv = Livello di profondita'   *
      *    *                                  relativo all'elemento    *
      *    *                                  trovato nella scansione, *
      *    *                                  assumendo come base il   *
      *    *                                  livello zero relativo    *
      *    *                                  all'assieme da esplodere *
      *    *                                                           *
      *    *              w-esp-scl-dtp-qta = Quantita' totale relati- *
      *    *                                  va all'elemento trovato  *
      *    *                                  nella scansione          *
      *    *                                                           *
      *    *              w-esp-scl-dtp-ana = Segnale di anagrafica e- *
      *    *                                  sistente                 *
      *    *                                   - Spaces : Si           *
      *    *                                   - '#'    : No           *
      *    *                                                           *
      *    *              w-esp-scl-dtp-des = Descrizione da anagrafi- *
      *    *                                  ca elemento              *
      *    *                                                           *
      *    *              w-esp-scl-dtp-umi = Unita' di misura da ana- *
      *    *                                  grafica elemento         *
      *    *                                                           *
      *    *              w-esp-scl-dtp-dec = Numero decimali quantita'*
      *    *                                  da anagrafica elemento   *
      *    *                                                           *
      *    *              rf-dcp, oppure    = Anagrafica elemento, a   *
      *    *              rf-dps, oppure      seconda del tipo ele-    *
      *    *              rf-dpm, oppure      mento, se anagrafica e-  *
      *    *              rf-lgv              sistente                 *
      *    *                                                           *
      *    * ----------------                                          *
      *    *                                                           *
      *    * - Funzione 'E-SKP'                                        *
      *    *                                                           *
      *    *   Ottenimento dell'elemento successivo dello stesso li-   *
      *    *   vello dell'ultimo elemento trovato, evitando in tal     *
      *    *   modo di entrare piu' in profondita' per quanto riguar-  *
      *    *   da i semilavorati e le subdistinte virtuali.            *
      *    *                                                           *
      *    *   - Input  : w-esp-scl-dtp-fun = 'E-SKP'                  *
      *    *                                                           *
      *    *   - Output : Esattamente come per funzione 'E-GET'        *
      *    *                                                           *
      *    *-----------------------------------------------------------*
       esp-scl-dtp-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda della funzione richiesta   *
      *              *-------------------------------------------------*
           if        w-esp-scl-dtp-fun    =    "E-INI"
                     go to esp-scl-dtp-050
           else if   w-esp-scl-dtp-fun    =    "E-GET"
                     go to esp-scl-dtp-100
           else if   w-esp-scl-dtp-fun    =    "E-SKP"
                     go to esp-scl-dtp-250
           else      go to esp-scl-dtp-999.
       esp-scl-dtp-050.
      *              *-------------------------------------------------*
      *              * Funzione 'E-INI'                                *
      *              *-------------------------------------------------*
       esp-scl-dtp-055.
      *                  *---------------------------------------------*
      *                  * Livello di lavoro a : 01                    *
      *                  *---------------------------------------------*
           move      01                   to   w-esp-scl-dtp-wlp      .
      *                  *---------------------------------------------*
      *                  * Segnale di prossima operazione da eseguire  *
      *                  * a : Start sul livello di profondita interno *
      *                  * attuale                                     *
      *                  *---------------------------------------------*
           move      "S"                  to   w-esp-scl-dtp-wpo      .
       esp-scl-dtp-060.
      *                  *---------------------------------------------*
      *                  * Preparazione valori per il 1. livello       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tipo elemento                           *
      *                      *-----------------------------------------*
           move      w-esp-scl-dtp-tde    to   w-esp-scl-dtp-wti (01) .
      *                      *-----------------------------------------*
      *                      * Codice numerico elemento                *
      *                      *-----------------------------------------*
           move      w-esp-scl-dtp-nde    to   w-esp-scl-dtp-wnu (01) .
      *                      *-----------------------------------------*
      *                      * Codice alfanumerico elemento            *
      *                      *-----------------------------------------*
           move      w-esp-scl-dtp-ade    to   w-esp-scl-dtp-wal (01) .
      *                      *-----------------------------------------*
      *                      * Numero progressivo per riga distinta    *
      *                      *-----------------------------------------*
           move      zero                 to   w-esp-scl-dtp-wrg (01) .
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica elemento e determi-  *
      *                      * nazione dei seguenti valori:            *
      *                      *  - Elemento anagraficamente esistente   *
      *                      *  - Descrizione anagrafica elemento      *
      *                      *  - Unita' di misura elemento            *
      *                      *  - Numero decimali per quantita'        *
      *                      *-----------------------------------------*
           perform   esp-scl-dtp-800      thru esp-scl-dtp-809        .
      *                      *-----------------------------------------*
      *                      * Quantita' relativa all'elemento         *
      *                      *-----------------------------------------*
           move      w-esp-scl-dtp-qde    to   w-esp-scl-dtp-wqt (01) .
           if        w-esp-scl-dtp-wnd (01)
                                          =    zero
                     add     0,499        to   w-esp-scl-dtp-wqt (01)
                     divide   1000        into w-esp-scl-dtp-wqt (01)
                                                         rounded
                     multiply 1000        by   w-esp-scl-dtp-wqt (01)
           else if   w-esp-scl-dtp-wnd (01)
                                          =    1
                     add     0,049        to   w-esp-scl-dtp-wqt (01)
                     divide    100        into w-esp-scl-dtp-wqt (01)
                                                         rounded
                     multiply  100        by   w-esp-scl-dtp-wqt (01)
           else if   w-esp-scl-dtp-wnd (01)
                                          =    2
                     add     0,004        to   w-esp-scl-dtp-wqt (01)
                     divide     10        into w-esp-scl-dtp-wqt (01)
                                                         rounded
                     multiply   10        by   w-esp-scl-dtp-wqt (01) .
       esp-scl-dtp-065.
      *                  *---------------------------------------------*
      *                  * Preparazione valori in uscita, escluso lo   *
      *                  * status, relativi all'elemento               *
      *                  *---------------------------------------------*
           perform   esp-scl-dtp-820      thru esp-scl-dtp-829        .
       esp-scl-dtp-070.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     esp-scl-dtp-999.
       esp-scl-dtp-100.
      *              *-------------------------------------------------*
      *              * Funzione 'E-GET'                                *
      *              *-------------------------------------------------*
       esp-scl-dtp-105.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del;valore del segnale *
      *                  * di prossima operazione da eseguire          *
      *                  *---------------------------------------------*
           if        w-esp-scl-dtp-wpo    =    "S"
                     go to esp-scl-dtp-110
           else if   w-esp-scl-dtp-wpo    =    "U"
                     go to esp-scl-dtp-140
           else      go to esp-scl-dtp-145.
       esp-scl-dtp-110.
      *                  *---------------------------------------------*
      *                  * Se operazione da eseguire : Start sul li-   *
      *                  * vello di profondita' interno attuale        *
      *                  *---------------------------------------------*
       esp-scl-dtp-115.
      *                      *-----------------------------------------*
      *                      * Esecuzione 'Start'                      *
      *                      *-----------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "GT"                 to   f-cfr                  .
           move      "TNMASS    "         to   f-key                  .
           move      w-esp-scl-dtp-wti
                    (w-esp-scl-dtp-wlp)   to   rf-lgr-tpm-ass         .
           move      w-esp-scl-dtp-wnu
                    (w-esp-scl-dtp-wlp)   to   rf-lgr-nrm-ass         .
           move      w-esp-scl-dtp-wrg
                    (w-esp-scl-dtp-wlp)   to   rf-lgr-num-prg         .
           move      "pgm/dtp/fls/ioc/obj/ioflgr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgr                 .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda dell'esito della   *
      *                      * 'Start'                                 *
      *                      *-----------------------------------------*
           if        f-sts                =    e-not-err
                     go to esp-scl-dtp-130.
       esp-scl-dtp-120.
      *                      *-----------------------------------------*
      *                      * Se 'Start' errata : non ci sono altri   *
      *                      * elementi nella distinta o subdistinta   *
      *                      *-----------------------------------------*
       esp-scl-dtp-125.
      *                          *-------------------------------------*
      *                          * Decremento livello di profondita'   *
      *                          * interno                             *
      *                          *-------------------------------------*
           subtract  1                    from w-esp-scl-dtp-wlp      .
      *                          *-------------------------------------*
      *                          * Se raggiunto il livello di profon-  *
      *                          * dita' interno zero : uscita con se- *
      *                          * gnale di fine scansione             *
      *                          *-------------------------------------*
           if        w-esp-scl-dtp-wlp    =    zero
                     move  "#"            to   w-esp-scl-dtp-sts
                     go to esp-scl-dtp-999.
      *                          *-------------------------------------*
      *                          * Segnale di prossima operazione da   *
      *                          * eseguire : Start sul livello di     *
      *                          * profondita' attuale                 *
      *                          *-------------------------------------*
           move      "S"                  to   w-esp-scl-dtp-wpo      .
      *                          *-------------------------------------*
      *                          * Riciclo per esecuzione Start        *
      *                          *-------------------------------------*
           go to     esp-scl-dtp-105.
       esp-scl-dtp-130.
      *                      *-----------------------------------------*
      *                      * Se 'Start' andata a buon fine : possono *
      *                      * esserci altri elementi nella distinta o *
      *                      * subdistinta                             *
      *                      *-----------------------------------------*
       esp-scl-dtp-135.
      *                          *-------------------------------------*
      *                          * Segnale di prossima operazione da   *
      *                          * eseguire : Read Next sul livello di *
      *                          * profondita' attuale                 *
      *                          *-------------------------------------*
           move      "N"                  to   w-esp-scl-dtp-wpo      .
      *                          *-------------------------------------*
      *                          * Riciclo per esecuzione Read Next    *
      *                          *-------------------------------------*
           go to     esp-scl-dtp-105.
       esp-scl-dtp-140.
      *                  *---------------------------------------------*
      *                  * Se operazione da eseguire : Incremento di   *
      *                  * un livello e Start sul livello di profondi- *
      *                  * ta' interno aumentato                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Incremento livello di profondita' in-   *
      *                      * terno                                   *
      *                      *-----------------------------------------*
           add       1                    to   w-esp-scl-dtp-wlp      .
      *                      *-----------------------------------------*
      *                      * Segnale di prossima operazione da ese-  *
      *                      * guire : Start sul livello di profondi-  *
      *                      * ta' interno attuale                     *
      *                      *-----------------------------------------*
           move      "S"                  to   w-esp-scl-dtp-wpo      .
      *                      *-----------------------------------------*
      *                      * Riciclo per esecuzione Start            *
      *                      *-----------------------------------------*
           go to     esp-scl-dtp-105.
       esp-scl-dtp-145.
      *                  *---------------------------------------------*
      *                  * Se operazione da eseguire : Read Next sul   *
      *                  * livello di profondita' attuale              *
      *                  *---------------------------------------------*
       esp-scl-dtp-150.
      *                      *-----------------------------------------*
      *                      * Esecuzione 'Read Next'                  *
      *                      *-----------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dtp/fls/ioc/obj/ioflgr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgr                 .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda dell'esito della   *
      *                      * 'Read Next'                             *
      *                      *-----------------------------------------*
           if        f-sts                =    e-not-err
                     go to esp-scl-dtp-160.
       esp-scl-dtp-155.
      *                      *-----------------------------------------*
      *                      * Se 'At end' : non ci sono altri elemen- *
      *                      * ti nella distinta o subdistinta         *
      *                      *-----------------------------------------*
           go to     esp-scl-dtp-120.
       esp-scl-dtp-160.
      *                      *-----------------------------------------*
      *                      * Se 'Read Next' andata a buon fine       *
      *                      *-----------------------------------------*
       esp-scl-dtp-165.
      *                          *-------------------------------------*
      *                          * Test max per verificare se si e'    *
      *                          * raggiunta la fine della distinta o  *
      *                          * subdistinta, e deviazione a seconda *
      *                          * dell'esito del test                 *
      *                          *-------------------------------------*
           if        rf-lgr-tpm-ass       =    w-esp-scl-dtp-wti
                                              (w-esp-scl-dtp-wlp) and
                     rf-lgr-nrm-ass       =    w-esp-scl-dtp-wnu
                                              (w-esp-scl-dtp-wlp)
                     go to esp-scl-dtp-175.
       esp-scl-dtp-170.
      *                          *-------------------------------------*
      *                          * Se si e' raggiunta la fine della    *
      *                          * distinta o subdistinta              *
      *                          *-------------------------------------*
           go to     esp-scl-dtp-120.
       esp-scl-dtp-175.
      *                          *-------------------------------------*
      *                          * Se si e' ancora nell'ambito della   *
      *                          * distinta o subdistinta del livello  *
      *                          * di profondita' interno attuale      *
      *                          *-------------------------------------*
       esp-scl-dtp-180.
      *                              *---------------------------------*
      *                              * Aggiornamento del numero pro-   *
      *                              * gressivo riga relativo al li-   *
      *                              * vello di profondita' interno    *
      *                              * attuale                         *
      *                              *---------------------------------*
           move      rf-lgr-num-prg       to   w-esp-scl-dtp-wrg
                                              (w-esp-scl-dtp-wlp)     .
       esp-scl-dtp-185.
      *                              *---------------------------------*
      *                              * Salvataggio livello di profon-  *
      *                              * dita' interno attuale           *
      *                              *---------------------------------*
           move      w-esp-scl-dtp-wlp    to   w-esp-scl-dtp-wls      .
      *                              *---------------------------------*
      *                              * Incremento livello di profondi- *
      *                              * ta' interno attuale             *
      *                              *---------------------------------*
           add       1                    to   w-esp-scl-dtp-wlp      .
       esp-scl-dtp-190.
      *                              *---------------------------------*
      *                              * Preparazione valori per il li-  *
      *                              * vello di profondita' interno    *
      *                              * attuale aumentato di 1          *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Tipo elemento               *
      *                                  *-----------------------------*
           move      rf-lgr-tpm-cpt       to   w-esp-scl-dtp-wti
                                              (w-esp-scl-dtp-wlp)     .
      *                                  *-----------------------------*
      *                                  * Codice numerico elemento    *
      *                                  *-----------------------------*
           move      rf-lgr-nrm-cpt       to   w-esp-scl-dtp-wnu
                                              (w-esp-scl-dtp-wlp)     .
      *                                  *-----------------------------*
      *                                  * Codice alfanumerico elemen- *
      *                                  * to                          *
      *                                  *-----------------------------*
           move      rf-lgr-afm-cpt       to   w-esp-scl-dtp-wal
                                              (w-esp-scl-dtp-wlp)     .
      *                                  *-----------------------------*
      *                                  * Numero progressivo di riga  *
      *                                  * distinta                    *
      *                                  *-----------------------------*
           move      zero                to   w-esp-scl-dtp-wrg
                                             (w-esp-scl-dtp-wlp)      .
      *                                  *-----------------------------*
      *                                  * Lettura anagrafica elemento *
      *                                  * e determinazione dei se-    *
      *                                  * guenti valori :             *
      *                                  *  - Elemento anagraficamente *
      *                                  *    esistente                *
      *                                  *  - Descrizione anagrafica   *
      *                                  *    elemento                 *
      *                                  *  - Unita' di misura elemen- *
      *                                  *    to                       *
      *                                  *  - Numero decimali per la   *
      *                                  *    quantita'                *
      *                                  *-----------------------------*
           perform   esp-scl-dtp-800      thru esp-scl-dtp-809        .
      *                                  *-----------------------------*
      *                                  * Quantita' relativa all'ele- *
      *                                  * mento                       *
      *                                  *-----------------------------*
           move      w-esp-scl-dtp-wqt
                    (w-esp-scl-dtp-wls)  to   w-esp-scl-dtp-wqt
                                             (w-esp-scl-dtp-wlp)      .
           multiply  rf-lgr-qta-ipm      by   w-esp-scl-dtp-wqt
                                             (w-esp-scl-dtp-wlp)      .
           if        rf-lgr-qta-ipd      not  = zero
                     divide   rf-lgr-qta-ipd
                                         into w-esp-scl-dtp-wqt
                                             (w-esp-scl-dtp-wlp)      .
           if        w-esp-scl-dtp-wnd
                    (w-esp-scl-dtp-wlp)   =    zero
                     add     0,499        to   w-esp-scl-dtp-wqt
                                              (w-esp-scl-dtp-wlp)
                     divide   1000        into w-esp-scl-dtp-wqt
                                              (w-esp-scl-dtp-wlp)
                                                         rounded
                     multiply 1000        by   w-esp-scl-dtp-wqt
                                              (w-esp-scl-dtp-wlp)
           else if   w-esp-scl-dtp-wnd
                    (w-esp-scl-dtp-wlp)   =    1
                     add     0,049        to   w-esp-scl-dtp-wqt
                                              (w-esp-scl-dtp-wlp)
                     divide    100        into w-esp-scl-dtp-wqt
                                              (w-esp-scl-dtp-wlp)
                                                         rounded
                     multiply  100        by   w-esp-scl-dtp-wqt
                                              (w-esp-scl-dtp-wlp)
           else if   w-esp-scl-dtp-wnd
                    (w-esp-scl-dtp-wlp)   =    2
                     add     0,004        to   w-esp-scl-dtp-wqt
                                              (w-esp-scl-dtp-wlp)
                     divide     10        into w-esp-scl-dtp-wqt
                                              (w-esp-scl-dtp-wlp)
                                                         rounded
                     multiply   10        by   w-esp-scl-dtp-wqt
                                              (w-esp-scl-dtp-wlp)     .
       esp-scl-dtp-195.
      *                              *---------------------------------*
      *                              * Preparazione valori in uscita,  *
      *                              * escluso lo status, relativi     *
      *                              * all'elemento                    *
      *                              *---------------------------------*
           perform   esp-scl-dtp-820      thru esp-scl-dtp-829        .
       esp-scl-dtp-200.
      *                              *---------------------------------*
      *                              * Preparazione della prossima o-  *
      *                              * perazione da eseguire, a se-    *
      *                              * conda del tipo di elemento      *
      *                              *                                 *
      *                              *   - Prodotto finito       : 'U' *
      *                              *                                 *
      *                              *   - Semilavorato          : 'U' *
      *                              *                                 *
      *                              *   - Materia prima         : 'N' *
      *                              *                                 *
      *                              *   - Subdistinta virtuale  : 'U' *
      *                              *                                 *
      *                              *   - Tipo non riconosciuto : 'N' *
      *                              *                                 *
      *                              *---------------------------------*
           if        w-esp-scl-dtp-wti
                    (w-esp-scl-dtp-wlp)   =    01 or
                     w-esp-scl-dtp-wti
                    (w-esp-scl-dtp-wlp)   =    02 or
                     w-esp-scl-dtp-wti
                    (w-esp-scl-dtp-wlp)   =    99
                     move  "U"            to   w-esp-scl-dtp-wpo
           else      move  "N"            to   w-esp-scl-dtp-wpo      .
       esp-scl-dtp-205.
      *                              *---------------------------------*
      *                              * Ripristino livello di profon-   *
      *                              * dita' interno attuale           *
      *                              *---------------------------------*
           move      w-esp-scl-dtp-wls    to   w-esp-scl-dtp-wlp      .
       esp-scl-dtp-210.
      *                              *---------------------------------*
      *                              * Status di uscita a : Ok         *
      *                              *---------------------------------*
           move      spaces               to   w-esp-scl-dtp-sts      .
       esp-scl-dtp-215.
      *                              *---------------------------------*
      *                              * Uscita                          *
      *                              *---------------------------------*
           go to     esp-scl-dtp-999.
       esp-scl-dtp-250.
      *              *-------------------------------------------------*
      *              * Funzione 'E-SKP'                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se il segnale di prossima operazione da e-  *
      *                  * seguire e' pari a 'U' lo si porta a 'N'     *
      *                  *---------------------------------------------*
           if        w-esp-scl-dtp-wpo    =    "U"
                     move  "N"            to   w-esp-scl-dtp-wpo      .
      *                  *---------------------------------------------*
      *                  * Dopodiche' si esegue la funzione 'E-GET'    *
      *                  *---------------------------------------------*
           go to     esp-scl-dtp-100.
       esp-scl-dtp-800.
      *              *-------------------------------------------------*
      *              * Subroutine per la lettura dell'anagrafica rela- *
      *              * tiva all'elemento di tipo e codice numerico di  *
      *              * cui al livello di profondita' interna definito  *
      *              * in : w-esp-scl-dtp-wlp                          *
      *              *-------------------------------------------------*
       esp-scl-dtp-801.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo elemento      *
      *                  *---------------------------------------------*
           if        w-esp-scl-dtp-wti
                    (w-esp-scl-dtp-wlp)   =    01
                     go to esp-scl-dtp-802
           else if   w-esp-scl-dtp-wti
                    (w-esp-scl-dtp-wlp)   =    02
                     go to esp-scl-dtp-803
           else if   w-esp-scl-dtp-wti
                    (w-esp-scl-dtp-wlp)   =    03
                     go to esp-scl-dtp-804
           else if   w-esp-scl-dtp-wti
                    (w-esp-scl-dtp-wlp)   =    99
                     go to esp-scl-dtp-805
           else      go to esp-scl-dtp-808.
       esp-scl-dtp-802.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento 01 : Prodotto finito       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica [dcp]                *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      w-esp-scl-dtp-wnu
                    (w-esp-scl-dtp-wlp)   to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Se anagrafica non esistente             *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-esp-scl-dtp-wes
                                              (w-esp-scl-dtp-wlp)
                     move  all "."        to   w-esp-scl-dtp-wde
                                              (w-esp-scl-dtp-wlp)
                     move  all "."        to   w-esp-scl-dtp-wum
                                              (w-esp-scl-dtp-wlp)
                     move  zero           to   w-esp-scl-dtp-wnd
                                              (w-esp-scl-dtp-wlp)
                     go to esp-scl-dtp-809.
      *                      *-----------------------------------------*
      *                      * Se anagrafica esistente                 *
      *                      *-----------------------------------------*
           move      spaces               to   w-esp-scl-dtp-wes
                                              (w-esp-scl-dtp-wlp)     .
           move      rf-dcp-des-pro       to   w-esp-scl-dtp-wde
                                              (w-esp-scl-dtp-wlp)     .
           move      rf-dcp-umi-ven       to   w-esp-scl-dtp-wum
                                              (w-esp-scl-dtp-wlp)     .
           move      rf-dcp-dec-qta       to   w-esp-scl-dtp-wnd
                                              (w-esp-scl-dtp-wlp)     .
           go to     esp-scl-dtp-809.
       esp-scl-dtp-803.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento 02 : Semilavorato          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica [dps]                *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMSEM"             to   f-key                  .
           move      w-esp-scl-dtp-wnu
                    (w-esp-scl-dtp-wlp)   to   rf-dps-num-sem         .
           move      "pgm/dps/fls/ioc/obj/iofdps"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dps                 .
      *                      *-----------------------------------------*
      *                      * Se anagrafica non esistente             *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-esp-scl-dtp-wes
                                              (w-esp-scl-dtp-wlp)
                     move  all "."        to   w-esp-scl-dtp-wde
                                              (w-esp-scl-dtp-wlp)
                     move  all "."        to   w-esp-scl-dtp-wum
                                              (w-esp-scl-dtp-wlp)
                     move  zero           to   w-esp-scl-dtp-wnd
                                              (w-esp-scl-dtp-wlp)
                     go to esp-scl-dtp-809.
      *                      *-----------------------------------------*
      *                      * Se anagrafica esistente                 *
      *                      *-----------------------------------------*
           move      spaces               to   w-esp-scl-dtp-wes
                                              (w-esp-scl-dtp-wlp)     .
           move      rf-dps-des-sem       to   w-esp-scl-dtp-wde
                                              (w-esp-scl-dtp-wlp)     .
           move      rf-dps-umi-prd       to   w-esp-scl-dtp-wum
                                              (w-esp-scl-dtp-wlp)     .
           move      rf-dps-dec-qta       to   w-esp-scl-dtp-wnd
                                              (w-esp-scl-dtp-wlp)     .
           go to     esp-scl-dtp-809.
       esp-scl-dtp-804.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento 03 : Materia prima         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica [dpm]                *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMMAP"             to   f-key                  .
           move      w-esp-scl-dtp-wnu
                    (w-esp-scl-dtp-wlp)   to   rf-dpm-num-map         .
           move      "pgm/dpm/fls/ioc/obj/iofdpm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dpm                 .
      *                      *-----------------------------------------*
      *                      * Se anagrafica non esistente             *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-esp-scl-dtp-wes
                                              (w-esp-scl-dtp-wlp)
                     move  all "."        to   w-esp-scl-dtp-wde
                                              (w-esp-scl-dtp-wlp)
                     move  all "."        to   w-esp-scl-dtp-wum
                                              (w-esp-scl-dtp-wlp)
                     move  zero           to   w-esp-scl-dtp-wnd
                                              (w-esp-scl-dtp-wlp)
                     go to esp-scl-dtp-809.
      *                      *-----------------------------------------*
      *                      * Se anagrafica esistente                 *
      *                      *-----------------------------------------*
           move      spaces               to   w-esp-scl-dtp-wes
                                              (w-esp-scl-dtp-wlp)     .
           move      rf-dpm-des-map       to   w-esp-scl-dtp-wde
                                              (w-esp-scl-dtp-wlp)     .
           move      rf-dpm-umi-prd       to   w-esp-scl-dtp-wum
                                              (w-esp-scl-dtp-wlp)     .
           move      rf-dpm-dec-qta       to   w-esp-scl-dtp-wnd
                                              (w-esp-scl-dtp-wlp)     .
           go to     esp-scl-dtp-809.
       esp-scl-dtp-805.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento 99 : Subdistinta virtuale  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica [lgv]                *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMLGV"             to   f-key                  .
           move      w-esp-scl-dtp-wnu
                    (w-esp-scl-dtp-wlp)   to   rf-lgv-num-lgv         .
           move      "pgm/dtp/fls/ioc/obj/ioflgv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lgv                 .
      *                      *-----------------------------------------*
      *                      * Se anagrafica non esistente             *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-esp-scl-dtp-wes
                                              (w-esp-scl-dtp-wlp)
                     move  all "."        to   w-esp-scl-dtp-wde
                                              (w-esp-scl-dtp-wlp)
                     move  all "."        to   w-esp-scl-dtp-wum
                                              (w-esp-scl-dtp-wlp)
                     move  zero           to   w-esp-scl-dtp-wnd
                                              (w-esp-scl-dtp-wlp)
                     go to esp-scl-dtp-809.
      *                      *-----------------------------------------*
      *                      * Se anagrafica esistente                 *
      *                      *-----------------------------------------*
           move      spaces               to   w-esp-scl-dtp-wes
                                              (w-esp-scl-dtp-wlp)     .
           move      rf-lgv-des-lgv       to   w-esp-scl-dtp-wde
                                              (w-esp-scl-dtp-wlp)     .
           move      rf-lgv-umi-prd       to   w-esp-scl-dtp-wum
                                              (w-esp-scl-dtp-wlp)     .
           move      rf-lgv-dec-qta       to   w-esp-scl-dtp-wnd
                                              (w-esp-scl-dtp-wlp)     .
           go to     esp-scl-dtp-809.
       esp-scl-dtp-808.
      *                  *---------------------------------------------*
      *                  * Se tipo elemento di tipo non riconosciuto   *
      *                  *---------------------------------------------*
           move      "#"                  to   w-esp-scl-dtp-wes
                                              (w-esp-scl-dtp-wlp)     .
           move      all  "."             to   w-esp-scl-dtp-wde
                                              (w-esp-scl-dtp-wlp)     .
           move      all  "."             to   w-esp-scl-dtp-wum
                                              (w-esp-scl-dtp-wlp)     .
           move      zero                 to   w-esp-scl-dtp-wnd
                                              (w-esp-scl-dtp-wlp)     .
           go to     esp-scl-dtp-809.
       esp-scl-dtp-809.
           exit.
       esp-scl-dtp-820.
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori in u- *
      *              * scita relativi all'elemento di cui al livello   *
      *              * di profondita' di : w-esp-scl-dtp-wlp.          *
      *              * Ad esclusione dello status di uscita            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo elemento                               *
      *                  *---------------------------------------------*
           move      w-esp-scl-dtp-wti
                    (w-esp-scl-dtp-wlp)   to   w-esp-scl-dtp-tip      .
      *                  *---------------------------------------------*
      *                  * Codice numerico elemento                    *
      *                  *---------------------------------------------*
           move      w-esp-scl-dtp-wnu
                    (w-esp-scl-dtp-wlp)   to   w-esp-scl-dtp-num      .
      *                  *---------------------------------------------*
      *                  * Codice alfanumerico elemento                *
      *                  *---------------------------------------------*
           move      w-esp-scl-dtp-wal
                    (w-esp-scl-dtp-wlp)   to   w-esp-scl-dtp-alf      .
      *                  *---------------------------------------------*
      *                  * Livello di profondita' esterno, pari al li- *
      *                  * vello di profondita' interno diminuito di 1 *
      *                  *---------------------------------------------*
           move      w-esp-scl-dtp-wlp    to   w-esp-scl-dtp-liv      .
           subtract  1                    from w-esp-scl-dtp-liv      .
      *                  *---------------------------------------------*
      *                  * Quantita' relativa all'elemento             *
      *                  *---------------------------------------------*
           move      w-esp-scl-dtp-wqt
                    (w-esp-scl-dtp-wlp)   to   w-esp-scl-dtp-qta      .
      *                  *---------------------------------------------*
      *                  * Flag di anagrafica elemento esistente       *
      *                  *---------------------------------------------*
           move      w-esp-scl-dtp-wes
                    (w-esp-scl-dtp-wlp)   to   w-esp-scl-dtp-ana      .
      *                  *---------------------------------------------*
      *                  * Descrizione da anagrafica elemento          *
      *                  *---------------------------------------------*
           move      w-esp-scl-dtp-wde
                    (w-esp-scl-dtp-wlp)   to   w-esp-scl-dtp-des      .
      *                  *---------------------------------------------*
      *                  * Unita' di misura da anagrafica elemento     *
      *                  *---------------------------------------------*
           move      w-esp-scl-dtp-wum
                    (w-esp-scl-dtp-wlp)   to   w-esp-scl-dtp-umi      .
      *                  *---------------------------------------------*
      *                  * Numero decimali quantita' da anagrafica e-  *
      *                  * lemento                                     *
      *                  *---------------------------------------------*
           move      w-esp-scl-dtp-wnd
                    (w-esp-scl-dtp-wlp)   to   w-esp-scl-dtp-dec      .
      *                  *---------------------------------------------*
      *                  * Se anagrafica esistente si esce, altrimenti *
      *                  * si prepara la descrizione con il codice nu- *
      *                  * merico dell'elemento e con puntini          *
      *                  *---------------------------------------------*
           if        w-esp-scl-dtp-ana    =    spaces
                     go to esp-scl-dtp-829.
           move      all   "."            to   w-esp-scl-dtp-des      .
           string    "("
                                delimited by   size
                     w-esp-scl-dtp-num
                                delimited by   size
                     ")"
                                delimited by   size
                                          into w-esp-scl-dtp-des      .
       esp-scl-dtp-829.
           exit.
       esp-scl-dtp-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per gestione file relative [rel]              *
      *    *-----------------------------------------------------------*
       fil-rel-opn-000.
      *              *=================================================*
      *              * Funzione Open                                   *
      *              *-------------------------------------------------*
       fil-rel-opn-100.
      *                  *---------------------------------------------*
      *                  * Richiesta alla segreteria di un pathname    *
      *                  * unico er files temporanei, per il file      *
      *                  * relative                                    *
      *                  *---------------------------------------------*
           move      "UP"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       fil-rel-opn-200.
      *                  *---------------------------------------------*
      *                  * Preparazione area ausiliaria per controllo  *
      *                  * i-o sul file relative                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * File name                               *
      *                      *-----------------------------------------*
           move      "rel "               to   f-rel-nam              .
      *                      *-----------------------------------------*
      *                      * File pathname                           *
      *                      *-----------------------------------------*
           move      s-pat                to   f-rel-pat              .
      *                      *-----------------------------------------*
      *                      * File status                             *
      *                      *-----------------------------------------*
           move      "00"                 to   f-rel-sts              .
      *                      *-----------------------------------------*
      *                      * Max record number scritto               *
      *                      *-----------------------------------------*
           move      zero                 to   f-rel-kms              .
       fil-rel-opn-300.
      *                  *---------------------------------------------*
      *                  * Open vera e propria, con conseguente crea-  *
      *                  * zione del file relative temporaneo          *
      *                  *---------------------------------------------*
           open      i-o   rel                                        .
       fil-rel-opn-999.
           exit.

       fil-rel-cls-000.
      *              *=================================================*
      *              * Funzione Close                                  *
      *              *-------------------------------------------------*
       fil-rel-cls-100.
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           close     rel                                              .
       fil-rel-cls-200.
      *                  *---------------------------------------------*
      *                  * Cancellazione del file relative             *
      *                  *---------------------------------------------*
           delete    file    rel                                      .
       fil-rel-cls-999.
           exit.

       fil-rel-new-000.
      *              *=================================================*
      *              * Funzione New                                    *
      *              *-------------------------------------------------*
       fil-rel-new-100.
      *                  *---------------------------------------------*
      *                  * Record number per scrittura a zero          *
      *                  *---------------------------------------------*
           move      zero                 to   f-rel-put              .
       fil-rel-new-999.
           exit.

       fil-rel-inc-000.
      *              *=================================================*
      *              * Funzione Inc                                    *
      *              *-------------------------------------------------*
       fil-rel-inc-100.
      *                  *---------------------------------------------*
      *                  * Incremento record number per scrittura      *
      *                  *---------------------------------------------*
           add       1                    to   f-rel-put              .
       fil-rel-inc-999.
           exit.

       fil-rel-put-000.
      *              *=================================================*
      *              * Funzione Put                                    *
      *              *-------------------------------------------------*
       fil-rel-put-100.
      *                  *---------------------------------------------*
      *                  * Record number attuale pari al record number *
      *                  * per scrittura                               *
      *                  *---------------------------------------------*
           move      f-rel-put            to   f-rel-krn              .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del confronto tra il   *
      *                  * record number attuale ed il max record num- *
      *                  * ber scritto                                 *
      *                  *---------------------------------------------*
           if        f-rel-krn            not  > f-rel-kms
                     go to fil-rel-put-300.
       fil-rel-put-200.
      *                  *---------------------------------------------*
      *                  * Se il record number attuale e' maggiore del *
      *                  * max record number scritto si esegue un ten- *
      *                  * tativo per Write                            *
      *                  *---------------------------------------------*
           write     rel-rec invalid key
                             go to   fil-rel-put-300.
           go to     fil-rel-put-400.
       fil-rel-put-300.
      *                  *---------------------------------------------*
      *                  * Se il record number attuale non e' maggiore *
      *                  * del max record number scritto si esegue un  *
      *                  * tentativo per Rewrite                       *
      *                  *---------------------------------------------*
           rewrite   rel-rec invalid key
                             go to   fil-rel-put-200.
           go to     fil-rel-put-400.
       fil-rel-put-400.
      *                  *---------------------------------------------*
      *                  * Eventuale aggiornamento del max record num- *
      *                  * ber scritto                                 *
      *                  *---------------------------------------------*
           if        f-rel-krn            >    f-rel-kms
                     move  f-rel-krn      to   f-rel-kms              .
       fil-rel-put-999.
           exit.

       fil-rel-get-000.
      *              *=================================================*
      *              * Funzione Get                                    *
      *              *-------------------------------------------------*
       fil-rel-get-100.
      *                  *---------------------------------------------*
      *                  * Record number attuale pari al record number *
      *                  * per lettura                                 *
      *                  *---------------------------------------------*
           move      f-rel-get            to   f-rel-krn              .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del confronto tra il   *
      *                  * record number attuale ed il max record num- *
      *                  * ber scritto                                 *
      *                  *---------------------------------------------*
           if        f-rel-krn            not  > f-rel-kms
                     go to fil-rel-get-300.
       fil-rel-get-200.
      *                  *---------------------------------------------*
      *                  * Se il record number attuale e' maggiore del *
      *                  * max record number scritto si esce sicura-   *
      *                  * mente come per record non esistente         *
      *                  *---------------------------------------------*
           go to     fil-rel-get-600.
       fil-rel-get-300.
      *                  *---------------------------------------------*
      *                  * Se il record number attuale non e' maggiore *
      *                  * del max record number scritto               *
      *                  *---------------------------------------------*
       fil-rel-get-400.
      *                      *-----------------------------------------*
      *                      * Lettura con deviazione a seconda del-   *
      *                      * l'esito                                 *
      *                      *-----------------------------------------*
           read      rel     invalid key
                             go to   fil-rel-get-600.
       fil-rel-get-500.
      *                      *-----------------------------------------*
      *                      * Se record esistente                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     fil-rel-get-999.
       fil-rel-get-600.
      *                      *-----------------------------------------*
      *                      * Se record non esistente                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Segnale di record non esistente     *
      *                          *-------------------------------------*
           move      zero                 to   f-rel-get              .
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     fil-rel-get-999.
       fil-rel-get-999.
           exit.
