       Identification division.
       Program-Id.                                 paut1001           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    nob                 *
      *                        Area gestionale:    aut                 *
      *                                Settore:    sqz                 *
      *                                   Fase:    aut100              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 10/02/94    *
      *                       Ultima revisione:    NdK del 15/03/19    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione stampa per il programma aut100   *
      *                                                                *
      *                    Creazione movimenti di contabilita' genera- *
      *                    le e scadenze fornitori da file sequenziale *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     d-K-b-Snc-PD .
       Object-Computer.     d-K-b-Snc-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Filler                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Filler                                            *
      *            *---------------------------------------------------*
               10  filler                 pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "nob"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "aut"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "sqz"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "aut100"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "paut1001"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "  CARICAMENTO FATTURE FORNITORI DA FILE "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output su files *
      *    * di tipo line sequential                                   *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/g"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records logici                                            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [asy]                                                 *
      *        *-------------------------------------------------------*
           copy      "nob/aut/fls/rec/rfasy"                          .
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [yfp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfyfp"                          .
      *        *-------------------------------------------------------*
      *        * [zpg]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfzpg"                          .
      *        *-------------------------------------------------------*
      *        * [sfs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/fls/rec/rfsfs"                          .
      *        *-------------------------------------------------------*
      *        * [pdc]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfpdc"                          .
      *        *-------------------------------------------------------*
      *        * [zci]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfzci"                          .
      *        *-------------------------------------------------------*
      *        * [prtivf]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/num/rec/rnprtivf"                       .
      *        *-------------------------------------------------------*
      *        * [sfsnum]                                              *
      *        *-------------------------------------------------------*
           copy      "pgm/scf/num/rec/rnsfsnum"                       .

      *    *===========================================================*
      *    * Record per le richieste                                   *
      *    *-----------------------------------------------------------*
       01  rr.
           05  rr-pth-acc                 pic  x(40)                  .
           05  rr-pth-inp                 pic  x(40)                  .
           05  rr-dat-reg                 pic  9(07)                  .

      *    *===========================================================*
      *    * Work area per contatori ed indici                         *
      *    *-----------------------------------------------------------*
       01  w-cix.
      *        *-------------------------------------------------------*
      *        * Contatore numero righe scansionate                    *
      *        *-------------------------------------------------------*
           05  w-cix-num-rig              pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Contatore numero righe scritte                        *
      *        *-------------------------------------------------------*
           05  w-cix-wrt-rig              pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Contatore numero righe errate                         *
      *        *-------------------------------------------------------*
           05  w-cix-err-rig              pic  9(05)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [fnt]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-fnt.
               10  w-let-arc-fnt-flg      pic  x(01)                  .
               10  w-let-arc-fnt-cod      pic  9(07)                  .
               10  w-let-arc-fnt-rag      pic  x(40)                  .
               10  w-let-arc-fnt-via      pic  x(30)                  .
               10  w-let-arc-fnt-loc      pic  x(30)                  .
               10  w-let-arc-fnt-stc      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcf]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcf.
               10  w-let-arc-dcf-flg      pic  x(01)                  .
               10  w-let-arc-dcf-tle      pic  x(01)                  .
               10  w-let-arc-dcf-cod      pic  9(07)                  .
               10  w-let-arc-dcf-dpz      pic  x(04)                  .
               10  w-let-arc-dcf-rag      pic  x(40)                  .
               10  w-let-arc-dcf-via      pic  x(40)                  .
               10  w-let-arc-dcf-loc      pic  x(40)                  .
               10  w-let-arc-dcf-abi      pic  9(05)                  .
               10  w-let-arc-dcf-cab      pic  9(05)                  .
               10  w-let-arc-dcf-ccc      pic  x(12)                  .
               10  w-let-arc-dcf-ccp      pic  x(12)                  .
               10  w-let-arc-dcf-ban      pic  x(10)                  .
               10  w-let-arc-dcf-vlt      pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [yfp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-yfp.
               10  w-let-arc-yfp-flg      pic  x(01)                  .
               10  w-let-arc-yfp-cod      pic  9(07)                  .
               10  w-let-arc-yfp-des      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [pdc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-pdc.
               10  w-let-arc-pdc-flg      pic  x(01)                  .
               10  w-let-arc-pdc-cod      pic  9(07)                  .
               10  w-let-arc-pdc-des      pic  x(40)                  .

      *    *===========================================================*
      *    * Work per Let su archivio [zci]                            *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/larczci0.ltw"                   .

      *    *===========================================================*
      *    * Work per subroutines di editing codice iva                *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/wedtzci0.wkl"                   .

      *    *===========================================================*
      *    * Work area di bufferizzazione                              *
      *    *-----------------------------------------------------------*
       01  w-buf.
      *        *-------------------------------------------------------*
      *        * Work per bufferizzazione anagrafica da stampare       *
      *        *-------------------------------------------------------*
           05  w-buf-ana-stp.
               10  w-buf-ana-stp-rs1      pic  x(40)                  .
               10  w-buf-ana-stp-rs2      pic  x(40)                  .
               10  w-buf-ana-stp-via      pic  x(40)                  .
               10  w-buf-ana-stp-loc      pic  x(40)                  .
               10  w-buf-ana-stp-int      pic  x(30)                  .

      *    *===========================================================*
      *    * Work area per messaggi di errore                          *
      *    *-----------------------------------------------------------*
       01  w-msg.
      *        *-------------------------------------------------------*
      *        * Work per messaggi di errore a livello dettaglio       *
      *        *-------------------------------------------------------*
           05  w-msg-liv-det.
               10  w-msg-liv-det-msg      pic  x(80)                  .
               10  w-msg-liv-det-ctr      pic  x(05)                  .

      *    *===========================================================*
      *    * Work per subroutines di numerazioni progressive           *
      *    *-----------------------------------------------------------*
       01  w-num.
      *        *-------------------------------------------------------*
      *        * Work per Num [prtivf]                                 *
      *        *-------------------------------------------------------*
           05  w-num-prt-ivf.
               10  w-num-prt-ivf-dat      pic  9(07)                  .
               10  w-num-prt-ivf-ngi      pic  9(02)                  .
               10  w-num-prt-ivf-prt      pic  9(07)                  .
               10  w-num-prt-ivf-dec      pic  9(07)                  .
               10  w-num-prt-ivf-inc      pic  9(07)                  .
               10  w-num-prt-ivf-flg      pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di attribuzione numero scadenza for- *
      *    * nitori                                                    *
      *    *-----------------------------------------------------------*
       01  w-sfs-num.
           05  w-sfs-num-scl-ann          pic  9(03)                  .
           05  w-sfs-num-num-scf          pic  9(11)                  .
           05  w-sfs-num-r01-scf redefines
               w-sfs-num-num-scf.
               10  w-sfs-num-r01-saa      pic  9(03)                  .
               10  w-sfs-num-r01-num      pic  9(08)                  .
           05  w-sfs-num-val-pre          pic  9(08)                  .
           05  w-sfs-num-val-pos          pic  9(08)                  .

      *    *===========================================================*
      *    * Area di comunicazione per movimento di contabilita'       *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/pcge300z.pgl"                   .

      *    *===========================================================*
      *    * Work per scrittura movimenti                              *
      *    *-----------------------------------------------------------*
       01  w-wrt-mov.
      *        *-------------------------------------------------------*
      *        * Work per scrittura movimenti di registrazione scaden- *
      *        * ze fornitori                                          *
      *        *-------------------------------------------------------*
           05  w-wrt-mov-rsf.
      *            *---------------------------------------------------*
      *            * Numero delle scadenze da generare                 *
      *            *---------------------------------------------------*
               10  w-wrt-mov-rsf-wdg      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Numero delle scadenze generate                    *
      *            *---------------------------------------------------*
               10  w-wrt-mov-rsf-wsg      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Comodo per codici di pagamento                    *
      *            *---------------------------------------------------*
               10  w-wrt-mov-rsf-wcp      pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di presenza anagrafica commerciale del for-  *
      *            * nitore                                            *
      *            *---------------------------------------------------*
               10  w-wrt-mov-rsf-wff      pic  x(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det totale imposta                           *
      *        *-------------------------------------------------------*
           05  w-det-tot-imp.
      *            *---------------------------------------------------*
      *            * Imponibile                                        *
      *            *---------------------------------------------------*
               10  w-det-tot-imp-ibl      pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Iva                                               *
      *            *---------------------------------------------------*
               10  w-det-tot-imp-cod      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Importo con Iva                                   *
      *            *---------------------------------------------------*
               10  w-det-tot-imp-imp      pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Campi di comodo                                   *
      *            *---------------------------------------------------*
               10  w-det-tot-imp-ctr      pic  9(02)                  .
               10  w-det-tot-imp-wpa      pic s9(11)                  .
               10  w-det-tot-imp-s11      pic s9(11)                  .
               10  w-det-tot-imp-wpr      pic s9(11)                  .

      *    *===========================================================*
      *    * Work per valori trattati a livello dettaglio              *
      *    *-----------------------------------------------------------*
       01  w-prn-liv-det.
      *        *-------------------------------------------------------*
      *        * Data                                                  *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-dat.
               10  w-prn-liv-det-daa      pic  9(02)                  .
               10  w-prn-liv-det-dmm      pic  9(02)                  .
               10  w-prn-liv-det-dgg      pic  9(02)                  .
           05  w-prn-liv-det-ddo          pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Imposta                                               *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-imp          pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Importo ivato                                         *
      *        *-------------------------------------------------------*
           05  w-prn-liv-det-tot          pic s9(11)                  .

      *    *===========================================================*
      *    * Work-area referenze                                       *
      *    *-----------------------------------------------------------*
       01  w-ref.
      *        *-------------------------------------------------------*
      *        * Sottoconto 'iva acquisti'                             *
      *        *-------------------------------------------------------*
           05  w-ref-iva-acq              pic  9(07)                  .

      *    *===========================================================*
      *    * Work per calcolo tabella scadenze                         *
      *    *-----------------------------------------------------------*
       01  w-clc-tbl-scd.
      *        *-------------------------------------------------------*
      *        * Parametri in input                                    *
      *        *-------------------------------------------------------*
           05  w-clc-tbl-scd-inp.
      *            *---------------------------------------------------*
      *            * Codice della forma di pagamento                   *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-fdp      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data documento                                    *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-ddo      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Totale imponibile per il documento                *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-ibl      pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Totale iva per il documento                       *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-iva      pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Ammontare della quota a forfait                   *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-qaf      pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Ammontare dell'acconto da considerare             *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-acc      pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Eventuale data decorrenza prima scadenza manuale  *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-ddp      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codici di pagamento associati alla forma di paga- *
      *            * mento                                             *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-tcp.
      *                *-----------------------------------------------*
      *                * Elemento della tabella codici di pagamento    *
      *                * associati alla forma di pagamento             *
      *                *-----------------------------------------------*
                   15  w-clc-tbl-scd-etc occurs 03.
      *                    *-------------------------------------------*
      *                    * Codice di pagamento vero e proprio; se a  *
      *                    * zero l'elemento non e' significativo      *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-cdp
                                          pic  9(07)                  .
      *                    *-------------------------------------------*
      *                    * Tipo di ammontare su cui agisce il codice *
      *                    * di pagamento vero e proprio :             *
      *                    * - 01 : Il totale documento                *
      *                    * - 02 : Il totale imponibile               *
      *                    * - 03 : Una % del totale documento         *
      *                    * - 04 : Una % del totale imponibile        *
      *                    * - 05 : Il totale iva                      *
      *                    * - 06 : Solo la quota a forfait            *
      *                    * - 07 : Il totale iva piu' la quota a for- *
      *                    *        fait                               *
      *                    * - 08 : Il totale documento meno la quota  *
      *                    *        a forfait                          *
      *                    * - 09 : Il totale imponibile meno la quota *
      *                    *        a forfait                          *
      *                    * - 10 : Il residuo per il totale documento *
      *                    * - 11 : Il residuo per il totale imponibi- *
      *                    *        le                                 *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-tam
                                          pic  9(02)                  .
      *                    *-------------------------------------------*
      *                    * Percentuale del totale documento o del    *
      *                    * totale imponibile se il tipo ammontare    *
      *                    * su cui agisce il codice di pagamento e'   *
      *                    * di tipo 03 oppure 04                      *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-pti
                                          pic  9(02)v9(01)            .
      *                    *-------------------------------------------*
      *                    * Segnale di diminuzione dell'ammontare per *
      *                    * l'importo dell'acconto da considerare     *
      *                    * - 01 : No, nessuna diminuzione, default   *
      *                    * - 02 : Si, l'ammontare viene diminuito    *
      *                    *            per l'acconto da considerare   *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-dda
                                          pic  9(02)                  .
      *                    *-------------------------------------------*
      *                    * Tipo di pagamento                         *
      *                    * - 01 : Rimessa diretta                    *
      *                    * - 02 : Incasso elettronico                *
      *                    * - 03 : Accredito preautorizzato in conto  *
      *                    * - 04 : Bonifico bancario                  *
      *                    * - 05 : Conto corrente postale             *
      *                    * - 06 : Ricevuta bancaria tradizionale     *
      *                    * - 07 : Tratta                             *
      *                    * - 08 : Paghero'                           *
      *                    * - 99 : Dilazione di pagamento             *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-tpg
                                          pic  9(02)                  .
      *                    *-------------------------------------------*
      *                    * Numero di scadenze : 01..96               *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-nsp
                                          pic  9(02)                  .
      *                    *-------------------------------------------*
      *                    * Decorrenza della prima scadenza           *
      *                    * - 01 : Manuale                            *
      *                    * - 02 : Ad una data prefissata (gg/mm)     *
      *                    * - 03 : A vista                            *
      *                    * - 04 : A  15 giorni                       *
      *                    * - 05 : A  30 giorni                       *
      *                    * - 06 : A  45 giorni                       *
      *                    * - 07 : A  60 giorni                       *
      *                    * - 08 : A  90 giorni                       *
      *                    * - 09 : A 120 giorni                       *
      *                    * - 10 : A 150 giorni                       *
      *                    * - 11 : A 180 giorni                       *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-dps
                                          pic  9(02)                  .
      *                    *-------------------------------------------*
      *                    * Data prefissata, mese, solo se decorrenza *
      *                    * prima scadenza di tipo 02                 *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-dpm
                                          pic  9(02)                  .
      *                    *-------------------------------------------*
      *                    * Data prefissata, giorno, solo se decor-   *
      *                    * renza prima scadenza di tipo 02           *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-dpg
                                          pic  9(02)                  .
      *                    *-------------------------------------------*
      *                    * Giorni di intervallo tra due scadenze     *
      *                    * - 00 : Non significativo                  *
      *                    * - 01 : Di 30 giorni in 30 giorni          *
      *                    * - 02 : Di 15 giorni in 15 giorni          *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-gdi
                                          pic  9(02)                  .
      *                    *-------------------------------------------*
      *                    * Tipo di scadenza nel mese                 *
      *                    * - 00 : Non significativo                  *
      *                    * - 01 : Giorno di decorrenza               *
      *                    * - 02 : Fine mese                          *
      *                    * - 03 : Giorno fisso nel mese              *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-tsm
                                          pic  9(02)                  .
      *                    *-------------------------------------------*
      *                    * Giorno fisso di scadenza nel mese, solo   *
      *                    * se tipo di scadenza nel mese a 03         *
      *                    * - 00     : Se non significativo           *
      *                    * - 01..28 : Se significativo               *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-gfs
                                          pic  9(02)                  .
      *                    *-------------------------------------------*
      *                    * Codice causale contabile per l'aggiorna-  *
      *                    * mento associata al codice di pagamento    *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-ccp
                                          pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Tipo esclusione mesi per scadenze                 *
      *            * - 01 : Nessun mese escluso                        *
      *            * - 02 : Si sposta la scadenza di un mese           *
      *            * - 03 : Si sposta la scadenza ad un giorno fisso   *
      *            *        del mese successivo                        *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-esm      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Giorno di scadenza fisso nel mese successivo, se  *
      *            * tipo esclusione mese pari a 03                    *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-alt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Primo mese di esclusione                          *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-e01      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Secondo mese di esclusione                        *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-e02      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Parametri in output                                   *
      *        *-------------------------------------------------------*
           05  w-clc-tbl-scd-out.
      *            *---------------------------------------------------*
      *            * Numero totale di scadenze calcolate : 00..96      *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-nts      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tabella scadenze calcolate                        *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-tsc.
      *                *-----------------------------------------------*
      *                * Elemento della tabella scadenze calcolate     *
      *                *                                               *
      *                * N.B.: Se questa tabella viene ampliata deve   *
      *                *       essere ampliato della stessa misura il  *
      *                *       campo 'w-clc-tbl-scd-wet', utilizzato   *
      *                *       come work per contenere un intero ele-  *
      *                *       mento della tabella in fase di ordina-  *
      *                *       mento                                   *
      *                *-----------------------------------------------*
                   15  w-clc-tbl-scd-ets occurs 96.
      *                    *-------------------------------------------*
      *                    * Data di scadenza                          *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-dds
                                          pic  9(07)                  .
      *                    *-------------------------------------------*
      *                    * Tipo di scadenza                          *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-tds
                                          pic  9(02)                  .
      *                    *-------------------------------------------*
      *                    * Codice della causale contabile per l'ag-  *
      *                    * giornamento                               *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-ccs
                                          pic  9(03)                  .
      *                    *-------------------------------------------*
      *                    * Importo della scadenza                    *
      *                    *-------------------------------------------*
                       20  w-clc-tbl-scd-ids
                                          pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Work-area locale per calcolo tabella scadenze         *
      *        *-------------------------------------------------------*
           05  w-clc-tbl-scd-wrk.
      *            *---------------------------------------------------*
      *            * Indice 1..3 su codici di pagamento associati alla *
      *            * forma di pagamento                                *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wip      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Progressivo ammontari utilizzati                  *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wau      pic s9(13)                  .
      *            *---------------------------------------------------*
      *            * Progressivo imponibile utilizzato                 *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wiu      pic s9(13)                  .
      *            *---------------------------------------------------*
      *            * Comodo per campo precedente                       *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wix      pic s9(13)                  .
      *            *---------------------------------------------------*
      *            * Importo dell'ammontare su cui agisce il singolo   *
      *            * codice di pagamento                               *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wap      pic s9(13)                  .
      *            *---------------------------------------------------*
      *            * Numero scadenze che devono essere calcolate per   *
      *            * il singolo codice di pagamento                    *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wnd      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Numero scadenze gia' calcolate per il singolo co- *
      *            * dice di pagamento                                 *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wnc      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Parte dell'ammontare gia' distribuito tra le sca- *
      *            * denze per il singolo codice di pagamento          *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wad      pic s9(13)                  .
      *            *---------------------------------------------------*
      *            * Importo per ciascuna scadenza tranne l'ultima     *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wis      pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Decorrenza per la scadenza in corso di trattamen- *
      *            * to per il singolo codice di pagamento, espressa   *
      *            * in giorni totali                                  *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wpd      pic  9(04)                  .
      *            *---------------------------------------------------*
      *            * Numero di mesi interi corrispondenti alla decor-  *
      *            * renza per la scadenza in corso di trattamento     *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wpm      pic  9(04)                  .
      *            *---------------------------------------------------*
      *            * Numero di giorni residui rispetto al numero di    *
      *            * mesi interi corrispondenti alla decorrenza per    *
      *            * la scadenza in corso di trattamento               *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wpg      pic  9(04)                  .
      *            *---------------------------------------------------*
      *            * Comodo per una data con ridefinizioni necessarie  *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wdt      pic  9(07)                  .
               10  w-clc-tbl-scd-wdr redefines
                   w-clc-tbl-scd-wdt.
                   15  w-clc-tbl-scd-wds  pic  9(03)                  .
                   15  w-clc-tbl-scd-wdm  pic  9(02)                  .
                   15  w-clc-tbl-scd-wdg  pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tabella giorni nei mesi e relativi comodi per il  *
      *            * calcolo del numero giorni di febbraio             *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wt0.
                   15  filler             pic  9(02)       value 31   .
                   15  filler             pic  9(02)       value 28   .
                   15  filler             pic  9(02)       value 31   .
                   15  filler             pic  9(02)       value 30   .
                   15  filler             pic  9(02)       value 31   .
                   15  filler             pic  9(02)       value 30   .
                   15  filler             pic  9(02)       value 31   .
                   15  filler             pic  9(02)       value 31   .
                   15  filler             pic  9(02)       value 30   .
                   15  filler             pic  9(02)       value 31   .
                   15  filler             pic  9(02)       value 30   .
                   15  filler             pic  9(02)       value 31   .
               10  w-clc-tbl-scd-wt1 redefines
                   w-clc-tbl-scd-wt0.
                   15  w-clc-tbl-scd-wt2
                               occurs 12  pic  9(02)                  .
               10  w-clc-tbl-scd-wt5      pic  9(04)                  .
               10  w-clc-tbl-scd-wt6      pic  9(04)                  .
               10  w-clc-tbl-scd-wt7      pic  9(04)                  .
      *            *---------------------------------------------------*
      *            * Comodi per piccoli calcoli locali                 *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wc4      pic  9(04)                  .
      *            *---------------------------------------------------*
      *            * Contatori per ordinamento                         *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wo1      pic  9(03)                  .
               10  w-clc-tbl-scd-wo2      pic  9(03)                  .
               10  w-clc-tbl-scd-wo3      pic  9(03)                  .
               10  w-clc-tbl-scd-wo4      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Comodo per elemento in tabella scadenze           *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wet.
                   15  w-clc-tbl-scd-wct  pic  9(02)                  .
                   15  w-clc-tbl-scd-wcd  pic  9(07)                  .
                   15  w-clc-tbl-scd-wcc  pic  9(03)                  .
                   15  w-clc-tbl-scd-wci  pic s9(11)                  .
      *            *---------------------------------------------------*
      *            * Contatori per compattamento                       *
      *            *---------------------------------------------------*
               10  w-clc-tbl-scd-wc1      pic  9(03)                  .
               10  w-clc-tbl-scd-wc2      pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err su controllo tasto Do                    *
      *        *-------------------------------------------------------*
           05  w-err-tdo-ric.
               10  w-err-tdo-ric-msg      pic  x(56)                  .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  filler                 pic  x(01)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
       pre-exe-pgm-100.
      *              *-------------------------------------------------*
      *              * Lettura referenze                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Sottoconto 'iva acquisti'                   *
      *                  *---------------------------------------------*
           move      "R:"                 to   s-ope                  .
           move      "pgm/cge/mov/cge300[iva-acq]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  s-num          to   w-ref-iva-acq
           else      move  zero           to   w-ref-iva-acq          .
      *                  *---------------------------------------------*
      *                  * Se referenza non trovata : uscita dal pro-  *
      *                  * gramma per errore                           *
      *                  *---------------------------------------------*
           if        w-ref-iva-acq        not  = zero
                     go to pre-exe-pgm-999.
      *                  *---------------------------------------------*
      *                  * Status di uscita                            *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-exe-pgm      .
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Referenze non trovate : programma non eseguibile !
      -              " "                  to   w-err-tdo-ric-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     pre-exe-pgm-999.
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [yfp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
      *              *-------------------------------------------------*
      *              * [zpg]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofzpg"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zpg                 .
      *              *-------------------------------------------------*
      *              * [sfs]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
      *              *-------------------------------------------------*
      *              * [pdc]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofpdc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdc                 .
      *              *-------------------------------------------------*
      *              * [zci]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *              *-------------------------------------------------*
      *              * [prtivf]                                        *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
      *              *-------------------------------------------------*
      *              * [sfsnum]                                        *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
       prn-opn-fls-900.
      *              *-------------------------------------------------*
      *              * Open programma di generazione automatica movi-  *
      *              * menti di CGE                                    *
      *              *-------------------------------------------------*
           move      "OP"                 to   l-cge-300-tip-ope      .
           perform   cll-300-zet-000      thru cll-300-zet-999        .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Chiusura del file in input                      *
      *              *-------------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo utilizzato                 *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mcvinp"                         .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [yfp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
      *              *-------------------------------------------------*
      *              * [zpg]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofzpg"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zpg                 .
      *              *-------------------------------------------------*
      *              * [sfs]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
      *              *-------------------------------------------------*
      *              * [pdc]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofpdc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdc                 .
      *              *-------------------------------------------------*
      *              * [zci]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofzci"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zci                 .
      *              *-------------------------------------------------*
      *              * [prtivf]                                        *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
      *              *-------------------------------------------------*
      *              * [sfsnum]                                        *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
       prn-cls-fls-900.
      *              *-------------------------------------------------*
      *              * Close programma di generazione automatica movi- *
      *              * menti di CGE                                    *
      *              *-------------------------------------------------*
           move      "CL"                 to   l-cge-300-tip-ope      .
           perform   cll-300-zet-000      thru cll-300-zet-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione programma di generazione automa-  *
      *              * tica movimenti di CGE                           *
      *              *-------------------------------------------------*
           move      "C?"                 to   l-cge-300-tip-ope      .
           perform   cll-300-zet-000      thru cll-300-zet-999        .
           if        l-cge-300-exi-sts    not  = spaces
                     go to prn-cls-fls-999.
           cancel    s-pat                                            .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : No                    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-exe-rou-srt      .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Normalizzazione contatori                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-cix-num-rig          .
           move      zero                 to   w-cix-wrt-rig          .
           move      zero                 to   w-cix-err-rig          .
      *              *-------------------------------------------------*
      *              * Apertura del file in input                      *
      *              *-------------------------------------------------*
           move      "OI"                 to   g-ope                  .
           move      "asy "               to   g-nam                  .
           move      rr-pth-inp           to   g-pat                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se Open errata                              *
      *                  *---------------------------------------------*
           if        g-sts                not  = e-not-err
                     move  "#"            to   w-cnt-prn-flg-sub      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessun elemento da sottoporre ad elaborazione !"
                                          to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file in input               *
      *              *-------------------------------------------------*
           move      "GN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se fine file                                *
      *                  *---------------------------------------------*
           if        g-sts                not  = e-not-err
                     move  "#"            to   w-cnt-prn-flg-sub      .
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Bufferizzazione linea letta                     *
      *              *-------------------------------------------------*
           move      g-rec                to   rf-asy                 .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Test su contatore righe errate                  *
      *              *-------------------------------------------------*
           if        w-cix-err-rig        =    zero
                     go to prn-fin-cic-999.
      *              *-------------------------------------------------*
      *              * Test su contatore righe scritte                 *
      *              *-------------------------------------------------*
           if        w-cix-wrt-rig        =    zero
                     go to prn-fin-cic-999.
      *              *-------------------------------------------------*
      *              * Editing contatore righe scritte                 *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-cix-wrt-rig        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-msg-liv-det-ctr      .
       prn-fin-cic-200.
      *              *-------------------------------------------------*
      *              * Messaggio di fine esecuzione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * 1. riga                                     *
      *                  *---------------------------------------------*
           move      all "-"              to   w-msg-liv-det-msg      .
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * 2. riga                                     *
      *                  *---------------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Totale documenti registrati regolarmente : "
                                delimited by   size
                     p-edt      delimited by   spaces
                                          into w-msg-liv-det-msg      .
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Normalizzazione messaggio di errore             *
      *              *-------------------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
      *              *-------------------------------------------------*
      *              * Incremento contatore righe scansionate          *
      *              *-------------------------------------------------*
           add       1                    to   w-cix-num-rig          .
      *              *-------------------------------------------------*
      *              * Editing contatore righe scansionate             *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-cix-num-rig        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-msg-liv-det-ctr      .
       prn-liv-det-100.
      *              *-------------------------------------------------*
      *              * Controlli preliminari                           *
      *              *-------------------------------------------------*
       prn-liv-det-110.
      *                  *---------------------------------------------*
      *                  * Su codice fornitore                         *
      *                  *---------------------------------------------*
           if        rf-asy-cod-fnt       not  = zero
                     go to prn-liv-det-120.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Codice fornitore a zero !"
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-900.
       prn-liv-det-120.
      *                  *---------------------------------------------*
      *                  * Su codice Iva                               *
      *                  *---------------------------------------------*
           if        rf-asy-cod-iva       not  = zero
                     go to prn-liv-det-130.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Codice Iva a zero !"
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-900.
       prn-liv-det-130.
      *                  *---------------------------------------------*
      *                  * Su Imponibile Iva                           *
      *                  *---------------------------------------------*
           if        rf-asy-ibl-iva       not  = zero
                     go to prn-liv-det-140.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Imponibile Iva a zero !"
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-900.
       prn-liv-det-140.
      *                  *---------------------------------------------*
      *                  * Su Contropartita acquisti                   *
      *                  *---------------------------------------------*
           if        rf-asy-ctp-acq       not  = zero
                     go to prn-liv-det-200.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Contropartita acquisti a zero !"
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-900.
       prn-liv-det-200.
      *              *-------------------------------------------------*
      *              * Test di esistenza dei valori in archivio        *
      *              *-------------------------------------------------*
       prn-liv-det-210.
      *                  *---------------------------------------------*
      *                  * Su codice fornitore contabile               *
      *                  *---------------------------------------------*
           move      rf-asy-cod-fnt       to   w-let-arc-fnt-cod      .
           perform   let-arc-fnt-000      thru let-arc-fnt-999        .
           if        w-let-arc-fnt-flg    =    spaces
                     go to prn-liv-det-215.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Anagrafica contabile Fornitore non tro
      -              "vata !"   delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-900.
       prn-liv-det-215.
      *                  *---------------------------------------------*
      *                  * Su codice fornitore commerciale             *
      *                  *---------------------------------------------*
           move      "C"                  to   w-let-arc-dcf-tle      .
           move      rf-asy-cod-fnt       to   w-let-arc-dcf-cod      .
           move      spaces               to   w-let-arc-dcf-dpz      .
           perform   let-arc-dcf-000      thru let-arc-dcf-999        .
           if        w-let-arc-dcf-flg    =    spaces
                     go to prn-liv-det-220.
      *                      *-----------------------------------------*
      *                      * Messaggio di avviso                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : Nota   - Anagrafica commerciale Fornitore non t
      -              "rovata !" delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Scrittura del messaggio di avviso       *
      *                      *-----------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-liv-det-220.
      *                  *---------------------------------------------*
      *                  * Su codice Iva                               *
      *                  *---------------------------------------------*
           move      rf-asy-cod-iva       to   w-let-arc-zci-cod      .
           perform   let-arc-zci-000      thru let-arc-zci-999        .
           if        w-let-arc-zci-flg    =    spaces
                     go to prn-liv-det-240.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Codice Iva non trovato in tabella !"
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-900.
       prn-liv-det-240.
      *                  *---------------------------------------------*
      *                  * Su Contropartita acquisti                   *
      *                  *---------------------------------------------*
           move      rf-asy-ctp-acq       to   w-let-arc-pdc-cod      .
           perform   let-arc-pdc-000      thru let-arc-pdc-999        .
           if        w-let-arc-pdc-flg    =    spaces
                     go to prn-liv-det-250.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : ERRORE - Contropartita acquisti non trovata !"
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Uscita per errore                       *
      *                      *-----------------------------------------*
           go to     prn-liv-det-900.
       prn-liv-det-250.
      *                  *---------------------------------------------*
      *                  * Su codice di pagamento                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se controllo da effettuare         *
      *                      *-----------------------------------------*
           if        rf-asy-cod-pag       =    zero
                     go to prn-liv-det-300.
      *                      *-----------------------------------------*
      *                      * Lettura archivio [yfp]                  *
      *                      *-----------------------------------------*
           move      rf-asy-cod-pag       to   w-let-arc-yfp-cod      .
           perform   let-arc-yfp-000      thru let-arc-yfp-999        .
           if        w-let-arc-yfp-flg    =    spaces
                     go to prn-liv-det-300.
      *                      *-----------------------------------------*
      *                      * Forzatura del valore                    *
      *                      *-----------------------------------------*
           move      0001130              to   rf-asy-cod-pag         .
       prn-liv-det-300.
      *              *-------------------------------------------------*
      *              * Altri controlli                                 *
      *              *-------------------------------------------------*
       prn-liv-det-310.
      *                  *---------------------------------------------*
      *                  * Test se presente la data documento          *
      *                  *---------------------------------------------*
           if        rf-asy-dat-doc       =    zero
                     go to prn-liv-det-320.
      *                  *---------------------------------------------*
      *                  * Manipolazione della data                    *
      *                  *---------------------------------------------*
           move      rf-asy-dat-doc       to   w-prn-liv-det-dat      .
           move      w-prn-liv-det-daa    to   s-saa                  .
           move      w-prn-liv-det-dmm    to   s-mes                  .
           move      w-prn-liv-det-dgg    to   s-gio                  .
           if        w-prn-liv-det-daa    <    25
                     add 100              to   s-saa                  .
           move      s-dat                to   w-prn-liv-det-ddo      .
      *                  *---------------------------------------------*
      *                  * Controllo data                              *
      *                  *---------------------------------------------*
           move      "CD"                 to   s-ope                  .
           move      w-prn-liv-det-ddo    to   s-dat                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-sts                =    spaces
                     go to prn-liv-det-320.
      *                      *-----------------------------------------*
      *                      * Messaggio di avviso                     *
      *                      *-----------------------------------------*
           move      spaces               to   w-msg-liv-det-msg      .
           string    "Riga nr. "
                                delimited by   size
                     w-msg-liv-det-ctr
                                delimited by   spaces
                     " : Nota   - Data con formato non corretto !" 
                                delimited by   size
                                          into w-msg-liv-det-msg      .
      *                      *-----------------------------------------*
      *                      * Scrittura del messaggio di avviso       *
      *                      *-----------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                      *-----------------------------------------*
      *                      * Normalizzazione della data              *
      *                      *-----------------------------------------*
           move      zero                 to   rf-asy-dat-doc         .
       prn-liv-det-320.
      *                  *---------------------------------------------*
      *                  * Normalizzazione valori per i calcoli        *
      *                  *---------------------------------------------*
           move      zero                 to   w-prn-liv-det-imp      .
           move      zero                 to   w-prn-liv-det-tot      .
      *                  *---------------------------------------------*
      *                  * Calcolo dell'Iva                            *
      *                  *---------------------------------------------*
           if        rf-asy-cod-iva       >    100
                     go to prn-liv-det-340.
           move      rf-asy-cod-iva       to   w-det-tot-imp-cod      .
           move      rf-asy-ibl-iva       to   w-det-tot-imp-ibl      .
           perform   det-tot-imp-000      thru det-tot-imp-999        .
           move      w-det-tot-imp-imp    to   w-prn-liv-det-imp      .
       prn-liv-det-340.
      *                  *---------------------------------------------*
      *                  * Calcolo dell'importo con Iva                *
      *                  *---------------------------------------------*
           move      rf-asy-ibl-iva       to   w-prn-liv-det-tot      .
           add       w-prn-liv-det-imp    to   w-prn-liv-det-tot      .
       prn-liv-det-400.
      *              *-------------------------------------------------*
      *              * Incremento contatore righe scritte              *
      *              *-------------------------------------------------*
           add       1                    to   w-cix-wrt-rig          .
      *              *-------------------------------------------------*
      *              * Write movimento CGE                             *
      *              *-------------------------------------------------*
           perform   wrt-mov-cge-000      thru wrt-mov-cge-999        .
       prn-liv-det-600.
      *              *-------------------------------------------------*
      *              * Write movimenti SCF                             *
      *              *-------------------------------------------------*
           perform   wrt-mov-rsf-000      thru wrt-mov-rsf-999        .
       prn-liv-det-800.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-900.
      *              *-------------------------------------------------*
      *              * Uscita con errori                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore righe scritte          *
      *                  *---------------------------------------------*
           add       1                    to   w-cix-err-rig          .
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "WR"                 to   m-ope                  .
           move      w-msg-liv-det-msg    to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-liv-det-999.
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio                                       *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [fnt]                         *
      *    *-----------------------------------------------------------*
       let-arc-fnt-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice fornitore a zero                 *
      *              *-------------------------------------------------*
           if        w-let-arc-fnt-cod    =    zero
                     go to let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT"             to   f-key                  .
           move      w-let-arc-fnt-cod    to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-fnt-400.
       let-arc-fnt-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-fnt-rag-soc       to   w-let-arc-fnt-rag      .
           move      rf-fnt-via-fnt       to   w-let-arc-fnt-via      .
           move      rf-fnt-loc-fnt       to   w-let-arc-fnt-loc      .
           move      rf-fnt-cod-cge       to   w-let-arc-fnt-stc      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-fnt-999.
       let-arc-fnt-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-fnt-flg      .
           move      all   "."            to   w-let-arc-fnt-rag      .
           move      all   "."            to   w-let-arc-fnt-via      .
           move      all   "."            to   w-let-arc-fnt-loc      .
           go to     let-arc-fnt-999.
       let-arc-fnt-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-fnt-rag      .
           move      spaces               to   w-let-arc-fnt-via      .
           move      spaces               to   w-let-arc-fnt-loc      .
           move      zero                 to   w-let-arc-fnt-stc      .
       let-arc-fnt-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio dipendenza fornitore in [dcf]    *
      *    *-----------------------------------------------------------*
       let-arc-dcf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcf-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice fornitore a zero                 *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-cod    =    zero
                     go to let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a spaces, solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-dpz    =    spaces and
                     w-let-arc-dcf-tle    =    "D"
                     go to let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Test se codice dipendenza a "*   ", solo se ri- *
      *              * chiesta di lettura specificamente di una dipen- *
      *              * denza                                           *
      *              *-------------------------------------------------*
           if        w-let-arc-dcf-dpz    =    "*   " and
                     w-let-arc-dcf-tle    =    "D"
                     go to let-arc-dcf-450.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      w-let-arc-dcf-cod    to   rf-dcf-cod-fnt         .
           move      w-let-arc-dcf-dpz    to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcf-400.
       let-arc-dcf-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcf-rag-soc       to   w-let-arc-dcf-rag      .
           move      rf-dcf-via-dcf       to   w-let-arc-dcf-via      .
           move      rf-dcf-loc-dcf       to   w-let-arc-dcf-loc      .
           move      rf-dcf-cod-abi       to   w-let-arc-dcf-abi      .
           move      rf-dcf-cod-cab       to   w-let-arc-dcf-cab      .
           move      rf-dcf-ccc-app       to   w-let-arc-dcf-ccc      .
           move      rf-dcf-ccp-app       to   w-let-arc-dcf-ccp      .
           if        w-let-arc-dcf-tle    =    "D"
                     move  spaces         to   w-let-arc-dcf-ban
           else      move  rf-dcf-nos-ban to   w-let-arc-dcf-ban
           move      rf-dcf-cod-vlt       to   w-let-arc-dcf-vlt      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcf-999.
       let-arc-dcf-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcf-flg      .
           move      all   "."            to   w-let-arc-dcf-rag      .
           go to     let-arc-dcf-600.
       let-arc-dcf-450.
      *              *-------------------------------------------------*
      *              * Normalizzazione per codice dipendenza "*   "    *
      *              *-------------------------------------------------*
           move      "Sia la sede che tutte le dipendenze     "
                                          to   w-let-arc-dcf-rag      .
           go to     let-arc-dcf-600.
       let-arc-dcf-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcf-rag      .
       let-arc-dcf-600.
           move      spaces               to   w-let-arc-dcf-via      .
           move      spaces               to   w-let-arc-dcf-loc      .
           move      zero                 to   w-let-arc-dcf-abi      .
           move      zero                 to   w-let-arc-dcf-cab      .
           move      zero                 to   w-let-arc-dcf-ccc      .
           move      spaces               to   w-let-arc-dcf-ccp      .
           move      spaces               to   w-let-arc-dcf-ban      .
           move      spaces               to   w-let-arc-dcf-vlt      .
       let-arc-dcf-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [yfp]                         *
      *    *-----------------------------------------------------------*
       let-arc-yfp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-yfp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice istituto a zero                  *
      *              *-------------------------------------------------*
           if        w-let-arc-yfp-cod    =    zero
                     go to let-arc-yfp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFOP"             to   f-key                  .
           move      w-let-arc-yfp-cod    to   rf-yfp-cod-fop         .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-yfp-400.
       let-arc-yfp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-yfp-des-fop       to   w-let-arc-yfp-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-yfp-999.
       let-arc-yfp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-yfp-flg      .
           move      all   "."            to   w-let-arc-yfp-des      .
           go to     let-arc-yfp-999.
       let-arc-yfp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-yfp-des      .
       let-arc-yfp-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [pdc]                         *
      *    *-----------------------------------------------------------*
       let-arc-pdc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-pdc-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice sottoconto a zero                *
      *              *-------------------------------------------------*
           if        w-let-arc-pdc-cod    =    zero
                     go to let-arc-pdc-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODPDC"             to   f-key                  .
           move      w-let-arc-pdc-cod    to   rf-pdc-cod-pdc         .
           move      "pgm/cge/fls/ioc/obj/iofpdc"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdc                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-pdc-400.
       let-arc-pdc-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-pdc-des-pdc       to   w-let-arc-pdc-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-pdc-999.
       let-arc-pdc-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-pdc-flg      .
           move      all   "."            to   w-let-arc-pdc-des      .
           go to     let-arc-pdc-999.
       let-arc-pdc-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-pdc-des      .
       let-arc-pdc-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [zci]                         *
      *    *-----------------------------------------------------------*
           copy      "pgm/cge/prg/cpy/larczci0.lts"                   .

      *    *===========================================================*
      *    * Scrittura movimento di CGE                                *
      *    *-----------------------------------------------------------*
       wrt-mov-cge-000.
      *              *-------------------------------------------------*
      *              * Attribuzione nuovo protocollo iva fornitori     *
      *              *-------------------------------------------------*
           move      rr-dat-reg           to   w-num-prt-ivf-dat      .
           move      rf-asy-num-giv       to   w-num-prt-ivf-ngi      .
           perform   att-prt-ivf-000      thru att-prt-ivf-999        .
      *              *-------------------------------------------------*
      *              * Manipolazione del numero documento se a spaces  *
      *              *-------------------------------------------------*
           if        rf-asy-num-doc       not  = spaces
                     go to wrt-mov-cge-050.
      *              *-------------------------------------------------*
      *              * Editing protocollo iva fornitori                *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-num-prt-ivf-prt    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   rf-asy-num-doc         .
       wrt-mov-cge-050.
      *              *-------------------------------------------------*
      *              * Normalizzazione link-area testata e riga movi-  *
      *              * mento per programma di generazione movimenti di *
      *              * CGE                                             *
      *              *-------------------------------------------------*
           move      "NO"                 to   l-cge-300-tip-ope      .
      *                  *---------------------------------------------*
      *                  * Chiamata modulo '300z'                      *
      *                  *---------------------------------------------*
           perform   cll-300-zet-000      thru cll-300-zet-999        .
      *              *-------------------------------------------------*
      *              * Scrittura testata e prima riga movimento : riga *
      *              * 'fornitore'                                     *
      *              *-------------------------------------------------*
           move      "WR"                 to   l-cge-300-tip-ope      .
           move      rr-dat-reg           to   l-cge-300-dat-reg      .
           move      zero                 to   l-cge-300-num-prt      .
      *                  *---------------------------------------------*
      *                  * Forzatura del valore per la causale conta-  *
      *                  * bile                                        *
      *                  *---------------------------------------------*
           move      510                  to   l-cge-300-cod-cau      .
           move      spaces               to   l-cge-300-des-cau      .
           move      "N"                  to   l-cge-300-snx-dts      .
           move      zero                 to   l-cge-300-dat-sca      .
           move      w-prn-liv-det-ddo    to   l-cge-300-dat-doc      .
           move      rf-asy-num-doc       to   l-cge-300-num-doc      .
           move      rf-asy-num-giv       to   l-cge-300-cod-num      .
           move      w-num-prt-ivf-prt    to   l-cge-300-prt-iva      .
           move      zero                 to   l-cge-300-cod-pdc      .
           move      "F"                  to   l-cge-300-tip-arc      .
           move      rf-asy-cod-fnt       to   l-cge-300-cod-arc      .
           move      spaces               to   l-cge-300-com-rig      .
           move      w-prn-liv-det-ddo    to   l-cge-300-dat-rif      .
           move      rf-asy-num-doc       to   l-cge-300-num-rif      .
           move      "A"                  to   l-cge-300-dar-ave      .
           move      rf-asy-ibl-iva       to   l-cge-300-ibl-iva (1)  .
           move      rf-asy-cod-iva       to   l-cge-300-cod-iva (1)  .
           move      w-prn-liv-det-imp    to   l-cge-300-imp-iva (1)  .
           move      w-prn-liv-det-tot    to   l-cge-300-imp-mov      .
      *                  *---------------------------------------------*
      *                  * Chiamata modulo '300z'                      *
      *                  *---------------------------------------------*
           perform   cll-300-zet-000      thru cll-300-zet-999        .
       wrt-mov-cge-100.
      *              *-------------------------------------------------*
      *              * Scrittura riga movimento : 'iva acquisti'       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione link-area sola riga         *
      *                  *---------------------------------------------*
           move      "N+"                 to   l-cge-300-tip-ope      .
           perform   cll-300-zet-000      thru cll-300-zet-999        .
      *                  *---------------------------------------------*
      *                  * Scrittura sola riga                         *
      *                  *---------------------------------------------*
           move      "W+"                 to   l-cge-300-tip-ope      .
           move      w-ref-iva-acq        to   l-cge-300-cod-pdc      .
           move      "G"                  to   l-cge-300-tip-arc      .
           move      zero                 to   l-cge-300-cod-arc      .
           move      spaces               to   l-cge-300-com-rig      .
           move      zero                 to   l-cge-300-dat-rif      .
           move      spaces               to   l-cge-300-num-rif      .
           move      "D"                  to   l-cge-300-dar-ave      .
           move      w-prn-liv-det-imp    to   l-cge-300-imp-mov      .
      *                  *---------------------------------------------*
      *                  * Chiamata modulo '300z'                      *
      *                  *---------------------------------------------*
           perform   cll-300-zet-000      thru cll-300-zet-999        .
       wrt-mov-cge-200.
      *              *-------------------------------------------------*
      *              * Scrittura riga movimento : 'contropartita       *
      *              *                             acquisti'           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione link-area sola riga         *
      *                  *---------------------------------------------*
           move      "N+"                 to   l-cge-300-tip-ope      .
           perform   cll-300-zet-000      thru cll-300-zet-999        .
      *                  *---------------------------------------------*
      *                  * Scrittura sola riga                         *
      *                  *---------------------------------------------*
           move      "W+"                 to   l-cge-300-tip-ope      .
           move      rf-asy-ctp-acq       to   l-cge-300-cod-pdc      .
           move      "G"                  to   l-cge-300-tip-arc      .
           move      zero                 to   l-cge-300-cod-arc      .
           move      spaces               to   l-cge-300-com-rig      .
           move      zero                 to   l-cge-300-dat-rif      .
           move      spaces               to   l-cge-300-num-rif      .
           move      "D"                  to   l-cge-300-dar-ave      .
           move      rf-asy-ibl-iva       to   l-cge-300-imp-mov      .
      *                  *---------------------------------------------*
      *                  * Chiamata modulo '300z'                      *
      *                  *---------------------------------------------*
           perform   cll-300-zet-000      thru cll-300-zet-999        .
       wrt-mov-cge-900.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     wrt-mov-cge-999.
       wrt-mov-cge-999.
           exit.

      *    *===========================================================*
      *    * Generazione scadenze fornitori a fronte fattura           *
      *    *-----------------------------------------------------------*
       wrt-mov-rsf-000.
      *              *-------------------------------------------------*
      *              * Letture preliminari                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione flag di presenza anagrafica *
      *                  * commerciale del fornitore                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-wrt-mov-rsf-wff      .
       wrt-mov-rsf-010.
      *                  *---------------------------------------------*
      *                  * Normalizzazione anagrafica fornitore        *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                  *---------------------------------------------*
      *                  * Anagrafica fornitore                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      rf-asy-cod-fnt       to   rf-dcf-cod-fnt         .
           move      spaces               to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                      *-----------------------------------------*
      *                      * Se record non trovato : flag di non     *
      *                      * trovato                                 *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-wrt-mov-rsf-wff      .
       wrt-mov-rsf-020.
      *                  *---------------------------------------------*
      *                  * Forma di pagamento                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se a zero : forzatura del valore        *
      *                      *-----------------------------------------*
           if        rf-asy-cod-pag       =    zero
                     move  0001130        to   rf-asy-cod-pag         .
      *                      *-----------------------------------------*
      *                      * Lettura per codice                      *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFOP"             to   f-key                  .
           move      rf-asy-cod-pag       to   rf-yfp-cod-fop         .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
      *                          *-------------------------------------*
      *                          * Se record non trovato : uscita      *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to wrt-mov-rsf-900.
       wrt-mov-rsf-030.
      *              *-------------------------------------------------*
      *              * Determinazione castelletto scadenze da generare *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Forma di pagamento                          *
      *                  *---------------------------------------------*
           move      rf-asy-cod-pag       to   w-clc-tbl-scd-fdp      .
      *                  *---------------------------------------------*
      *                  * Data documento per calcolo scadenze         *
      *                  *---------------------------------------------*
           move      rf-asy-dat-doc       to   w-clc-tbl-scd-ddo      .
      *                  *---------------------------------------------*
      *                  * Totale imponibile in valuta base            *
      *                  *---------------------------------------------*
           move      rf-asy-ibl-iva       to   w-clc-tbl-scd-ibl      .
      *                  *---------------------------------------------*
      *                  * Totale imposta in valuta base               *
      *                  *---------------------------------------------*
           move      w-prn-liv-det-imp    to   w-clc-tbl-scd-iva      .
      *                  *---------------------------------------------*
      *                  * Quota a forfait                             *
      *                  *---------------------------------------------*
           move      zero                 to   w-clc-tbl-scd-qaf      .
      *                  *---------------------------------------------*
      *                  * Acconto                                     *
      *                  *---------------------------------------------*
           move      zero                 to   w-clc-tbl-scd-acc      .
      *                  *---------------------------------------------*
      *                  * Data scadenza manuale                       *
      *                  *---------------------------------------------*
           move      zero                 to   w-clc-tbl-scd-ddp      .
      *                  *---------------------------------------------*
      *                  * Ciclo per tre codici pagamento              *
      *                  *---------------------------------------------*
           move      zero                 to   w-wrt-mov-rsf-wcp      .
       wrt-mov-rsf-040.
           add       1                    to   w-wrt-mov-rsf-wcp      .
           if        w-wrt-mov-rsf-wcp    >    3
                     go to wrt-mov-rsf-050.
      *                      *-----------------------------------------*
      *                      * Codice di pagamento                     *
      *                      *-----------------------------------------*
           move      rf-yfp-cod-pag
                    (w-wrt-mov-rsf-wcp)   to   w-clc-tbl-scd-cdp
                                              (w-wrt-mov-rsf-wcp)     .
      *                      *-----------------------------------------*
      *                      * Tipo ammontare                          *
      *                      *-----------------------------------------*
           move      rf-yfp-tip-amm
                    (w-wrt-mov-rsf-wcp)   to   w-clc-tbl-scd-tam
                                              (w-wrt-mov-rsf-wcp)     .
      *                      *-----------------------------------------*
      *                      * Percentuale per il tipo ammontare       *
      *                      *-----------------------------------------*
           move      rf-yfp-per-toi
                    (w-wrt-mov-rsf-wcp)   to   w-clc-tbl-scd-pti
                                              (w-wrt-mov-rsf-wcp)     .
      *                      *-----------------------------------------*
      *                      * Si/No diminuzione dell'acconto          *
      *                      *-----------------------------------------*
           move      rf-yfp-dim-act
                    (w-wrt-mov-rsf-wcp)   to   w-clc-tbl-scd-dda
                                              (w-wrt-mov-rsf-wcp)     .
       wrt-mov-rsf-045.
      *                      *-----------------------------------------*
      *                      * Lettura codice di pagamento             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Normalizzazione record [zpg]        *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofzpg"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zpg                 .
      *                          *-------------------------------------*
      *                          * Lettura record [zpg]                *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODPAG"             to   f-key                  .
           move      rf-yfp-cod-pag
                    (w-wrt-mov-rsf-wcp)   to   rf-zpg-cod-pag         .
           move      "pgm/gep/fls/ioc/obj/iofzpg"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zpg                 .
      *                          *-------------------------------------*
      *                          * Bufferizzazione valori letti        *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Tipo pagamento                  *
      *                              *---------------------------------*
           move      rf-zpg-tip-pag       to   w-clc-tbl-scd-tpg
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Numero scadenze                 *
      *                              *---------------------------------*
           move      rf-zpg-num-sca       to   w-clc-tbl-scd-nsp
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Decorrenza prima scadenza       *
      *                              *---------------------------------*
           move      rf-zpg-dec-prs       to   w-clc-tbl-scd-dps
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Mese della data prefissata      *
      *                              *---------------------------------*
           move      rf-zpg-dap-mes       to   w-clc-tbl-scd-dpm
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Giorno della data prefissata    *
      *                              *---------------------------------*
           move      rf-zpg-dap-gio       to   w-clc-tbl-scd-dpg
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Giorni di intervallo            *
      *                              *---------------------------------*
           move      rf-zpg-ggg-int       to   w-clc-tbl-scd-gdi
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Tipo di scadenza nel mese       *
      *                              *---------------------------------*
           move      rf-zpg-tip-scm       to   w-clc-tbl-scd-tsm
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Giorno fisso di scadenza        *
      *                              *---------------------------------*
           move      rf-zpg-gio-scm       to   w-clc-tbl-scd-gfs
                                              (w-wrt-mov-rsf-wcp)     .
      *                              *---------------------------------*
      *                              * Causale contabile : forzata a   *
      *                              * zero                            *
      *                              *---------------------------------*
           move      zero                 to   w-clc-tbl-scd-ccp
                                              (w-wrt-mov-rsf-wcp)     .
      *                      *-----------------------------------------*
      *                      * Riciclo a codice pagamento successivo   *
      *                      *-----------------------------------------*
           go to     wrt-mov-rsf-040.
       wrt-mov-rsf-050.
      *                  *---------------------------------------------*
      *                  * Tipo esclusione mesi : forzato a 01, nessun *
      *                  * mese escluso                                *
      *                  *---------------------------------------------*
           move      01                   to   w-clc-tbl-scd-esm      .
      *                  *---------------------------------------------*
      *                  * Valori di esclusione : normalizzati a zero  *
      *                  *---------------------------------------------*
           move      zero                 to   w-clc-tbl-scd-alt      .
           move      zero                 to   w-clc-tbl-scd-e01      .
           move      zero                 to   w-clc-tbl-scd-e02      .
       wrt-mov-rsf-060.
      *              *-------------------------------------------------*
      *              * Richiamo routine di calcolo                     *
      *              *-------------------------------------------------*
           perform   clc-tbl-scd-000      thru clc-tbl-scd-999        .
      *              *-------------------------------------------------*
      *              * Numero scadenze da generare                     *
      *              *-------------------------------------------------*
           move      w-clc-tbl-scd-nts    to   w-wrt-mov-rsf-wdg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione numero scadenze generate        *
      *              *-------------------------------------------------*
           move      zero                 to   w-wrt-mov-rsf-wsg      .
       wrt-mov-rsf-200.
      *              *-------------------------------------------------*
      *              * Ciclo di generazione scadenze fornitori         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento numero scadenze da generare      *
      *                  *---------------------------------------------*
           add       1                    to   w-wrt-mov-rsf-wsg      .
      *                  *---------------------------------------------*
      *                  * Test su numero di scadenze da generare      *
      *                  *---------------------------------------------*
           if        w-wrt-mov-rsf-wsg    >    w-wrt-mov-rsf-wdg
                     go to wrt-mov-rsf-900.
       wrt-mov-rsf-300.
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [sfs]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
       wrt-mov-rsf-400.
      *                  *---------------------------------------------*
      *                  * Composizione record [sfs]                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Dati identificativi                     *
      *                      *-----------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   rf-sfs-ide-dat         .
           move      s-ute                to   rf-sfs-ide-ute         .
           move      s-fas                to   rf-sfs-ide-fas         .
      *                      *-----------------------------------------*
      *                      * Data registrazione movimento            *
      *                      *-----------------------------------------*
           move      rr-dat-reg           to   rf-sfs-dtr-rgs         .
      *                      *-----------------------------------------*
      *                      * Data registrazione movimento di conta-  *
      *                      * bilita'                                 *
      *                      *-----------------------------------------*
           move      zero                 to   rf-sfs-drc-rgs         .
      *                      *-----------------------------------------*
      *                      * Numero protocollo movimento di contabi- *
      *                      * lita'                                   *
      *                      *-----------------------------------------*
           move      zero                 to   rf-sfs-npc-rgs         .
      *                      *-----------------------------------------*
      *                      * Numero scadenza                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Preparazione secolo ed anno         *
      *                          *-------------------------------------*
           move      rr-dat-reg           to   s-dat                  .
           move      s-saa                to   w-sfs-num-scl-ann      .
      *                          *-------------------------------------*
      *                          * Richiamo routine di attribuzione    *
      *                          *-------------------------------------*
           perform   att-num-scf-000      thru att-num-scf-999        .
      *                          *-------------------------------------*
      *                          * Numero scadenza                     *
      *                          *-------------------------------------*
           move      w-sfs-num-num-scf    to   rf-sfs-num-scf         .
      *                      *-----------------------------------------*
      *                      * Tipo scadenza                           *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-tds
                    (w-wrt-mov-rsf-wsg)   to   rf-sfs-tip-scf         .
      *                      *-----------------------------------------*
      *                      * Tipo registrazione scadenza             *
      *                      *-----------------------------------------*
           move      01                   to   rf-sfs-trs-scf         .
      *                      *-----------------------------------------*
      *                      * Tipo valuta per la scadenza             *
      *                      *-----------------------------------------*
           move      01                   to   rf-sfs-tvl-scf         .
      *                      *-----------------------------------------*
      *                      * Data di scadenza                        *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-dds
                    (w-wrt-mov-rsf-wsg)   to   rf-sfs-dts-scf         .
      *                      *-----------------------------------------*
      *                      * Codice fornitore                        *
      *                      *-----------------------------------------*
           move      rf-asy-cod-fnt       to   rf-sfs-cod-fnt         .
      *                      *-----------------------------------------*
      *                      * Codice dipendenza del fornitore         *
      *                      *-----------------------------------------*
           move      spaces               to   rf-sfs-dpz-fnt         .
      *                      *-----------------------------------------*
      *                      * Inoltro pagamento al fornitore          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di presenza del forni- *
      *                          * tore commerciale                    *
      *                          *-------------------------------------*
           if        w-wrt-mov-rsf-wff    not  = spaces
                     move  01             to   rf-sfs-inl-scf
           else      move  rf-dcf-inl-pgt to   rf-sfs-inl-scf         .
      *                      *-----------------------------------------*
      *                      * Sigla valuta per la scadenza            *
      *                      *-----------------------------------------*
           move      c-sgl                to   rf-sfs-sgl-vlt         .
      *                      *-----------------------------------------*
      *                      * Numero decimali per la valuta           *
      *                      *-----------------------------------------*
           move      c-dec                to   rf-sfs-dec-vlt         .
      *                      *-----------------------------------------*
      *                      * Tipo di cambio                          *
      *                      *-----------------------------------------*
           move      c-tdc                to   rf-sfs-tdc-vlt         .
      *                      *-----------------------------------------*
      *                      * Coefficiente di cambio                  *
      *                      *-----------------------------------------*
           move      c-cdc                to   rf-sfs-cdc-scf         .
      *                      *-----------------------------------------*
      *                      * Importo scadenza in valuta              *
      *                      *-----------------------------------------*
           move      zero                 to   rf-sfs-iiv-scf         .
      *                      *-----------------------------------------*
      *                      * Importo scadenza                        *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-ids
                    (w-wrt-mov-rsf-wsg)   to   rf-sfs-imp-scf         .
      *                      *-----------------------------------------*
      *                      * Data documento di riferimento           *
      *                      *-----------------------------------------*
           move      rf-asy-dat-doc       to   rf-sfs-dat-ddr         .
      *                      *-----------------------------------------*
      *                      * Numero documento di riferimento         *
      *                      *-----------------------------------------*
           move      rf-asy-num-doc       to   rf-sfs-num-ddr         .
      *                      *-----------------------------------------*
      *                      * Tipo documento di riferimento           *
      *                      *-----------------------------------------*
           move      01                   to   rf-sfs-tip-ddr         .
      *                      *-----------------------------------------*
      *                      * Importo documento di riferimento        *
      *                      *-----------------------------------------*
           move      w-prn-liv-det-tot    to   rf-sfs-imp-ddr         .
      *                      *-----------------------------------------*
      *                      * Numero rata documento di riferimento    *
      *                      *-----------------------------------------*
           move      w-wrt-mov-rsf-wsg    to   rf-sfs-nra-ddr         .
      *                      *-----------------------------------------*
      *                      * Codice ABI banca fornitore              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di presenza del forni- *
      *                          * tore commerciale                    *
      *                          *-------------------------------------*
           if        w-wrt-mov-rsf-wff    not  = spaces
                     move  zero           to   rf-sfs-abi-fnt
           else      move  rf-dcf-cod-abi to   rf-sfs-abi-fnt         .
      *                      *-----------------------------------------*
      *                      * Codice CAB banca fornitore              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di presenza del forni- *
      *                          * tore commerciale                    *
      *                          *-------------------------------------*
           if        w-wrt-mov-rsf-wff    not  = spaces
                     move  zero           to   rf-sfs-cab-fnt
           else      move  rf-dcf-cod-cab to   rf-sfs-cab-fnt         .
      *                      *-----------------------------------------*
      *                      * Codice banca estera del fornitore       *
      *                      *-----------------------------------------*
           move      zero                 to   rf-sfs-cod-bef         .
      *                      *-----------------------------------------*
      *                      * Codice conto corrente bancario o posta- *
      *                      * le                                      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di presenza del forni- *
      *                          * tore commerciale                    *
      *                          *-------------------------------------*
           if        w-wrt-mov-rsf-wff    not  = spaces
                     move  spaces         to   rf-sfs-ccc-fnt
           else      move  rf-dcf-ccc-app to   rf-sfs-ccc-fnt         .
      *                      *-----------------------------------------*
      *                      * Codice nostra banca di appoggio         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su flag di presenza del forni- *
      *                          * tore commerciale                    *
      *                          *-------------------------------------*
           if        w-wrt-mov-rsf-wff    not  = spaces
                     move  spaces         to   rf-sfs-cbp-nsb
           else      move  rf-dcf-nos-ban to   rf-sfs-cbp-nsb         .
      *                      *-----------------------------------------*
      *                      * Si/No pagamento bloccato per la scaden- *
      *                      * za                                      *
      *                      *-----------------------------------------*
           move      "N"                  to   rf-sfs-snx-pbl         .
      *                      *-----------------------------------------*
      *                      * Tutti gli altri campi rimangono norma-  *
      *                      * lizzati                                 *
      *                      *-----------------------------------------*
       wrt-mov-rsf-600.
      *                  *---------------------------------------------*
      *                  * Scrittura record [sfs]                      *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/scf/fls/ioc/obj/iofsfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-sfs                 .
       wrt-mov-rsf-800.
      *                  *---------------------------------------------*
      *                  * Riciclo su prossima scadenza                *
      *                  *---------------------------------------------*
           go to     wrt-mov-rsf-200.
       wrt-mov-rsf-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     wrt-mov-rsf-999.
       wrt-mov-rsf-999.
           exit.

      *    *===========================================================*
      *    * Routine di chiamata programma 'pcge300z'                  *
      *    *-----------------------------------------------------------*
       cll-300-zet-000.
           move      "pgm/cge/prg/obj/pcge300z"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using l-cge-300              .
       cll-300-zet-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      13                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      68                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      48                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      15                   to   v-pos                  .
           move      w-err-tdo-ric-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      64                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      65                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Determinazione totale imposta                             *
      *    *-----------------------------------------------------------*
       det-tot-imp-000.
      *              *-------------------------------------------------*
      *              * Azzeramento totalizzatore                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-tot-imp-imp      .
           move      zero                 to   w-det-tot-imp-wpa      .
      *              *-------------------------------------------------*
      *              * Calcolo                                         *
      *              *-------------------------------------------------*
           multiply  w-det-tot-imp-cod    by   w-det-tot-imp-ibl
                                        giving w-det-tot-imp-wpa      .
           divide    100                  into w-det-tot-imp-wpa
                                        giving w-det-tot-imp-s11
                                     remainder w-det-tot-imp-wpr      .
           move      w-det-tot-imp-s11    to   w-det-tot-imp-wpa      .
           if        w-det-tot-imp-wpr    >    zero
                     add      1           to   w-det-tot-imp-wpa
           else if   w-det-tot-imp-wpr    <    zero
                     subtract 1           from w-det-tot-imp-wpa      .
      *              *-------------------------------------------------*
      *              * Aggiornamento accumulatore                      *
      *              *-------------------------------------------------*
           move      w-det-tot-imp-wpa    to   w-det-tot-imp-imp      .
       det-tot-imp-999.
           exit.

      *    *===========================================================*
      *    * Routine di attribuzione numero protocollo iva fornitori   *
      *    *-----------------------------------------------------------*
       att-prt-ivf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
      *              *-------------------------------------------------*
      *              * Lettura numerazione                             *
      *              *-------------------------------------------------*
           move      w-num-prt-ivf-dat    to   s-dat                  .
           move      s-saa                to   rn-prt-ivf-saa-dtr     .
           move      w-num-prt-ivf-ngi    to   rn-prt-ivf-cod-num     .
           move      "GT"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
           if        f-sts                =    e-not-err
                     go to att-prt-ivf-100.
      *              *-------------------------------------------------*
      *              * Se numerazione non esistente la si crea norma-  *
      *              * lizzata a zero                                  *
      *              *-------------------------------------------------*
           move      zero                 to   rn-prt-ivf-num-prt     .
           move      "PT"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
           go to     att-prt-ivf-000.
       att-prt-ivf-100.
      *              *-------------------------------------------------*
      *              * Se numerazione esistente                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valore originale            *
      *                  *---------------------------------------------*
           move      rn-prt-ivf-num-prt   to   w-num-prt-ivf-dec      .
      *                  *---------------------------------------------*
      *                  * Incremento numero protocollo                *
      *                  *---------------------------------------------*
           add       1                    to   rn-prt-ivf-num-prt     .
           if        rn-prt-ivf-num-prt   =    zero
                     move  1              to   rn-prt-ivf-num-prt     .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione numero protocollo           *
      *                  *---------------------------------------------*
           move      rn-prt-ivf-num-prt   to   w-num-prt-ivf-prt      .
           move      rn-prt-ivf-num-prt   to   w-num-prt-ivf-inc      .
      *                  *---------------------------------------------*
      *                  * Update record                               *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
      *                  *---------------------------------------------*
      *                  * Se errori ripete l'intera operazione        *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to att-prt-ivf-000.
      *                  *---------------------------------------------*
      *                  * Unlock                                      *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/cge/num/ioc/obj/inprtivf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-prt-ivf             .
       att-prt-ivf-999.
           exit.

      *    *===========================================================*
      *    * Routine di attribuzione numero scadenza fornitori         *
      *    *-----------------------------------------------------------*
       att-num-scf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *              *-------------------------------------------------*
      *              * Preparazione chiave per lettura tabella numera- *
      *              * zioni [sfsnum]                                  *
      *              *-------------------------------------------------*
           move      w-sfs-num-scl-ann    to   rn-sfs-num-scl-ann     .
      *              *-------------------------------------------------*
      *              * Lettura tabella numerazioni [sfsnum]            *
      *              *-------------------------------------------------*
           move      "GT"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to att-num-scf-400.
       att-num-scf-200.
      *              *-------------------------------------------------*
      *              * Se record non esistente                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Scrittura record normalizzato               *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *                  *---------------------------------------------*
      *                  * Unlock record                               *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *                  *---------------------------------------------*
      *                  * Ripetizione dell'intera operazione          *
      *                  *---------------------------------------------*
           go to     att-num-scf-000.
       att-num-scf-400.
      *              *-------------------------------------------------*
      *              * Se record esistente                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore pre-incremento           *
      *                  *---------------------------------------------*
           move      rn-sfs-num-num-scf   to   w-sfs-num-num-scf      .
           move      w-sfs-num-r01-num    to   w-sfs-num-val-pre      .
      *                  *---------------------------------------------*
      *                  * Preparazione valore post-incremento         *
      *                  *---------------------------------------------*
           move      w-sfs-num-val-pre    to   w-sfs-num-val-pos      .
           add       1                    to   w-sfs-num-val-pos      .
           if        w-sfs-num-val-pos    =    zero
                     move  1              to   w-sfs-num-val-pos      .
      *                  *---------------------------------------------*
      *                  * Preparazione numero scadenza completo       *
      *                  *---------------------------------------------*
           move      w-sfs-num-scl-ann    to   w-sfs-num-r01-saa      .
           move      w-sfs-num-val-pos    to   w-sfs-num-r01-num      .
      *                  *---------------------------------------------*
      *                  * Aggiornamento numero scadenza               *
      *                  *---------------------------------------------*
           move      w-sfs-num-num-scf    to   rn-sfs-num-num-scf     .
      *                  *---------------------------------------------*
      *                  * Update record                               *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito dell'opera- *
      *                  * zione di update                             *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to att-num-scf-600.
       att-num-scf-500.
      *                  *---------------------------------------------*
      *                  * Se errore in operazione di update           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Unlock record                           *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *                      *-----------------------------------------*
      *                      * Ripetizione dell'intera operazione      *
      *                      *-----------------------------------------*
           go to     att-num-scf-000.
       att-num-scf-600.
      *                  *---------------------------------------------*
      *                  * Se nessun errore in operazione di update    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Unlock record                           *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/scf/num/ioc/obj/insfsnum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rn-sfs-num             .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     att-num-scf-999.
       att-num-scf-999.
           exit.

      *    *===========================================================*
      *    * Calcolo tabella scadenze                                  *
      *    *-----------------------------------------------------------*
       clc-tbl-scd-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione numero totale scadenze calco-  *
      *              * late                                            *
      *              *-------------------------------------------------*
           move      zero                 to   w-clc-tbl-scd-nts      .
      *              *-------------------------------------------------*
      *              * Se la forma di pagamento passata in input come  *
      *              * parametro e' a zero : uscita                    *
      *              *-------------------------------------------------*
           if        w-clc-tbl-scd-fdp    =    zero
                     go to clc-tbl-scd-999.
      *              *-------------------------------------------------*
      *              * Se tutti e tre i codici di pagamento passati in *
      *              * input come parametri sono a zero : uscita       *
      *              *-------------------------------------------------*
           if        w-clc-tbl-scd-cdp (1)
                                          =    zero and
                     w-clc-tbl-scd-cdp (2)
                                          =    zero and
                     w-clc-tbl-scd-cdp (3)
                                          =    zero
                     go to clc-tbl-scd-999.
       clc-tbl-scd-100.
      *              *-------------------------------------------------*
      *              * Determinazione delle scadenze per ogni codice   *
      *              * di pagamento                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizializzazione progressivo ammontari uti- *
      *                  * lizzati                                     *
      *                  *---------------------------------------------*
           move      zero                 to   w-clc-tbl-scd-wau      .
      *                  *---------------------------------------------*
      *                  * Inizializzazione progressivo imponibile uti-*
      *                  * lizzato                                     *
      *                  *---------------------------------------------*
           move      zero                 to   w-clc-tbl-scd-wiu      .
      *                  *---------------------------------------------*
      *                  * Inizializzazione indice 1..3 sui codici di  *
      *                  * pagamento associati alla forma di pagamento *
      *                  *---------------------------------------------*
           move      zero                 to   w-clc-tbl-scd-wip      .
       clc-tbl-scd-110.
      *                  *---------------------------------------------*
      *                  * Incremento indice 1..3 sui codici di paga-  *
      *                  * mento associati alla forma di pagamento     *
      *                  *---------------------------------------------*
           add       1                    to   w-clc-tbl-scd-wip      .
      *                  *---------------------------------------------*
      *                  * Se oltre il terzo codice di pagamento : a   *
      *                  * compattamento della tabella calcolata       *
      *                  *---------------------------------------------*
           if        w-clc-tbl-scd-wip    >    3
                     go to clc-tbl-scd-600.
      *                  *---------------------------------------------*
      *                  * Se codice di pagamento a zero : riciclo su  *
      *                  * codice di pagamento successivo              *
      *                  *---------------------------------------------*
           if        w-clc-tbl-scd-cdp
                    (w-clc-tbl-scd-wip)   =    zero
                     go to clc-tbl-scd-110.
       clc-tbl-scd-120.
      *                  *---------------------------------------------*
      *                  * Determinazione del totale ammontare su cui  *
      *                  * agisce il codice di pagamento               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione del tipo di am-  *
      *                      * montare                                 *
      *                      *-----------------------------------------*
           if        w-clc-tbl-scd-tam
                    (w-clc-tbl-scd-wip)   =    01
                     go to clc-tbl-scd-130
           else if   w-clc-tbl-scd-tam
                    (w-clc-tbl-scd-wip)   =    02
                     go to clc-tbl-scd-140
           else if   w-clc-tbl-scd-tam
                    (w-clc-tbl-scd-wip)   =    03
                     go to clc-tbl-scd-150
           else if   w-clc-tbl-scd-tam
                    (w-clc-tbl-scd-wip)   =    04
                     go to clc-tbl-scd-160
           else if   w-clc-tbl-scd-tam
                    (w-clc-tbl-scd-wip)   =    05
                     go to clc-tbl-scd-170
           else if   w-clc-tbl-scd-tam
                    (w-clc-tbl-scd-wip)   =    06
                     go to clc-tbl-scd-180
           else if   w-clc-tbl-scd-tam
                    (w-clc-tbl-scd-wip)   =    07
                     go to clc-tbl-scd-190
           else if   w-clc-tbl-scd-tam
                    (w-clc-tbl-scd-wip)   =    08
                     go to clc-tbl-scd-200
           else if   w-clc-tbl-scd-tam
                    (w-clc-tbl-scd-wip)   =    09
                     go to clc-tbl-scd-210
           else if   w-clc-tbl-scd-tam
                    (w-clc-tbl-scd-wip)   =    10
                     go to clc-tbl-scd-220
           else if   w-clc-tbl-scd-tam
                    (w-clc-tbl-scd-wip)   =    11
                     go to clc-tbl-scd-230.
       clc-tbl-scd-130.
      *                      *-----------------------------------------*
      *                      * Tipo ammontare 01 : Il totale documento *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-ibl    to   w-clc-tbl-scd-wap      .
           add       w-clc-tbl-scd-iva    to   w-clc-tbl-scd-wap      .
      *
           move      w-clc-tbl-scd-ibl    to   w-clc-tbl-scd-wiu      .
           go to     clc-tbl-scd-250.
       clc-tbl-scd-140.
      *                      *-----------------------------------------*
      *                      * Tipo ammontare 02 : Il totale imponibi- *
      *                      *                     le                  *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-ibl    to   w-clc-tbl-scd-wap      .
      *
           move      w-clc-tbl-scd-ibl    to   w-clc-tbl-scd-wiu      .
           go to     clc-tbl-scd-250.
       clc-tbl-scd-150.
      *                      *-----------------------------------------*
      *                      * Tipo ammontare 03 : Una % del totale    *
      *                      *                     documento           *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-ibl    to   w-clc-tbl-scd-wap      .
           add       w-clc-tbl-scd-iva    to   w-clc-tbl-scd-wap      .
           multiply  w-clc-tbl-scd-pti
                    (w-clc-tbl-scd-wip)   by   w-clc-tbl-scd-wap      .
           divide    100                  into w-clc-tbl-scd-wap
                                                         rounded      .
      *
           move      w-clc-tbl-scd-ibl    to   w-clc-tbl-scd-wix      .
           multiply  w-clc-tbl-scd-pti
                    (w-clc-tbl-scd-wip)   by   w-clc-tbl-scd-wix      .
           divide    100                  into w-clc-tbl-scd-wix
                                                         rounded      .
           add       w-clc-tbl-scd-wix    to   w-clc-tbl-scd-wiu      .
           go to     clc-tbl-scd-250.
       clc-tbl-scd-160.
      *                      *-----------------------------------------*
      *                      * Tipo ammontare 04 : Una % del totale    *
      *                      *                     imponibile          *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-ibl    to   w-clc-tbl-scd-wap      .
           multiply  w-clc-tbl-scd-pti
                    (w-clc-tbl-scd-wip)   by   w-clc-tbl-scd-wap      .
           divide    100                  into w-clc-tbl-scd-wap
                                                         rounded      .
      *
           add       w-clc-tbl-scd-wap    to   w-clc-tbl-scd-wiu      .
           go to     clc-tbl-scd-250.
       clc-tbl-scd-170.
      *                      *-----------------------------------------*
      *                      * Tipo ammontare 05 : Il totale iva       *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-iva    to   w-clc-tbl-scd-wap      .
           go to     clc-tbl-scd-250.
       clc-tbl-scd-180.
      *                      *-----------------------------------------*
      *                      * Tipo ammontare 06 : Solo la quota a     *
      *                      *                     forfait             *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-qaf    to   w-clc-tbl-scd-wap      .
           go to     clc-tbl-scd-250.
       clc-tbl-scd-190.
      *                      *-----------------------------------------*
      *                      * Tipo ammontare 07 : Il totale iva piu'  *
      *                      *                     la quota a forfait  *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-iva    to   w-clc-tbl-scd-wap      .
           add       w-clc-tbl-scd-qaf    to   w-clc-tbl-scd-wap      .
           go to     clc-tbl-scd-250.
       clc-tbl-scd-200.
      *                      *-----------------------------------------*
      *                      * Tipo ammontare 08 : Il totale documento *
      *                      *                     meno la quota a     *
      *                      *                     forfait             *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-ibl    to   w-clc-tbl-scd-wap      .
           add       w-clc-tbl-scd-iva    to   w-clc-tbl-scd-wap      .
           subtract  w-clc-tbl-scd-qaf    from w-clc-tbl-scd-wap      .
      *
           if        w-clc-tbl-scd-wap    <    w-clc-tbl-scd-ibl
                     add  w-clc-tbl-scd-wap
                                          to   w-clc-tbl-scd-wiu
           else      add  w-clc-tbl-scd-ibl
                                          to   w-clc-tbl-scd-wiu      .
           go to     clc-tbl-scd-250.
       clc-tbl-scd-210.
      *                      *-----------------------------------------*
      *                      * Tipo ammontare 09 : Il totale imponibi- *
      *                      *                     le meno la quota a  *
      *                      *                     forfait             *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-ibl    to   w-clc-tbl-scd-wap      .
           subtract  w-clc-tbl-scd-qaf    from w-clc-tbl-scd-wap      .
      *
           add       w-clc-tbl-scd-wap    to   w-clc-tbl-scd-wiu      .
           go to     clc-tbl-scd-250.
       clc-tbl-scd-220.
      *                      *-----------------------------------------*
      *                      * Tipo ammontare 10 : Il residuo per il   *
      *                      *                     totale documento    *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-ibl    to   w-clc-tbl-scd-wap      .
           add       w-clc-tbl-scd-iva    to   w-clc-tbl-scd-wap      .
           subtract  w-clc-tbl-scd-wau    from w-clc-tbl-scd-wap      .
      *
           move      w-clc-tbl-scd-ibl    to   w-clc-tbl-scd-wiu      .
           go to     clc-tbl-scd-250.
       clc-tbl-scd-230.
      *                      *-----------------------------------------*
      *                      * Tipo ammontare 11 : Il residuo per il   *
      *                      *                     totale imponibile   *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-ibl    to   w-clc-tbl-scd-wap      .
           subtract  w-clc-tbl-scd-wiu    from w-clc-tbl-scd-wap      .
      *
           move      w-clc-tbl-scd-ibl    to   w-clc-tbl-scd-wiu      .
           go to     clc-tbl-scd-250.
       clc-tbl-scd-250.
      *                      *-----------------------------------------*
      *                      * Aggiornamento progressivo ammontari u-  *
      *                      * tilizzati                               *
      *                      *-----------------------------------------*
           add       w-clc-tbl-scd-wap    to   w-clc-tbl-scd-wau      .
       clc-tbl-scd-260.
      *                      *-----------------------------------------*
      *                      * Eventuale diminuzione dell'acconto      *
      *                      *-----------------------------------------*
           if        w-clc-tbl-scd-dda
                    (w-clc-tbl-scd-wip)   not  = 02
                     go to clc-tbl-scd-270.
           subtract  w-clc-tbl-scd-acc    from w-clc-tbl-scd-wap      .
       clc-tbl-scd-270.
      *                      *-----------------------------------------*
      *                      * Test se l'ammontare cosi' determinato   *
      *                      * risulta uguale o minore di zero         *
      *                      *-----------------------------------------*
           if        w-clc-tbl-scd-wap    >    zero
                     go to clc-tbl-scd-280.
      *                          *-------------------------------------*
      *                          * Se si' : si ignora il codice di pa- *
      *                          * gamento in esame e si passa a trat- *
      *                          * tare il codice pagamento successivo *
      *                          * senza alcuna segnalazione           *
      *                          *-------------------------------------*
           go to     clc-tbl-scd-590.
       clc-tbl-scd-280.
      *                  *---------------------------------------------*
      *                  * Determinazione delle scadenze relative al   *
      *                  * codice di pagamento in esame sul totale am- *
      *                  * montare appena determinato                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Numero scadenze che devono essere cal-  *
      *                      * colate per il codice pagamento in esa-  *
      *                      * me in area di comodo                    *
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-nsp
                    (w-clc-tbl-scd-wip)   to   w-clc-tbl-scd-wnd      .
      *                      *-----------------------------------------*
      *                      * Inizializzazione numero di scadenze gia'*
      *                      * calcolate per il codice pagamento in e- *
      *                      * same                                    *
      *                      *-----------------------------------------*
           move      zero                 to   w-clc-tbl-scd-wnc      .
      *                      *-----------------------------------------*
      *                      * Inizializzazione parte dell'ammontare   *
      *                      * gia' distribuito tra le scadenze per    *
      *                      * il singolo codice di pagamento          *
      *                      *-----------------------------------------*
           move      zero                 to   w-clc-tbl-scd-wad      .
      *                      *-----------------------------------------*
      *                      * Determinazione importo di ogni scadenza *
      *                      * tranne l'ultima                         *
      *                      *-----------------------------------------*
           divide    w-clc-tbl-scd-wnd    into w-clc-tbl-scd-wap
                                        giving w-clc-tbl-scd-wis      .
      *                      *-----------------------------------------*
      *                      * Inizializzazione decorrenza prima sca-  *
      *                      * denza in termini di giorni dalla data   *
      *                      * documento                               *
      *                      *-----------------------------------------*
           if        w-clc-tbl-scd-dps
                    (w-clc-tbl-scd-wip)   =    01 or
                     w-clc-tbl-scd-dps
                    (w-clc-tbl-scd-wip)   =    02 or
                     w-clc-tbl-scd-dps
                    (w-clc-tbl-scd-wip)   =    03
                     move  0000           to   w-clc-tbl-scd-wpd
           else if   w-clc-tbl-scd-dps
                    (w-clc-tbl-scd-wip)   =    04
                     move  0015           to   w-clc-tbl-scd-wpd
           else if   w-clc-tbl-scd-dps
                    (w-clc-tbl-scd-wip)   =    05
                     move  0030           to   w-clc-tbl-scd-wpd
           else if   w-clc-tbl-scd-dps
                    (w-clc-tbl-scd-wip)   =    06
                     move  0045           to   w-clc-tbl-scd-wpd
           else if   w-clc-tbl-scd-dps
                    (w-clc-tbl-scd-wip)   =    07
                     move  0060           to   w-clc-tbl-scd-wpd
           else if   w-clc-tbl-scd-dps
                    (w-clc-tbl-scd-wip)   =    08
                     move  0090           to   w-clc-tbl-scd-wpd
           else if   w-clc-tbl-scd-dps
                    (w-clc-tbl-scd-wip)   =    09
                     move  0120           to   w-clc-tbl-scd-wpd
           else if   w-clc-tbl-scd-dps
                    (w-clc-tbl-scd-wip)   =    10
                     move  0150           to   w-clc-tbl-scd-wpd
           else if   w-clc-tbl-scd-dps
                    (w-clc-tbl-scd-wip)   =    11
                     move  0180           to   w-clc-tbl-scd-wpd
           else      move  0030           to   w-clc-tbl-scd-wpd      .
       clc-tbl-scd-290.
      *                      *-----------------------------------------*
      *                      * Ciclo per le scadenze                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento numero di scadenze gia'  *
      *                          * calcolate per il codice di paga-    *
      *                          * mento in esame                      *
      *                          *-------------------------------------*
           add       1                    to   w-clc-tbl-scd-wnc      .
      *                          *-------------------------------------*
      *                          * Se oltre numero di scadenze che de- *
      *                          * vono essere calcolate per il codice *
      *                          * pagamento in esame : riciclo su co- *
      *                          * dice di pagamento successivo        *
      *                          *-------------------------------------*
           if        w-clc-tbl-scd-wnc    >    w-clc-tbl-scd-wnd
                     go to clc-tbl-scd-590.
      *                          *-------------------------------------*
      *                          * Incremento numero totale scadenze   *
      *                          * calcolate                           *
      *                          *-------------------------------------*
           add       1                    to   w-clc-tbl-scd-nts      .
       clc-tbl-scd-300.
      *                          *-------------------------------------*
      *                          * Bufferizzazione in tabella scadenze *
      *                          * calcolate                           *
      *                          *-------------------------------------*
       clc-tbl-scd-310.
      *                              *---------------------------------*
      *                              * Tipo di scadenza                *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Da codice di pagamento      *
      *                                  *-----------------------------*
           move      w-clc-tbl-scd-tpg
                    (w-clc-tbl-scd-wip)   to   w-clc-tbl-scd-tds
                                              (w-clc-tbl-scd-nts)     .
       clc-tbl-scd-320.
      *                              *---------------------------------*
      *                              * Data di scadenza                *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Deviazione in funzione del  *
      *                                  * numero giorni di decorrenza *
      *                                  *-----------------------------*
           if        w-clc-tbl-scd-wpd    =    0000
                     go to clc-tbl-scd-330
           else      go to clc-tbl-scd-380.
       clc-tbl-scd-330.
      *                                  *-----------------------------*
      *                                  * Se numero giorni di decor-  *
      *                                  * renza pari a 0000 : signi-  *
      *                                  * fica che il numero di sca-  *
      *                                  * denze per il codice di pa-  *
      *                                  * gamento in esame e' pari a  *
      *                                  * 1, e che la decorrenza puo' *
      *                                  * essere solo tra le seguen-  *
      *                                  * ti :                        *
      *                                  * - manuale                   *
      *                                  * - ad una data prefissata    *
      *                                  * - a vista                   *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Deviazione a seconda    *
      *                                      * del caso                *
      *                                      *-------------------------*
           if        w-clc-tbl-scd-dps
                    (w-clc-tbl-scd-wip)   =    01
                     go to clc-tbl-scd-340
           else if   w-clc-tbl-scd-dps
                    (w-clc-tbl-scd-wip)   =    02
                     go to clc-tbl-scd-350
           else      go to clc-tbl-scd-360.
       clc-tbl-scd-340.
      *                                      *-------------------------*
      *                                      * Se decorrenza manuale   *
      *                                      *-------------------------*
      *                                          *---------------------*
      *                                          * Dalla data scadenza *
      *                                          * manuale passata in  *
      *                                          * input come parame-  *
      *                                          * tro                 *
      *                                          *---------------------*
           move      w-clc-tbl-scd-ddp    to   w-clc-tbl-scd-dds
                                              (w-clc-tbl-scd-nts)     .
           go to     clc-tbl-scd-370.
       clc-tbl-scd-350.
      *                                      *-------------------------*
      *                                      * Se decorrenza ad una    *
      *                                      * data prefissata gg.mm   *   
      *                                      *-------------------------*
      *                                          *---------------------*
      *                                          * Si prende la data   *
      *                                          * del documento       *
      *                                          *---------------------*
           move      w-clc-tbl-scd-ddo    to   w-clc-tbl-scd-wdt      .
      *                                          *---------------------*
      *                                          * A questa si sosti-  *
      *                                          * tuiscono il mese ed *
      *                                          * il giorno con quel- *
      *                                          * li prefissati       *
      *                                          *---------------------*
           move      w-clc-tbl-scd-dpm
                    (w-clc-tbl-scd-wip)   to   w-clc-tbl-scd-wdm      .
           move      w-clc-tbl-scd-dpg
                    (w-clc-tbl-scd-wip)   to   w-clc-tbl-scd-wdg      .
      *                                          *---------------------*
      *                                          * Se la data ottenuta *
      *                                          * in tal modo risulta *
      *                                          * anteriore alla data *
      *                                          * del documento, la   *
      *                                          * si sposta in avanti *
      *                                          * di un anno          *
      *                                          *---------------------*
           if        w-clc-tbl-scd-wdt    <    w-clc-tbl-scd-ddo
                     add   1              to   w-clc-tbl-scd-wds      .
           move      w-clc-tbl-scd-wdt    to   w-clc-tbl-scd-dds
                                              (w-clc-tbl-scd-nts)     .
           go to     clc-tbl-scd-370.
       clc-tbl-scd-360.
      *                                      *-------------------------*
      *                                      * Se decorrenza a vista   *
      *                                      *-------------------------*
      *                                          *---------------------*
      *                                          * Data scadenza a ze- *
      *                                          * ro                  *
      *                                          *---------------------*
           move      zero                 to   w-clc-tbl-scd-dds
                                              (w-clc-tbl-scd-nts)     .
       clc-tbl-scd-370.
      *                                      *-------------------------*
      *                                      * A determinazione della  *
      *                                      * causale contabile senza *
      *                                      * tenere conto di eventu- *
      *                                      * ali mesi esclusi        *
      *                                      *-------------------------*
           go to     clc-tbl-scd-505.
       clc-tbl-scd-380.
      *                                  *-----------------------------*
      *                                  * Se numero giorni di decor-  *
      *                                  * renza diverso da 0000: si-  *
      *                                  * gnifica che il calcolo del- *
      *                                  * la data scadenza deve esse- *
      *                                  * re eseguito, e che inoltre  *
      *                                  * si deve tenere conto di e-  *
      *                                  * ventuali mesi esclusi       *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Calcolo data scadenza   *
      *                                      *-------------------------*
      *                                          *---------------------*
      *                                          * Data documento in   *
      *                                          * area di comodo ri-  *
      *                                          * definita            *
      *                                          *---------------------*
           move      w-clc-tbl-scd-ddo    to   w-clc-tbl-scd-wdt      .
      *                                          *---------------------*
      *                                          * Determinazione del  *
      *                                          * numero di mesi in-  *
      *                                          * teri e del numero   *
      *                                          * di giorni residui   *
      *                                          * rispetto al numero  *
      *                                          * di mesi interi, in  *
      *                                          * corrispondono alla  *
      *                                          * decorrenza per la   *
      *                                          * scadenza in corso   *
      *                                          * di trattamento e-   *
      *                                          * spressa in termini  *
      *                                          * di giorni.          *
      *                                          * Nota : Secondo la   *
      *                                          * struttura del codi- *
      *                                          * ce di pagamento, il *
      *                                          * numero di giorni    *
      *                                          * residui puo' essere *
      *                                          * solo pari a zero o  *
      *                                          * a 15.               *
      *                                          *---------------------*
           divide    30                   into w-clc-tbl-scd-wpd
                                        giving w-clc-tbl-scd-wpm
                                     remainder w-clc-tbl-scd-wpg      .
       clc-tbl-scd-390.
      *                                          *---------------------*
      *                                          * Incremento su data  *
      *                                          * documento in area   *
      *                                          * di comodo ridefini- *
      *                                          * ta per il numero di *
      *                                          * mesi interi deter-  *
      *                                          * minato              *
      *                                          *---------------------*
           if        w-clc-tbl-scd-wpm    =    zero
                     go to clc-tbl-scd-400.
           add       1                    to   w-clc-tbl-scd-wdm      .
           if        w-clc-tbl-scd-wdm    >    12
                     add   1              to   w-clc-tbl-scd-wds
                     move  1              to   w-clc-tbl-scd-wdm      .
           subtract  1                    from w-clc-tbl-scd-wpm      .
           go to     clc-tbl-scd-390.
       clc-tbl-scd-400.
      *                                          *---------------------*
      *                                          * Trattamento degli   *
      *                                          * eventuali giorni    *
      *                                          * residui rispetto al *
      *                                          * al numero di mesi   *
      *                                          * interi              *
      *                                          *---------------------*
      *                                              *-----------------*
      *                                              * Test se esisto- *
      *                                              * no giorni resi- *
      *                                              * dui             *
      *                                              *-----------------*
           if        w-clc-tbl-scd-wpg    =    zero
                     go to clc-tbl-scd-430.
      *                                              *-----------------*
      *                                              * Deviazione in   *
      *                                              * funzione del    *
      *                                              * giorno espres-  *
      *                                              * so nella data   *
      *                                              * documento in a- *
      *                                              * rea di comodo   *
      *                                              * ridefinita      *
      *                                              *-----------------*
           if        w-clc-tbl-scd-wdg    >    15
                     go to clc-tbl-scd-420.
       clc-tbl-scd-410.
      *                                              *-----------------*
      *                                              * Se il giorno e' *
      *                                              * compreso tra 1  *
      *                                              * e 15, si incre- *
      *                                              * menta il giorno *
      *                                              * di 15, lascian- *
      *                                              * do inalterato   *
      *                                              * il mese         *
      *                                              *-----------------*
           add       15                   to   w-clc-tbl-scd-wdg      .
           go to     clc-tbl-scd-430.
       clc-tbl-scd-420.
      *                                              *-----------------*
      *                                              * Se il giorno e' *
      *                                              * maggiore di 15, *
      *                                              * si decrementa   *
      *                                              * il giorno di 15 *
      *                                              * incrementando   *
      *                                              * il mese di 1    *
      *                                              *-----------------*
           subtract  15                   from w-clc-tbl-scd-wdg      .
           add       1                    to   w-clc-tbl-scd-wdm      .
           if        w-clc-tbl-scd-wdm    >    12
                     add   1              to   w-clc-tbl-scd-wds
                     move  1              to   w-clc-tbl-scd-wdm      .
       clc-tbl-scd-430.
      *                                          *---------------------*
      *                                          * Rifinizione del va- *
      *                                          * lore per il giorno  *
      *                                          * di scadenza         *
      *                                          *---------------------*
       clc-tbl-scd-440.
      *                                              *-----------------*
      *                                              * Determinazione  *
      *                                              * numero giorni   *
      *                                              * di febbraio se  *
      *                                              * mese pari a 02  *
      *                                              *-----------------*
           if        w-clc-tbl-scd-wdm    not  = 02
                     go to clc-tbl-scd-450.
           move      w-clc-tbl-scd-wds    to   w-clc-tbl-scd-wt5      .
           add       1900                 to   w-clc-tbl-scd-wt5      .
           divide    4                    into w-clc-tbl-scd-wt5
                                        giving w-clc-tbl-scd-wt6
                                     remainder w-clc-tbl-scd-wt7      .
           if        w-clc-tbl-scd-wt7    not  = zero
                     move  28             to   w-clc-tbl-scd-wt2 (2)
                     go to clc-tbl-scd-450.
           divide    400                  into w-clc-tbl-scd-wt5
                                        giving w-clc-tbl-scd-wt6
                                     remainder w-clc-tbl-scd-wt7      .
           if        w-clc-tbl-scd-wt7    =    zero
                     move  29             to   w-clc-tbl-scd-wt2 (2)
                     go to clc-tbl-scd-450.
           divide    100                  into w-clc-tbl-scd-wt5
                                        giving w-clc-tbl-scd-wt6
                                     remainder w-clc-tbl-scd-wt7      .
           if        w-clc-tbl-scd-wt7    =    zero
                     move  28             to   w-clc-tbl-scd-wt2 (2)
           else      move  29             to   w-clc-tbl-scd-wt2 (2)  .
       clc-tbl-scd-450.
      *                                              *-----------------*
      *                                              * Deviazione in   *
      *                                              * funzione del    *
      *                                              * tipo di scaden- *
      *                                              * za nel mese     *
      *                                              *-----------------*
           if        w-clc-tbl-scd-tsm
                    (w-clc-tbl-scd-wip)   =    01
                     go to clc-tbl-scd-460
           else if   w-clc-tbl-scd-tsm
                    (w-clc-tbl-scd-wip)   =    02
                     go to clc-tbl-scd-470
           else if   w-clc-tbl-scd-tsm
                    (w-clc-tbl-scd-wip)   =    03
                     go to clc-tbl-scd-480.
       clc-tbl-scd-460.
      *                                              *-----------------*
      *                                              * Se il tipo di   *
      *                                              * scadenza  nel   *
      *                                              * mese e' : data  *
      *                                              * documento       *
      *                                              *-----------------*
      *                                                  *-------------*
      *                                                  * Se il gior- *
      *                                                  * no calcola- *
      *                                                  * to supera   *
      *                                                  * l'ultimo    *
      *                                                  * giorno del  *
      *                                                  * mese, lo si *
      *                                                  * riporta al- *
      *                                                  * l'ultimo    *
      *                                                  * giorno del  *
      *                                                  * mese        *
      *                                                  *-------------*
           if        w-clc-tbl-scd-wdg    not  > w-clc-tbl-scd-wt2
                                                (w-clc-tbl-scd-wdm)
                     go to clc-tbl-scd-462.
           move      w-clc-tbl-scd-wt2
                    (w-clc-tbl-scd-wdm)   to   w-clc-tbl-scd-wdg      .
       clc-tbl-scd-462.
      *                                                  *-------------*
      *                                                  * A tratta-   *
      *                                                  * mento mesi  *
      *                                                  * sclusi      *
      *                                                  *-------------*
           go to     clc-tbl-scd-490.
       clc-tbl-scd-470.
      *                                              *-----------------*
      *                                              * Se il tipo di   *
      *                                              * scadenza  nel   *
      *                                              * mese e' : fine  *
      *                                              * mese            *
      *                                              *-----------------*
      *                                                  *-------------*
      *                                                  * Forzatura   *
      *                                                  * del giorno  *
      *                                                  * di fine me- *
      *                                                  * se          *
      *                                                  *-------------*
           move      w-clc-tbl-scd-wt2
                    (w-clc-tbl-scd-wdm)   to   w-clc-tbl-scd-wdg      .
      *                                                  *-------------*
      *                                                  * A tratta-   *
      *                                                  * mento mesi  *
      *                                                  * sclusi      *
      *                                                  *-------------*
           go to     clc-tbl-scd-490.
       clc-tbl-scd-480.
      *                                              *-----------------*
      *                                              * Se il tipo di   *
      *                                              * scadenza  nel   *
      *                                              * mese e' : gior- *
      *                                              * no fisso nel    *
      *                                              * mese            *
      *                                              *-----------------*
      *                                                  *-------------*
      *                                                  * Deviazione  *
      *                                                  * secondo il  *
      *                                                  * giorno di   *
      *                                                  * scadenza    *
      *                                                  * sino a qui  *
      *                                                  * calcolato   *
      *                                                  *-------------*
           if        w-clc-tbl-scd-wdg    >    w-clc-tbl-scd-gfs
                                              (w-clc-tbl-scd-wip)
                     go to clc-tbl-scd-484.
       clc-tbl-scd-482.
      *                                                  *-------------*
      *                                                  * Se il gior- *
      *                                                  * no di sca-  *
      *                                                  * denza sin   *
      *                                                  * qui calco-  *
      *                                                  * lato non e' *
      *                                                  * superiore   *
      *                                                  * al giorno   *
      *                                                  * fisso di    *
      *                                                  * scadenza :  *
      *                                                  * si forza il *
      *                                                  * giorno fis- *
      *                                                  * so di sca-  *
      *                                                  * denza e si  *
      *                                                  * passa al    *
      *                                                  * trattamento *
      *                                                  * mesi esclu- *
      *                                                  * si          *
      *                                                  *-------------*
           move      w-clc-tbl-scd-gfs
                    (w-clc-tbl-scd-wip)   to   w-clc-tbl-scd-wdg      .
           go to     clc-tbl-scd-490.
       clc-tbl-scd-484.
      *                                                  *-------------*
      *                                                  * Se il gior- *
      *                                                  * no di sca-  *
      *                                                  * denza sin   *
      *                                                  * qui calco-  *
      *                                                  * lato e' su- *
      *                                                  * periore al  *
      *                                                  * giorno fis- *
      *                                                  * so di sca-  *
      *                                                  * denza :     *
      *                                                  * se c'e' un  *
      *                                                  * eccesso di  *
      *                                                  * giorni da 1 *
      *                                                  * a 7 si re-  *
      *                                                  * gredisce al *
      *                                                  * giorno fis- *
      *                                                  * so di sca-  *
      *                                                  * denza dello *
      *                                                  * stesso mese *
      *                                                  * altrimenti  *
      *                                                  * si forza il *
      *                                                  * giorno fis- *
      *                                                  * so di sca-  *
      *                                                  * denza del   *
      *                                                  * mese suc-   *
      *                                                  * cessivo.    *
      *                                                  * Poi si pas- *
      *                                                  * sa al trat- *
      *                                                  * tamento me- *
      *                                                  * si esclusi  *
      *                                                  *-------------*
           move      w-clc-tbl-scd-wdg    to   w-clc-tbl-scd-wc4      .
           subtract  w-clc-tbl-scd-gfs
                    (w-clc-tbl-scd-wip)   from w-clc-tbl-scd-wc4      .
           move      w-clc-tbl-scd-gfs
                    (w-clc-tbl-scd-wip)   to   w-clc-tbl-scd-wdg      .
           if        w-clc-tbl-scd-wc4    not  > 7
                     go to clc-tbl-scd-490.
           add       1                    to   w-clc-tbl-scd-wdm      .
           if        w-clc-tbl-scd-wdm    >    12
                     add   1              to   w-clc-tbl-scd-wds
                     move  1              to   w-clc-tbl-scd-wdm      .
       clc-tbl-scd-490.
      *                                      *-------------------------*
      *                                      * Trattamento eventuali   *
      *                                      * mesi esclusi            *
      *                                      *-------------------------*
      *                                          *---------------------*
      *                                          * Se nessun mese e-   *
      *                                          * scluso : oltre      *
      *                                          *---------------------*
           if        w-clc-tbl-scd-esm    =    01
                     go to clc-tbl-scd-494.
      *                                          *---------------------*
      *                                          * Test se il mese del-*
      *                                          * la scadenza fin qui *
      *                                          * calcolato corrispon-*
      *                                          * de ad uno fra quelli*
      *                                          * esclusi             *
      *                                          *---------------------*
           if        w-clc-tbl-scd-wdm    =    w-clc-tbl-scd-e01
                     go to clc-tbl-scd-492.
           if        w-clc-tbl-scd-wdm    =    w-clc-tbl-scd-e02
                     go to clc-tbl-scd-492.
           go to     clc-tbl-scd-494.
       clc-tbl-scd-492.
      *                                          *---------------------*
      *                                          * Spostamento della   *
      *                                          * scadenza di un mese *
      *                                          * un mese             *
      *                                          *---------------------*
           add       1                    to   w-clc-tbl-scd-wdm      .
           if        w-clc-tbl-scd-wdm    >    12
                     add   1              to   w-clc-tbl-scd-wds
                     move  1              to   w-clc-tbl-scd-wdm      .
      *                                          *---------------------*
      *                                          * Se la scadenza deve *
      *                                          * essere spostata ad  *
      *                                          * un giorno fisso del *
      *                                          * mese successivo     *
      *                                          *---------------------*
           if        w-clc-tbl-scd-esm    =    03
                     move  w-clc-tbl-scd-alt
                                          to   w-clc-tbl-scd-wdg      .
      *                                          *---------------------*
      *                                          * Se il giorno calco- *
      *                                          * lato supera l'ultimo*
      *                                          * giorno del mese, lo *
      *                                          * si riporta all'ulti-*
      *                                          * mo giorno del mese  *
      *                                          *---------------------*
           if        w-clc-tbl-scd-wdg    not  > w-clc-tbl-scd-wt2
                                                (w-clc-tbl-scd-wdm)
                     go to clc-tbl-scd-494.
           move      w-clc-tbl-scd-wt2
                    (w-clc-tbl-scd-wdm)   to   w-clc-tbl-scd-wdg      .
       clc-tbl-scd-494.
      *                                      *-------------------------*
      *                                      * Aggiornamento decorrenza*
      *                                      * per scdenza successiva  *
      *                                      *-------------------------*
           if        w-clc-tbl-scd-gdi
                    (w-clc-tbl-scd-wip)   =    01
                     add  30              to   w-clc-tbl-scd-wpd
           else if   w-clc-tbl-scd-gdi
                    (w-clc-tbl-scd-wip)   =    02
                     add  15              to   w-clc-tbl-scd-wpd      .
       clc-tbl-scd-500.
      *                              *---------------------------------*
      *                              * Data scadenza calcolata         *
      *                              *---------------------------------*
           move      w-clc-tbl-scd-wdt    to   w-clc-tbl-scd-dds
                                              (w-clc-tbl-scd-nts)     .
       clc-tbl-scd-505.
      *                              *---------------------------------*
      *                              * Codice della causale contabile  *
      *                              * per l'aggiornamento             *
      *                              *---------------------------------*
           move      w-clc-tbl-scd-ccp
                    (w-clc-tbl-scd-wip)   to   w-clc-tbl-scd-ccs
                                              (w-clc-tbl-scd-nts)     .
       clc-tbl-scd-510.
      *                              *---------------------------------*
      *                              * Importo della scadenza          *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Deviazione a seconda se si  *
      *                                  * e' sull'ultima scadenza da  *
      *                                  * calcolare per il codice pa- *
      *                                  * gamento in esame oppure no  *
      *                                  *-----------------------------*
           if        w-clc-tbl-scd-wnc    =    w-clc-tbl-scd-wnd
                     go to clc-tbl-scd-512
           else      go to clc-tbl-scd-514.
       clc-tbl-scd-512.
      *                                  *-----------------------------*
      *                                  * Se si e' sull'ultima        *
      *                                  *-----------------------------*
           move      w-clc-tbl-scd-wap    to   w-clc-tbl-scd-ids
                                              (w-clc-tbl-scd-nts)     .
           subtract  w-clc-tbl-scd-wad    from w-clc-tbl-scd-ids
                                              (w-clc-tbl-scd-nts)     .
           go to     clc-tbl-scd-520.
       clc-tbl-scd-514.
      *                                  *-----------------------------*
      *                                  * Se non si e' sull'ultima    *
      *                                  *-----------------------------*
           move      w-clc-tbl-scd-wis    to   w-clc-tbl-scd-ids
                                              (w-clc-tbl-scd-nts)     .
       clc-tbl-scd-520.
      *                          *-------------------------------------*
      *                          * Incremento ammontare gia' distri-   *
      *                          * buito                               *
      *                          *-------------------------------------*
           add       w-clc-tbl-scd-ids
                    (w-clc-tbl-scd-nts)    to   w-clc-tbl-scd-wad     .
       clc-tbl-scd-530.
      *                          *-------------------------------------*
      *                          * Riciclo su prossima scadenza        *
      *                          *-------------------------------------*
           go to     clc-tbl-scd-290.
       clc-tbl-scd-590.
      *                  *---------------------------------------------*
      *                  * Riciclo su codice di pagamento successivo   *
      *                  *---------------------------------------------*
           go to     clc-tbl-scd-110.
       clc-tbl-scd-600.
      *              *-------------------------------------------------*
      *              * Compattamento della tabella calcolata           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se numero scadenze calcolate non superiore a*
      *                  * uno : nessun compattamento                  *
      *                  *---------------------------------------------*
           if        w-clc-tbl-scd-nts    not  > 1
                     go to clc-tbl-scd-999.
      *                  *---------------------------------------------*
      *                  * Ordinamento scadenze                        *
      *                  *---------------------------------------------*
           move      zero                 to   w-clc-tbl-scd-wo1      .
       clc-tbl-scd-610.
           add       1                    to   w-clc-tbl-scd-wo1      .
           if        w-clc-tbl-scd-wo1    =    w-clc-tbl-scd-nts
                     go to  clc-tbl-scd-700.
           move      w-clc-tbl-scd-wo1    to   w-clc-tbl-scd-wo2
                                               w-clc-tbl-scd-wo3      .
           move      w-clc-tbl-scd-ets
                    (w-clc-tbl-scd-wo1)   to   w-clc-tbl-scd-wet      .
       clc-tbl-scd-620.
           add       1                    to   w-clc-tbl-scd-wo2      .
           if        w-clc-tbl-scd-wo2    >    w-clc-tbl-scd-nts
                     go to  clc-tbl-scd-630.
           if        w-clc-tbl-scd-ets
                    (w-clc-tbl-scd-wo2)   >    w-clc-tbl-scd-wet
                     go to  clc-tbl-scd-620.
           move      w-clc-tbl-scd-wo2    to   w-clc-tbl-scd-wo3      .
           move      w-clc-tbl-scd-ets
                    (w-clc-tbl-scd-wo2)   to   w-clc-tbl-scd-wet      .
           go to     clc-tbl-scd-620.
       clc-tbl-scd-630.
           move      w-clc-tbl-scd-wo2    to   w-clc-tbl-scd-wo4      .
           if        w-clc-tbl-scd-wet    >    w-clc-tbl-scd-ets
                                              (w-clc-tbl-scd-wo4)
                     go to  clc-tbl-scd-610.
           move      w-clc-tbl-scd-ets
                    (w-clc-tbl-scd-wo3)   to   w-clc-tbl-scd-wet      .
           move      w-clc-tbl-scd-ets
                    (w-clc-tbl-scd-wo4)   to   w-clc-tbl-scd-ets
                                              (w-clc-tbl-scd-wo3)     .
           move      w-clc-tbl-scd-wet    to   w-clc-tbl-scd-ets
                                              (w-clc-tbl-scd-wo4)     .
           go to     clc-tbl-scd-610.
       clc-tbl-scd-700.
      *                  *---------------------------------------------*
      *                  * Compattamento vero e proprio                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Azzeramento work per rottura            *
      *                      *-----------------------------------------*
           move      zero                 to   w-clc-tbl-scd-wct      .
           move      zero                 to   w-clc-tbl-scd-wcd      .
           move      zero                 to   w-clc-tbl-scd-wcc      .
      *                      *-----------------------------------------*
      *                      * Azzeramento contatori                   *
      *                      *-----------------------------------------*
           move      zero                 to   w-clc-tbl-scd-wo1      .
           move      zero                 to   w-clc-tbl-scd-wo2      .
       clc-tbl-scd-710.
           add       1                    to   w-clc-tbl-scd-wo1      .
           if        w-clc-tbl-scd-wo1    >    w-clc-tbl-scd-nts
                     go to clc-tbl-scd-750.
      *                      *-----------------------------------------*
      *                      * Test se rottura                         *
      *                      *-----------------------------------------*
           if        w-clc-tbl-scd-tds
                    (w-clc-tbl-scd-wo1)   =    w-clc-tbl-scd-wct and
                     w-clc-tbl-scd-dds
                    (w-clc-tbl-scd-wo1)   =    w-clc-tbl-scd-wcd and
                     w-clc-tbl-scd-ccs
                    (w-clc-tbl-scd-wo1)   =    w-clc-tbl-scd-wcc
                     go to clc-tbl-scd-730.
      *                      *-----------------------------------------*
      *                      * Se rottura                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Fine rottura precedente             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Se prima rottura : oltre        *
      *                              *---------------------------------*
           if        w-clc-tbl-scd-wct    =    zero and
                     w-clc-tbl-scd-wcd    =    zero and
                     w-clc-tbl-scd-wcc    =    zero
                     go to clc-tbl-scd-720.
      *                              *---------------------------------*
      *                              * Incremento contatore elementi   *
      *                              *---------------------------------*
           add       1                    to   w-clc-tbl-scd-wo2      .
      *                              *---------------------------------*
      *                              * Bufferizzazione in tabella      *
      *                              *---------------------------------*
           move      w-clc-tbl-scd-wct    to   w-clc-tbl-scd-tds
                                              (w-clc-tbl-scd-wo2)     .
           move      w-clc-tbl-scd-wcd    to   w-clc-tbl-scd-dds
                                              (w-clc-tbl-scd-wo2)     .
           move      w-clc-tbl-scd-wcc    to   w-clc-tbl-scd-ccs
                                              (w-clc-tbl-scd-wo2)     .
           move      w-clc-tbl-scd-wci    to   w-clc-tbl-scd-ids
                                              (w-clc-tbl-scd-wo2)     .
       clc-tbl-scd-720.
      *                          *-------------------------------------*
      *                          * Inizio nuova rottura                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Aggiornamento area rottura      *
      *                              *---------------------------------*
           move      w-clc-tbl-scd-tds
                    (w-clc-tbl-scd-wo1)   to   w-clc-tbl-scd-wct      .
           move      w-clc-tbl-scd-dds
                    (w-clc-tbl-scd-wo1)   to   w-clc-tbl-scd-wcd      .
           move      w-clc-tbl-scd-ccs
                    (w-clc-tbl-scd-wo1)   to   w-clc-tbl-scd-wcc      .
      *                              *---------------------------------*
      *                              * Normalizzazione importo scadenza*
      *                              *---------------------------------*
           move      zero                 to   w-clc-tbl-scd-wci      .
       clc-tbl-scd-730.
      *                      *-----------------------------------------*
      *                      * Se non rottura                          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Aggiornamento importo scadenza      *
      *                          *-------------------------------------*
           add       w-clc-tbl-scd-ids
                    (w-clc-tbl-scd-wo1)   to   w-clc-tbl-scd-wci      .
      *                      *-----------------------------------------*
      *                      * Riciclo su scansione tabella            *
      *                      *-----------------------------------------*
           go to     clc-tbl-scd-710.
       clc-tbl-scd-750.
      *                      *-----------------------------------------*
      *                      * Fine ultima rottura                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Incremento contatore elementi       *
      *                          *-------------------------------------*
           add       1                    to   w-clc-tbl-scd-wo2      .
      *                          *-------------------------------------*
      *                          * Bufferizzazione in tabella          *
      *                          *-------------------------------------*
           move      w-clc-tbl-scd-wct    to   w-clc-tbl-scd-tds
                                              (w-clc-tbl-scd-wo2)     .
           move      w-clc-tbl-scd-wcd    to   w-clc-tbl-scd-dds
                                              (w-clc-tbl-scd-wo2)     .
           move      w-clc-tbl-scd-wcc    to   w-clc-tbl-scd-ccs
                                              (w-clc-tbl-scd-wo2)     .
           move      w-clc-tbl-scd-wci    to   w-clc-tbl-scd-ids
                                              (w-clc-tbl-scd-wo2)     .
      *                      *-----------------------------------------*
      *                      * Aggiornamento numero elementi in tabella*
      *                      *-----------------------------------------*
           move      w-clc-tbl-scd-wo2    to   w-clc-tbl-scd-nts      .
       clc-tbl-scd-999.
           exit.

