       Identification Division.
       Program-Id.                                 pdcp6200           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    dcp                 *
      *                                Settore:    cdv                 *
      *                                   Fase:    dcp620              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 16/01/95    *
      *                       Ultima revisione:    NdK del 25/11/04    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Gestione prezzi per campagne promozionali   *
      *                    per piu' prodotti                           *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Sequenza per classe prodotto                      *
      *            *---------------------------------------------------*
               10  srt-key-sqc            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Sequenza per gruppo prodotto                      *
      *            *---------------------------------------------------*
               10  srt-key-sqg            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Sequenza per sottogruppo prodotto                 *
      *            *---------------------------------------------------*
               10  srt-key-sqs            pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Descrizione prodotto 1                            *
      *            *---------------------------------------------------*
               10  srt-key-dp1            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice alfanumerico prodotto                      *
      *            *---------------------------------------------------*
               10  srt-key-cap            pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Descrizione prodotto 2                            *
      *            *---------------------------------------------------*
               10  srt-key-dp2            pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Descrizione prodotto da esporre                   *
      *            *---------------------------------------------------*
               10  srt-des-pro            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Codice prodotto numerico                          *
      *            *---------------------------------------------------*
               10  srt-num-pro            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice prodotto alfanumerico                      *
      *            *---------------------------------------------------*
               10  srt-alf-pro            pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Prezzo di listino attuale                         *
      *            *---------------------------------------------------*
               10  srt-prz-lst            pic  9(09)                  .
      *            *---------------------------------------------------*
      *            * Decimali prezzo                                   *
      *            *---------------------------------------------------*
               10  srt-dec-prz            pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Categoria provvigioni                             *
      *            *---------------------------------------------------*
               10  srt-cat-pvg            pic  9(05)                  .
               10  srt-cat-pvg-des        pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * % di provvigioni                                  *
      *            *---------------------------------------------------*
               10  srt-per-pvg occurs 03  pic  9(02)v9(01)            .
      *            *---------------------------------------------------*
      *            * Categoria sconto                                  *
      *            *---------------------------------------------------*
               10  srt-cat-sco            pic  9(05)                  .
               10  srt-cat-sco-des        pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * % di sconto                                       *
      *            *---------------------------------------------------*
               10  srt-per-sco occurs 05  pic  9(02)v9(01)            .
      *            *---------------------------------------------------*
      *            * Flags di si/no utilizzo                           *
      *            *---------------------------------------------------*
               10  srt-snx-prz            pic  x(01)                  .
               10  srt-snx-pvg            pic  x(01)                  .
               10  srt-snx-sco            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo funzionamento                                *
      *            *---------------------------------------------------*
               10  srt-tip-fnz            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Data validita' iniziale                           *
      *            *---------------------------------------------------*
               10  srt-dva-ini            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Data validita' finale                             *
      *            *---------------------------------------------------*
               10  srt-dva-fin            pic  9(07)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "dcp"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "cdv"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "dcp620"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pdcp6200"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "GESTIONE CAMPAGNE PROMOZIONALI PRODOTTI "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pos-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pos-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-let-reg-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-let-reg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-ins-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-ins      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-mod-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-mod      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-vis-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-vis      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-snx-del      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pos-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pos-snx-del      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-tus.
      *            *---------------------------------------------------*
      *            * Da accettazione campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-nok      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione testata                           *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione corpo                             *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione riga corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione piede                             *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-key-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per controllo se chiave vuota                     *
      *            *---------------------------------------------------*
               10  w-cnt-key-vuo-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-nok-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per tasto Do su riga corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-rig-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su modalita' di funzionamento      *
      *        *-------------------------------------------------------*
           05  w-cnt-mfu.
      *            *---------------------------------------------------*
      *            * Tipo impostazione                                 *
      *            * - K : Impostazione campi chiave                   *
      *            * - T : Impostazione campi testata                  *
      *            * - C : Impostazione primo campo riga corpo         *
      *            * - R : Impostazione altri campi riga corpo         *
      *            * - P : Impostazione campi piede                    *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-imp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo funzione                                     *
      *            * - I : Inserimento                                 *
      *            * - M : Modifica                                    *
      *            * - V : Visualizzazione                             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-fun      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione forzata da segreteria             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-vis-sgr      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flag di controllo su status visualizzazione titolo    *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis-tit          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione chiave                               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina testata in corso di trattamento     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-npt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Salvataggio per il campo precedente               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-svp      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Si/No pagina testata in corso di trattamento      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-snp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagine componenti la testata               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-mpt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Impostazione testata                              *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione pagine di testata                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-pte.
                   15  w-cnt-sts-imp-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Ingresso in pagine di testata                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-ing-pte.
                   15  w-cnt-sts-ing-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione corpo                                *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione riga corpo                           *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione piede                                *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-pie      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di inibizione manuale tasto Delt             *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-itd      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts chiave                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts testata                   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts pagine di testata         *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-pte.
                   15  w-cnt-sts-pmt-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts corpo                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts riga accettazione corpo   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts piede                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati chiave                       *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati testata                      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati pagine di testata            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-pte.
                   15  w-cnt-sts-vis-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati riga di accettazione corpo   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati piede                        *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per trattamento corpo               *
      *        *-------------------------------------------------------*
           05  w-cnt-cor.
      *            *---------------------------------------------------*
      *            * Numero riga da accettare                          *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrg-dac      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero riga da visualizzare                       *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrg-dav      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Tipo visualizzazione riga                         *
      *            *---------------------------------------------------*
               10  w-cnt-cor-tvi-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina corpo da visualizzare               *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrp-dav      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina corpo visualizzata                  *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrp-vis      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Tipo aggiornamento post-riga (+ o -)              *
      *            *---------------------------------------------------*
               10  w-cnt-cor-tip-agg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per variazioni                      *
      *        *-------------------------------------------------------*
           05  w-cnt-var.
      *            *---------------------------------------------------*
      *            * Flag di variazioni in testata che si ripercuotono *
      *            * su tutte le righe corpo                           *
      *            *---------------------------------------------------*
               10  w-cnt-var-tes-cor      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per Slct da primo campo riga corpo  *
      *        *-------------------------------------------------------*
           05  w-cnt-slc.
      *            *---------------------------------------------------*
      *            * Numero riga di destinazione per Slct              *
      *            *---------------------------------------------------*
               10  w-cnt-slc-num-rig      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Rappresentazione alfa del numero riga             *
      *            *---------------------------------------------------*
               10  w-cnt-slc-rap-alf.
                   15  w-cnt-slc-rap-chr
                               occurs 05  pic  x(01)                  .
               10  w-cnt-slc-rap-a01 redefines
                   w-cnt-slc-rap-alf.
                   15  w-cnt-slc-rap-chn
                               occurs 05  pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Rappresentazione numerica del numero riga         *
      *            *---------------------------------------------------*
               10  w-cnt-slc-rap-num      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per accettazioni singoli campi      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
               10  w-cnt-acc-flg-aum      pic  x(01)                  .
               10  w-cnt-acc-sav-tip      pic  x(01)                  .
               10  w-cnt-acc-sav-car      pic  9(02)                  .
               10  w-cnt-acc-sav-ldt      pic  9(02)                  .
               10  w-cnt-acc-sav-dec      pic  9(01)                  .
               10  w-cnt-acc-sav-sgn      pic  x(01)                  .
               10  w-cnt-acc-sav-edm      pic  x(10)                  .
               10  w-cnt-acc-sav-msk      pic  x(24)                  .
               10  w-cnt-acc-sav-lin      pic  9(02)                  .
               10  w-cnt-acc-sav-pos      pic  9(02)                  .
               10  w-cnt-acc-sav-alf      pic  x(80)                  .
               10  w-cnt-acc-sav-txt.
                   15  filler occurs 400  pic  x(01)                  .
               10  w-cnt-acc-sav-num      pic s9(13)v9(05)  trailing
                                                            separate
                                                            character .
               10  w-cnt-acc-sav-dat      pic  9(07)                  .
               10  w-cnt-acc-sav-ufk      pic  x(80)                  .
               10  w-cnt-acc-sav-mod      pic  x(01)                  .
               10  w-cnt-acc-sav-l23      pic  x(80)                  .
               10  w-cnt-acc-sav-l24      pic  x(80)                  .
      *        *-------------------------------------------------------*
      *        * Work area                                             *
      *        *-------------------------------------------------------*
           05  w-cnt-wrk.
               10  w-cnt-wrk-ctr-001      pic  9(05)                  .
               10  w-cnt-wrk-ctr-002      pic  9(05)                  .
               10  w-cnt-wrk-ctr-003      pic  9(05)                  .
               10  w-cnt-wrk-ctr-008      pic  9(05)                  .
               10  w-cnt-wrk-ctr-009      pic  9(05)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [lst]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rflst"                          .
      *        *-------------------------------------------------------*
      *        * [lsd]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rflsd"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [zos]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/azi/fls/rec/rfzos"                          .
      *        *-------------------------------------------------------*
      *        * [zp1]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp1"                          .
      *        *-------------------------------------------------------*
      *        * [zp2]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp2"                          .
      *        *-------------------------------------------------------*
      *        * [zp3]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp3"                          .
      *        *-------------------------------------------------------*
      *        * [zcs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfzcs"                          .
      *        *-------------------------------------------------------*
      *        * [zpv]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/age/fls/rec/rfzpv"                          .

      *    *===========================================================*
      *    * Work-area per bufferizzazione testata                     *
      *    *-----------------------------------------------------------*
       01  w-tes.
      *        *-------------------------------------------------------*
      *        * Valori chiave                                         *
      *        *-------------------------------------------------------*
           05  w-tes-val-key.
      *            *---------------------------------------------------*
      *            * Filtro di selezione [dcp]                         *
      *            *---------------------------------------------------*
               10  w-tes-fso-dcp          pic  9(08)                  .
               10  w-tes-fso-dcp-alf redefines
                   w-tes-fso-dcp          pic  x(08)                  .
               10  w-tes-fso-dcp-des      pic  x(40)                  .
               10  w-tes-fso-dcp-ord      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Si/No selezione solo prodotti in campagna         *
      *            *---------------------------------------------------*
               10  w-tes-snx-spc          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Conferma impostazioni                             *
      *            *---------------------------------------------------*
               10  w-tes-cnf-imp          pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per bufferizzazione riga corpo                  *
      *    *-----------------------------------------------------------*
       01  w-rig.
      *        *-------------------------------------------------------*
      *        * Area valori attuali e precedenti                      *
      *        *-------------------------------------------------------*
           05  w-rig-val-aep     occurs 2.
               10  w-rig-num-prg          pic  9(05)                  .
               10  w-rig-num-pro          pic  9(07)                  .
               10  w-rig-alf-pro          pic  x(14)                  .
               10  w-rig-des-pro          pic  x(40)                  .
               10  w-rig-tip-fnz          pic  9(02)                  .
               10  w-rig-cat-pvg          pic  9(05)                  .
               10  w-rig-cat-pvg-des      pic  x(20)                  .
               10  w-rig-per-pvg occurs 03
                                          pic  9(02)v9(01)            .
               10  w-rig-cat-sco          pic  9(05)                  .
               10  w-rig-cat-sco-des      pic  x(20)                  .
               10  w-rig-per-sco occurs 05
                                          pic  9(02)v9(01)            .
               10  w-rig-snx-prz          pic  x(01)                  .
               10  w-rig-snx-sco          pic  x(01)                  .
               10  w-rig-snx-pvg          pic  x(01)                  .
               10  w-rig-prz-lst          pic  9(09)                  .
               10  w-rig-dec-prz          pic  9(01)                  .
               10  w-rig-dva-ini          pic  9(07)                  .
               10  w-rig-dva-fin          pic  9(07)                  .
               10  w-rig-snx-sto          pic  x(01)                  .
               10  w-rig-alx-exp.
                   15  filler occurs 06   pic  x(01)                  .

      *    *===========================================================*
      *    * Area di comunicazione per gestione file relative di sup-  *
      *    * porto, con buffer in grado di ospitare l'area w-rig.      *
      *    *-----------------------------------------------------------*
       01  w-rlt-sup.
           05  w-rlt-sup-ope              pic  x(02)                  .
           05  w-rlt-sup-exs              pic  x(01)                  .
           05  w-rlt-sup-prg              pic  9(05)                  .
           05  w-rlt-sup-max              pic  9(05)                  .
           05  w-rlt-sup-ctr              pic  9(05)                  .
           05  w-rlt-sup-buf.
               10  filler occurs 512      pic  x(01)                  .

      *    *===========================================================*
      *    * Work per linea corpo a video                              *
      *    *-----------------------------------------------------------*
       01  w-lin.
      *        *-------------------------------------------------------*
      *        * Numero righe di corpo effettive visibili contempora-  *
      *        * neamente in una pagina di corpo nell'area di scroll   *
      *        *-------------------------------------------------------*
           05  w-lin-num-lin-vis          pic  9(02)       value 08   .
      *        *-------------------------------------------------------*
      *        * Numero linee di display impegnate per ogni riga corpo *
      *        * nell'area di scroll                                   *
      *        *-------------------------------------------------------*
           05  w-lin-num-lin-prc          pic  9(02)       value 01   .
      *        *-------------------------------------------------------*
      *        * Prima linea di display utilizzata per le righe corpo  *
      *        * nell'area di scroll                                   *
      *        *-------------------------------------------------------*
           05  w-lin-pri-lin-vid          pic  9(02)       value 06   .
      *        *-------------------------------------------------------*
      *        * Immagine di una riga di corpo su video                *
      *        *-------------------------------------------------------*
           05  w-lin-imm.
      *            *---------------------------------------------------*
      *            * Linee di display per ogni riga corpo in scroll    *
      *            *---------------------------------------------------*
               10  w-lin-imm-dsp.
                   15  w-lin-imm-dsp-lin occurs 01
                                          pic  x(80)                  .
      *            *---------------------------------------------------*
      *            * Riga corpo in scroll rappresentata linearmente    *
      *            *---------------------------------------------------*
               10  w-lin-imm-scr redefines
                   w-lin-imm-dsp.
      *                *-----------------------------------------------*
      *                * Numero linea                                  *
      *                *-----------------------------------------------*
                   15  w-lin-imm-num-lin  pic  x(05)                  .
      *                *-----------------------------------------------*
      *                * Altri dati visualizzati                       *
      *                *-----------------------------------------------*
                   15  filler             pic  x(03)                  .
                   15  w-lin-imm-alf-pro  pic  x(14)                  .
                   15  filler             pic  x(02)                  .
                   15  w-lin-imm-prz-lst  pic  x(12)                  .
                   15  filler             pic  x(04)                  .
                   15  w-lin-imm-des-pro  pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per salvataggi                                  *
      *    *-----------------------------------------------------------*
       01  w-sav.
      *        *-------------------------------------------------------*
      *        * Salvataggio per codice prodotto alfanumerico          *
      *        *-------------------------------------------------------*
           05  w-sav-alf-pro              pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Salvataggio campo 'Si/No storicizzazione valori pre-  *
      *        * cedenti pre determinazione della sua significativita' *
      *        *-------------------------------------------------------*
           05  w-sav-det-snx-sto          pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per lettura personalizzazioni                   *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Personalizzazione relativa al tipo funzionamento      *
      *        * prezzi di vendita per campagne promozionali           *
      *        *                                                       *
      *        * - 00 : Nessuna preferenza, sempre utilizzo di prezzo  *
      *        *        e sconti                                       *
      *        * - 01 : Utilizzo di prezzo, sconti e provvigioni       *
      *        * - 02 : Utilizzo solo di prezzo                        *
      *        * - 03 : Utilizzo solo di sconti                        *
      *        * - 04 : Utilizzo solo di provvigioni                   *
      *        * - 05 : Utilizzo di prezzo e sconti                    *
      *        * - 06 : Utilizzo di prezzo e provvigioni               *
      *        * - 07 : Utilizzo di sconti e provvigioni               *
      *        *-------------------------------------------------------*
           05  w-prs-tfu-pcp              pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per contatori e indici                          *
      *    *-----------------------------------------------------------*
       01  w-cix.
      *        *-------------------------------------------------------*
      *        * Contatore per percentuali                             *
      *        *-------------------------------------------------------*
           05  w-cix-ctr-001              pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutines di editing                           *
      *    *-----------------------------------------------------------*
       01  w-edt.
      *        *-------------------------------------------------------*
      *        * Area editata per 5 percentuali di sconto              *
      *        *-------------------------------------------------------*
           05  w-edt-per-sco.
               10  w-edt-cst-psr occurs 5.
                   15  w-edt-psr-ele      pic  x(04)                  .
                   15  filler             pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area editata per 3 percentuali di provvigioni         *
      *        *-------------------------------------------------------*
           05  w-edt-per-pvg.
               10  w-edt-cst-ppv occurs 3.
                   15  w-edt-ppv-ele      pic  x(04)                  .
                   15  filler             pic  x(01)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Si/No selezione solo prodotti in campagna  *
      *        *-------------------------------------------------------*
           05  w-exp-snx-spc.
               10  w-exp-snx-spc-num      pic  9(02)       value 2    .
               10  w-exp-snx-spc-lun      pic  9(02)       value 02   .
               10  w-exp-snx-spc-tbl.
                   15  filler             pic  x(02) value "Si"       .
                   15  filler             pic  x(02) value "No"       .
      *        *-------------------------------------------------------*
      *        * Work per : Tipo funzionamento                         *
      *        *-------------------------------------------------------*
           05  w-exp-tip-fun.
               10  w-exp-tip-fun-num      pic  9(02)       value 7    .
               10  w-exp-tip-fun-lun      pic  9(02)       value 40   .
               10  w-exp-tip-fun-tbl.
                   15  filler             pic  x(40) value
                            "Utilizzo di prezzo, sconti e provvigioni".
                   15  filler             pic  x(40) value
                            "Utilizzo solo di prezzo                 ".
                   15  filler             pic  x(40) value
                            "Utilizzo solo di sconti                 ".
                   15  filler             pic  x(40) value
                            "Utilizzo solo di provvigioni            ".
                   15  filler             pic  x(40) value
                            "Utilizzo di prezzo e sconti             ".
                   15  filler             pic  x(40) value
                            "Utilizzo di prezzo e provvigioni        ".
                   15  filler             pic  x(40) value
                            "Utilizzo di sconti e provvigioni        ".
      *        *-------------------------------------------------------*
      *        * Work per : Si/No storicizzazione valori precedenti    *
      *        *-------------------------------------------------------*
           05  w-exp-snx-sto.
               10  w-exp-snx-sto-num      pic  9(02)       value 2    .
               10  w-exp-snx-sto-lun      pic  9(02)       value 02   .
               10  w-exp-snx-sto-tbl.
                   15  filler             pic  x(02) value "No"       .
                   15  filler             pic  x(02) value "Si"       .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [cli]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-cli.
               10  w-let-arc-cli-flg      pic  x(01)                  .
               10  w-let-arc-cli-cod      pic  9(07)                  .
               10  w-let-arc-cli-rag      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcc]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcc.
               10  w-let-arc-dcc-flg      pic  x(01)                  .
               10  w-let-arc-dcc-cli      pic  9(07)                  .
               10  w-let-arc-dcc-dpz      pic  x(04)                  .
               10  w-let-arc-dcc-rag      pic  x(40)                  .
               10  w-let-arc-dcc-vlt      pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zvl]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zvl.
               10  w-let-arc-zvl-flg      pic  x(01)                  .
               10  w-let-arc-zvl-cod      pic  x(03)                  .
               10  w-let-arc-zvl-des      pic  x(20)                  .
               10  w-let-arc-zvl-din      pic  x(20)                  .
               10  w-let-arc-zvl-dec      pic  9(01)                  .
               10  w-let-arc-zvl-tdc      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zp1]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zp1.
               10  w-let-arc-zp1-flg      pic  x(01)                  .
               10  w-let-arc-zp1-cla      pic  9(05)                  .
               10  w-let-arc-zp1-des      pic  x(40)                  .
               10  w-let-arc-zp1-mne      pic  x(05)                  .
               10  w-let-arc-zp1-sud      pic  9(02)                  .
               10  w-let-arc-zp1-sqz      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zp2]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zp2.
               10  w-let-arc-zp2-flg      pic  x(01)                  .
               10  w-let-arc-zp2-cla      pic  9(05)                  .
               10  w-let-arc-zp2-gru      pic  9(05)                  .
               10  w-let-arc-zp2-des      pic  x(40)                  .
               10  w-let-arc-zp2-mne      pic  x(05)                  .
               10  w-let-arc-zp2-sud      pic  9(02)                  .
               10  w-let-arc-zp2-sqz      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zp3]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zp3.
               10  w-let-arc-zp3-flg      pic  x(01)                  .
               10  w-let-arc-zp3-cla      pic  9(05)                  .
               10  w-let-arc-zp3-gru      pic  9(05)                  .
               10  w-let-arc-zp3-sgr      pic  9(05)                  .
               10  w-let-arc-zp3-des      pic  x(40)                  .
               10  w-let-arc-zp3-mne      pic  x(05)                  .
               10  w-let-arc-zp3-sud      pic  9(02)                  .
               10  w-let-arc-zp3-sqz      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zcs]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zcs.
               10  w-let-arc-zcs-flg      pic  x(01)                  .
               10  w-let-arc-zcs-tip      pic  9(02)                  .
               10  w-let-arc-zcs-cod      pic  9(05)                  .
               10  w-let-arc-zcs-des      pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zpv]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zpv.
               10  w-let-arc-zpv-flg      pic  x(01)                  .
               10  w-let-arc-zpv-tip      pic  9(02)                  .
               10  w-let-arc-zpv-cod      pic  9(05)                  .
               10  w-let-arc-zpv-des      pic  x(20)                  .

      *    *===========================================================*
      *    * Work per Let su archivio [zos] per [dcp]                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/lzosdcp0.ltw"                   .
              
      *    *===========================================================*
      *    * Link-area per accettazione codice filtro selezione e or-  *
      *    * dinamento per file [dcp]                                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/azosdcp0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice prodotto 'dcp'          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acoddcp0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione categoria sconto in riga pro-  *
      *    * dotto                                                     *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acmnzcs3.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione categoria provvigione legata   *
      *    * al prodotto                                               *
      *    *-----------------------------------------------------------*
           copy      "pgm/age/prg/cpy/acmnzpv2.acl"                   .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale, o per messaggi centra- *
      *        * li circondati da un box                               *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .
               10  w-err-box-err-m02      pic  x(65)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di visualizzazione titolo  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-tit      .
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
       main-050.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-800.
       main-100.
      *              *-------------------------------------------------*
      *              * Accettazione campi chiave                       *
      *              *-------------------------------------------------*
           perform   acc-key-reg-000      thru acc-key-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita "E" : fine programma         *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-key    =    "E"
                     go to main-800.
      *              *-------------------------------------------------*
      *              * Lettura registrazione pre-esistente             *
      *              *-------------------------------------------------*
           perform   rou-let-reg-000      thru rou-let-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se esito negativo : riciclo su chiave       *
      *                  *---------------------------------------------*
           if        w-cnt-rou-let-reg    not  = spaces
                     go to main-100.
      *              *-------------------------------------------------*
      *              * Routine pre-accettazione campi non chiave       *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     go to main-130
           else if   w-cnt-mfu-tip-fun    =    "M"
                     go to main-140
           else if   w-cnt-mfu-tip-fun    =    "V"
                     go to main-150
           else      go to main-100.
       main-130.
           move      spaces               to   w-cnt-pre-acc-ins      .
           perform   pre-acc-ins-000      thru pre-acc-ins-999        .
           if        w-cnt-pre-acc-ins    =    spaces
                     go to main-180
           else      go to main-100.
       main-140.
           move      spaces               to   w-cnt-pre-acc-mod      .
           perform   pre-acc-mod-000      thru pre-acc-mod-999        .
           if        w-cnt-pre-acc-mod    =    spaces
                     go to main-180
           else      go to main-100.
       main-150.
           move      spaces               to   w-cnt-pre-acc-vis      .
           perform   pre-acc-vis-000      thru pre-acc-vis-999        .
           if        w-cnt-pre-acc-vis    =    spaces
                     go to main-180
           else      go to main-100.
       main-180.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di modifica di almeno un   *
      *              * campo non chiave                                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-flg-aum      .
      *              *-------------------------------------------------*
      *              * Accettazione campi non chiave                   *
      *              *-------------------------------------------------*
           perform   acc-nok-reg-000      thru acc-nok-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "E"
                     go to main-200.
      *                      *-----------------------------------------*
      *                      * Routine post-exit su campi non chiave   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se Inserimento                      *
      *                          *-------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-exi-ins-000
                                          thru pos-exi-ins-999
      *                          *-------------------------------------*
      *                          * Se Modifica                         *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-exi-mod-000
                                          thru pos-exi-mod-999
      *                          *-------------------------------------*
      *                          * Se Visualizzazione                  *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "V"
                     perform   pos-exi-vis-000
                                          thru pos-exi-vis-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-200.
      *                  *---------------------------------------------*
      *                  * Se uscita per annullamento                  *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "X"
                     go to main-300.
      *                      *-----------------------------------------*
      *                      * Routine post-conferma di annullamento   *
      *                      *-----------------------------------------*
           perform   pos-cnf-ann-000      thru pos-cnf-ann-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-300.
      *                  *---------------------------------------------*
      *                  * Se uscita per conferma                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Routine post-conferma                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se post-conferma di Inserimento     *
      *                          *-------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-cnf-ins-000
                                          thru pos-cnf-ins-999
      *                          *-------------------------------------*
      *                          * Se post-conferma di Modifica        *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-cnf-mod-000
                                          thru pos-cnf-mod-999        .
      *                      *-----------------------------------------*
      *                      * Riciclo                                 *
      *                      *-----------------------------------------*
           go to     main-100.
       main-800.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione routine post-esecuzione programma    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pos-exe-pgm      .
           perform   pos-exe-pgm-000      thru pos-exe-pgm-999        .
           if        w-cnt-pos-exe-pgm    not  = spaces
                     go to main-050.
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Prsc :                        *
      *              * - se in tipo impostazione testata e su pagina   *
      *              *   maggiore di 1 : abilitato                     *
      *              * - altrimenti    : invariato                     *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "T" and
                     w-cnt-sts-imp-npt    >    1
                     move  "PRSC"         to   v-pfk (07)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Nxsc :                        *
      *              * - se in tipo impostazione testata e se pagina   *
      *              *   gia' completamente impostata o testata gia'   *
      *              *   completamente impostata : abilitato           *
      *              *  - altrimenti             : invariato           *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    not  = "T"
                     go to exe-acc-cmp-050.
           if        w-cnt-sts-imp-tes    not  = spaces or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     move  "NXSC"         to   v-pfk (08)             .
       exe-acc-cmp-050.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Delt :                        *
      *              *  - se Impostazione chiave    : non abilitato    *
      *              *  - se Altri campi corpo      : non abilitato    *
      *              *  - se Inserimento            : non abilitato    *
      *              *  - se Visualizzazione        : non abilitato    *
      *              *  - se Disabilitato manualm.  : non abilitato    *
      *              *  - se Almeno una modifica    : non abilitato    *
      *              *  - altrimenti                : abilitato        *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "K"      or
                     w-cnt-mfu-tip-imp    =    "R"      or
                     w-cnt-mfu-tip-fun    =    "I"      or
                     w-cnt-mfu-tip-fun    =    "V"      or
                     w-cnt-sts-imp-itd    not  = spaces or
                     w-cnt-acc-flg-aum    not  = spaces
                     go to exe-acc-cmp-100.
           move      "DELT"               to   v-pfk (19)             .
       exe-acc-cmp-100.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Do :                          *
      *              *  - se Visualizzazione     : disabilitato        *
      *              *  - altrimenti             : inalterato          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     move  spaces         to   v-pfk (05)             .
      *              *-------------------------------------------------*
      *              * Tasti di funzione Insr e Remv :                 *
      *              *  - se Visualizzazione e in                      *
      *              *    primo campo riga corpo : disabilitati        *
      *              *  - altrimenti             : inalterati          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V" and
                     w-cnt-mfu-tip-imp    =    "C"
                     move  spaces         to   v-pfk (04)
                     move  spaces         to   v-pfk (06)             .
      *              *-------------------------------------------------*
      *              * Salvataggio parametri di accettazione           *
      *              *-------------------------------------------------*
           move      v-tip                to   w-cnt-acc-sav-tip      .
           move      v-car                to   w-cnt-acc-sav-car      .
           move      v-lin                to   w-cnt-acc-sav-lin      .
           move      v-pos                to   w-cnt-acc-sav-pos      .
           if        v-tip                =    "A" or
                     v-tip                =    "U" or
                     v-tip                =    "L" or
                     v-tip                =    "E"
                     move  v-alf          to   w-cnt-acc-sav-alf      .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  v-dec          to   w-cnt-acc-sav-dec
                     move  v-sgn          to   w-cnt-acc-sav-sgn
                     move  v-edm          to   w-cnt-acc-sav-edm
                     move  v-msk          to   w-cnt-acc-sav-msk
                     move  v-num          to   w-cnt-acc-sav-num      .
           if        v-tip                =    "D"
                     move  v-dat          to   w-cnt-acc-sav-dat      .
           if        v-tip                =    "T" or
                     v-tip                =    "E"
                     move  v-ldt          to   w-cnt-acc-sav-ldt
                     move  v-txt          to   w-cnt-acc-sav-txt      .
           move      v-ufk                to   w-cnt-acc-sav-ufk      .
       exe-acc-cmp-200.
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Memorizzazione segnale di campo modificato      *
      *              *-------------------------------------------------*
           move      v-mod                to   w-cnt-acc-sav-mod      .
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "DELT"
                     go to exe-acc-cmp-600.
      *              *-------------------------------------------------*
      *              * Se il campo impostato ha modificato il valore   *
      *              * precedente : ripetizione impostazione           *
      *              *-------------------------------------------------*
           if        w-cnt-acc-sav-mod    not  = spaces
                     go to exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Routine pre-richiesta di ratifica tasto Delete  *
      *              *-------------------------------------------------*
           perform   pre-snx-del-000      thru pre-snx-del-999        .
      *              *-------------------------------------------------*
      *              * Se errore : a ripristino                        *
      *              *-------------------------------------------------*
           if        w-cnt-pre-snx-del    not  = spaces
                     go to exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Salvataggio linee 23 e 24 di note operative     *
      *              *-------------------------------------------------*
           move      "GL"                 to   v-ope                  .
           move      23                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l23      .
           move      "GL"                 to   v-ope                  .
           move      24                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l24      .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative attuali            *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      spaces               to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Richiesta conferma annullamento                 *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#DEL"               to   v-not                  .
           move      "N"                  to   v-alf                  .
           move      "SN"                 to   v-msk                  .
           move      "DELT"               to   v-pfk (19)             .
           move      "UP  "               to   v-pfk (02)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                =    spaces
                     if      v-alf        =    "S"
                             move  "DELT" to   v-key
                     else    move  "UP  " to   v-key                  .
      *              *-------------------------------------------------*
      *              * Se non function key DELT si ripristina          *
      *              *-------------------------------------------------*
           if        v-key                not  = "DELT"
                     go to exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Routine post-richiesta di ratifica tasto Delete *
      *              *-------------------------------------------------*
           perform   pos-snx-del-000      thru pos-snx-del-999        .
      *              *-------------------------------------------------*
      *              * Se errore : a ripristino                        *
      *              *-------------------------------------------------*
           if        w-cnt-pos-snx-del    not  = spaces
                     go to exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Altrimenti : uscita                             *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-999.
       exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Ripristino linee 23 e 24 di note operative      *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      w-cnt-acc-sav-l23    to   v-nt1                  .
           move      w-cnt-acc-sav-l24    to   v-nt2                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Ripristino parametri di impostazione            *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      w-cnt-acc-sav-tip    to   v-tip                  .
           move      w-cnt-acc-sav-car    to   v-car                  .
           move      w-cnt-acc-sav-lin    to   v-lin                  .
           move      w-cnt-acc-sav-pos    to   v-pos                  .
           if        v-tip                =    "A" or
                     v-tip                =    "U" or
                     v-tip                =    "L" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-alf
                                          to   v-alf                  .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-dec
                                          to   v-dec
                     move  w-cnt-acc-sav-sgn
                                          to   v-sgn
                     move  w-cnt-acc-sav-edm
                                          to   v-edm
                     move  w-cnt-acc-sav-msk
                                          to   v-msk
                     move  w-cnt-acc-sav-num
                                          to   v-num                  .
           if        v-tip                =    "D"
                     move  w-cnt-acc-sav-dat
                                          to   v-dat                  .
           if        v-tip                =    "T" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-ldt
                                          to   v-ldt
                     move  w-cnt-acc-sav-txt
                                          to   v-txt                  .
           move      w-cnt-acc-sav-ufk    to   v-ufk                  .
      *              *-------------------------------------------------*
      *              * Ritorno alla impostazione                       *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-200.
       exe-acc-cmp-600.
      *              *-------------------------------------------------*
      *              * Flag globale di avvenuta almeno una modifica    *
      *              *-------------------------------------------------*
           if        w-cnt-acc-sav-mod    not  = spaces
                     move  "#"            to   w-cnt-acc-flg-aum      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
      *              *-------------------------------------------------*
      *              * Flag di eventuale visualizzazione forzata       *
      *              *-------------------------------------------------*
           move      s-sts                to   w-cnt-mfu-vis-sgr      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Test su flag di visualizzazione titolo          *
      *              *-------------------------------------------------*
           if        w-cnt-sts-vis-tit    not  = spaces
                     move  spaces         to   w-cnt-sts-vis-tit
                     go to vis-tit-pgm-999.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione tipo funzionamento                        *
      *    *-----------------------------------------------------------*
       vis-tip-fun-000.
           move      "TF"                 to   v-ope                  .
           move      w-cnt-mfu-tip-fun    to   v-tfu                  .
           move      w-cnt-acc-flg-aum    to   v-tfm                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Visualizzazione titolo programma                *
      *              *-------------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
           move      "#"                  to   w-cnt-sts-vis-tit      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice filtro ordina-  *
      *              * mento e selezione per file [dcp]                *
      *              *-------------------------------------------------*
           perform   cod-zos-dcp-opn-000  thru cod-zos-dcp-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice prodotto 'dcp'  *
      *              *-------------------------------------------------*
           perform   cod-cod-dcp-opn-000  thru cod-cod-dcp-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice categoria di    *
      *              * sconto prodotto                                 *
      *              *-------------------------------------------------*
           perform   cmn-zcs-003-opn-000  thru cmn-zcs-003-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione categoria provvigioni  *
      *              *-------------------------------------------------*
           perform   cmn-zpv-002-opn-000  thru cmn-zpv-002-opn-999    .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Personalizzazione per tipo funzionamento    *
      *                  * prezzi per campagne promozionali            *
      *                  *---------------------------------------------*
           perform   prs-tfu-pcp-000      thru prs-tfu-pcp-999        .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura della personalizzazione per il tipo funzionamento *
      *    * dei prezzi per campagne promozionali, e modifica dei pa-  *
      *    * rametri per impostazione riga corpo, poiche' l'espansio-  *
      *    * ne della riga varia di conseguenza                        *
      *    *-----------------------------------------------------------*
       prs-tfu-pcp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione work-area                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-prs-tfu-pcp          .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/dcp/cdv[tfu-pcp]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Test su esito operazione                        *
      *              *-------------------------------------------------*
           if        s-ves                not  = spaces
                     go to prs-tfu-pcp-500.
      *              *-------------------------------------------------*
      *              * Valore personalizzazione in work-area           *
      *              *-------------------------------------------------*
           move      s-num                to   w-prs-tfu-pcp          .
      *              *-------------------------------------------------*
      *              * Controllo personalizzazione                     *
      *              *-------------------------------------------------*
           if        w-prs-tfu-pcp        <    01 or
                     w-prs-tfu-pcp        >    07
                     move  00             to   w-prs-tfu-pcp          .
       prs-tfu-pcp-500.
      *              *-------------------------------------------------*
      *              * Modifica dei parametri per il trattamento delle *
      *              * righe corpo                                     *
      *              *-------------------------------------------------*
       prs-tfu-pcp-550.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del valore della per-  *
      *                  * sonalizzazione letta                        *
      *                  *---------------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to prs-tfu-pcp-600
           else      go to prs-tfu-pcp-650.
       prs-tfu-pcp-600.
      *                  *---------------------------------------------*
      *                  * Se la personalizzazione non esprime nessuna *
      *                  * preferenza, si considerera' solo il prezzo  *
      *                  * di listino e gli sconti                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * In questo caso ci saranno 11 righe di   *
      *                      * corpo effettive visibili contemporanea- *
      *                      * mente in una pagina di corpo nell'area  *
      *                      * di scroll                               *
      *                      *-----------------------------------------*
           move      09                   to   w-lin-num-lin-vis      .
           go to     prs-tfu-pcp-999.
       prs-tfu-pcp-650.
      *                  *---------------------------------------------*
      *                  * Se la personalizzazione esprime una prefe-  *
      *                  * renza di default , quindi si considerera'   *
      *                  * il tipo funzionamento e i campi da lui di-  *
      *                  * pendenti                                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * In questo caso ci saranno 9 righe di    *
      *                      * corpo effettive visibili contemporanea- *
      *                      * mente in una pagina di corpo nell'area  *
      *                      * di scroll                               *
      *                      *-----------------------------------------*
           move      08                   to   w-lin-num-lin-vis      .
           go to     prs-tfu-pcp-999.
       prs-tfu-pcp-999.
           exit.

      *    *===========================================================*
      *    * Routine post-esecuzione programma                         *
      *    *-----------------------------------------------------------*
       pos-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice filtro ordina- *
      *              * mento e selezione per file [dcp]                *
      *              *-------------------------------------------------*
           perform   cod-zos-dcp-cls-000  thru cod-zos-dcp-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice prodotto 'dcp' *
      *              *-------------------------------------------------*
           perform   cod-cod-dcp-cls-000  thru cod-cod-dcp-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice categoria di   *
      *              * sconto prodotto                                 *
      *              *-------------------------------------------------*
           perform   cmn-zcs-003-cls-000  thru cmn-zcs-003-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione categoria provvigioni *
      *              *-------------------------------------------------*
           perform   cmn-zpv-002-cls-000  thru cmn-zpv-002-cls-999    .
       pos-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Open files                                                *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [lst]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *              *-------------------------------------------------*
      *              * [lsd]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflsd"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lsd                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [zos]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofzos"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zos                 .
      *              *-------------------------------------------------*
      *              * [zp1]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
      *              *-------------------------------------------------*
      *              * [zp2]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
      *              *-------------------------------------------------*
      *              * [zp3]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
      *              *-------------------------------------------------*
      *              * [zcs]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzcs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zcs                 .
      *              *-------------------------------------------------*
      *              * [zpv]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofzpv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zpv                 .
      *              *-------------------------------------------------*
      *              * Filtro per selezione ed ordinamento [dcp]       *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * File relative di supporto                       *
      *              *-------------------------------------------------*
           move      "OP"                 to   w-rlt-sup-ope          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files                                               *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [lst]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *              *-------------------------------------------------*
      *              * [lsd]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflsd"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lsd                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [zos]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofzos"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zos                 .
      *              *-------------------------------------------------*
      *              * [zp1]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
      *              *-------------------------------------------------*
      *              * [zp2]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
      *              *-------------------------------------------------*
      *              * [zp3]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
      *              *-------------------------------------------------*
      *              * [zcs]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzcs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zcs                 .
      *              *-------------------------------------------------*
      *              * [zpv]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/age/fls/ioc/obj/iofzpv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zpv                 .
      *              *-------------------------------------------------*
      *              * Filtro per selezione ed ordinamento [dcp]       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Cancel                                      *
      *                  *---------------------------------------------*
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * File relative di supporto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   w-rlt-sup-ope          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
      *                  *---------------------------------------------*
      *                  * Cancel                                      *
      *                  *---------------------------------------------*
           perform   cnc-rlt-sup-000      thru cnc-rlt-sup-999        .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi chiave della registrazione             *
      *    *-----------------------------------------------------------*
       acc-key-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-fun      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo impostazione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-sts-imp-npt      .
           move      spaces               to   w-cnt-sts-imp-key
                                               w-cnt-sts-imp-tes
                                               w-cnt-sts-imp-pte
                                               w-cnt-sts-ing-pte
                                               w-cnt-sts-imp-cor
                                               w-cnt-sts-imp-rig
                                               w-cnt-sts-imp-pie
                                               w-cnt-sts-imp-itd      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key
                                               w-cnt-sts-pmt-tes
                                               w-cnt-sts-pmt-pte
                                               w-cnt-sts-pmt-cor
                                               w-cnt-sts-pmt-rig
                                               w-cnt-sts-pmt-pie      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-key
                                               w-cnt-sts-vis-tes
                                               w-cnt-sts-vis-pte
                                               w-cnt-sts-vis-cor
                                               w-cnt-sts-vis-rig
                                               w-cnt-sts-vis-pie      .
      *              *-------------------------------------------------*
      *              * Normalizzazione area di controllo variazioni    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-var-tes-cor      .
      *              *-------------------------------------------------*
      *              * Normalizzazione registrazione                   *
      *              *-------------------------------------------------*
           perform   nor-key-nok-000      thru nor-key-nok-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           perform   pmt-key-reg-000      thru pmt-key-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per prima pagina testata            *
      *                  *---------------------------------------------*
           perform   pmt-tes-reg-000      thru pmt-tes-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : chiave                      *
      *              *-------------------------------------------------*
           move      "K"                  to   w-cnt-mfu-tip-imp      .
       acc-key-reg-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Accettazione codice filtro di selezione ed  *
      *                  * ordinamento su file [dcp]                   *
      *                  *---------------------------------------------*
           perform   acc-fso-dcp-000      thru acc-fso-dcp-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
       acc-key-reg-110.
      *                  *---------------------------------------------*
      *                  * Si/No solo prodotti gia' in campagna        *
      *                  *---------------------------------------------*
           perform   acc-snx-spc-000      thru acc-snx-spc-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-100.
       acc-key-reg-200.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma impostazioni          *
      *                  *---------------------------------------------*
           perform   acc-cnf-imp-000      thru acc-cnf-imp-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-110.
       acc-key-reg-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-key      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visual. dati chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-key      .
      *              *-------------------------------------------------*
      *              * Test se chiave vuota                            *
      *              *-------------------------------------------------*
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-key-reg-999.
      *              *-------------------------------------------------*
      *              * Controllo globale su tasto Do su chiave         *
      *              *-------------------------------------------------*
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-key-reg-100.
           move      "S"                  to   w-cnt-tus-acc-key      .
       acc-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campi chiave della registrazione          *
      *    *-----------------------------------------------------------*
       vis-key-reg-000.
       vis-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per campi chiave                  *
      *    *-----------------------------------------------------------*
       pmt-key-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate dalla chiave              *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-key-reg-100.
      *              *-------------------------------------------------*
      *              * Visualizzazioni prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice filtro di selezione ed ordinamento   *
      *                  * per file [dcp]                              *
      *                  *---------------------------------------------*
           perform   pmt-fso-dcp-000      thru pmt-fso-dcp-999        .
      *                  *---------------------------------------------*
      *                  * Si/No selezione dei soli prodotti in campa- *
      *                  * gna                                         *
      *                  *---------------------------------------------*
           perform   pmt-snx-spc-000      thru pmt-snx-spc-999        .
       pmt-key-reg-200.
      *              *-------------------------------------------------*
      *              * Linea di trattini di separazione                *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Codice filtro di selezione anagrafica prodotti   *
      *    *-----------------------------------------------------------*
       pmt-fso-dcp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice filtro di selezione :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "       anagrafica prodotti  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-fso-dcp-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Si/No solo prodotti gia' in campagna             *
      *    *-----------------------------------------------------------*
       pmt-snx-spc-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Selezione solo sui prodotti:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "per i quali gia' esiste una "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "        campagna di vendita "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-snx-spc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Codice filtro di ordinamento e selezione   *
      *    *                per file [dcp]                             *
      *    *-----------------------------------------------------------*
       acc-fso-dcp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-fso-dcp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-zos-dcp-ope      .
           move      w-tes-fso-dcp        to   w-cod-zos-dcp-cod      .
           move      04                   to   w-cod-zos-dcp-lin      .
           move      30                   to   w-cod-zos-dcp-pos      .
           move      04                   to   w-cod-zos-dcp-dln      .
           move      41                   to   w-cod-zos-dcp-dps      .
           move      "<B"                 to   v-edm                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-zos-dcp-cll-000  thru cod-zos-dcp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-zos-dcp-foi-000  thru cod-zos-dcp-foi-999    .
       acc-fso-dcp-110.
           perform   cod-zos-dcp-cll-000  thru cod-zos-dcp-cll-999    .
           if        w-cod-zos-dcp-ope    =    "F+"
                     go to acc-fso-dcp-115.
           if        w-cod-zos-dcp-ope    =    "AC"
                     go to acc-fso-dcp-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-fso-dcp-115.
           perform   cod-zos-dcp-foi-000  thru cod-zos-dcp-foi-999    .
           go to     acc-fso-dcp-110.
       acc-fso-dcp-120.
           move      w-cod-zos-dcp-cod    to   v-num                  .
       acc-fso-dcp-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "EXIT"
                     go to acc-fso-dcp-200.
      *                      *-----------------------------------------*
      *                      * Normalizzazione di :                    *
      *                      * - Filtro di ordinamento e selezione     *
      *                      *-----------------------------------------*
           move      zero                 to   w-tes-fso-dcp          .
      *                      *-----------------------------------------*
      *                      * Lettura di :                            *
      *                      * - Filtro di ordinamento e selezione     *
      *                      * e normalizzazione dati associati        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Filtro di selezione                 *
      *                          *-------------------------------------*
           move      w-tes-fso-dcp        to   w-let-fso-dcp-cod      .
           perform   let-fso-dcp-000      thru let-fso-dcp-999        .
           move      w-let-fso-dcp-des    to   w-tes-fso-dcp-des      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione di :                    *
      *                      * - Filtro di ordinamento e selezione     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Per filtro di selezione             *
      *                          *-------------------------------------*
           perform   vis-fso-dcp-000      thru vis-fso-dcp-999        .
           perform   vis-fso-dcp-des-000  thru vis-fso-dcp-des-999    .
      *                      *-----------------------------------------*
      *                      * Status di uscita ad 'E'                 *
      *                      *-----------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-key      .
           go to     acc-fso-dcp-999.
       acc-fso-dcp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-fso-dcp          .
       acc-fso-dcp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura codice filtro selezione e ordina-   *
      *                  * mento per file [dcp]                        *
      *                  *---------------------------------------------*
           move      w-tes-fso-dcp        to   w-let-fso-dcp-cod      .
           perform   let-fso-dcp-000      thru let-fso-dcp-999        .
           move      w-let-fso-dcp-des    to   w-tes-fso-dcp-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione codice filtro di selezione  *
      *                  * per file [dcp], descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-fso-dcp-des-000  thru vis-fso-dcp-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice filtro non esistente : a reimpo-  *
      *                  * stazione                                    *
      *                  *---------------------------------------------*
           if        w-let-fso-dcp-flg    not  = spaces
                     go to acc-fso-dcp-100.
       acc-fso-dcp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tipo ordinamento dal codice filtro  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiesta tipo ordinamento              *
      *                      *-----------------------------------------*
           move      "TO"                 to   f-ope                  .
           move      w-tes-fso-dcp-alf    to   f-key                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
           if        f-sts                =    "01"
                     move  01             to   w-tes-fso-dcp-ord
           else if   f-sts                =    "02"
                     move  02             to   w-tes-fso-dcp-ord
           else if   f-sts                =    "03"
                     move  03             to   w-tes-fso-dcp-ord
           else if   f-sts                =    "04"
                     move  04             to   w-tes-fso-dcp-ord
           else      move  01             to   w-tes-fso-dcp-ord      .
       acc-fso-dcp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-fso-dcp-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-fso-dcp-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-fso-dcp-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-fso-dcp-999.
       acc-fso-dcp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice del filtro di selezione per file *
      *    *                   [dcp]                                   *
      *    *-----------------------------------------------------------*
       vis-fso-dcp-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      04                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-fso-dcp        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-fso-dcp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice del filtro di selezione per file *
      *    *                   [dcp], descrizione                      *
      *    *-----------------------------------------------------------*
       vis-fso-dcp-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-fso-dcp-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-fso-dcp-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo chiave : Si/No selezione solo prodotti *
      *    * gia' in campagna                                          *
      *    *-----------------------------------------------------------*
       acc-snx-spc-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-snx-spc-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snx-spc-lun    to   v-car                  .
           move      w-exp-snx-spc-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      08                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-snx-spc-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           if        w-tes-snx-spc        =    "S"
                     move  01             to   v-num
           else if   w-tes-snx-spc        =    "N"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-snx-spc-999.
       acc-snx-spc-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  "S"            to   w-tes-snx-spc
           else if   v-num                =    02
                     move  "N"            to   w-tes-snx-spc
           else      move  spaces         to   w-tes-snx-spc          .
       acc-snx-spc-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        w-tes-snx-spc        not  = "S" and
                     w-tes-snx-spc        not  = "N"
                     go to acc-snx-spc-100.
       acc-snx-spc-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-snx-spc-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-snx-spc-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-snx-spc-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-snx-spc-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-snx-spc-999.
       acc-snx-spc-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Conferma impostazioni                *
      *    *-----------------------------------------------------------*
       acc-cnf-imp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea 23                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Linea 24                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Conferma impostazioni (S/N/E) ? "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione valore da impostare         *
      *                  *---------------------------------------------*
           move      spaces               to   w-tes-cnf-imp          .
       acc-cnf-imp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      33                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-tes-cnf-imp        to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cnf-imp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-cnf-imp          .
       acc-cnf-imp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se impostata una function-key prevista : Ok *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  " or
                     v-key                =    "DO  " or
                     v-key                =    "EXIT"
                     go to acc-cnf-imp-450.
      *                  *---------------------------------------------*
      *                  * Se impostato un carattere previsto : Ok     *
      *                  *---------------------------------------------*
           if        w-tes-cnf-imp        =    "S" or
                     w-tes-cnf-imp        =    "N" or
                     w-tes-cnf-imp        =    "E"
                     go to acc-cnf-imp-450.
      *                  *---------------------------------------------*
      *                  * Altrimenti : reimpostazione                 *
      *                  *---------------------------------------------*
           go to     acc-cnf-imp-100.
       acc-cnf-imp-450.
      *                  *---------------------------------------------*
      *                  * Cancellazione prompts                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea 23                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Linea 24                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cnf-imp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda della function-key o   *
      *                  * del carattere impostato                     *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-cnf-imp-625
           else if   v-key                =    "DO  "
                     go to acc-cnf-imp-650
           else if   v-key                =    "EXIT"
                     go to acc-cnf-imp-675.
           if        w-tes-cnf-imp        =    "N"
                     go to acc-cnf-imp-625
           else if   w-tes-cnf-imp        =    "S"
                     go to acc-cnf-imp-650
           else if   w-tes-cnf-imp        =    "E"
                     go to acc-cnf-imp-675.
       acc-cnf-imp-625.
      *                  *---------------------------------------------*
      *                  * Se Up o 'N'                                 *
      *                  *---------------------------------------------*
           move      "UP  "               to   v-key                  .
           go to     acc-cnf-imp-999.
       acc-cnf-imp-650.
      *                  *---------------------------------------------*
      *                  * Se Do o 'S'                                 *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
           go to     acc-cnf-imp-999.
       acc-cnf-imp-675.
      *                  *---------------------------------------------*
      *                  * Se Exit o 'E'                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione di :                    *
      *                      * - Filtro di ordinamento e selezione     *
      *                      *-----------------------------------------*
           move      zero                 to   w-tes-fso-dcp          .
      *                      *-----------------------------------------*
      *                      * Lettura di :                            *
      *                      * - Filtro di ordinamento e selezione     *
      *                      * e normalizzazione dati associati        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Filtro di selezione                 *
      *                          *-------------------------------------*
           move      w-tes-fso-dcp        to   w-let-fso-dcp-cod      .
           perform   let-fso-dcp-000      thru let-fso-dcp-999        .
           move      w-let-fso-dcp-des    to   w-tes-fso-dcp-des      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione di :                    *
      *                      * - Filtro di ordinamento e selezione     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Per filtro di selezione             *
      *                          *-------------------------------------*
           perform   vis-fso-dcp-000      thru vis-fso-dcp-999        .
           perform   vis-fso-dcp-des-000  thru vis-fso-dcp-des-999    .
      *                      *-----------------------------------------*
      *                      * Status di uscita ad 'E'                 *
      *                      *-----------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-key      .
           go to     acc-cnf-imp-999.
       acc-cnf-imp-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi non chiave della registrazione         *
      *    *-----------------------------------------------------------*
       acc-nok-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-nok      .
      *              *-------------------------------------------------*
      *              * Visualizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           perform   vis-tip-fun-000      thru vis-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione se in modi- *
      *              * fica o visualizzazione, per testata e corpo     *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M" or
                     w-cnt-mfu-tip-fun    =    "V"
                     move  "#"            to   w-cnt-sts-imp-tes
                     move  all "#"        to   w-cnt-sts-imp-pte
                     move  all "#"        to   w-cnt-sts-ing-pte
                     move  "#"            to   w-cnt-sts-imp-cor      .
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione per piede   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-pie      .
       acc-nok-reg-200.
      *              *-------------------------------------------------*
      *              * Trattamento testata                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione del numero di pagine che     *
      *                  * compongono la testata                       *
      *                  *---------------------------------------------*
           perform   dmp-tes-reg-000      thru dmp-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati corpo                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-cor      
                                               w-cnt-sts-vis-cor      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati riga corpo             *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-rig      
                                               w-cnt-sts-vis-rig      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati piede                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-pie      
                                               w-cnt-sts-vis-pie      .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-key    =    spaces
                     perform pmt-key-reg-000
                                          thru pmt-key-reg-999
                     move    "#"          to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati campi chiave           *
      *                  *---------------------------------------------*
           if        w-cnt-sts-vis-key    =    spaces
                     perform vis-key-reg-000
                                          thru vis-key-reg-999
                     move    "#"          to   w-cnt-sts-vis-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per pagina di testata               *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-ptx
                    (w-cnt-sts-imp-npt)   =    spaces
                     perform pmt-tes-reg-000
                                          thru pmt-tes-reg-999
                     move    "#"          to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati pagina testata         *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M"      or
                     w-cnt-mfu-tip-fun    =    "V"      or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces or
                     w-cnt-sts-ing-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     if    w-cnt-sts-vis-ptx
                          (w-cnt-sts-imp-npt)
                                          =    spaces
                           perform vis-tes-reg-000
                                          thru vis-tes-reg-999
                           move    "#"    to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Flag di ingresso in pagina di testata       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-ing-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Accettazione dati testata                   *
      *                  *---------------------------------------------*
           perform   acc-tes-reg-000      thru acc-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita definitivo                   *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "S" or
                     w-cnt-tus-acc-tes    =    "X" or
                     w-cnt-tus-acc-tes    =    "E"
                     move  w-cnt-tus-acc-tes
                                          to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999.
      *                  *---------------------------------------------*
      *                  * Se spostamento di pagina                    *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "-"
                     go to acc-nok-reg-225
           else      go to acc-nok-reg-250.
       acc-nok-reg-225.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina precedente      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' 1 si ignora *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  > 1
                     go to acc-nok-reg-200.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina attuale a : no    *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
       acc-nok-reg-230.
      *                          *-------------------------------------*
      *                          * Decremento numero pagina attuale    *
      *                          *-------------------------------------*
           subtract  1                    from w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : decremento ulteriore        *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces and
                     w-cnt-sts-imp-npt    >    1
                     go to acc-nok-reg-230.
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-250.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina successiva      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Salvataggio numero pagina attuale   *
      *                          *-------------------------------------*
           move      w-cnt-sts-imp-npt    to   w-cnt-sts-imp-svp      .
       acc-nok-reg-260.
      *                          *-------------------------------------*
      *                          * Status di impostazione dati della   *
      *                          * della pagina attuale a : si'        *
      *                          *-------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si pone lo status di impostazione   *
      *                          * dati generale testata a si'         *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  "#"            to   w-cnt-sts-imp-tes      .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si va' ad accettazione corpo        *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  w-cnt-sts-imp-svp
                                          to   w-cnt-sts-imp-npt
                     go to acc-nok-reg-300.
      *                          *-------------------------------------*
      *                          * Incremento numero pagina attuale    *
      *                          *-------------------------------------*
           add       1                    to   w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : a re-incremento             *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces
                     go to acc-nok-reg-260.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina impostata a : no  *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-svp)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-svp)     .
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-300.
      *                  *---------------------------------------------*
      *                  * Numero riga corpo da accettare : 1          *
      *                  *---------------------------------------------*
           move       1                   to   w-cnt-cor-nrg-dac      .
       acc-nok-reg-400.
      *              *-------------------------------------------------*
      *              * Trattamento corpo                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati chiave                 *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      
                                               w-cnt-sts-vis-key      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati testata                *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-tes
                                               w-cnt-sts-pmt-pte
                                               w-cnt-sts-vis-tes
                                               w-cnt-sts-vis-pte      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati piede                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-pie      
                                               w-cnt-sts-vis-pie      .
      *                  *---------------------------------------------*
      *                  * Accettazione dati corpo                     *
      *                  *---------------------------------------------*
           perform   acc-cor-reg-000      thru acc-cor-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita definitivo                   *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-cor    =    "S" or
                     w-cnt-tus-acc-cor    =    "X" or
                     w-cnt-tus-acc-cor    =    "E"
                     move  w-cnt-tus-acc-cor
                                          to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999.
      *                  *---------------------------------------------*
      *                  * Se tipo uscita "-"                          *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-cor    =    "-"
                     go to acc-nok-reg-200.
       acc-nok-reg-800.
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Se attualmente visualizzato il corpo si e-  *
      *                  * segue la visualizzazione dei prompts della  *
      *                  * riga corpo espansa                          *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-cor    =    spaces
                     go to acc-nok-reg-805.
           perform   pmt-rig-cor-000      thru pmt-rig-cor-999        .
       acc-nok-reg-805.
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-nok-reg-810.
      *                  *---------------------------------------------*
      *                  * Test se sola visualizzazione                *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to acc-nok-reg-820
           else      go to acc-nok-reg-830.
       acc-nok-reg-820.
      *                      *-----------------------------------------*
      *                      * Accettazione se sola visualizzazione    *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#VIS"               to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "E"                  to   v-msk                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "E"
                     move  "EXIT"         to   v-key                  .
           go to     acc-nok-reg-840.
       acc-nok-reg-830.
      *                      *-----------------------------------------*
      *                      * Accettazione se inserimento o modifica  *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "Conferma impostazioni (S/N/E) ?"
                                          to   v-not
           else      move  "Conferma impostazioni (N/E) ?"
                                          to   v-not                  .
           move      spaces               to   v-alf                  .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "SNE"          to   v-msk
           else      move  "NE"           to   v-msk                  .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-nok-reg-840.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-nok-reg-850
           else if   v-key                =    "EXIT"
                     go to acc-nok-reg-860
           else if   v-key                =    "UP  "
                     go to acc-nok-reg-870
           else      go to acc-nok-reg-810.
       acc-nok-reg-850.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-tus-acc-nok      .
           perform   cnt-tdo-nok-000      thru cnt-tdo-nok-999        .
           if        w-cnt-tdo-nok-flg    not  = spaces
                     go to acc-nok-reg-870.
           go to     acc-nok-reg-999.
       acc-nok-reg-860.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-nok      .
           go to     acc-nok-reg-999.
       acc-nok-reg-870.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nr riga corpo da accettare : max        *
      *                      *-----------------------------------------*
           move      w-rlt-sup-max        to   w-cnt-cor-nrg-dac      .
      *                      *-----------------------------------------*
      *                      * Ad accettazione corpo                   *
      *                      *-----------------------------------------*
           move      spaces               to   v-key                  .
           go to     acc-nok-reg-400.
       acc-nok-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione numero pagine che compongono la testata    *
      *    *-----------------------------------------------------------*
       dmp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * La testata e' composta di nr. 1 pagine          *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-sts-imp-mpt      .
       dmp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione si/no pagina w-cnt-sts-imp-npt da trattare *
      *    *-----------------------------------------------------------*
       snp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Flag di uscita a Si                             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-snp      .
       snp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione testata registrazione                        *
      *    *-----------------------------------------------------------*
       acc-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-tes      .
      *              *-------------------------------------------------*
      *              * Normalizzazione function-key                    *
      *              *-------------------------------------------------*
           move      spaces               to   v-key                  .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : testata                     *
      *              *-------------------------------------------------*
           move      "T"                  to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Disabilitazione forzata del tasto Delt      *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-itd      .
      *                  *---------------------------------------------*
      *                  * Fine Pagina                                 *
      *                  *---------------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-tes      .
           go to     acc-tes-reg-999.
       acc-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione testata registrazione                     *
      *    *-----------------------------------------------------------*
       vis-tes-reg-000.
       vis-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts testata                           *
      *    *-----------------------------------------------------------*
       pmt-tes-reg-000.
       pmt-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Presa visione per pagina     *
      *    *-----------------------------------------------------------*
       acc-pre-vpg-000.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      spaces               to   v-msk                  .
           move      spaces               to   v-alf                  .
           move      spaces               to   v-not                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-pre-vpg-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-pre-vpg-000.
       acc-pre-vpg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione corpo a partire dalla riga con numero d'or-  *
      *    * dine : w-cnt-cor-nrg-dac                                  *
      *    *-----------------------------------------------------------*
       acc-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita da corpo            *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-cor      .
      *              *-------------------------------------------------*
      *              * Confronto tra numero d'ordine riga da accettare *
      *              * e numero d'ordine dell'ultima riga              *
      *              *-------------------------------------------------*
           if        w-cnt-cor-nrg-dac    not  > w-rlt-sup-max
                     go to acc-cor-reg-025.
      *              *-------------------------------------------------*
      *              * Se oltre numero riga massimo si esce con status *
      *              * di uscita "+"                                   *
      *              *-------------------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-025.
      *              *-------------------------------------------------*
      *              * Video in 'OFF'                                  *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Prompts per corpo                               *
      *              *-------------------------------------------------*
           if        w-cnt-sts-pmt-cor    =    spaces
                     perform pmt-cor-reg-000
                                          thru pmt-cor-reg-999
                     move    "#"          to   w-cnt-sts-pmt-cor      .
      *              *-------------------------------------------------*
      *              * Visualizzazione dati corpo                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione nr pagina da visualizzare    *
      *                  *---------------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrp-dav      .
           add       w-lin-num-lin-vis    to   w-cnt-cor-nrp-dav      .
           subtract  1                    from w-cnt-cor-nrp-dav      .
           divide    w-lin-num-lin-vis    into w-cnt-cor-nrp-dav      .
      *                  *---------------------------------------------*
      *                  * Se non e' visualizzata nessuna pagina corpo *
      *                  * o una pagina corpo diversa da quella da vi- *
      *                  * sualizzare si procede alla visualizzazione  *
      *                  *---------------------------------------------*
           if        w-cnt-sts-vis-cor    =    spaces           or
                     w-cnt-cor-nrp-vis    not  = w-cnt-cor-nrp-dav
                     perform vis-cor-reg-000
                                          thru vis-cor-reg-999
                     move    "#"          to   w-cnt-sts-vis-cor
                     move    w-cnt-cor-nrp-dav
                                          to   w-cnt-cor-nrp-vis      .
      *              *-------------------------------------------------*
      *              * Lettura riga da file relative di supporto       *
      *              *-------------------------------------------------*
           move      "RD"                 to   w-rlt-sup-ope          .
           move      w-cnt-cor-nrg-dac    to   w-rlt-sup-prg          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
           move      w-rlt-sup-buf        to   w-rig                  .
       acc-cor-reg-050.
      *              *-------------------------------------------------*
      *              * Routine pre-accettazione riga corpo             *
      *              *-------------------------------------------------*
           perform   pre-rig-cor-000      thru pre-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts per riga d'accettazione *
      *              *-------------------------------------------------*
           perform   pmt-rig-cor-000      thru pmt-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione dati per riga di accettazione   *
      *              *-------------------------------------------------*
           perform   vis-rig-cor-000      thru vis-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Video in 'ON'                                   *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Flag di status impostazione corpo               *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-cor      .
      *              *-------------------------------------------------*
      *              * Flag di status impostione riga attuale          *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-rig      .
      *              *-------------------------------------------------*
      *              * Indicatore linea in corso di trattamento        *
      *              *-------------------------------------------------*
           move      "I"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita da riga corpo       *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-rig      .
       acc-cor-reg-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo impostazione : primo campo riga corpo  *
      *                  *---------------------------------------------*
           move      "C"                  to   w-cnt-mfu-tip-imp      .
      *                  *---------------------------------------------*
      *                  * Accettazione Codice prodotto                *
      *                  *---------------------------------------------*
           perform   acc-cod-pro-000      thru acc-cod-pro-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-925.
      *                  *---------------------------------------------*
      *                  * Tipo impostazione : altri campi riga corpo  *
      *                  *---------------------------------------------*
           move      "R"                  to   w-cnt-mfu-tip-imp      .
       acc-cor-reg-200.
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Data inizio campagna promozionale           *
      *                  *---------------------------------------------*
           perform   acc-dva-ini-000      thru acc-dva-ini-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
       acc-cor-reg-250.
      *                  *---------------------------------------------*
      *                  * Data fine campagna promozionale             *
      *                  *---------------------------------------------*
           perform   acc-dva-fin-000      thru acc-dva-fin-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-200.
       acc-cor-reg-300.
      *                  *---------------------------------------------*
      *                  * Tipo funzionamento                          *
      *                  *---------------------------------------------*
           perform   acc-tip-fnz-000      thru acc-tip-fnz-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-250.
       acc-cor-reg-350.
      *                  *---------------------------------------------*
      *                  * Prezzo di listino                           *
      *                  *---------------------------------------------*
           perform   acc-prz-lst-000      thru acc-prz-lst-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-300.
       acc-cor-reg-400.
      *                  *---------------------------------------------*
      *                  * Categoria di sconto in riga                 *
      *                  *---------------------------------------------*
           perform   acc-cat-sco-000      thru acc-cat-sco-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-350.
       acc-cor-reg-450.
      *                  *---------------------------------------------*
      *                  * % sconto                                    *
      *                  *---------------------------------------------*
           perform   acc-per-sco-000      thru acc-per-sco-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-400.
       acc-cor-reg-500.
      *                  *---------------------------------------------*
      *                  * Categoria provvigioni                       *
      *                  *---------------------------------------------*
           perform   acc-cat-pvg-000      thru acc-cat-pvg-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-450.
       acc-cor-reg-550.
      *                  *---------------------------------------------*
      *                  * % provvigioni                               *
      *                  *---------------------------------------------*
           perform   acc-per-pvg-000      thru acc-per-pvg-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-500.
       acc-cor-reg-600.
      *                  *---------------------------------------------*
      *                  * Si/No storicizzazione valori precedenti     *
      *                  *---------------------------------------------*
           perform   acc-snx-sto-000      thru acc-snx-sto-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-550.
       acc-cor-reg-800.
      *              *-------------------------------------------------*
      *              * Controllo finale su riga impostata              *
      *              *-------------------------------------------------*
           perform   cnt-tdo-rig-000      thru cnt-tdo-rig-999        .
           if        w-cnt-tdo-rig-flg    not  = spaces
                     move  spaces         to   w-cnt-tdo-rig-flg
                     move  "UP  "         to   v-key
                     go to acc-cor-reg-200.
       acc-cor-reg-900.
      *              *-------------------------------------------------*
      *              * Tests per uscita significativa da interno riga  *
      *              *-------------------------------------------------*
           if        w-cnt-tus-acc-rig    =    spaces or
                     w-cnt-tus-acc-rig    =    "S"
                     go to acc-cor-reg-905.
      *                  *---------------------------------------------*
      *                  * Se Exit da interno riga                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione numero riga             *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
           go to     acc-cor-reg-000.
       acc-cor-reg-905.
      *                  *---------------------------------------------*
      *                  * Se Do da interno riga                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Routine post-accettazione riga          *
      *                      *-----------------------------------------*
           move      "+"                  to   w-cnt-cor-tip-agg      .
           perform   pos-rig-cor-000      thru pos-rig-cor-999        .
      *                      *-----------------------------------------*
      *                      * Update riga su file relative di suppor- *
      *                      * to                                      *
      *                      *-----------------------------------------*
           move      "UP"                 to   w-rlt-sup-ope          .
           move      w-cnt-cor-nrg-dac    to   w-rlt-sup-prg          .
           move      w-rig                to   w-rlt-sup-buf          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
      *                      *-----------------------------------------*
      *                      * Visualizzazione linea corpo             *
      *                      *-----------------------------------------*
           move      "R"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Incremento del numero d'ordine della    *
      *                      * riga da accettare                       *
      *                      *-----------------------------------------*
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-925.
      *              *-------------------------------------------------*
      *              * Tests per uscita significativa dal primo campo  *
      *              * di impostazione della riga                      *
      *              *-------------------------------------------------*
           if        w-cnt-tus-acc-rig    =    "U"
                     go to acc-cor-reg-935
           else if   w-cnt-tus-acc-rig    =    "D"
                     go to acc-cor-reg-940
           else if   w-cnt-tus-acc-rig    =    "S"
                     go to acc-cor-reg-945
           else if   w-cnt-tus-acc-rig    =    "T"
                     go to acc-cor-reg-965
           else if   w-cnt-tus-acc-rig    =    "B"
                     go to acc-cor-reg-970
           else if   w-cnt-tus-acc-rig    =    "N"
                     go to acc-cor-reg-975
           else if   w-cnt-tus-acc-rig    =    "P"
                     go to acc-cor-reg-980
           else if   w-cnt-tus-acc-rig    =    "."
                     go to acc-cor-reg-985.
       acc-cor-reg-930.
      *                  *---------------------------------------------*
      *                  * Se Exit da primo campo di impostazione riga *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-935.
      *                  *---------------------------------------------*
      *                  * Se Up da primo campo di impostazione riga   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Decremento numero riga da accettare     *
      *                      *-----------------------------------------*
           subtract  1                    from w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-940.
      *                  *---------------------------------------------*
      *                  * Se Down da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Incremento del numero riga              *
      *                      *-----------------------------------------*
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-945.
      *                  *---------------------------------------------*
      *                  * Se Do da primo campo di impostazione riga   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di uscita a 'S'                  *
      *                      *-----------------------------------------*
           move      "S"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-965.
      *                  *---------------------------------------------*
      *                  * Se Tab da primo campo di impostazione riga  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Ad accettazione ultimo record           *
      *                      *-----------------------------------------*
           move      w-rlt-sup-max        to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-970.
      *                  *---------------------------------------------*
      *                  * Se Back da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
           move      1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-975.
      *                  *---------------------------------------------*
      *                  * Se Nxsc da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Determinazione numero d'ordine della    *
      *                      * prima riga appartenente alla pagina     *
      *                      * successiva a quella attuale             *
      *                      *-----------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-cnt-wrk-ctr-001      .
           add       w-lin-num-lin-vis    to   w-cnt-wrk-ctr-001      .
           subtract  1                    from w-cnt-wrk-ctr-001      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-001      .
           multiply  w-lin-num-lin-vis    by   w-cnt-wrk-ctr-001      .
           add       1                    to   w-cnt-wrk-ctr-001      .
      *                      *-----------------------------------------*
      *                      * Se questa e' maggiore del numero riga   *
      *                      * massimo si esce con '+'                 *
      *                      *-----------------------------------------*
           if        w-cnt-wrk-ctr-001    >    w-rlt-sup-max
                     move  "+"            to   w-cnt-tus-acc-cor
                     go to acc-cor-reg-990.
      *                      *-----------------------------------------*
      *                      * Altrimenti : ad accettazione della pri- *
      *                      * ma riga della pagina successiva         *
      *                      *-----------------------------------------*
           move      w-cnt-wrk-ctr-001    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-980.
      *                  *---------------------------------------------*
      *                  * Se Prsc da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Se si e' sulla prima pagina : si ignora *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  > w-lin-num-lin-vis
                     go to acc-cor-reg-000.
      *                      *-----------------------------------------*
      *                      * Se non si e' sulla prima pagina : alla  *
      *                      * accettazione della prima riga della pa- *
      *                      * gina precedente                         *
      *                      *-----------------------------------------*
           subtract  w-lin-num-lin-vis    from w-cnt-cor-nrg-dac      .
           subtract  1                    from w-cnt-cor-nrg-dac      .
           divide    w-lin-num-lin-vis    into w-cnt-cor-nrg-dac      .
           multiply  w-lin-num-lin-vis    by   w-cnt-cor-nrg-dac      .
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-985.
      *                  *---------------------------------------------*
      *                  * Se Slct da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Ad accettazione nr riga selezionato     *
      *                      *-----------------------------------------*
           move      w-cnt-slc-num-rig    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-990.
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione corpo       *
      *              *-------------------------------------------------*
           if        w-rlt-sup-max        =    zero
                     move  spaces         to   w-cnt-sts-imp-cor
           else      move  "#"            to   w-cnt-sts-imp-cor      .
       acc-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina corpo numero : w-cnt-cor-nrp-dav   *
      *    *-----------------------------------------------------------*
       vis-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate, escluse fincature        *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           move      w-lin-pri-lin-vid    to   v-lto                  .
           add       w-lin-num-lin-vis    to   v-lto                  .
           subtract  1                    from v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-cor-reg-150.
      *              *-------------------------------------------------*
      *              * Determinazione numero d'ordine del primo numero *
      *              * riga da visualizzare                            *
      *              *-------------------------------------------------*
           move      w-cnt-cor-nrp-dav    to   w-cnt-wrk-ctr-008      .
           multiply  w-lin-num-lin-vis    by   w-cnt-wrk-ctr-008      .
           add       1                    to   w-cnt-wrk-ctr-008      .
           subtract  w-lin-num-lin-vis    from w-cnt-wrk-ctr-008      .
      *              *-------------------------------------------------*
      *              * Determinazione numero d'ordine dell'ultimo nu-  *
      *              * mero riga da visualizzare                       *
      *              *-------------------------------------------------*
           move      w-cnt-wrk-ctr-008    to   w-cnt-wrk-ctr-009      .
           add       w-lin-num-lin-vis    to   w-cnt-wrk-ctr-009      .
           subtract  1                    from w-cnt-wrk-ctr-009      .
       vis-cor-reg-200.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se si e' entro il massimo  *
      *              * numero di records caricati oppure no            *
      *              *-------------------------------------------------*
           if        w-cnt-wrk-ctr-008    >    w-rlt-sup-max
                     go to vis-cor-reg-300
           else      go to vis-cor-reg-400.
       vis-cor-reg-300.
      *              *-------------------------------------------------*
      *              * Se si e' oltre il massimo numero di records ca- *
      *              * ricati                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione linea a Spaces              *
      *                  *---------------------------------------------*
           move      "B"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-wrk-ctr-008    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     vis-cor-reg-500.
       vis-cor-reg-400.
      *              *-------------------------------------------------*
      *              * Se non si e' oltre il massimo numero di records *
      *              * caricati                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura file relative di supporto           *
      *                  *---------------------------------------------*
           move      "RD"                 to   w-rlt-sup-ope          .
           move      w-cnt-wrk-ctr-008    to   w-rlt-sup-prg          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
           move      w-rlt-sup-buf        to   w-rig                  .
      *                  *---------------------------------------------*
      *                  * Visualizzazione riga                        *
      *                  *---------------------------------------------*
           move      "R"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-wrk-ctr-008    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
       vis-cor-reg-500.
      *              *-------------------------------------------------*
      *              * Incremento numero riga da visualizzare          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-wrk-ctr-008      .
      *              *-------------------------------------------------*
      *              * Test se oltre ultima riga da visualizzare       *
      *              *-------------------------------------------------*
           if        w-cnt-wrk-ctr-008    not  > w-cnt-wrk-ctr-009
                     go to vis-cor-reg-200.
       vis-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione linea corpo numero : w-cnt-cor-nrg-dav    *
      *    *-----------------------------------------------------------*
       vis-lin-cor-000.
      *              *-------------------------------------------------*
      *              * Abblencamento immagine linea di corpo           *
      *              *-------------------------------------------------*
           move      spaces               to   w-lin-imm              .
      *              *-------------------------------------------------*
      *              * Determinazione numero linea assoluta a video    *
      *              *-------------------------------------------------*
           move      w-cnt-cor-nrg-dav    to   w-cnt-wrk-ctr-001      .
           subtract  1                    from w-cnt-wrk-ctr-001      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-001
                                        giving w-cnt-wrk-ctr-003
                                     remainder w-cnt-wrk-ctr-002      .
           multiply  w-lin-num-lin-prc    by   w-cnt-wrk-ctr-002      .
           add       w-lin-pri-lin-vid    to   w-cnt-wrk-ctr-002      .
      *              *-------------------------------------------------*
      *              * Test su tipo visualizzazione riga               *
      *              *-------------------------------------------------*
           if        w-cnt-cor-tvi-rig    =    "I"
                     go to vis-lin-cor-100
           else if   w-cnt-cor-tvi-rig    =    "B"
                     go to vis-lin-cor-150
           else if   w-cnt-cor-tvi-rig    =    "S"
                     go to vis-lin-cor-200
           else if   w-cnt-cor-tvi-rig    =    "N"
                     go to vis-lin-cor-300
           else      go to vis-lin-cor-400.
       vis-lin-cor-100.
      *              *-------------------------------------------------*
      *              * Se visualizzazione indicatore linea             *
      *              *-------------------------------------------------*
           move      "====>"              to   w-lin-imm-num-lin      .
           move      05                   to   v-car                  .
           go to     vis-lin-cor-900.
       vis-lin-cor-150.
      *              *-------------------------------------------------*
      *              * Se visualizzazione linea a blanks               *
      *              *-------------------------------------------------*
           move      80                   to   v-car                  .
           go to     vis-lin-cor-900.
       vis-lin-cor-200.
      *              *-------------------------------------------------*
      *              * Se visualizzazione numero linea a spaces        *
      *              *-------------------------------------------------*
           move      spaces               to   w-lin-imm-num-lin      .
           move      05                   to   v-car                  .
           go to     vis-lin-cor-900.
       vis-lin-cor-300.
      *              *-------------------------------------------------*
      *              * Se visualizzazione numero d'ordine riga         *
      *              *-------------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      spaces               to   v-edm                  .
           move      w-rlt-sup-prg        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-num-lin      .
           go to     vis-lin-cor-900.
       vis-lin-cor-400.
      *              *-------------------------------------------------*
      *              * Se visualizzazione riga intera                  *
      *              *-------------------------------------------------*
       vis-lin-cor-420.
      *                  *---------------------------------------------*
      *                  * Editing Numero d'ordine riga                *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      spaces               to   v-edm                  .
           move      w-rlt-sup-prg        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-num-lin      .
       vis-lin-cor-440.
      *                  *---------------------------------------------*
      *                  * Editing Codice prodotto                     *
      *                  *---------------------------------------------*
           move      w-rig-alf-pro (1)    to   w-lin-imm-alf-pro      .
       vis-lin-cor-460.
      *                  *---------------------------------------------*
      *                  * Editing Prezzo di listino attuale           *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "G"                  to   v-edm                  .
           move      w-rig-prz-lst (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-prz-lst      .
       vis-lin-cor-500.
      *                  *---------------------------------------------*
      *                  * Editing Descrizione prodotto in italiano    *
      *                  *---------------------------------------------*
           move      w-rig-des-pro (1)    to   w-lin-imm-des-pro      .
       vis-lin-cor-800.
      *                  *---------------------------------------------*
      *                  * Parametri per visualizzazione               *
      *                  *---------------------------------------------*
           move      80                   to   v-car                  .
       vis-lin-cor-900.
      *              *-------------------------------------------------*
      *              * Esecuzione visualizzazione prima linea          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-lin-imm-dsp-lin (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se una sola linea : uscita                      *
      *              *-------------------------------------------------*
           if        w-lin-num-lin-prc    =    1
                     go to vis-lin-cor-999.
      *              *-------------------------------------------------*
      *              * Esecuzione visualizzazione altre linee          *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-wrk-ctr-003      .
       vis-lin-cor-925.
           add       1                    to   w-cnt-wrk-ctr-003      .
           if        w-cnt-wrk-ctr-003    >    w-lin-num-lin-prc
                     go to vis-lin-cor-999.
           add       1                    to   w-cnt-wrk-ctr-002      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-lin-imm-dsp-lin
                    (w-cnt-wrk-ctr-003)   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     vis-lin-cor-925.
       vis-lin-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts area linee di corpo               *
      *    *-----------------------------------------------------------*
       pmt-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate sia dall'area per la fin- *
      *              * catura che dall'area delle righe effettive      *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      w-lin-pri-lin-vid    to   v-lto                  .
           add       w-lin-num-lin-vis    to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Fincatura : Linea 04                            *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      " N.R.   Cod. prodotto       Prezzo                
      -              "Descrizione prodotto          "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Fincatura : Linea 05                            *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "-----  ---------------  --------------  ----------
      -              "------------------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Fincatura : Linea finale                        *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione riga corpo di accettazione in w-rig       *
      *    *-----------------------------------------------------------*
       vis-rig-cor-000.
      *              *-------------------------------------------------*
      *              * Codice prodotto                                 *
      *              *-------------------------------------------------*
           perform   vis-cod-pro-000      thru vis-cod-pro-999        .
      *              *-------------------------------------------------*
      *              * Codice prodotto, descrizione                    *
      *              *-------------------------------------------------*
           perform   vis-cod-pro-des-000  thru vis-cod-pro-des-999    .
      *              *-------------------------------------------------*
      *              * Data inizio campagna promozionale               *
      *              *-------------------------------------------------*
           perform   vis-dva-ini-000      thru vis-dva-ini-999        .
      *              *-------------------------------------------------*
      *              * Data fine campagna promozionale                 *
      *              *-------------------------------------------------*
           perform   vis-dva-fin-000      thru vis-dva-fin-999        .
      *              *-------------------------------------------------*
      *              * Tipo funzionamento                              *
      *              *-------------------------------------------------*
           perform   vis-tip-fnz-000      thru vis-tip-fnz-999        .
      *              *-------------------------------------------------*
      *              * Prezzo di listino                               *
      *              *-------------------------------------------------*
           perform   vis-prz-lst-000      thru vis-prz-lst-999        .
      *              *-------------------------------------------------*
      *              * Categoria di sconto in riga                     *
      *              *-------------------------------------------------*
           perform   vis-cat-sco-000      thru vis-cat-sco-999        .
           perform   vis-des-sco-000      thru vis-des-sco-999        .
      *              *-------------------------------------------------*
      *              * % sconto                                        *
      *              *-------------------------------------------------*
           perform   vis-per-sco-000      thru vis-per-sco-999        .
      *              *-------------------------------------------------*
      *              * Categoria provvigioni                           *
      *              *-------------------------------------------------*
           perform   vis-cat-pvg-000      thru vis-cat-pvg-999        .
           perform   vis-des-cpv-000      thru vis-des-cpv-999        .
      *              *-------------------------------------------------*
      *              * % provvigioni                                   *
      *              *-------------------------------------------------*
           perform   vis-per-pvg-000      thru vis-per-pvg-999        .
      *              *-------------------------------------------------*
      *              * Si/No storicizzazione valori precedenti         *
      *              *-------------------------------------------------*
           perform   vis-snx-sto-000      thru vis-snx-sto-999        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-rig-cor-999.
       vis-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per riga corpo di accettazione    *
      *    *-----------------------------------------------------------*
       pmt-rig-cor-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate dall'area di impostazione *
      *              * della singola riga corpo espansa a piede        *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           add       1                    to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-rig-cor-100.
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts per riga corpo espansa  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice prodotto                             *
      *                  *---------------------------------------------*
           perform   pmt-cod-pro-000      thru pmt-cod-pro-999        .
      *                  *---------------------------------------------*
      *                  * Data inizio campagna promozionale           *
      *                  *---------------------------------------------*
           perform   pmt-dva-ini-000      thru pmt-dva-ini-999        .
      *                  *---------------------------------------------*
      *                  * Data fine campagna promozionale             *
      *                  *---------------------------------------------*
           perform   pmt-dva-fin-000      thru pmt-dva-fin-999        .
      *                  *---------------------------------------------*
      *                  * Tipo funzionamento                          *
      *                  *---------------------------------------------*
           perform   pmt-tip-fnz-000      thru pmt-tip-fnz-999        .
      *                  *---------------------------------------------*
      *                  * Prezzo di listino                           *
      *                  *---------------------------------------------*
           perform   pmt-prz-lst-000      thru pmt-prz-lst-999        .
      *                  *---------------------------------------------*
      *                  * Categoria di sconto in riga                 *
      *                  *---------------------------------------------*
           perform   pmt-cat-sco-000      thru pmt-cat-sco-999        .
      *                  *---------------------------------------------*
      *                  * % sconto                                    *
      *                  *---------------------------------------------*
           perform   pmt-per-sco-000      thru pmt-per-sco-999        .
      *                  *---------------------------------------------*
      *                  * Categoria provvigioni                       *
      *                  *---------------------------------------------*
           perform   pmt-cat-pvg-000      thru pmt-cat-pvg-999        .
      *                  *---------------------------------------------*
      *                  * % provvigioni                               *
      *                  *---------------------------------------------*
           perform   pmt-per-pvg-000      thru pmt-per-pvg-999        .
      *                  *---------------------------------------------*
      *                  * Si/No storicizzazione                       *
      *                  *---------------------------------------------*
           perform   pmt-snx-sto-000      thru pmt-snx-sto-999        .
       pmt-rig-cor-200.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     pmt-rig-cor-999.
       pmt-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice prodotto alfanumerico     *
      *    *-----------------------------------------------------------*
       pmt-cod-pro-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           add       1                    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice prodotto       :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-cod-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Data inizio campagna promoziona- *
      *    * le                                                        *
      *    *-----------------------------------------------------------*
       pmt-dva-ini-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           add       2                    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Validita'         dal :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dva-ini-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Data fine campagna promozionale  *
      *    *-----------------------------------------------------------*
       pmt-dva-fin-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           add       2                    to   v-lin                  .
           move      35                   to   v-pos                  .
           move      "al"                 to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-dva-fin-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Tipo funzionamento               *
      *    *-----------------------------------------------------------*
       pmt-tip-fnz-000.
      *              *-------------------------------------------------*
      *              * Test se prompt da visualizzare                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se Nessuna Preferenza per il tipo funziona- *
      *                  * mento prezzi per campagna promozionale :    *
      *                  * uscita                                      *
      *                  *---------------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to pmt-tip-fnz-999.
       pmt-tip-fnz-200.
      *                  *---------------------------------------------*
      *                  * Visualizzazione prompt                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           add       3                    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo funzionamento    :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-tip-fnz-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Prezzo di listino attuale        *
      *    *-----------------------------------------------------------*
       pmt-prz-lst-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   3              to   v-lin
           else      add   4              to   v-lin                  .
      *
           move      01                   to   v-pos                  .
           move      "Prezzo di vendita     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-prz-lst-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Categoria sconto in riga fattura *
      *    *-----------------------------------------------------------*
       pmt-cat-sco-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   4              to   v-lin
           else      add   5              to   v-lin                  .
      *
           move      01                   to   v-pos                  .
           move      "Sconti                :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cat-sco-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : % di sconto                      *
      *    *-----------------------------------------------------------*
       pmt-per-sco-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   4              to   v-lin
           else      add   5              to   v-lin                  .
      *
           move      53                   to   v-pos                  .
           move      "% :"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-per-sco-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Categoria provvigionale          *
      *    *-----------------------------------------------------------*
       pmt-cat-pvg-000.
      *              *-------------------------------------------------*
      *              * Test se prompt da visualizzare                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se Nessuna Preferenza per il tipo funziona- *
      *                  * mento prezzi per campagna promozionale :    *
      *                  * uscita                                      *
      *                  *---------------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to pmt-cat-pvg-999.
       pmt-cat-pvg-200.
      *                  *---------------------------------------------*
      *                  * Visualizzazione prompt                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   5              to   v-lin
           else      add   6              to   v-lin                  .
      *
           move      01                   to   v-pos                  .
           move      "Provvigioni           :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cat-pvg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : % di provvigioni                 *
      *    *-----------------------------------------------------------*
       pmt-per-pvg-000.
      *              *-------------------------------------------------*
      *              * Test se prompt da visualizzare                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se Nessuna Preferenza per il tipo funziona- *
      *                  * mento prezzi per campagna promozionale :    *
      *                  * uscita                                      *
      *                  *---------------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to pmt-per-pvg-999.
       pmt-per-pvg-200.
      *                  *---------------------------------------------*
      *                  * Visualizzazione prompt                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   5              to   v-lin
           else      add   6              to   v-lin                  .
           move      53                   to   v-pos                  .
           move      "% :"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-per-pvg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Si/No storicizzazione valori     *
      *    * precedenti                                                *
      *    *-----------------------------------------------------------*
       pmt-snx-sto-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      23                   to   v-car                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   6              to   v-lin
           else      add   7              to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Storicizzazione       :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-snx-sto-999.
           exit.

      *    *===========================================================*
      *    * Accettazione 1. campo riga corpo espansa : Codice prodot- *
      *    *                                            to alfanumeri- *
      *    *                                            co             *
      *    *-----------------------------------------------------------*
       acc-cod-pro-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-rig-alf-pro (1)    to   w-sav-alf-pro          .
       acc-cod-pro-100.
      *              *-------------------------------------------------*
      *              * Ripristino valore precedente                    *
      *              *-------------------------------------------------*
           move      w-sav-alf-pro        to   w-rig-alf-pro (1)      .
       acc-cod-pro-125.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Parametri generali di accettazione          *
      *                  *---------------------------------------------*
           move      "AC"                 to   w-cod-cod-dcp-ope      .
           move      "L"                  to   w-cod-cod-dcp-tac      .
           move      w-rig-num-pro (1)    to   w-cod-cod-dcp-num      .
           move      w-rig-alf-pro (1)    to   w-cod-cod-dcp-alf      .
           move      w-lin-pri-lin-vid    to   w-cod-cod-dcp-lin      .
           add       w-lin-num-lin-vis    to   w-cod-cod-dcp-lin      .
           add       1                    to   w-cod-cod-dcp-lin      .
           move      25                   to   w-cod-cod-dcp-pos      .
           move      zero                 to   w-cod-cod-dcp-dln      .
           move      zero                 to   w-cod-cod-dcp-dps      .
           move      spaces               to   v-edm                  .
      *                  *---------------------------------------------*
      *                  * Tasti funzione                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Up   : sempre ammesso, a meno che non   *
      *                      *        si sia alla riga numero 1        *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    >    1
                     move  "UP  "         to   v-pfk (01)
           else      move  spaces         to   v-pfk (01)             .
      *                      *-----------------------------------------*
      *                      * Down : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "DOWN"               to   v-pfk (02)             .
      *                      *-----------------------------------------*
      *                      * Find : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "FIND"               to   v-pfk (03)             .
      *                      *-----------------------------------------*
      *                      * Insr : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "INSR"               to   v-pfk (04)             .
      *                      *-----------------------------------------*
      *                      * Do   : sempre ammesso, purche' sia con- *
      *                      *        cesso dallo status delle impo-   *
      *                      *        stazioni; eventualmente disat-   *
      *                      *        tivato dal richiamo della sub-   *
      *                      *        routine di accettazione          *
      *                      *-----------------------------------------*
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)
           else      move  spaces         to   v-pfk (05)             .
      *                      *-----------------------------------------*
      *                      * Remv : mai ammesso                      *
      *                      *-----------------------------------------*
           move      spaces               to   v-pfk (06)             .
      *                      *-----------------------------------------*
      *                      * Prsc : sempre ammesso, a meno che non   *
      *                      *        si sia alla pagina numero 1      *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    >    w-lin-num-lin-vis
                     move  "PRSC"         to   v-pfk (07)
           else      move  spaces         to   v-pfk (07)             .
      *                      *-----------------------------------------*
      *                      * Nxsc : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "NXSC"               to   v-pfk (08)             .
      *                      *-----------------------------------------*
      *                      * Back : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sulla prima riga     *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  = 1
                     move  "BACK"         to   v-pfk (09)
           else      move  spaces         to   v-pfk (09)             .
      *                      *-----------------------------------------*
      *                      * Tab  : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sull'ultima riga     *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  = w-rlt-sup-max
                     move  "TAB "         to   v-pfk (10)
           else      move  spaces         to   v-pfk (10)             .
      *                      *-----------------------------------------*
      *                      * Slct : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sull'unica riga      *
      *                      *-----------------------------------------*
           if        w-rlt-sup-max        not  < 2
                     move  "SLCT"         to   v-pfk (11)
           else      move  spaces         to   v-pfk (11)             .
       acc-cod-pro-150.
      *                  *---------------------------------------------*
      *                  * Esecuzione accettazione                     *
      *                  *---------------------------------------------*
           perform   cod-cod-dcp-cll-000  thru cod-cod-dcp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dcp-foi-000  thru cod-cod-dcp-foi-999    .
       acc-cod-pro-152.
           perform   cod-cod-dcp-cll-000  thru cod-cod-dcp-cll-999    .
           if        w-cod-cod-dcp-ope    =    "F+"
                     go to acc-cod-pro-154.
           if        w-cod-cod-dcp-ope    =    "AC"
                     go to acc-cod-pro-156.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cod-pro-154.
           perform   cod-cod-dcp-foi-000  thru cod-cod-dcp-foi-999    .
           go to     acc-cod-pro-152.
       acc-cod-pro-156.
           move      w-cod-cod-dcp-alf    to   v-alf                  .
       acc-cod-pro-200.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-cod-pro-999.
       acc-cod-pro-225.
      *              *-------------------------------------------------*
      *              * Test se Return                                  *
      *              *-------------------------------------------------*
           if        v-key                =    spaces
                     go to acc-cod-pro-400.
       acc-cod-pro-250.
      *              *-------------------------------------------------*
      *              * Se Slct                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "SLCT"
                     go to acc-cod-pro-300.
       acc-cod-pro-255.
      *                  *---------------------------------------------*
      *                  * Conversione numero riga impostato in forma- *
      *                  * to numerico                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Valore impostato in comodo per tratta-  *
      *                      * mento                                   *
      *                      *-----------------------------------------*
           move      v-alf                to   w-cnt-slc-rap-alf      .
      *                      *-----------------------------------------*
      *                      * Se nel movimento e' avvenuto un tronca- *
      *                      * mento : a reimpostazione                *
      *                      *-----------------------------------------*
           if        w-cnt-slc-rap-alf    not  = v-alf
                     go to acc-cod-pro-100.
       acc-cod-pro-260.
      *                      *-----------------------------------------*
      *                      * Conversione vera e propria; se errori : *
      *                      * a reimpostazione                        *
      *                      *-----------------------------------------*
           move      zero                 to   w-cnt-slc-rap-num      .
           move      zero                 to   w-cnt-wrk-ctr-001      .
       acc-cod-pro-262.
           add       1                    to   w-cnt-wrk-ctr-001      .
           if        w-cnt-wrk-ctr-001    >    5
                     go to acc-cod-pro-270.
           if        w-cnt-slc-rap-chr
                    (w-cnt-wrk-ctr-001)   =    spaces
                     go to acc-cod-pro-264.
           if       (w-cnt-wrk-ctr-001)   <    "0"   or
                     w-cnt-slc-rap-chr
                    (w-cnt-wrk-ctr-001)   >    "9"
                     go to acc-cod-pro-100.
           multiply  10                   by   w-cnt-slc-rap-num      .
           add       w-cnt-slc-rap-chn
                    (w-cnt-wrk-ctr-001)   to   w-cnt-slc-rap-num      .
           go to     acc-cod-pro-262.
       acc-cod-pro-264.
           add       1                    to   w-cnt-wrk-ctr-001      .
           if        w-cnt-wrk-ctr-001    >    5
                     go to acc-cod-pro-270.
           if        w-cnt-slc-rap-chr
                    (w-cnt-wrk-ctr-001)   =    spaces
                     go to acc-cod-pro-264
           else      go to acc-cod-pro-100.
       acc-cod-pro-270.
      *                      *-----------------------------------------*
      *                      * Se conversione senza errori             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se numero riga minore di 1 oppure   *
      *                          * maggiore del massimo : reimposta-   *
      *                          * zione                               *
      *                          *-------------------------------------*
           if        w-cnt-slc-rap-num    =    zero       or
                     w-cnt-slc-rap-num    >    w-rlt-sup-max
                     go to acc-cod-pro-100.
      *                          *-------------------------------------*
      *                          * Se numero riga impostato pari a nu- *
      *                          * numero riga attuale : reimpostazio- *
      *                          * ne                                  *
      *                          *-------------------------------------*
           if        w-cnt-slc-rap-num    =    w-cnt-cor-nrg-dac
                     go to acc-cod-pro-100.
      *                          *-------------------------------------*
      *                          * Preparazione parametri e uscita     *
      *                          *-------------------------------------*
           move      w-cnt-slc-rap-num    to   w-cnt-slc-num-rig      .
           move      "."                  to   w-cnt-tus-acc-rig      .
           go to     acc-cod-pro-999.
       acc-cod-pro-300.
      *              *-------------------------------------------------*
      *              * Se premuto un altro tasto funzione non deve es- *
      *              * sere avvenuta variazione del campo di imposta-  *
      *              * zione                                           *
      *              *-------------------------------------------------*
           if        v-mod                not  = spaces
                     go to acc-cod-pro-100.
      *              *-------------------------------------------------*
      *              * Se Up                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "UP  "
                     move  "U"            to   w-cnt-tus-acc-rig
                     go to acc-cod-pro-999.
      *              *-------------------------------------------------*
      *              * Se Down                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DOWN"
                     move  "D"            to   w-cnt-tus-acc-rig
                     go to acc-cod-pro-999.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-cod-pro-999
                     else    go to acc-cod-pro-100.
      *              *-------------------------------------------------*
      *              * Se Tab                                          *
      *              *-------------------------------------------------*
           if        v-key                =    "TAB "
                     move  "T"            to   w-cnt-tus-acc-rig
                     go to acc-cod-pro-999.
      *              *-------------------------------------------------*
      *              * Se Back                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "BACK"
                     move  "B"            to   w-cnt-tus-acc-rig
                     go to acc-cod-pro-999.
      *              *-------------------------------------------------*
      *              * Se Nxsc                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "NXSC"
                     move  "N"            to   w-cnt-tus-acc-rig
                     go to acc-cod-pro-999.
      *              *-------------------------------------------------*
      *              * Se Prsc                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "PRSC"
                     move  "P"            to   w-cnt-tus-acc-rig
                     go to acc-cod-pro-999.
       acc-cod-pro-400.
      *              *-------------------------------------------------*
      *              * Se Return                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se variazione del valore di default : a re- *
      *                  * impostazione                                *
      *                  *---------------------------------------------*
           if        v-mod                not  = spaces
                     go to acc-cod-pro-100.
       acc-cod-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice prodotto alfanumerico            *
      *    *-----------------------------------------------------------*
       vis-cod-pro-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      14                   to   v-car                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           add       1                    to   v-lin                  .
           move      25                   to   v-pos                  .
           move      w-rig-alf-pro (1)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice prodotto, descrizione            *
      *    *-----------------------------------------------------------*
       vis-cod-pro-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           add       1                    to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-rig-des-pro (1)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cod-pro-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Data inizio campagna di vendita            *
      *    *-----------------------------------------------------------*
       acc-dva-ini-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dva-ini-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      ">"                  to   v-edm                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           add       2                    to   v-lin                  .
           move      25                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-rig    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      w-rig-dva-ini (1)    to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-dva-ini-999.
       acc-dva-ini-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   w-rig-dva-ini (1)      .
       acc-dva-ini-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se zero : reimpostazione                    *
      *                  *---------------------------------------------*
           if        w-rig-dva-ini (1)    =    zero
                     go to acc-dva-ini-100.
       acc-dva-ini-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dva-ini-625.
      *                  *---------------------------------------------*
      *                  * Determinazione significativita' del campo   *
      *                  * 'Si/No storicizzazione valori precedenti' e *
      *                  * sua eventuale rivisualizzazione             *
      *                  *---------------------------------------------*
           perform   det-snx-sto-000      thru det-snx-sto-999        .
       acc-dva-ini-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-dva-ini-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-dva-ini-100.
       acc-dva-ini-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Data inizio campagna di vendita         *
      *    *-----------------------------------------------------------*
       vis-dva-ini-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      spaces               to   v-edm                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           add       2                    to   v-lin                  .
           move      25                   to   v-pos                  .
           move      w-rig-dva-ini (1)    to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dva-ini-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Data fine campagna di vendita              *
      *    *-----------------------------------------------------------*
       acc-dva-fin-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-dva-fin-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      ">"                  to   v-edm                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           add       2                    to   v-lin                  .
           move      38                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-rig    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      w-rig-dva-fin (1)    to   v-dat                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-dva-fin-999.
       acc-dva-fin-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-dat                to   w-rig-dva-fin (1)      .
       acc-dva-fin-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore a zero non ammesso, a meno che non   *
      *                  * si sia in Up                                *
      *                  *---------------------------------------------*
           if        w-rig-dva-fin (1)    not  = zero
                     go to acc-dva-fin-600.
           if        v-key                =    "UP  "
                     go to acc-dva-fin-600
           else      go to acc-dva-fin-100.
       acc-dva-fin-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-dva-fin-625.
      *                  *---------------------------------------------*
      *                  * Determinazione significativita' del campo   *
      *                  * 'Si/No storicizzazione valori precedenti' e *
      *                  * sua eventuale rivisualizzazione             *
      *                  *---------------------------------------------*
           perform   det-snx-sto-000      thru det-snx-sto-999        .
       acc-dva-fin-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-dva-fin-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-dva-fin-100.
       acc-dva-fin-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Data fine campagna di vendita           *
      *    *-----------------------------------------------------------*
       vis-dva-fin-000.
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      spaces               to   v-edm                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           add       2                    to   v-lin                  .
           move      38                   to   v-pos                  .
           move      w-rig-dva-fin (1)    to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-dva-fin-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Tipo funzionamento           *
      *    *-----------------------------------------------------------*
       acc-tip-fnz-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-tip-fnz-025.
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se Nessuna Preferenza per il tipo fun-  *
      *                      * zionamento prezzi per campagne di ven-  *
      *                      * dita : uscita                           *
      *                      *-----------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to acc-tip-fnz-999.
       acc-tip-fnz-050.
      *                  *---------------------------------------------*
      *                  * Preparazione eventuale default              *
      *                  *---------------------------------------------*
           if        w-rig-tip-fnz (1)    not  = zero
                     go to acc-tip-fnz-100.
           move      w-prs-tfu-pcp        to   w-rig-tip-fnz (1)      .
       acc-tip-fnz-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-fun-lun    to   v-car                  .
           move      w-exp-tip-fun-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           add       3                    to   v-lin                  .
           move      25                   to   v-pos                  .
           move      w-exp-tip-fun-tbl    to   v-txt                  .
           move      w-rig-tip-fnz (1)    to   v-num                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-rig    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-tip-fnz-999.
       acc-tip-fnz-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-tip-fnz (1)      .
       acc-tip-fnz-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore a zero non ammesso, a meno che non   *
      *                  * si sia in Up                                *
      *                  *---------------------------------------------*
           if        w-rig-tip-fnz (1)    not  = zero
                     go to acc-tip-fnz-500.
           if        v-key                =    "UP  "
                     go to acc-tip-fnz-600
           else      go to acc-tip-fnz-100.
       acc-tip-fnz-500.
      *                  *---------------------------------------------*
      *                  * Controllo se valore non a zero              *
      *                  *---------------------------------------------*
           if        w-rig-tip-fnz (1)    >    w-exp-tip-fun-num
                     go to acc-tip-fnz-100.
       acc-tip-fnz-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione significativita' del campo   *
      *                  * 'Si/No storicizzazione valori precedenti' e *
      *                  * sua eventuale rivisualizzazione             *
      *                  *---------------------------------------------*
           perform   det-snx-sto-000      thru det-snx-sto-999        .
      *                  *---------------------------------------------*
      *                  * Preparazione flags di si/no utilizzo prezzo *
      *                  * sconti e provvigioni                        *
      *                  *---------------------------------------------*
           if        w-rig-tip-fnz (1)    =    01
                     move  "S"            to   w-rig-snx-prz (1)
                     move  "S"            to   w-rig-snx-sco (1)
                     move  "S"            to   w-rig-snx-pvg (1)
           else if   w-rig-tip-fnz (1)    =    02
                     move  "S"            to   w-rig-snx-prz (1)
                     move  "N"            to   w-rig-snx-sco (1)
                     move  "N"            to   w-rig-snx-pvg (1)
           else if   w-rig-tip-fnz (1)    =    03
                     move  "N"            to   w-rig-snx-prz (1)
                     move  "S"            to   w-rig-snx-sco (1)
                     move  "N"            to   w-rig-snx-pvg (1)
           else if   w-rig-tip-fnz (1)    =    04
                     move  "N"            to   w-rig-snx-prz (1)
                     move  "N"            to   w-rig-snx-sco (1)
                     move  "S"            to   w-rig-snx-pvg (1)
           else if   w-rig-tip-fnz (1)    =    05
                     move  "S"            to   w-rig-snx-prz (1)
                     move  "S"            to   w-rig-snx-sco (1)
                     move  "N"            to   w-rig-snx-pvg (1)
           else if   w-rig-tip-fnz (1)    =    06
                     move  "S"            to   w-rig-snx-prz (1)
                     move  "N"            to   w-rig-snx-sco (1)
                     move  "S"            to   w-rig-snx-pvg (1)
           else if   w-rig-tip-fnz (1)    =    07
                     move  "N"            to   w-rig-snx-prz (1)
                     move  "S"            to   w-rig-snx-sco (1)
                     move  "S"            to   w-rig-snx-pvg (1)
           else      move  "S"            to   w-rig-snx-prz (1)
                     move  "S"            to   w-rig-snx-sco (1)
                     move  "S"            to   w-rig-snx-pvg (1)      .
      *                  *---------------------------------------------*
      *                  * Normalizzazioni campi in conseguenza ai     *
      *                  * flags di si/no                              *
      *                  *---------------------------------------------*
       acc-tip-fnz-700.
      *                      *-----------------------------------------*
      *                      * Se prezzo a no                          *
      *                      *-----------------------------------------*
           if        w-rig-snx-prz (1)    not  = "N"
                     go to acc-tip-fnz-720.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione       *
      *                      * prezzi                                  *
      *                      *-----------------------------------------*
           move      zero                 to   w-rig-prz-lst (1)      .
           perform   vis-prz-lst-000      thru vis-prz-lst-999        .
       acc-tip-fnz-720.
      *                      *-----------------------------------------*
      *                      * Se sconti a no                          *
      *                      *-----------------------------------------*
           if        w-rig-snx-sco (1)    not  = "N"
                     go to acc-tip-fnz-740.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione       *
      *                      * % di sconto                             *
      *                      *-----------------------------------------*
           move      zero                 to   w-rig-per-sco (1, 1)   .
           move      zero                 to   w-rig-per-sco (1, 2)   .
           move      zero                 to   w-rig-per-sco (1, 3)   .
           move      zero                 to   w-rig-per-sco (1, 4)   .
           move      zero                 to   w-rig-per-sco (1, 5)   .
           perform   vis-per-sco-000      thru vis-per-sco-999        .
       acc-tip-fnz-740.
      *                      *-----------------------------------------*
      *                      * Se provvigioni a no                     *
      *                      *-----------------------------------------*
           if        w-rig-snx-pvg (1)    not  = "N"
                     go to acc-tip-fnz-800.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione       *
      *                      * % di provvigioni                        *
      *                      *-----------------------------------------*
           move      zero                 to   w-rig-cat-pvg (1)      .
           move      spaces               to   w-rig-cat-pvg-des (1)  .
           move      zero                 to   w-rig-per-pvg (1, 1)   .
           move      zero                 to   w-rig-per-pvg (1, 2)   .
           move      zero                 to   w-rig-per-pvg (1, 3)   .
           perform   vis-per-pvg-000      thru vis-per-pvg-999        .
           perform   vis-cat-pvg-000      thru vis-cat-pvg-999        .
           perform   vis-des-cpv-000      thru vis-des-cpv-999        .
       acc-tip-fnz-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-tip-fnz-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-tip-fnz-100.
       acc-tip-fnz-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Tipo funzionamento                      *
      *    *-----------------------------------------------------------*
       vis-tip-fnz-000.
      *              *-------------------------------------------------*
      *              * Test se campo da visualizzare                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se Nessuna Preferenza per il tipo funziona- *
      *                  * mento prezzi per campagne di vendita : u-   *
      *                  * scita                                       *
      *                  *---------------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to vis-tip-fnz-999.
       vis-tip-fnz-200.
      *                  *---------------------------------------------*
      *                  * Visualizzazione campo                       *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-fun-lun    to   v-car                  .
           move      w-exp-tip-fun-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           add       3                    to   v-lin                  .
           move      25                   to   v-pos                  .
           move      w-exp-tip-fun-tbl    to   v-txt                  .
           move      w-rig-tip-fnz (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-fnz-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Prezzo di listino attuale                  *
      *    *-----------------------------------------------------------*
       acc-prz-lst-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-prz-lst-025.
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se Nessuna Preferenza per il tipo fun-  *
      *                      * zionamento prezzi per campagna di ven-  *
      *                      * dita : ad accettazione                  *
      *                      *-----------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to acc-prz-lst-100.
      *                      *-----------------------------------------*
      *                      * Se Tipo funzionamento che non prevede   *
      *                      * il prezzo : uscita                      *
      *                      *-----------------------------------------*
           if        w-rig-snx-prz (1)    not  = "S"
                     go to acc-prz-lst-999.
       acc-prz-lst-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           add       w-rig-dec-prz (1)    to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<BG"                to   v-edm                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   3              to   v-lin
           else      add   4              to   v-lin                  .
           move      25                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-rig    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           move      w-rig-prz-lst (1)    to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-prz-lst-999.
      *              *-------------------------------------------------*
      *              * Valore impostato                                *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-prz-lst (1)      .
       acc-prz-lst-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore a zero non ammesso, a meno che non   *
      *                  * si sia in Up                                *
      *                  *---------------------------------------------*
           if        w-rig-prz-lst (1)    not  = zero
                     go to acc-prz-lst-600.
           if        v-key                =    "UP  "
                     go to acc-prz-lst-600
           else      go to acc-prz-lst-100.
       acc-prz-lst-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione significativita' del campo   *
      *                  * 'Si/No storicizzazione valori precedenti' e *
      *                  * sua eventuale rivisualizzazione             *
      *                  *---------------------------------------------*
           perform   det-snx-sto-000      thru det-snx-sto-999        .
       acc-prz-lst-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-prz-lst-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-prz-lst-100.
       acc-prz-lst-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Prezzo di listino attuale               *
      *    *-----------------------------------------------------------*
       vis-prz-lst-000.
           move      "DS"                 to   v-ope                  .
           move      "V"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      c-dec                to   v-dec                  .
           add       w-rig-dec-prz (1)    to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<BG"                to   v-edm                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   3              to   v-lin
           else      add   4              to   v-lin                  .
           move      25                   to   v-pos                  .
           move      w-rig-prz-lst (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-prz-lst-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Categoria sconto                     *
      *    *-----------------------------------------------------------*
       acc-cat-sco-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cat-sco-025.
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se Nessuna Preferenza per il tipo fun-  *
      *                      * zionamento prezzi per campagne di ven-  *
      *                      * dita : ad accettazione                  *
      *                      *-----------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to acc-cat-sco-100.
      *                      *-----------------------------------------*
      *                      * Se il tipo funzionamento indica che le  *
      *                      * percentuali di sconto non devono essere *
      *                      * trattate : uscita                       *
      *                      *-----------------------------------------*
           if        w-rig-snx-sco (1)    not  = "S"
                     go to acc-cat-sco-999.
       acc-cat-sco-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cmn-zcs-003-ope      .
           move      w-rig-cat-sco (1)    to   w-cmn-zcs-003-cod      .
      *
           move      w-lin-pri-lin-vid    to   w-cmn-zcs-003-lin      .
           add       w-lin-num-lin-vis    to   w-cmn-zcs-003-lin      .
           if        w-prs-tfu-pcp        =    zero
                     add   4              to   w-cmn-zcs-003-lin
           else      add   5              to   w-cmn-zcs-003-lin      .
      *
           move      25                   to   w-cmn-zcs-003-pos      .
      *
           move      w-lin-pri-lin-vid    to   w-cmn-zcs-003-dln      .
           add       w-lin-num-lin-vis    to   w-cmn-zcs-003-dln      .
           if        w-prs-tfu-pcp        =    zero
                     add   4              to   w-cmn-zcs-003-dln
           else      add   5              to   w-cmn-zcs-003-dln      .
      *
           move      32                   to   w-cmn-zcs-003-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           if        w-cnt-sts-imp-rig    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   cmn-zcs-003-cll-000  thru cmn-zcs-003-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cmn-zcs-003-foi-000  thru cmn-zcs-003-foi-999    .
       acc-cat-sco-110.
           perform   cmn-zcs-003-cll-000  thru cmn-zcs-003-cll-999    .
           if        w-cmn-zcs-003-ope    =    "F+"
                     go to acc-cat-sco-115.
           if        w-cmn-zcs-003-ope    =    "AC"
                     go to acc-cat-sco-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cat-sco-115.
           perform   cmn-zcs-003-foi-000  thru cmn-zcs-003-foi-999    .
           go to     acc-cat-sco-110.
       acc-cat-sco-120.
           move      w-cmn-zcs-003-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-cat-sco-999.
       acc-cat-sco-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-cat-sco (1)      .
       acc-cat-sco-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      03                   to   w-let-arc-zcs-tip      .
           move      w-rig-cat-sco (1)    to   w-let-arc-zcs-cod      .
           perform   let-arc-zcs-000      thru let-arc-zcs-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-zcs-des    to   w-rig-cat-sco-des (1)  .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-des-sco-000      thru vis-des-sco-999        .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-zcs-flg    not  = spaces
                     go to acc-cat-sco-100.
       acc-cat-sco-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cat-sco-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-cat-sco-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-cat-sco-100.
       acc-cat-sco-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Categoria sconto                  *
      *    *-----------------------------------------------------------*
       vis-cat-sco-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   4              to   v-lin
           else      add   5              to   v-lin                  .
      *
           move      25                   to   v-pos                  .
           move      w-rig-cat-sco (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cat-sco-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Descrizione categoria     *
      *    *-----------------------------------------------------------*
       vis-des-sco-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   4              to   v-lin
           else      add   5              to   v-lin                  .
      *
           move      32                   to   v-pos                  .
           move      w-rig-cat-sco-des (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-des-sco-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Percentuali di sconto                      *
      *    *-----------------------------------------------------------*
       acc-per-sco-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-per-sco-025.
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se Nessuna Preferenza per il tipo fun-  *
      *                      * zionamento prezzi per campagne di ven-  *
      *                      * dita : ad accettazione                  *
      *                      *-----------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to acc-per-sco-075.
      *                      *-----------------------------------------*
      *                      * Se il tipo funzionamento indica che le  *
      *                      * percentuali di sconto non devono essere *
      *                      * trattate : uscita                       *
      *                      *-----------------------------------------*
           if        w-rig-snx-sco (1)    not  = "S"
                     go to acc-per-sco-999.
       acc-per-sco-075.
      *                  *---------------------------------------------*
      *                  * Inizializzazione contatore 01..05           *
      *                  *---------------------------------------------*
           move      01                   to   w-cix-ctr-001          .
       acc-per-sco-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      01                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<BD"                to   v-edm                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   4              to   v-lin
           else      add   5              to   v-lin                  .
      *
           move      w-cix-ctr-001        to   v-pos                  .
           if        w-cix-ctr-001        >    5
                     subtract  5          from v-pos                  .
           multiply  05                   by   v-pos                  .
           add       52                   to   v-pos                  .
      *
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "TAB "               to   v-pfk (10)             .
           move      w-rig-per-sco
                    (1, w-cix-ctr-001)    to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-per-sco-999.
       acc-per-sco-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-per-sco
                                              (1, w-cix-ctr-001)      .
       acc-per-sco-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-per-sco-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione significativita' del campo   *
      *                  * 'Si/No storicizzazione valori precedenti' e *
      *                  * sua eventuale rivisualizzazione             *
      *                  *---------------------------------------------*
           perform   det-snx-sto-000      thru det-snx-sto-999        .
      *                  *---------------------------------------------*
      *                  * Deviazione secondo la function key imposta- *
      *                  * ta                                          *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-per-sco-620
           else if   v-key                =    "DOWN"
                     go to acc-per-sco-630
           else if   v-key                =    "TAB "
                     go to acc-per-sco-700
           else if   v-key                =    "DO  "
                     go to acc-per-sco-800
           else      go to acc-per-sco-630.
       acc-per-sco-620.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
           if        w-cix-ctr-001        =    1
                     go to acc-per-sco-999.
           subtract  1                    from w-cix-ctr-001          .
           go to     acc-per-sco-100.
       acc-per-sco-630.
      *                  *---------------------------------------------*
      *                  * Se Down o Return                            *
      *                  *---------------------------------------------*
           go to     acc-per-sco-999.
       acc-per-sco-700.
      *                  *---------------------------------------------*
      *                  * Se Tab                                      *
      *                  *---------------------------------------------*
           if        w-cix-ctr-001        =    05
                     go to acc-per-sco-999.
      *                      *-----------------------------------------*
      *                      * Incremento contatore                    *
      *                      *-----------------------------------------*
           add       1                    to   w-cix-ctr-001          .
           go to     acc-per-sco-100.
       acc-per-sco-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-per-sco-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-per-sco-100.
       acc-per-sco-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Percentuali di sconto                   *
      *    *-----------------------------------------------------------*
       vis-per-sco-000.
           move      spaces               to   w-edt-per-sco          .
           move      zero                 to   w-cix-ctr-001          .
       vis-per-sco-200.
           add       1                    to   w-cix-ctr-001          .
           if        w-cix-ctr-001        >    5
                     go to vis-per-sco-500.
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      01                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<BD"                to   v-edm                  .
           move      w-rig-per-sco 
                    (1, w-cix-ctr-001)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-edt-psr-ele
                                              (w-cix-ctr-001)         .
           go to     vis-per-sco-200.
       vis-per-sco-500.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      24                   to   v-car                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   4              to   v-lin
           else      add   5              to   v-lin                  .
      *
           move      57                   to   v-pos                  .
           move      w-edt-per-sco        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-per-sco-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Categoria provvigioni                *
      *    *-----------------------------------------------------------*
       acc-cat-pvg-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se Nessuna Preferenza per il tipo fun-  *
      *                      * zionamento prezzi per campagne di ven-  *
      *                      * dita : uscita                           *
      *                      *-----------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to acc-cat-pvg-999.
      *                      *-----------------------------------------*
      *                      * Se Tipo funzionamento che non prevede   *
      *                      * percentuali di provvigione : uscita     *
      *                      *-----------------------------------------*
           if        w-rig-snx-pvg (1)    not  = "S"
                     go to acc-cat-pvg-999.
       acc-cat-pvg-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cmn-zpv-002-ope      .
           move      w-rig-cat-pvg (1)    to   w-cmn-zpv-002-cod      .
      *
           move      w-lin-pri-lin-vid    to   w-cmn-zpv-002-lin      .
           add       w-lin-num-lin-vis    to   w-cmn-zpv-002-lin      .
           if        w-prs-tfu-pcp        =    zero
                     add   5              to   w-cmn-zpv-002-lin
           else      add   6              to   w-cmn-zpv-002-lin      .
      *
           move      25                   to   w-cmn-zpv-002-pos      .
      *
           move      w-lin-pri-lin-vid    to   w-cmn-zpv-002-dln      .
           add       w-lin-num-lin-vis    to   w-cmn-zpv-002-dln      .
           if        w-prs-tfu-pcp        =    zero
                     add   5              to   w-cmn-zpv-002-dln
           else      add   6              to   w-cmn-zpv-002-dln      .
      *
           move      32                   to   w-cmn-zpv-002-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cmn-zpv-002-cll-000  thru cmn-zpv-002-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cmn-zpv-002-foi-000  thru cmn-zpv-002-foi-999    .
       acc-cat-pvg-110.
           perform   cmn-zpv-002-cll-000  thru cmn-zpv-002-cll-999    .
           if        w-cmn-zpv-002-ope    =    "F+"
                     go to acc-cat-pvg-115.
           if        w-cmn-zpv-002-ope    =    "AC"
                     go to acc-cat-pvg-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cat-pvg-115.
           perform   cmn-zpv-002-foi-000  thru cmn-zpv-002-foi-999    .
           go to     acc-cat-pvg-110.
       acc-cat-pvg-120.
           move      w-cmn-zpv-002-cod    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-cat-pvg-999.
       acc-cat-pvg-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-cat-pvg (1)      .
       acc-cat-pvg-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella                             *
      *                  *---------------------------------------------*
           move      02                   to   w-let-arc-zpv-tip      .
           move      w-rig-cat-pvg (1)    to   w-let-arc-zpv-cod      .
           perform   let-arc-zpv-000      thru let-arc-zpv-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      w-let-arc-zpv-des    to   w-rig-cat-pvg-des (1)  .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione                 *
      *                  *---------------------------------------------*
           perform   vis-des-cpv-000      thru vis-des-cpv-999        .
      *                  *---------------------------------------------*
      *                  * Se codice errato : reimpostazione           *
      *                  *---------------------------------------------*
           if        w-let-arc-zpv-flg    not  = spaces
                     go to acc-cat-pvg-100.
       acc-cat-pvg-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cat-pvg-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-cat-pvg-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-cat-pvg-100.
       acc-cat-pvg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Categoria sconto                  *
      *    *-----------------------------------------------------------*
       vis-cat-pvg-000.
      *              *-------------------------------------------------*
      *              * Test se campo da visualizzare                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se Nessuna Preferenza per il tipo funziona- *
      *                  * mento prezzi per campagna promozionale :    *
      *                  * uscita                                      *
      *                  *---------------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to vis-cat-pvg-999.
       vis-cat-pvg-100.
      *                  *---------------------------------------------*
      *                  * Visualizzazione campo                       *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   5              to   v-lin
           else      add   6              to   v-lin                  .
      *
           move      25                   to   v-pos                  .
           move      w-rig-cat-pvg (1)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cat-pvg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Descrizione categoria provvigioni *
      *    *-----------------------------------------------------------*
       vis-des-cpv-000.
      *              *-------------------------------------------------*
      *              * Test se campo da visualizzare                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se Nessuna Preferenza per il tipo funziona- *
      *                  * mento prezzi per campagna promozionale :    *
      *                  * uscita                                      *
      *                  *---------------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to vis-des-cpv-999.
       vis-des-cpv-100.
      *                  *---------------------------------------------*
      *                  * Visualizzazione campo                       *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   5              to   v-lin
           else      add   6              to   v-lin                  .
      *
           move      32                   to   v-pos                  .
           move      w-rig-cat-pvg-des (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-des-cpv-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata: Percentuali di provvigione    *
      *    *-----------------------------------------------------------*
       acc-per-pvg-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-per-pvg-025.
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se Nessuna Preferenza per il tipo fun-  *
      *                      * zionamento prezzi per campagne di ven-  *
      *                      * dita : uscita                           *
      *                      *-----------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to acc-per-pvg-999.
      *                      *-----------------------------------------*
      *                      * Se Tipo funzionamento che non prevede   *
      *                      * percentuali di provvigione : uscita     *
      *                      *-----------------------------------------*
           if        w-rig-snx-pvg (1)    not  = "S"
                     go to acc-per-pvg-999.
       acc-per-pvg-075.
      *                  *---------------------------------------------*
      *                  * Inizializzazione contatore 01..03           *
      *                  *---------------------------------------------*
           move      01                   to   w-cix-ctr-001          .
       acc-per-pvg-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      01                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<BD"                to   v-edm                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   5              to   v-lin
           else      add   6              to   v-lin                  .
      *
           move      w-cix-ctr-001        to   v-pos                  .
           if        w-cix-ctr-001        >    3
                     subtract  3          from v-pos                  .
           multiply  05                   by   v-pos                  .
           add       52                   to   v-pos                  .
      *
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "TAB "               to   v-pfk (10)             .
           move      w-rig-per-pvg
                    (1, w-cix-ctr-001)    to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-per-pvg-999.
       acc-per-pvg-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-per-pvg
                                              (1, w-cix-ctr-001)      .
       acc-per-pvg-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-per-pvg-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione significativita' del campo   *
      *                  * 'Si/No storicizzazione valori precedenti' e *
      *                  * sua eventuale rivisualizzazione             *
      *                  *---------------------------------------------*
           perform   det-snx-sto-000      thru det-snx-sto-999        .
      *                  *---------------------------------------------*
      *                  * Deviazione secondo la function key imposta- *
      *                  * ta                                          *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-per-pvg-620
           else if   v-key                =    "DOWN"
                     go to acc-per-pvg-630
           else if   v-key                =    "TAB "
                     go to acc-per-pvg-700
           else if   v-key                =    "DO  "
                     go to acc-per-pvg-800
           else      go to acc-per-pvg-630.
       acc-per-pvg-620.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
           if        w-cix-ctr-001        =    1
                     go to acc-per-pvg-999.
           subtract  1                    from w-cix-ctr-001          .
           go to     acc-per-pvg-100.
       acc-per-pvg-630.
      *                  *---------------------------------------------*
      *                  * Se Down o Return                            *
      *                  *---------------------------------------------*
           go to     acc-per-pvg-999.
       acc-per-pvg-700.
      *                  *---------------------------------------------*
      *                  * Se Tab                                      *
      *                  *---------------------------------------------*
           if        w-cix-ctr-001        =    03
                     go to acc-per-pvg-999.
      *                      *-----------------------------------------*
      *                      * Incremento contatore                    *
      *                      *-----------------------------------------*
           add       1                    to   w-cix-ctr-001          .
           go to     acc-per-pvg-100.
       acc-per-pvg-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-per-pvg-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-per-pvg-100.
       acc-per-pvg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Percentuali di provvigione        *
      *    *-----------------------------------------------------------*
       vis-per-pvg-000.
      *              *-------------------------------------------------*
      *              * Test se campo da visualizzare                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se Nessuna Preferenza per il tipo funziona- *
      *                  * mento prezzi per campagna promozionale :    *
      *                  * uscita                                      *
      *                  *---------------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to vis-per-pvg-999.
       vis-per-pvg-100.
      *                  *---------------------------------------------*
      *                  * Visualizzazione campo                       *
      *                  *---------------------------------------------*
           move      spaces               to   w-edt-per-pvg          .
           move      zero                 to   w-cix-ctr-001          .
       vis-per-pvg-200.
           add       1                    to   w-cix-ctr-001          .
           if        w-cix-ctr-001        >    03
                     go to vis-per-pvg-500.
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      01                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<BD"                to   v-edm                  .
           move      w-rig-per-pvg 
                    (1, w-cix-ctr-001)    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-edt-ppv-ele
                                              (w-cix-ctr-001)         .
           go to     vis-per-pvg-200.
       vis-per-pvg-500.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      14                   to   v-car                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   5              to   v-lin
           else      add   6              to   v-lin                  .
      *
           move      57                   to   v-pos                  .
           move      w-edt-per-pvg        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-per-pvg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione significativita' del campo 'Si/No stori-   *
      *    * cizzazione valori precedenti', e sua visualizzazione se   *
      *    * variato                                                   *
      *    *-----------------------------------------------------------*
       det-snx-sto-000.
      *              *-------------------------------------------------*
      *              * Salvataggio valore attuale del campo            *
      *              *-------------------------------------------------*
           move      w-rig-snx-sto (1)    to   w-sav-det-snx-sto      .
       det-snx-sto-100.
      *              *-------------------------------------------------*
      *              * Se non si e' in modifica : ad uscita senza al-  *
      *              * cuna azione                                     *
      *              *-------------------------------------------------*
           if        w-rig-dva-ini (2)    =    zero and
                     w-rig-dva-fin (2)    =    zero and
                     w-rig-tip-fnz (2)    =    zero and
                     w-rig-prz-lst (2)    =    zero and
                     w-rig-cat-sco (2)    =    zero and
                     w-rig-per-sco (2, 1) =    zero and
                     w-rig-per-sco (2, 2) =    zero and
                     w-rig-per-sco (2, 3) =    zero and
                     w-rig-per-sco (2, 4) =    zero and
                     w-rig-per-sco (2, 5) =    zero and
                     w-rig-cat-pvg (2)    =    zero and
                     w-rig-per-pvg (2, 1) =    zero and
                     w-rig-per-pvg (2, 2) =    zero and
                     w-rig-per-pvg (2, 3) =    zero
                     go to det-snx-sto-900.
       det-snx-sto-200.
      *              *-------------------------------------------------*
      *              * Test se il campo puo' essere significativo, e   *
      *              * deviazione secondo l'esito                      *
      *              *-------------------------------------------------*
       det-snx-sto-210.
      *                  *---------------------------------------------*
      *                  * Test su data di validita' iniziale          *
      *                  *---------------------------------------------*
           if        w-rig-dva-ini (1)    not  = w-rig-dva-ini (2)
                     go to det-snx-sto-600.
       det-snx-sto-500.
      *              *-------------------------------------------------*
      *              * Se il valore non puo' essere significativo      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Forzatura del valore a spaces               *
      *                  *---------------------------------------------*
           move      spaces               to   w-rig-snx-sto (1)      .
      *                  *---------------------------------------------*
      *                  * Ad eventuale ri-visualizzazione             *
      *                  *---------------------------------------------*
           go to     det-snx-sto-700.
       det-snx-sto-600.
      *              *-------------------------------------------------*
      *              * Se il valore puo' essere significativo          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se il valore attuale e' indefinito si forza *
      *                  * il valore a 'No'                            *
      *                  *---------------------------------------------*
           if        w-rig-snx-sto (1)    not  = "S" and
                     w-rig-snx-sto (1)    not  = "N"
                     move  "N"            to   w-rig-snx-sto (1)      .
      *                  *---------------------------------------------*
      *                  * Ad eventuale ri-visualizzazione             *
      *                  *---------------------------------------------*
           go to     det-snx-sto-700.
       det-snx-sto-700.
      *              *-------------------------------------------------*
      *              * Se il valore e' inalterato rispetto al valore   *
      *              * salvato all'inizio : ad  uscita                 *
      *              *-------------------------------------------------*
           if        w-rig-snx-sto (1)    =    w-sav-det-snx-sto
                     go to det-snx-sto-900.
       det-snx-sto-800.
      *              *-------------------------------------------------*
      *              * Ri-visualizzazione campo                        *
      *              *-------------------------------------------------*
           perform   vis-snx-sto-000      thru vis-snx-sto-999        .
       det-snx-sto-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-snx-sto-999.
       det-snx-sto-999.
           exit.

      *    *===========================================================*
      *    * Accettazione : Si/No storicizzazione valori precedenti    *
      *    *-----------------------------------------------------------*
       acc-snx-sto-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-snx-sto-025.
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se il valore attuale del campo e' inde- *
      *                      * terminato : uscita                      *
      *                      *-----------------------------------------*
           if        w-rig-snx-sto (1)    not  = "S" and
                     w-rig-snx-sto (1)    not  = "N"
                     go to acc-snx-sto-999.
       acc-snx-sto-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snx-sto-lun    to   v-car                  .
           move      w-exp-snx-sto-num    to   v-ldt                  .
           move      "X"                  to   v-edm                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   6              to   v-lin
           else      add   7              to   v-lin                  .
      *
           move      25                   to   v-pos                  .
           move      w-exp-snx-sto-tbl    to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           if        w-rig-snx-sto (1)    =    "N"
                     move  01             to   v-num
           else if   w-rig-snx-sto (1)    =    "S"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-snx-sto-999.
       acc-snx-sto-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  "N"            to   w-rig-snx-sto (1)
           else if   v-num                =    02
                     move  "S"            to   w-rig-snx-sto (1)
           else      move  spaces         to   w-rig-snx-sto (1)      .
       acc-snx-sto-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
           if        w-rig-snx-sto (1)    not  = "S" and
                     w-rig-snx-sto (1)    not  = "N"
                     go to acc-snx-sto-100.
       acc-snx-sto-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-snx-sto-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-snx-sto-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-snx-sto-100.
       acc-snx-sto-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Si/No storicizzazione valori precedenti *
      *    *-----------------------------------------------------------*
       vis-snx-sto-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snx-sto-lun    to   v-car                  .
           move      w-exp-snx-sto-num    to   v-ldt                  .
           move      "X"                  to   v-edm                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
           if        w-prs-tfu-pcp        =    zero
                     add   6              to   v-lin
           else      add   7              to   v-lin                  .
      *
           move      25                   to   v-pos                  .
           move      w-exp-snx-sto-tbl    to   v-txt                  .
           if        w-rig-snx-sto (1)    =    "N"
                     move  01             to   v-num
           else if   w-rig-snx-sto (1)    =    "S"
                     move  02             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-snx-sto-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi chiave           *
      *    *-----------------------------------------------------------*
       cnt-tdo-key-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-key-flg      .
       cnt-tdo-key-999.
           exit.
           
      *    *===========================================================*
      *    * Controllo se chiave vuota                                 *
      *    *-----------------------------------------------------------*
       cnt-key-vuo-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-key-vuo-flg      .
       cnt-key-vuo-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi non chiave       *
      *    *-----------------------------------------------------------*
       cnt-tdo-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-nok-flg      .
       cnt-tdo-nok-999.
           exit.
           
      *    *===========================================================*
      *    * Controllo su impostazione tasto Do riga corpo             *
      *    *-----------------------------------------------------------*
       cnt-tdo-rig-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-rig-flg      .
      *              *-------------------------------------------------*
      *              * Controlli formali                               *
      *              *-------------------------------------------------*
       cnt-tdo-rig-110.
      *                  *---------------------------------------------*
      *                  * Data inizio campagna                        *
      *                  *---------------------------------------------*
           if        w-rig-dva-ini (1)    not  = zero
                     go to cnt-tdo-rig-120.
           move      "Manca la data di inizio campagna promozionale     
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-120.
      *                  *---------------------------------------------*
      *                  * Data fine campagna                          *
      *                  *---------------------------------------------*
           if        w-rig-dva-fin (1)    not  = zero
                     go to cnt-tdo-rig-130.
           move      "Manca la data di fine campagna promozionale       
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-130.
      *                  *---------------------------------------------*
      *                  * Tipo funzionamento                          *
      *                  *---------------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     go to cnt-tdo-rig-140.
           if        w-rig-tip-fnz (1)    not  = zero
                     go to cnt-tdo-rig-140.
           move      "Manca la definizione del tipo funzionamento       
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-140.
      *                  *---------------------------------------------*
      *                  * Prezzo di vendita per campagna promozionale *
      *                  *---------------------------------------------*
           if        w-rig-snx-prz (1)    not  = "S"
                     go to cnt-tdo-rig-150.
           if        w-rig-prz-lst (1)    not  = zero
                     go to cnt-tdo-rig-150.
           move      "Manca il prezzo di vendita per campagna promoziona
      -              "le             "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-150.
      *                  *---------------------------------------------*
      *                  * Sconti per campagna promozionale            *
      *                  *---------------------------------------------*
       cnt-tdo-rig-160.
      *                  *---------------------------------------------*
      *                  * Provvigioni per campagna promozionale       *
      *                  *---------------------------------------------*
       cnt-tdo-rig-200.
      *              *-------------------------------------------------*
      *              * Controllo di congruenza tra data di inizio e    *
      *              * data di fine campagna                           *
      *              *-------------------------------------------------*
           if        w-rig-dva-ini (1)    not  > w-rig-dva-fin (1)
                     go to cnt-tdo-rig-300.
           move      "La data di inizio campagna di vendita non puo' ess
      -              "ere superiore a"    to   w-err-box-err-msg      .
           move      "quella di fine campagna                           
      -              "               "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-300.
      *              *-------------------------------------------------*
      *              * Controllo di congruenza tra la campagna attuale *
      *              * e l'ultima campagna storicizzata                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Start su file [lsd]                         *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "LSTPRODFR "         to   f-key                  .
           move      03                   to   rf-lsd-tip-rec         .
           move      spaces               to   rf-lsd-cod-lst         .
           move      zero                 to   rf-lsd-cod-cli         .
           move      c-sgl                to   rf-lsd-sgl-vlt         .
           move      w-rig-num-pro (1)    to   rf-lsd-num-pro         .
           move      zero                 to   rf-lsd-dvf-rev         .
           move      "pgm/dcp/fls/ioc/obj/ioflsd"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lsd                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : nessun controllo          *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to cnt-tdo-rig-400.
      *                  *---------------------------------------------*
      *                  * Lettura primo record [lsd]                  *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflsd"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lsd                 .
      *                  *---------------------------------------------*
      *                  * Se At End : nessun controllo                *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to cnt-tdo-rig-400.
      *                  *---------------------------------------------*
      *                  * Test sul massimo                            *
      *                  *---------------------------------------------*
           if        rf-lsd-tip-rec       not  = 03                or
                     rf-lsd-cod-lst       not  = spaces            or
                     rf-lsd-cod-cli       not  = zero              or
                     rf-lsd-sgl-vlt       not  = c-sgl             or
                     rf-lsd-num-pro       not  = w-rig-num-pro (1)
                     go to cnt-tdo-rig-400.
      *                  *---------------------------------------------*
      *                  * Confronto fra data inizio campagna attuale  *
      *                  * con data di fine campagna ultima storiciz-  *
      *                  * zat                                         *
      *                  *---------------------------------------------*
           if        rf-lsd-dva-fin       <    w-rig-dva-ini (1)
                     go to cnt-tdo-rig-400.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "La data di inizio campagna di vendita deve essere 
      -              "superiore a    "    to   w-err-box-err-msg      .
           move      "quella di fine campagna dell'ultima campagna stori
      -              "cizzata !      "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
      *                  *---------------------------------------------*
      *                  * Ad errore                                   *
      *                  *---------------------------------------------*
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-400.
      *              *-------------------------------------------------*
      *              * Controllo di congruenza tra la campagna attuale *
      *              * e la campagna da storicizzare                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non richiesta la storicizzazione : nes-  *
      *                  * sun controllo                               *
      *                  *---------------------------------------------*
           if        w-rig-snx-sto (1)    not  = "S"
                     go to cnt-tdo-rig-500.
      *                  *---------------------------------------------*
      *                  * Confronto fra data inizio campagna, valore  *
      *                  * attuale, con data di fine campagna, valore  *
      *                  * precedente                                  *
      *                  *---------------------------------------------*
           if        w-rig-dva-ini (2)    <    w-rig-dva-ini (1)
                     go to cnt-tdo-rig-500.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "La data di inizio campagna di vendita attuale deve
      -              " essere        "    to   w-err-box-err-msg      .
           move      "superiore alla data di fine campagna precedente !
      -              "               "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
      *                  *---------------------------------------------*
      *                  * Ad errore                                   *
      *                  *---------------------------------------------*
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-500.
      *              *-------------------------------------------------*
      *              * Controllo di congruenza tra la campagna prece-  *
      *              * dente da storicizzare e l'ultima campagna sto-  *
      *              * ricizzata                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non richiesta la storicizzazione : nes-  *
      *                  * sun controllo                               *
      *                  *---------------------------------------------*
           if        w-rig-snx-sto (1)    not  = "S"
                     go to cnt-tdo-rig-600.
      *                  *---------------------------------------------*
      *                  * Start su file [lsd]                         *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "LSTPRODFR "         to   f-key                  .
           move      03                   to   rf-lsd-tip-rec         .
           move      spaces               to   rf-lsd-cod-lst         .
           move      zero                 to   rf-lsd-cod-cli         .
           move      c-sgl                to   rf-lsd-sgl-vlt         .
           move      w-rig-num-pro (1)    to   rf-lsd-num-pro         .
           move      zero                 to   rf-lsd-dvf-rev         .
           move      "pgm/dcp/fls/ioc/obj/ioflsd"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lsd                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : nessun controllo          *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to cnt-tdo-rig-600.
      *                  *---------------------------------------------*
      *                  * Lettura primo record [lsd]                  *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflsd"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lsd                 .
      *                  *---------------------------------------------*
      *                  * Se At End : nessun controllo                *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to cnt-tdo-rig-600.
      *                  *---------------------------------------------*
      *                  * Test sul massimo                            *
      *                  *---------------------------------------------*
           if        rf-lsd-tip-rec       not  = 03                or
                     rf-lsd-cod-lst       not  = spaces            or
                     rf-lsd-cod-cli       not  = zero              or
                     rf-lsd-sgl-vlt       not  = c-sgl             or
                     rf-lsd-num-pro       not  = w-rig-num-pro (1)
                     go to cnt-tdo-rig-600.
      *                  *---------------------------------------------*
      *                  * Confronto fra data inizio campagna prece-   *
      *                  * dente da storicizzare con data di fine cam- *
      *                  * pagna ultima storicizzata                   *
      *                  *---------------------------------------------*
           if        rf-lsd-dva-fin       <    w-rig-dva-ini (2)
                     go to cnt-tdo-rig-600.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "La data di inizio della campagna da storicizzare d
      -              "eve essere     "    to   w-err-box-err-msg      .
           move      "superirore a quella di fine campagna ultima storic
      -              "izzata !       "    to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
      *                  *---------------------------------------------*
      *                  * Ad errore                                   *
      *                  *---------------------------------------------*
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-600.
      *              *-------------------------------------------------*
      *              * Fine controlli : uscita                         *
      *              *-------------------------------------------------*
           go to     cnt-tdo-rig-999.
       cnt-tdo-rig-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-rig-flg      .
       cnt-tdo-rig-999.
           exit.

      *    *===========================================================*
      *    * Preparazioni pre-accettazione riga corpo                  *
      *    *-----------------------------------------------------------*
       pre-rig-cor-000.
       pre-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Azioni post-accettazione riga corpo                       *
      *    *-----------------------------------------------------------*
       pos-rig-cor-000.
       pos-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati chiave e non chiave                  *
      *    *-----------------------------------------------------------*
       nor-key-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione dati chiave                     *
      *              *-------------------------------------------------*
           perform   nor-key-reg-000      thru nor-key-reg-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave testata         *
      *              *-------------------------------------------------*
           perform   nor-nok-tes-000      thru nor-nok-tes-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave riga corpo      *
      *              *-------------------------------------------------*
           perform   nor-nok-rig-000      thru nor-nok-rig-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave piede           *
      *              *-------------------------------------------------*
           perform   nor-nok-pie-000      thru nor-nok-pie-999        .
      *              *-------------------------------------------------*
      *              * Inizializzazione file relative di supporto      *
      *              *-------------------------------------------------*
           move      "BE"                 to   w-rlt-sup-ope          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       nor-key-nok-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati chiave                               *
      *    *-----------------------------------------------------------*
       nor-key-reg-000.
           move      zero                 to   w-tes-fso-dcp          .
           move      spaces               to   w-tes-fso-dcp-des      .
           move      zero                 to   w-tes-fso-dcp-ord      .
           move      spaces               to   w-tes-snx-spc          .
           move      spaces               to   w-tes-cnf-imp          .
       nor-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave testata                   *
      *    *-----------------------------------------------------------*
       nor-nok-tes-000.
       nor-nok-tes-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave riga corpo                *
      *    *-----------------------------------------------------------*
       nor-nok-rig-000.
           move      zero                 to   w-rig-num-prg (1)      .
           move      zero                 to   w-rig-num-pro (1)      .
           move      spaces               to   w-rig-alf-pro (1)      .
           move      spaces               to   w-rig-des-pro (1)      .
           move      zero                 to   w-rig-tip-fnz (1)      .
           move      zero                 to   w-rig-cat-pvg (1)      .
           move      spaces               to   w-rig-cat-pvg-des (1)  .
           move      zero                 to   w-rig-per-pvg (1, 1)   .
           move      zero                 to   w-rig-per-pvg (1, 2)   .
           move      zero                 to   w-rig-per-pvg (1, 3)   .
           move      zero                 to   w-rig-cat-sco (1)      .
           move      spaces               to   w-rig-cat-sco-des (1)  .
           move      zero                 to   w-rig-per-sco (1, 1)   .
           move      zero                 to   w-rig-per-sco (1, 2)   .
           move      zero                 to   w-rig-per-sco (1, 3)   .
           move      zero                 to   w-rig-per-sco (1, 4)   .
           move      zero                 to   w-rig-per-sco (1, 5)   .
           move      spaces               to   w-rig-snx-prz (1)      .
           move      spaces               to   w-rig-snx-pvg (1)      .
           move      spaces               to   w-rig-snx-sco (1)      .
           move      zero                 to   w-rig-prz-lst (1)      .
           move      zero                 to   w-rig-dec-prz (1)      .
           move      zero                 to   w-rig-dva-ini (1)      .
           move      zero                 to   w-rig-dva-fin (1)      .
           move      spaces               to   w-rig-snx-sto (1)      .
           move      spaces               to   w-rig-alx-exp (1)      .
       nor-nok-rig-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave piede                     *
      *    *-----------------------------------------------------------*
       nor-nok-pie-000.
       nor-nok-pie-999.
           exit.

      *    *===========================================================*
      *    * Lettura registrazione pre-esistente                       *
      *    *-----------------------------------------------------------*
       rou-let-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-let-reg      .
       rou-let-reg-100.
      *              *-------------------------------------------------*
      *              * Messaggio di caricamento in esecuzione          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "              --- Caricamento prezzi di listino in
      -              " esecuzione ---               "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Esecuzione sort per ordinamento richiesto       *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   car-fil-rap-000
                                          thru car-fil-rap-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del numero di records ca-  *
      *              * ricati nel file relative di appoggio            *
      *              *-------------------------------------------------*
           if        w-rlt-sup-max        =    zero
                     go to rou-let-reg-200
           else      go to rou-let-reg-300.
       rou-let-reg-200.
      *              *-------------------------------------------------*
      *              * Se numero di records caricati : zero            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Nessun prezzo di listino da trattare !            
      -              "               "    to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Status di uscita ad errore                  *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-rou-let-reg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-300.
      *              *-------------------------------------------------*
      *              * Se numero di records caricati maggiore di zero  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Modifica                                    *
      *                  *---------------------------------------------*
           move      "M"                  to   w-cnt-mfu-tip-fun      .
      *                  *---------------------------------------------*
      *                  * Test per visualizzazione                    *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-vis-sgr    =    "V"
                     move  "V"            to   w-cnt-mfu-tip-fun      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per inserimento                  *
      *    *-----------------------------------------------------------*
       pre-acc-ins-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-ins      .
       pre-acc-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per modifica                     *
      *    *-----------------------------------------------------------*
       pre-acc-mod-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-mod      .
       pre-acc-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per visualizzazione              *
      *    *-----------------------------------------------------------*
       pre-acc-vis-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-vis      .
       pre-acc-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-richiesta di ratifica tasto Delete            *
      *    *-----------------------------------------------------------*
       pre-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-snx-del      .
      *              *-------------------------------------------------*
      *              * Si ignora comunque il tasto Delt                *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-pre-snx-del      .
       pre-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-richiesta di ratifica tasto Delete           *
      *    *-----------------------------------------------------------*
       pos-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pos-snx-del      .
      *              *-------------------------------------------------*
      *              * Si ignora comunque il tasto Delt                *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-pos-snx-del      .
       pos-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su inserimento                          *
      *    *-----------------------------------------------------------*
       pos-exi-ins-000.
       pos-exi-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su modifica                             *
      *    *-----------------------------------------------------------*
       pos-exi-mod-000.
       pos-exi-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su visualizzazione                      *
      *    *-----------------------------------------------------------*
       pos-exi-vis-000.
       pos-exi-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di inserimento                      *
      *    *-----------------------------------------------------------*
       pos-cnf-ins-000.
       pos-cnf-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di modifica                         *
      *    *-----------------------------------------------------------*
       pos-cnf-mod-000.
      *              *-------------------------------------------------*
      *              * Scaricamento file relative di appoggio          *
      *              *-------------------------------------------------*
           perform   sca-fil-rap-000      thru sca-fil-rap-999        .
       pos-cnf-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di annullamento                     *
      *    *-----------------------------------------------------------*
       pos-cnf-ann-000.
       pos-cnf-ann-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione della selezione sui pro- *
      *              * dotti gia' in campagna                          *
      *              *-------------------------------------------------*
           if        w-tes-snx-spc        =    "S"
                     go to stp-srt-inp-100
           else if   w-tes-snx-spc        =    "N"
                     go to stp-srt-inp-200.
       stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Se selezione dei soli prodotti gia' in campagna *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Start su archivio [lst]                     *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "LSTPRO    "         to   f-key                  .
           move      03                   to   rf-lst-tip-rec         .
           move      spaces               to   rf-lst-cod-lst         .
           move      zero                 to   rf-lst-cod-cli         .
           move      c-sgl                to   rf-lst-sgl-vlt         .
           move      zero                 to   rf-lst-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                      *-----------------------------------------*
      *                      * Se Start errata : uscita                *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-999.
       stp-srt-inp-120.
      *                  *---------------------------------------------*
      *                  * Read-next su archivio [lst]                 *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                      *-----------------------------------------*
      *                      * Se at end : uscita                      *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-999.
      *                  *---------------------------------------------*
      *                  * Test sul massimo                            *
      *                  *---------------------------------------------*
           if        rf-lst-tip-rec       not  = 03             or
                     rf-lst-cod-lst       not  = spaces         or
                     rf-lst-cod-cli       not  = zero           or
                     rf-lst-sgl-vlt       not  = c-sgl
                     go to stp-srt-inp-999.
      *                  *---------------------------------------------*
      *                  * Lettura record [dcp] per ordinamenti        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      rf-lst-num-pro       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Se record non trovato : a prodotto suc- *
      *                      * cessivo                                 *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-120.
      *                  *---------------------------------------------*
      *                  * Selezione su record [dcp] letto mediante    *
      *                  * richiamo del filtro di ordinamento e se-    *
      *                  * lezione                                     *
      *                  *---------------------------------------------*
           move      "SE"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Se selezione non superata : a prodotto  *
      *                      * successivo                              *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-120.
      *                  *---------------------------------------------*
      *                  * Esecuzione sub-routine per composizione e   *
      *                  * scrittura record di Sort                    *
      *                  *---------------------------------------------*
           perform   stp-srt-inp-500      thru stp-srt-inp-599        .
      *                  *---------------------------------------------*
      *                  * Riciclo su lettura record [lst]             *
      *                  *---------------------------------------------*
           go to     stp-srt-inp-120.
       stp-srt-inp-200.
      *              *-------------------------------------------------*
      *              * Se selezione di tutti i prodotti                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Start filtro di ordinamento e selezione per *
      *                  * file [dcp]                                  *
      *                  *---------------------------------------------*
           move      "ST"                 to   f-ope                  .
           move      w-tes-fso-dcp        to   f-key                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Se errore su Start : uscita             *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-999.
       stp-srt-inp-220.
      *                  *---------------------------------------------*
      *                  * Read Next filtro di ordinamento e selezione *
      *                  * per file [dcp]                              *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Se At End : uscita                      *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-999.
      *                  *---------------------------------------------*
      *                  * Tentativo di lettura record [lst] relativo  *
      *                  * al prodotto letto                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [lst]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [lst]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "LSTPRO    "         to   f-key                  .
           move      03                   to   rf-lst-tip-rec         .
           move      spaces               to   rf-lst-cod-lst         .
           move      zero                 to   rf-lst-cod-cli         .
           move      c-sgl                to   rf-lst-sgl-vlt         .
           move      rf-dcp-num-pro       to   rf-lst-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Esecuzione sub-routine per composizione e   *
      *                  * scrittura record di Sort                    *
      *                  *---------------------------------------------*
           perform   stp-srt-inp-500      thru stp-srt-inp-599        .
      *                  *---------------------------------------------*
      *                  * Riciclo su lettura filtro di ordinamento e  *
      *                  * selezione per file [dcp]                    *
      *                  *---------------------------------------------*
           go to     stp-srt-inp-220.
       stp-srt-inp-500.
      *              *=================================================*
      *              * Sub-routine per composizione e scrittura record *
      *              * di Sort                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione preliminare numeri di se-   *
      *                  * quenza per classe, gruppo, sottogruppo      *
      *                  *---------------------------------------------*
           move      zero                 to   w-let-arc-zp1-sqz      .
           move      zero                 to   w-let-arc-zp2-sqz      .
           move      zero                 to   w-let-arc-zp3-sqz      .
      *                  *---------------------------------------------*
      *                  * Lettura numeri di sequenza per classe,      *
      *                  * gruppo e sottogruppo solo se richiesto da   *
      *                  * tipo ordinamento il quale va decodificato   *
      *                  * nel modo che segue :                        *
      *                  *                                             *
      *                  * - 01 : Per classe, gruppo e sottogruppo e   *
      *                  *        codice prodotto                      *
      *                  * - 02 : Per classe, gruppo e sottogruppo e   *
      *                  *        descrizione prodotto                 *
      *                  * - 03 : Per codice prodotto                  *
      *                  * - 04 : Per descrizione prodotto             *
      *                  *---------------------------------------------*
           if        w-tes-fso-dcp-ord    >    2
                     go to stp-srt-inp-520.
      *                      *-----------------------------------------*
      *                      * Lettura classe di appartenenza          *
      *                      *-----------------------------------------*
           move      rf-dcp-cla-pro       to   w-let-arc-zp1-cla      .
           perform   let-arc-zp1-000      thru let-arc-zp1-999        .
      *                          *-------------------------------------*
      *                          * Se classe non trovata : a composi-  *
      *                          * zione record di sort                *
      *                          *-------------------------------------*
           if        w-let-arc-zp1-flg    not  = spaces
                     go to stp-srt-inp-540.
      *                          *-------------------------------------*
      *                          * Se la classe non ulteriormente sud- *
      *                          * divisa : a composizione record di   *
      *                          * sort                                *
      *                          *-------------------------------------*
           if        w-let-arc-zp1-sud    =    01
                     go to stp-srt-inp-540.
      *                      *-----------------------------------------*
      *                      * Lettura gruppo di appartenenza          *
      *                      *-----------------------------------------*
           move      rf-dcp-cla-pro       to   w-let-arc-zp2-cla      .
           move      rf-dcp-gru-pro       to   w-let-arc-zp2-gru      .
           perform   let-arc-zp2-000      thru let-arc-zp2-999        .
      *                          *-------------------------------------*
      *                          * Se gruppo non trovato : a composi-  *
      *                          * zione record di sort                *
      *                          *-------------------------------------*
           if        w-let-arc-zp2-flg    not  = spaces
                     go to stp-srt-inp-540.
      *                          *-------------------------------------*
      *                          * Se il gruppo non ulteriormente sud- *
      *                          * diviso : a composizione record di   *
      *                          * sort                                *
      *                          *-------------------------------------*
           if        w-let-arc-zp2-sud    =    01
                     go to stp-srt-inp-540.
      *                      *-----------------------------------------*
      *                      * Lettura sottogruppo di appartenenza     *
      *                      *-----------------------------------------*
           move      rf-dcp-cla-pro       to   w-let-arc-zp3-cla      .
           move      rf-dcp-gru-pro       to   w-let-arc-zp3-gru      .
           move      rf-dcp-sgr-pro       to   w-let-arc-zp3-sgr      .
           perform   let-arc-zp3-000      thru let-arc-zp3-999        .
      *                          *-------------------------------------*
      *                          * Se sottogruppo non trovato : a      *
      *                          * composizione record di sort         *
      *                          *-------------------------------------*
           if        w-let-arc-zp3-flg    not  = spaces
                     go to stp-srt-inp-540.
      *                          *-------------------------------------*
      *                          * Se il sottogruppo non ulteriormente *
      *                          * suddiviso : a composizione record   *
      *                          * di sort                             *
      *                          *-------------------------------------*
           if        w-let-arc-zp3-sud    =    01
                     go to stp-srt-inp-540.
       stp-srt-inp-520.
      *                  *---------------------------------------------*
      *                  * Se ordinamento per codice o descrizione :   *
      *                  * nessuna azione                              *
      *                  *---------------------------------------------*
       stp-srt-inp-540.
      *                  *---------------------------------------------*
      *                  * Preparazione record di sort                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Pulizia preliminare                     *
      *                      *-----------------------------------------*
           move      spaces               to   srt-rec                .
      *                      *-----------------------------------------*
      *                      * Campi chiave                            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Sequenza per classe prodotto        *
      *                          *-------------------------------------*
           if        w-tes-fso-dcp-ord    =    01  or
                     w-tes-fso-dcp-ord    =    02
                     move  w-let-arc-zp1-sqz
                                          to   srt-key-sqc
           else      move  zero           to   srt-key-sqc            .
      *                          *-------------------------------------*
      *                          * Sequenza per gruppo prodotto        *
      *                          *-------------------------------------*
           if        w-tes-fso-dcp-ord    =    01  or
                     w-tes-fso-dcp-ord    =    02
                     move  w-let-arc-zp2-sqz
                                          to   srt-key-sqg
           else      move  zero           to   srt-key-sqg            .
      *                          *-------------------------------------*
      *                          * Sequenza per sottogruppo prodotto   *
      *                          *-------------------------------------*
           if        w-tes-fso-dcp-ord    =    01  or
                     w-tes-fso-dcp-ord    =    02
                     move  w-let-arc-zp3-sqz
                                          to   srt-key-sqs
           else      move  zero           to   srt-key-sqs            .
      *                          *-------------------------------------*
      *                          * Descrizione prodotto 1              *
      *                          *-------------------------------------*
           if        w-tes-fso-dcp-ord    =    02  or
                     w-tes-fso-dcp-ord    =    04
                     move  rf-dcp-des-pro to   srt-key-dp1
           else      move  spaces         to   srt-key-dp1            .
      *                          *-------------------------------------*
      *                          * Codice alfanumerico prodotto        *
      *                          *-------------------------------------*
           if        w-tes-fso-dcp-ord    =    01  or
                     w-tes-fso-dcp-ord    =    03
                     move  rf-dcp-alf-pro to   srt-key-cap
           else      move  spaces         to   srt-key-cap            .
      *                          *-------------------------------------*
      *                          * Descrizione prodotto 2              *
      *                          *-------------------------------------*
           if        w-tes-fso-dcp-ord    =    02  or
                     w-tes-fso-dcp-ord    =    04
                     move  rf-dcp-des-pro to   srt-key-dp2
           else      move  spaces         to   srt-key-dp2            .
      *                      *-----------------------------------------*
      *                      * Preparazione dati                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Descrizione da esporre              *
      *                          *-------------------------------------*
           move      rf-dcp-des-pro       to   srt-des-pro            .
      *                          *-------------------------------------*
      *                          * Codice prodotto numerico            *
      *                          *-------------------------------------*
           move      rf-dcp-num-pro       to   srt-num-pro            .
      *                          *-------------------------------------*
      *                          * Codice prodotto alfanumerico        *
      *                          *-------------------------------------*
           move      rf-dcp-alf-pro       to   srt-alf-pro            .
      *                          *-------------------------------------*
      *                          * Prezzo di listino attuale           *
      *                          *-------------------------------------*
           move      rf-lst-prz-lst       to   srt-prz-lst            .
      *                          *-------------------------------------*
      *                          * Decimali prezzo                     *
      *                          *-------------------------------------*
           move      rf-dcp-dec-prz       to   srt-dec-prz            .
      *                          *-------------------------------------*
      *                          * Categoria provvigioni               *
      *                          *-------------------------------------*
           move      rf-lst-cat-pvg       to   srt-cat-pvg            .
           move      02                   to   w-let-arc-zpv-tip      .
           move      srt-cat-pvg          to   w-let-arc-zpv-cod      .
           perform   let-arc-zpv-000      thru let-arc-zpv-999        .
           move      w-let-arc-zpv-des    to   srt-cat-pvg-des        .
      *                          *-------------------------------------*
      *                          * % di provvigioni                    *
      *                          *-------------------------------------*
           move      rf-lst-per-pvg (1)   to   srt-per-pvg (1)        .
           move      rf-lst-per-pvg (2)   to   srt-per-pvg (2)        .
           move      rf-lst-per-pvg (3)   to   srt-per-pvg (3)        .
      *                          *-------------------------------------*
      *                          * Categoria sconto                    *
      *                          *-------------------------------------*
           move      rf-lst-cat-sco       to   srt-cat-sco            .
           move      03                   to   w-let-arc-zcs-tip      .
           move      srt-cat-sco          to   w-let-arc-zcs-cod      .
           perform   let-arc-zcs-000      thru let-arc-zcs-999        .
           move      w-let-arc-zcs-des    to   srt-cat-sco-des        .
      *                          *-------------------------------------*
      *                          * % sconto                            *
      *                          *-------------------------------------*
           move      rf-lst-per-sco (1)   to   srt-per-sco (1)        .
           move      rf-lst-per-sco (2)   to   srt-per-sco (2)        .
           move      rf-lst-per-sco (3)   to   srt-per-sco (3)        .
           move      rf-lst-per-sco (4)   to   srt-per-sco (4)        .
           move      rf-lst-per-sco (5)   to   srt-per-sco (5)        .
      *                          *-------------------------------------*
      *                          * Flags di si/no utilizzo             *
      *                          *-------------------------------------*
           move      rf-lst-snx-prz       to   srt-snx-prz            .
           move      rf-lst-snx-pvg       to   srt-snx-pvg            .
           move      rf-lst-snx-sco       to   srt-snx-sco            .
      *                      *-----------------------------------------*
      *                      * Tipo funzionamento                      *
      *                      *-----------------------------------------*
           if        srt-snx-prz          =    "S"  and
                     srt-snx-sco          =    "S"  and
                     srt-snx-pvg          =    "S"
                     move  01             to   srt-tip-fnz
           else if   srt-snx-prz          =    "S"  and
                     srt-snx-sco          =    "N"  and
                     srt-snx-pvg          =    "N"
                     move  02             to   srt-tip-fnz
           else if   srt-snx-prz          =    "N"  and
                     srt-snx-sco          =    "S"  and
                     srt-snx-pvg          =    "N"
                     move  03             to   srt-tip-fnz
           else if   srt-snx-prz          =    "N"  and
                     srt-snx-sco          =    "N"  and
                     srt-snx-pvg          =    "S"
                     move  04             to   srt-tip-fnz
           else if   srt-snx-prz          =    "S"  and
                     srt-snx-sco          =    "S"  and
                     srt-snx-pvg          =    "N"
                     move  05             to   srt-tip-fnz
           else if   srt-snx-prz          =    "S"  and
                     srt-snx-sco          =    "N"  and
                     srt-snx-pvg          =    "S"
                     move  06             to   srt-tip-fnz
           else if   srt-snx-prz          =    "N"  and
                     srt-snx-sco          =    "S"  and
                     srt-snx-pvg          =    "S"
                     move  07             to   srt-tip-fnz
           else      move  zero           to   srt-tip-fnz            .
      *                      *-----------------------------------------*
      *                      * Data validita' iniziale                 *
      *                      *-----------------------------------------*
           move      rf-lst-dva-ini       to   srt-dva-ini            .
      *                      *-----------------------------------------*
      *                      * Data validita' finale                   *
      *                      *-----------------------------------------*
           move      rf-lst-dva-fin       to   srt-dva-fin            .
      *                  *---------------------------------------------*
      *                  * Rilascio record al sort                     *
      *                  *---------------------------------------------*
           release   srt-rec                                          .
       stp-srt-inp-599.
           exit.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione caricamento file relative di appoggio          *
      *    *-----------------------------------------------------------*
       car-fil-rap-000.
      *              *-------------------------------------------------*
      *              * La preparazione della catena avviene dai record *
      *              * rilasciati dalla routine in input di sort       *
      *              *-------------------------------------------------*
       car-fil-rap-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se At End : uscita                          *
      *                  *---------------------------------------------*
           return    srt    at end
                            go to car-fil-rap-900                     .
       car-fil-rap-150.
      *              *-------------------------------------------------*
      *              * Caricamento effettivo del record nella catena   *
      *              * movimenti per la registrazione                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione area 'w-rig'                *
      *                  *---------------------------------------------*
           perform   nor-nok-rig-000      thru nor-nok-rig-999        .
       car-fil-rap-400.
      *                  *---------------------------------------------*
      *                  * Composizione area 'w-rig'                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Numero progressivo record caricato      *
      *                      *-----------------------------------------*
           move      w-rlt-sup-max        to   w-rig-num-prg (1)      .
           add       1                    to   w-rig-num-prg (1)      .
       car-fil-rap-410.
      *                      *-----------------------------------------*
      *                      * Codice prodotto numerico                *
      *                      *-----------------------------------------*
           move      srt-num-pro          to   w-rig-num-pro (1)      .
      *                      *-----------------------------------------*
      *                      * Codice prodotto alfanumerico            *
      *                      *-----------------------------------------*
           move      srt-alf-pro          to   w-rig-alf-pro (1)      .
      *                      *-----------------------------------------*
      *                      * Descrizione prodotto in lingua italiana *
      *                      *-----------------------------------------*
           move      srt-des-pro          to   w-rig-des-pro (1)      .
      *                      *-----------------------------------------*
      *                      * Prezzo di listino attuale               *
      *                      *-----------------------------------------*
           move      srt-prz-lst          to   w-rig-prz-lst (1)      .
      *                      *-----------------------------------------*
      *                      * Decimali prezzo                         *
      *                      *-----------------------------------------*
           move      srt-dec-prz          to   w-rig-dec-prz (1)      .
      *                      *-----------------------------------------*
      *                      * Categoria provvigioni                   *
      *                      *-----------------------------------------*
           move      srt-cat-pvg          to   w-rig-cat-pvg (1)      .
           move      srt-cat-pvg-des      to   w-rig-cat-pvg-des (1)  .
      *                      *-----------------------------------------*
      *                      * % di provvigioni                        *
      *                      *-----------------------------------------*
           move      srt-per-pvg (1)      to   w-rig-per-pvg (1, 1)   .
           move      srt-per-pvg (2)      to   w-rig-per-pvg (1, 2)   .
           move      srt-per-pvg (3)      to   w-rig-per-pvg (1, 3)   .
      *                      *-----------------------------------------*
      *                      * Categoria sconto                        *
      *                      *-----------------------------------------*
           move      srt-cat-sco          to   w-rig-cat-sco (1)      .
           move      srt-cat-sco-des      to   w-rig-cat-sco-des (1)  .
      *                      *-----------------------------------------*
      *                      * % sconto                                *
      *                      *-----------------------------------------*
           move      srt-per-sco (1)      to   w-rig-per-sco (1, 1)   .
           move      srt-per-sco (2)      to   w-rig-per-sco (1, 2)   .
           move      srt-per-sco (3)      to   w-rig-per-sco (1, 3)   .
           move      srt-per-sco (4)      to   w-rig-per-sco (1, 4)   .
           move      srt-per-sco (5)      to   w-rig-per-sco (1, 5)   .
      *                      *-----------------------------------------*
      *                      * Flags di si/no utilizzo                 *
      *                      *-----------------------------------------*
           move      srt-snx-prz          to   w-rig-snx-prz (1)      .
           move      srt-snx-pvg          to   w-rig-snx-pvg (1)      .
           move      srt-snx-sco          to   w-rig-snx-sco (1)      .
      *                      *-----------------------------------------*
      *                      * Tipo funzionamento                      *
      *                      *-----------------------------------------*
           move      srt-tip-fnz          to   w-rig-tip-fnz (1)      .
      *                      *-----------------------------------------*
      *                      * Data validita' iniziale                 *
      *                      *-----------------------------------------*
           move      srt-dva-ini          to   w-rig-dva-ini (1)      .
      *                      *-----------------------------------------*
      *                      * Data validita' finale                   *
      *                      *-----------------------------------------*
           move      srt-dva-fin          to   w-rig-dva-fin (1)      .
      *                  *---------------------------------------------*
      *                  * Valori attuali in precedenti                *
      *                  *---------------------------------------------*
           move      w-rig-val-aep (1)    to   w-rig-val-aep (2)      .
       car-fil-rap-500.
      *              *-------------------------------------------------*
      *              * Put su file relative di appoggio                *
      *              *-------------------------------------------------*
           move      "PT"                 to   w-rlt-sup-ope          .
           move      w-rig                to   w-rlt-sup-buf          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       car-fil-rap-550.
      *              *-------------------------------------------------*
      *              * Riciclo a Read Next                             *
      *              *-------------------------------------------------*
           go to     car-fil-rap-100.
       car-fil-rap-900.
      *              *-------------------------------------------------*
      *              * Eliminazione messaggio di caricamento in esecu- *
      *              * zione                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       car-fil-rap-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione scaricamento da file relative di appoggio      *
      *    *-----------------------------------------------------------*
       sca-fil-rap-000.
      *              *-------------------------------------------------*
      *              * Messaggio di aggiornamento in esecuzione        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "             --- Aggiornamento prezzi di listino i
      -              "n esecuzione ---              "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       sca-fil-rap-050.
      *              *-------------------------------------------------*
      *              * Contatore records scaricati a zero              *
      *              *-------------------------------------------------*
           move      zero                 to   w-rlt-sup-ctr          .
       sca-fil-rap-100.
      *              *-------------------------------------------------*
      *              * Incremento contatore records scaricati          *
      *              *-------------------------------------------------*
           add       1                    to   w-rlt-sup-ctr          .
      *              *-------------------------------------------------*
      *              * Se maggiore del numero di records caricati  :   *
      *              * uscita                                          *
      *              *-------------------------------------------------*
           if        w-rlt-sup-ctr        >    w-rlt-sup-max
                     go to sca-fil-rap-900.
       sca-fil-rap-150.
      *              *-------------------------------------------------*
      *              * Lettura riga da file relative di supporto       *
      *              *-------------------------------------------------*
           move      "RD"                 to   w-rlt-sup-ope          .
           move      w-rlt-sup-ctr        to   w-rlt-sup-prg          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
           move      w-rlt-sup-buf        to   w-rig                  .
      *              *-------------------------------------------------*
      *              * Se valori attuali come precedenti : riciclo     *
      *              *-------------------------------------------------*
           if        w-rig-val-aep (1)    =    w-rig-val-aep (2)
                     go to sca-fil-rap-100.
       sca-fil-rap-200.
      *              *-------------------------------------------------*
      *              * Lettura, con lock, del record listino           *
      *              *-------------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "LSTPRO    "         to   f-key                  .
           move      03                   to   rf-lst-tip-rec         .
           move      spaces               to   rf-lst-cod-lst         .
           move      zero                 to   rf-lst-cod-cli         .
           move      c-sgl                to   rf-lst-sgl-vlt         .
           move      w-rig-num-pro (1)    to   rf-lst-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to sca-fil-rap-250.
       sca-fil-rap-220.
      *              *-------------------------------------------------*
      *              * Se record listino non esistente                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [lst]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Composizione chiave                         *
      *                  *---------------------------------------------*
           move      03                   to   rf-lst-tip-rec         .
           move      spaces               to   rf-lst-cod-lst         .
           move      zero                 to   rf-lst-cod-cli         .
           move      c-sgl                to   rf-lst-sgl-vlt         .
           move      w-rig-num-pro (1)    to   rf-lst-num-pro         .
      *                  *---------------------------------------------*
      *                  * Scrittura record [lst] normalizzato         *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Riciclo a lettura record [lst]              *
      *                  *---------------------------------------------*
           go to     sca-fil-rap-200.
       sca-fil-rap-250.
      *              *-------------------------------------------------*
      *              * Se record listino esistente                     *
      *              *-------------------------------------------------*
       sca-fil-rap-300.
      *                  *---------------------------------------------*
      *                  * Aggiornamento dati nel record               *
      *                  *---------------------------------------------*
           move      w-rig-prz-lst (1)    to   rf-lst-prz-lst         .
           move      w-rig-cat-pvg (1)    to   rf-lst-cat-pvg         .
           move      w-rig-per-pvg (1, 1) to   rf-lst-per-pvg (1)     .
           move      w-rig-per-pvg (1, 2) to   rf-lst-per-pvg (2)     .
           move      w-rig-per-pvg (1, 3) to   rf-lst-per-pvg (3)     .
           move      w-rig-cat-sco (1)    to   rf-lst-cat-sco         .
           move      w-rig-per-sco (1, 1) to   rf-lst-per-sco (1)     .
           move      w-rig-per-sco (1, 2) to   rf-lst-per-sco (2)     .
           move      w-rig-per-sco (1, 3) to   rf-lst-per-sco (3)     .
           move      w-rig-per-sco (1, 4) to   rf-lst-per-sco (4)     .
           move      w-rig-per-sco (1, 5) to   rf-lst-per-sco (5)     .
           move      w-rig-snx-prz (1)    to   rf-lst-snx-prz         .
           move      w-rig-snx-pvg (1)    to   rf-lst-snx-pvg         .
           move      w-rig-snx-sco (1)    to   rf-lst-snx-sco         .
           move      w-rig-dva-ini (1)    to   rf-lst-dva-ini         .
           move      w-rig-dva-fin (1)    to   rf-lst-dva-fin         .
           move      w-rig-alx-exp (1)    to   rf-lst-alx-exp         .
      *                  *---------------------------------------------*
      *                  * Normalizzazione in caso di Nessuna Prefe-   *
      *                  * renza per il tipo funzionamento prezzi net- *
      *                  * ti concordati per cliente                   *
      *                  *---------------------------------------------*
           if        w-prs-tfu-pcp        =    zero
                     move  "S"            to   rf-lst-snx-prz
                     move  "N"            to   rf-lst-snx-pvg
                     move  "S"            to   rf-lst-snx-sco
                     move  zero           to   rf-lst-cat-pvg
                     move  zero           to   rf-lst-per-pvg (1)
                     move  zero           to   rf-lst-per-pvg (2)
                     move  zero           to   rf-lst-per-pvg (3)     .
       sca-fil-rap-350.
      *                  *---------------------------------------------*
      *                  * Update record                               *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Unlock record                               *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
       sca-fil-rap-375.
      *                  *---------------------------------------------*
      *                  * Write record [lsd], solo se richiesta la    *
      *                  * storicizzazione                             *
      *                  *---------------------------------------------*
           perform   wrt-rec-lsd-000      thru wrt-rec-lsd-999        .
       sca-fil-rap-400.
      *                  *---------------------------------------------*
      *                  * Riciclo a rilettura riga da file relative   *
      *                  * di supporto                                 *
      *                  *---------------------------------------------*
           go to     sca-fil-rap-100.
       sca-fil-rap-900.
      *              *-------------------------------------------------*
      *              * Eliminazione messaggio di aggiornamento in ese- *
      *              * cuzione                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       sca-fil-rap-999.
           exit.

      *    *===========================================================*
      *    * Scrittura record [lsd], solo se richiesta la storicizza-  *
      *    * zione                                                     *
      *    *-----------------------------------------------------------*
       wrt-rec-lsd-000.
      *              *-------------------------------------------------*
      *              * Se non e' stata richiesta la storicizzazione :  *
      *              * uscita senza alcuna azione                      *
      *              *-------------------------------------------------*
           if        w-rig-snx-sto (1)    not  = "S"
                     go to wrt-rec-lsd-999.
       wrt-rec-lsd-100.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflsd"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lsd                 .
       wrt-rec-lsd-200.
      *              *-------------------------------------------------*
      *              * Composizione record                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo record                                 *
      *                  *---------------------------------------------*
           move      03                   to   rf-lsd-tip-rec         .
      *                  *---------------------------------------------*
      *                  * Codice listino alternativo                  *
      *                  *---------------------------------------------*
           move      spaces               to   rf-lsd-cod-lst         .
      *                  *---------------------------------------------*
      *                  * Codice cliente                              *
      *                  *---------------------------------------------*
           move      zero                 to   rf-lsd-cod-cli         .
      *                  *---------------------------------------------*
      *                  * Sigla della valuta                          *
      *                  *---------------------------------------------*
           move      c-sgl                to   rf-lsd-sgl-vlt         .
      *                  *---------------------------------------------*
      *                  * Numero decimali della valuta                *
      *                  *---------------------------------------------*
           move      c-dec                to   rf-lsd-dec-vlt         .
      *                  *---------------------------------------------*
      *                  * Codice prodotto numerico                    *
      *                  *---------------------------------------------*
           move      w-rig-num-pro (2)    to   rf-lsd-num-pro         .
      *                  *---------------------------------------------*
      *                  * Prezzo                                      *
      *                  *---------------------------------------------*
           move      w-rig-prz-lst (2)    to   rf-lsd-prz-lst         .
      *                  *---------------------------------------------*
      *                  * Categoria provvigioni                       *
      *                  *---------------------------------------------*
           move      w-rig-cat-pvg (1)    to   rf-lsd-cat-pvg         .
      *                  *---------------------------------------------*
      *                  * % di provvigione associate direttamente al  *
      *                  * listino                                     *
      *                  *---------------------------------------------*
           move      w-rig-per-pvg (2, 1) to   rf-lsd-per-pvg (1)     .
           move      w-rig-per-pvg (2, 2) to   rf-lsd-per-pvg (2)     .
           move      w-rig-per-pvg (2, 3) to   rf-lsd-per-pvg (3)     .
      *                  *---------------------------------------------*
      *                  * Categoria sconto                            *
      *                  *---------------------------------------------*
           move      w-rig-cat-sco (1)    to   rf-lsd-cat-sco         .
      *                  *---------------------------------------------*
      *                  * % di sconto associate direttamente al li-   *
      *                  * stino                                       *
      *                  *---------------------------------------------*
           move      w-rig-per-sco (2, 1) to   rf-lsd-per-sco (1)     .
           move      w-rig-per-sco (2, 2) to   rf-lsd-per-sco (2)     .
           move      w-rig-per-sco (2, 3) to   rf-lsd-per-sco (3)     .
           move      w-rig-per-sco (2, 4) to   rf-lsd-per-sco (4)     .
           move      w-rig-per-sco (2, 5) to   rf-lsd-per-sco (5)     .
      *                  *---------------------------------------------*
      *                  * Si/no utilizzo del prezzo                   *
      *                  *---------------------------------------------*
           move      w-rig-snx-prz (2)    to   rf-lsd-snx-prz         .
      *                  *---------------------------------------------*
      *                  * Si/no utilizzo delle % di provvigione       *
      *                  *---------------------------------------------*
           move      w-rig-snx-pvg (2)    to   rf-lsd-snx-pvg         .
      *                  *---------------------------------------------*
      *                  * Si/no utilizzo delle % di sconto            *
      *                  *---------------------------------------------*
           move      w-rig-snx-sco (2)    to   rf-lsd-snx-sco         .
      *                  *---------------------------------------------*
      *                  * Data di validita' iniziale                  *
      *                  *---------------------------------------------*
           move      w-rig-dva-ini (2)    to   rf-lsd-dva-ini         .
      *                  *---------------------------------------------*
      *                  * Data di validita' finale                    *
      *                  *---------------------------------------------*
           move      w-rig-dva-fin (2)    to   rf-lsd-dva-fin         .
      *                  *---------------------------------------------*
      *                  * Data di validita' finale in formato 're-    *
      *                  * verse'                                      *
      *                  *---------------------------------------------*
           move      99999999             to   rf-lsd-dvf-rev         .
           if        rf-lsd-dva-fin       not  = zero
                     subtract   19000000  from rf-lsd-dvf-rev
                     subtract   rf-lsd-dva-fin
                                          from rf-lsd-dvf-rev         .
      *                  *---------------------------------------------*
      *                  * Area libera per espansioni speciali         *
      *                  *---------------------------------------------*
           move      w-rig-alx-exp (2)    to   rf-lsd-alx-exp         .
       wrt-rec-lsd-300.
      *              *-------------------------------------------------*
      *              * Put record                                      *
      *              *-------------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflsd"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lsd                 .
       wrt-rec-lsd-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [zos] per [dcp]                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/lzosdcp0.lts"                   .

      *    *===========================================================*
      *    * Routine lettura tabella [zp1]                             *
      *    *-----------------------------------------------------------*
       let-arc-zp1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp1-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice classe a zero                    *
      *              *-------------------------------------------------*
           if        w-let-arc-zp1-cla    =    zero
                     go to let-arc-zp1-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLA    "         to   f-key                  .
           move      w-let-arc-zp1-cla    to   rf-zp1-cod-cla         .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zp1-400.
       let-arc-zp1-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zp1-des-cla       to   w-let-arc-zp1-des      .
           move      rf-zp1-mne-cla       to   w-let-arc-zp1-mne      .
           move      rf-zp1-ult-sud       to   w-let-arc-zp1-sud      .
           move      rf-zp1-sqz-num       to   w-let-arc-zp1-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zp1-999.
       let-arc-zp1-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zp1-flg      .
           move      all   "."            to   w-let-arc-zp1-des      .
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-let-arc-zp1-cla    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edm                to   w-let-arc-zp1-mne      .
           go to     let-arc-zp1-600.
       let-arc-zp1-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp1-des      .
           move      spaces               to   w-let-arc-zp1-mne      .
       let-arc-zp1-600.
           move      zero                 to   w-let-arc-zp1-sud      .
           move      zero                 to   w-let-arc-zp1-sqz      .
       let-arc-zp1-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zp2]                             *
      *    *-----------------------------------------------------------*
       let-arc-zp2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp2-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice gruppo a zero                    *
      *              *-------------------------------------------------*
           if        w-let-arc-zp2-gru    =    zero
                     go to let-arc-zp2-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODGRU    "         to   f-key                  .
           move      w-let-arc-zp2-cla    to   rf-zp2-cod-cla         .
           move      w-let-arc-zp2-gru    to   rf-zp2-cod-gru         .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zp2-400.
       let-arc-zp2-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zp2-des-gru       to   w-let-arc-zp2-des      .
           move      rf-zp2-mne-gru       to   w-let-arc-zp2-mne      .
           move      rf-zp2-ult-sud       to   w-let-arc-zp2-sud      .
           move      rf-zp2-sqz-num       to   w-let-arc-zp2-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zp2-999.
       let-arc-zp2-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zp2-flg      .
           move      all   "."            to   w-let-arc-zp2-des      .
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-let-arc-zp2-gru    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edm                to   w-let-arc-zp2-mne      .
           go to     let-arc-zp2-600.
       let-arc-zp2-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp2-des      .
           move      spaces               to   w-let-arc-zp2-mne      .
       let-arc-zp2-600.
           move      zero                 to   w-let-arc-zp2-sud      .
           move      zero                 to   w-let-arc-zp2-sqz      .
       let-arc-zp2-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zp3]                             *
      *    *-----------------------------------------------------------*
       let-arc-zp3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp3-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice sottogruppo a zero               *
      *              *-------------------------------------------------*
           if        w-let-arc-zp3-sgr    =    zero
                     go to let-arc-zp3-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODSGR    "         to   f-key                  .
           move      w-let-arc-zp3-cla    to   rf-zp3-cod-cla         .
           move      w-let-arc-zp3-gru    to   rf-zp3-cod-gru         .
           move      w-let-arc-zp3-sgr    to   rf-zp3-cod-sgr         .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zp3-400.
       let-arc-zp3-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zp3-des-sgr       to   w-let-arc-zp3-des      .
           move      rf-zp3-mne-sgr       to   w-let-arc-zp3-mne      .
           move      rf-zp3-ult-sud       to   w-let-arc-zp3-sud      .
           move      rf-zp3-sqz-num       to   w-let-arc-zp3-sqz      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zp3-999.
       let-arc-zp3-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zp3-flg      .
           move      all   "."            to   w-let-arc-zp3-des      .
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-let-arc-zp3-sgr    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edm                to   w-let-arc-zp3-mne      .
           go to     let-arc-zp3-600.
       let-arc-zp3-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zp3-des      .
           move      spaces               to   w-let-arc-zp3-mne      .
       let-arc-zp3-600.
           move      zero                 to   w-let-arc-zp3-sud      .
           move      zero                 to   w-let-arc-zp3-sqz      .
       let-arc-zp3-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [zcs]                         *
      *    *-----------------------------------------------------------*
       let-arc-zcs-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zcs-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice sconto a zero                    *
      *              *-------------------------------------------------*
           if        w-let-arc-zcs-cod    =    zero
                     go to let-arc-zcs-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCSC    "         to   f-key                  .
           move      w-let-arc-zcs-tip    to   rf-zcs-tip-csc         .
           move      w-let-arc-zcs-cod    to   rf-zcs-cod-csc         .
           move      "pgm/dcc/fls/ioc/obj/iofzcs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zcs                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zcs-400.
       let-arc-zcs-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zcs-des-csc       to   w-let-arc-zcs-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zcs-999.
       let-arc-zcs-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zcs-flg      .
           move      all   "."            to   w-let-arc-zcs-des      .
           go to     let-arc-zcs-999.
       let-arc-zcs-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zcs-des      .
       let-arc-zcs-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [zpv]                         *
      *    *-----------------------------------------------------------*
       let-arc-zpv-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zpv-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice sconto a zero                    *
      *              *-------------------------------------------------*
           if        w-let-arc-zpv-cod    =    zero
                     go to let-arc-zpv-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCPV    "         to   f-key                  .
           move      w-let-arc-zpv-tip    to   rf-zpv-tip-cpv         .
           move      w-let-arc-zpv-cod    to   rf-zpv-cod-cpv         .
           move      "pgm/age/fls/ioc/obj/iofzpv"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zpv                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zpv-400.
       let-arc-zpv-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zpv-des-cpv       to   w-let-arc-zpv-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zpv-999.
       let-arc-zpv-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zpv-flg      .
           move      all   "."            to   w-let-arc-zpv-des      .
           go to     let-arc-zpv-999.
       let-arc-zpv-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zpv-des      .
       let-arc-zpv-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice filtro ordina-  *
      *    * mento e selezione per file [dcp]                          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/azosdcp0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per accettazione codice prodotto 'dcp'        *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acoddcp0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione categoria di sconto prod.  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acmnzcs3.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice categoria prov- *
      *    * vigioni legate al prodotto                                *
      *    *-----------------------------------------------------------*
           copy      "pgm/age/prg/cpy/acmnzpv2.acs"                   .

      *    *===========================================================*
      *    * Richiamo sottoprogramma per gestione catena righe         *
      *    *-----------------------------------------------------------*
       cll-rlt-sup-000.
           move      "pgm/dcp/prg/obj/pdcp6202"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using w-rlt-sup              .
       cll-rlt-sup-999.
           exit.

      *    *===========================================================*
      *    * Cancellazione sottoprogramma per gestione catena righe    *
      *    *-----------------------------------------------------------*
       cnc-rlt-sup-000.
           move      "pgm/dcp/prg/obj/pdcp6202"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       cnc-rlt-sup-999.
           exit.

