       Identification Division.
       Program-Id.                                 pdcp330a           .
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione ovelay per programma pdcp3300 :  *
      *                                                                *
      *                    Duplicazione di un listino                  *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine qry-rou-pri-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-qry-rou-pri      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste pre esecuzione interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico interrogazione        *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento automatico interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-aut      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di Si/No primo giro di esecuzione            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-prm-gir      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento qry-routine       *
      *        *-------------------------------------------------------*
           05  w-cnt-qry.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-qry-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-liv.
                   15  w-cnt-qry-sav-l05  pic  x(64)                  .
                   15  w-cnt-qry-sav-l04  pic  x(64)                  .
                   15  w-cnt-qry-sav-l03  pic  x(64)                  .
                   15  w-cnt-qry-sav-l02  pic  x(64)                  .
                   15  w-cnt-qry-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Literals                                              *
      *        *-------------------------------------------------------*
           05  w-cnt-lit.
               10  w-cnt-lit-t80          pic  x(80) value all "="    .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [zos]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/azi/fls/rec/rfzos"                          .
      *        *-------------------------------------------------------*
      *        * [lst]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rflst"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [zls]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzls"                          .
      *        *-------------------------------------------------------*
      *        * [zvl]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcc/fls/rec/rfzvl"                          .

      *    *===========================================================*
      *    * Work-area richieste per interrogazione                    *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Listino di origine                                    *
      *        *-------------------------------------------------------*
           05  rr-lor.
      *            *---------------------------------------------------*
      *            * Codice listino                                    *
      *            *---------------------------------------------------*
               10  rr-lor-cod-lst         pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Descrizione listino                               *
      *            *---------------------------------------------------*
               10  rr-lor-des-lst         pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Codice valuta per il listino                      *
      *            *---------------------------------------------------*
               10  rr-lor-cod-vlt         pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Descrizione della valuta                          *
      *            *---------------------------------------------------*
               10  rr-lor-des-vlt         pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Numero decimali della valuta                      *
      *            *---------------------------------------------------*
               10  rr-lor-dec-vlt         pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo di cambio per la valuta                      *
      *            *---------------------------------------------------*
               10  rr-lor-tdc-vlt         pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Coefficiente di cambio per la valuta              *
      *            *---------------------------------------------------*
               10  rr-lor-cdc-vlt         pic  9(06)v9(05)            .
      *        *-------------------------------------------------------*
      *        * Listino di destinazione                               *
      *        *-------------------------------------------------------*
           05  rr-lde.
      *            *---------------------------------------------------*
      *            * Codice listino                                    *
      *            *---------------------------------------------------*
               10  rr-lde-cod-lst         pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Descrizione listino                               *
      *            *---------------------------------------------------*
               10  rr-lde-des-lst         pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Codice valuta per il listino                      *
      *            *---------------------------------------------------*
               10  rr-lde-cod-vlt         pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Descrizione della valuta                          *
      *            *---------------------------------------------------*
               10  rr-lde-des-vlt         pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Numero decimali della valuta                      *
      *            *---------------------------------------------------*
               10  rr-lde-dec-vlt         pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo di cambio per la valuta                      *
      *            *---------------------------------------------------*
               10  rr-lde-tdc-vlt         pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Coefficiente di cambio per la valuta              *
      *            *---------------------------------------------------*
               10  rr-lde-cdc-vlt         pic  9(06)v9(05)            .
      *        *-------------------------------------------------------*
      *        * Codice filtro di selezione                            *
      *        *-------------------------------------------------------*
           05  rr-fso-dcp                 pic  9(08)                  .
           05  rr-fso-dcp-alf redefines
               rr-fso-dcp                 pic  x(08)                  .
           05  rr-fso-dcp-des             pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Si/no duplicazione dei prezzi a zero                  *
      *        *                                                       *
      *        *  - 1 : No                                             *
      *        *  - 2 : Si                                             *
      *        *-------------------------------------------------------*
           05  rr-snd-paz                 pic  9(01)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zls]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zls.
               10  w-let-arc-zls-flg      pic  x(01)                  .
               10  w-let-arc-zls-cod      pic  x(03)                  .
               10  w-let-arc-zls-des      pic  x(20)                  .
               10  w-let-arc-zls-vlt      pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zvl]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zvl.
               10  w-let-arc-zvl-flg      pic  x(01)                  .
               10  w-let-arc-zvl-sgl      pic  x(03)                  .
               10  w-let-arc-zvl-des      pic  x(20)                  .
               10  w-let-arc-zvl-din      pic  x(20)                  .
               10  w-let-arc-zvl-dec      pic  9(01)                  .
               10  w-let-arc-zvl-tdc      pic  x(01)                  .

      *    *===========================================================*
      *    * Work per Let su archivio [zos] per [dcp]                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/lzosdcp0.ltw"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice listino                 *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acodzls0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione coefficiente cambio valuta     *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoecmb0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice filtro selezione e or-  *
      *    * dinamento per file [dcp]                                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/azosdcp0.acl"                   .

      *    *===========================================================*
      *    * Work per salvataggi                                       *
      *    *-----------------------------------------------------------*
       01  w-sav.
      *        *-------------------------------------------------------*
      *        * Work per salvataggi per accettazioni                  *
      *        *-------------------------------------------------------*
           05  w-sav-acc.
      *            *---------------------------------------------------*
      *            * Codice valuta                                     *
      *            *---------------------------------------------------*
               10  w-sav-acc-sgl-vlt      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Numero decimali per la valuta                     *
      *            *---------------------------------------------------*
               10  w-sav-acc-dec-vlt      pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo di coefficiente di cambio per la valuta      *
      *            *---------------------------------------------------*
               10  w-sav-acc-tdc-vlt      pic  9(01)                  .
      *            *---------------------------------------------------*
      *            * Coefficiente di cambio per la valuta              *
      *            *---------------------------------------------------*
               10  w-sav-acc-cdc-vlt      pic  9(06)v9(05)            .
      *        *-------------------------------------------------------*
      *        * Work per salvataggio parametri per ripristino opera-  *
      *        * zione di Start su [lst]                               *
      *        *-------------------------------------------------------*
           05  w-sav-lst.
      *            *---------------------------------------------------*
      *            * Tipo record                                       *
      *            *---------------------------------------------------*
               10  w-sav-lst-tip-rec      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Codice listino                                    *
      *            *---------------------------------------------------*
               10  w-sav-lst-cod-lst      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Codice cliente                                    *
      *            *---------------------------------------------------*
               10  w-sav-lst-cod-cli      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Sigla valuta                                      *
      *            *---------------------------------------------------*
               10  w-sav-lst-sgl-vlt      pic  x(03)                  .
      *            *---------------------------------------------------*
      *            * Codice numerico del prodotto                      *
      *            *---------------------------------------------------*
               10  w-sav-lst-num-pro      pic  9(07)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per determinazione nuovo prezzo di listino sot-  *
      *        * toposto ad eventuali cambi                            *
      *        *-------------------------------------------------------*
           05  w-det-new-prz.
      *            *---------------------------------------------------*
      *            * Vecchio prezzo                                    *
      *            *---------------------------------------------------*
               10  w-det-new-prz-old      pic  9(09)                  .
      *            *---------------------------------------------------*
      *            * Nuovo prezzo                                      *
      *            *---------------------------------------------------*
               10  w-det-new-prz-new      pic  9(09)                  .
               
      *    *===========================================================*
      *    * Work per subroutines di Exp                               *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Si/no duplicazione dei prezzi a zero       *
      *        *-------------------------------------------------------*
           05  w-exp-snd-paz.
               10  w-exp-snd-paz-num      pic  9(02)       value 2    .
               10  w-exp-snd-paz-lun      pic  9(02)       value 02   .
               10  w-exp-snd-paz-tbl.
                   15  filler             pic  x(02) value "No"       .
                   15  filler             pic  x(02) value "Si"       .

      *    *===========================================================*
      *    * Work-area per conversioni rispetto alla valuta base       *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wcvsvlt0.cpw"                   .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Box messaggi di errore                       *
      *        *-------------------------------------------------------*
           05  w-box-msg-err.
               10  w-box-msg-err-msg      pic  x(56)                  .

      *================================================================*
       Linkage Section.
      *================================================================*

      *    *===========================================================*
      *    * Link-area comune per programmi della serie pdcp3300       *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/pdcp3300.pgl"                   .

      ******************************************************************
       Procedure Division                using i-ide
                                               w-ovy-exe
                                               w-top
                                               w-spg
                                               w-prs
                                               w-ref                  .
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Segnale primo giro di esecuzione                *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-prm-gir      .
      *              *-------------------------------------------------*
      *              * Se no richieste : a esecuzione interrogazione   *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-500.
       main-250.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-500.
      *              *-------------------------------------------------*
      *              * Esecuzione sub-program                          *
      *              *-------------------------------------------------*
           perform   exe-sub-pgm-000      thru exe-sub-pgm-999        .
      *              *-------------------------------------------------*
      *              * Se no richieste : a fine programma              *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Test se fine esecuzione da operatore            *
      *              *-------------------------------------------------*
           if        w-cnt-qry-rou-pri    not  = spaces
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Segnale non piu' primo giro di esecuzione       *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-prm-gir      .
      *              *-------------------------------------------------*
      *              * Test se tipo esecuzione ciclico                 *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S" or
                     w-cnt-fun-snx-cic    not  = "S"
                     go to main-750
           else      go to main-250.
       main-750.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "dcp330"             to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      "    DUPLICAZIONE PREZZI TRA LISTINI     "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
      *              *-------------------------------------------------*
      *              * Visualizzazione titolo programma                *
      *              *-------------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No richieste ad utente                       *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No funzionamento ciclico                     *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-cic      .
      *              *-------------------------------------------------*
      *              * Si/No funzionamento automatico                  *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-aut      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice filtro ordina-  *
      *              * mento e selezione per file [dcp]                *
      *              *-------------------------------------------------*
           perform   cod-zos-dcp-opn-000  thru cod-zos-dcp-opn-999    .
      *              *-------------------------------------------------*
      *              * [zos]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofzos"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zos                 .
      *              *-------------------------------------------------*
      *              * Apertura filtro per selezione ed ordinamento    *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [zls]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzls"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zls                 .
      *              *-------------------------------------------------*
      *              * [zvl]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzvl"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zvl                 .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice listino         *
      *              *-------------------------------------------------*
           perform   cod-cod-zls-opn-000  thru cod-cod-zls-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione coefficiente di cambio *
      *              * valuta                                          *
      *              *-------------------------------------------------*
           perform   coe-cmb-vlt-opn-000  thru coe-cmb-vlt-opn-999    .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice filtro ordina- *
      *              * mento e selezione per file [dcp]                *
      *              *-------------------------------------------------*
           perform   cod-zos-dcp-cls-000  thru cod-zos-dcp-cls-999    .
      *              *-------------------------------------------------*
      *              * [zos]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofzos"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zos                 .
      *              *-------------------------------------------------*
      *              * Close filtro per selezione ed ordinamento       *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Cancel del modulo utilizzato                *
      *                  *---------------------------------------------*
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * [zls]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzls"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zls                 .
      *              *-------------------------------------------------*
      *              * [zvl]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcc/fls/ioc/obj/iofzvl"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zvl                 .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice listino        *
      *              *-------------------------------------------------*
           perform   cod-cod-zls-cls-000  thru cod-cod-zls-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione coefficiente di cam-  *
      *              * bio valuta                                      *
      *              *-------------------------------------------------*
           perform   coe-cmb-vlt-cls-000  thru coe-cmb-vlt-cls-999    .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Listino di origine, codice                  *
      *                  *---------------------------------------------*
           perform   acc-lor-cod-lst-000  thru acc-lor-cod-lst-999    .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
       acc-ric-sel-200.
      *                  *---------------------------------------------*
      *                  * Listino di origine, coefficiente di cambio  *
      *                  *---------------------------------------------*
           perform   acc-lor-cdc-vlt-000  thru acc-lor-cdc-vlt-999    .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-100.
       acc-ric-sel-300.
      *                  *---------------------------------------------*
      *                  * Listino di destinazione, codice             *
      *                  *---------------------------------------------*
           perform   acc-lde-cod-lst-000  thru acc-lde-cod-lst-999    .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-200.
       acc-ric-sel-400.
      *                  *---------------------------------------------*
      *                  * Listino di destinazione, coefficiente di    *
      *                  * cambio                                      *
      *                  *---------------------------------------------*
           perform   acc-lde-cdc-vlt-000  thru acc-lde-cdc-vlt-999    .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-300.
       acc-ric-sel-500.
      *                  *---------------------------------------------*
      *                  * Accettazione codice filtro di ordinamento e *
      *                  * selezione per file [dcp]                    *
      *                  *---------------------------------------------*
           perform   acc-fso-dcp-000      thru acc-fso-dcp-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-400.
       acc-ric-sel-600.
      *                  *---------------------------------------------*
      *                  * Si/no duplicazione dei prezzi a zero        *
      *                  *---------------------------------------------*
           perform   acc-snd-paz-000      thru acc-snd-paz-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-500.
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#CNF"               to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else if   v-key                =    "UP  "
                     go to acc-ric-sel-950
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-950.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazioni                         *
      *                      *-----------------------------------------*
           go to     acc-ric-sel-100.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Titoli in alto                                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "                      Listino di origine          
      -              "  Listino di destinazione     "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura titoli in alto                   *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "                   -------------------------      
      -              " -------------------------    "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Titolo laterale per codice listino              *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      14                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice       :"     to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Titolo laterale per codice valuta               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      14                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Valuta       :"     to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Titolo laterale per coefficiente di cambio      *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      14                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Cambio       :"     to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura titoli in basso                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "                   -------------------------      
      -              " -------------------------    "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Codice filtro per selezione ed ordinamento file *
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice filtro di selezione :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "       anagrafica prodotti  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Si/no duplicazione dei prezzi a zero            *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Duplicazione anche dei     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "         prezzi a zero      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Listino di origine, codice           *
      *    *-----------------------------------------------------------*
       acc-lor-cod-lst-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-lor-cod-lst-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-lst-ope      .
           move      rr-lor-cod-lst       to   w-cod-cod-lst-cod      .
           move      08                   to   w-cod-cod-lst-lin      .
           move      20                   to   w-cod-cod-lst-pos      .
           move      spaces               to   v-edm                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   cod-cod-zls-cll-000  thru cod-cod-zls-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-zls-foi-000  thru cod-cod-zls-foi-999    .
       acc-lor-cod-lst-110.
           perform   cod-cod-zls-cll-000  thru cod-cod-zls-cll-999    .
           if        w-cod-cod-lst-ope    =    "F+"
                     go to acc-lor-cod-lst-115.
           if        w-cod-cod-lst-ope    =    "AC"
                     go to acc-lor-cod-lst-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-lor-cod-lst-115.
           perform   cod-cod-zls-foi-000  thru cod-cod-zls-foi-999    .
           go to     acc-lor-cod-lst-110.
       acc-lor-cod-lst-120.
           move      w-cod-cod-lst-cod    to   v-alf                  .
       acc-lor-cod-lst-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-lor-cod-lst-999.
       acc-lor-cod-lst-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-lor-cod-lst         .
       acc-lor-cod-lst-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valori riferiti alla valuta     *
      *                  *---------------------------------------------*
           move      rr-lor-cod-vlt       to   w-sav-acc-sgl-vlt      .
           move      rr-lor-dec-vlt       to   w-sav-acc-dec-vlt      .
           move      rr-lor-tdc-vlt       to   w-sav-acc-tdc-vlt      .
      *                  *---------------------------------------------*
      *                  * Lettura tabella [zls]                       *
      *                  *---------------------------------------------*
           move      rr-lor-cod-lst       to   w-let-arc-zls-cod      .
           perform   let-arc-zls-000      thru let-arc-zls-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione per il codice    *
      *                  * listino                                     *
      *                  *---------------------------------------------*
           move      w-let-arc-zls-des    to   rr-lor-des-lst         .
      *                  *---------------------------------------------*
      *                  * Memorizzazione valuta per il codice listino *
      *                  *---------------------------------------------*
           move      w-let-arc-zls-vlt    to   rr-lor-cod-vlt         .
      *                  *---------------------------------------------*
      *                  * Lettura tabella [zvl]                       *
      *                  *---------------------------------------------*
           move      rr-lor-cod-vlt       to   w-let-arc-zvl-sgl      .
           perform   let-arc-zvl-000      thru let-arc-zvl-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione per la valuta in *
      *                  * lingua italiana                             *
      *                  *---------------------------------------------*
           move      w-let-arc-zvl-des    to   rr-lor-des-vlt         .
      *                  *---------------------------------------------*
      *                  * Memorizzazione numero decimali per la valu- *
      *                  * ta                                          *
      *                  *---------------------------------------------*
           move      w-let-arc-zvl-dec    to   rr-lor-dec-vlt         .
      *                  *---------------------------------------------*
      *                  * Memorizzazione tipo di cambio per la valu-  *
      *                  * ta                                          *
      *                  *---------------------------------------------*
           move      w-let-arc-zvl-tdc    to   rr-lor-tdc-vlt         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione listino         *
      *                  *---------------------------------------------*
           perform   vis-lor-des-lst-000  thru vis-lor-des-lst-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione codice valuta               *
      *                  *---------------------------------------------*
           perform   vis-lor-cod-vlt-000  thru vis-lor-cod-vlt-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione valuta          *
      *                  *---------------------------------------------*
           perform   vis-lor-des-vlt-000  thru vis-lor-des-vlt-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione coefficiente di cambio      *
      *                  *---------------------------------------------*
           perform   vis-lor-cdc-vlt-000  thru vis-lor-cdc-vlt-999    .
      *                  *---------------------------------------------*
      *                  * Se listino non esistente in [zls] : reimpo- *
      *                  * stazione                                    *
      *                  *---------------------------------------------*
           if        w-let-arc-zls-flg    not  = spaces
                     go to acc-lor-cod-lst-100.
      *                  *---------------------------------------------*
      *                  * Se valuta non esistente in [zvl] : reimpo-  *
      *                  * stazione                                    *
      *                  *---------------------------------------------*
           if        w-let-arc-zvl-flg    not  = spaces
                     go to acc-lor-cod-lst-100.
       acc-lor-cod-lst-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-lor-cod-lst-625.
      *                  *---------------------------------------------*
      *                  * Se codice valuta pari alla valuta standard  *
      *                  * si normalizza e si visualizza il coeffi-    *
      *                  * ciente di cambio                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        rr-lor-cod-vlt       not  = c-sgl
                     go to acc-lor-cod-lst-650.
      *                      *-----------------------------------------*
      *                      * Normalizzazione                         *
      *                      *-----------------------------------------*
           move      1                    to   rr-lor-cdc-vlt         .
      *                      *-----------------------------------------*
      *                      * Visualizzazione                         *
      *                      *-----------------------------------------*
           perform   vis-lor-cdc-vlt-000  thru vis-lor-cdc-vlt-999    .
       acc-lor-cod-lst-650.
      *                  *---------------------------------------------*
      *                  * Fine dipendenze                             *
      *                  *---------------------------------------------*
           go to     acc-lor-cod-lst-800.
       acc-lor-cod-lst-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-lor-cod-lst-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-lor-cod-lst-100.
       acc-lor-cod-lst-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Listino di origine, descrizione   *
      *    *-----------------------------------------------------------*
       vis-lor-des-lst-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      25                   to   v-pos                  .
           move      rr-lor-des-lst       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-lor-des-lst-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Listino di origine, valuta        *
      *    *-----------------------------------------------------------*
       vis-lor-cod-vlt-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      20                   to   v-pos                  .
           move      rr-lor-cod-vlt       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-lor-cod-vlt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Listino di origine, descrizione   *
      *    *                         valuta                            *
      *    *-----------------------------------------------------------*
       vis-lor-des-vlt-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      25                   to   v-pos                  .
           move      rr-lor-des-vlt       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-lor-des-vlt-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Listino di origine, coefficiente di  *
      *    *                      cambio                               *
      *    *-----------------------------------------------------------*
       acc-lor-cdc-vlt-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-lor-cdc-vlt-025.
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se la valuta e' pari alla valuta base : *
      *                      * no accettazione                         *
      *                      *-----------------------------------------*
           if        rr-lor-cod-vlt       =    c-sgl
                     go to acc-lor-cdc-vlt-999.
       acc-lor-cdc-vlt-050.
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      rr-lor-cdc-vlt       to   w-sav-acc-cdc-vlt      .
       acc-lor-cdc-vlt-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-coe-cmb-vlt-ope      .
           move      rr-lor-cod-vlt       to   w-coe-cmb-vlt-sdv      .
           move      rr-lor-tdc-vlt       to   w-coe-cmb-vlt-tdc      .    
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-coe-cmb-vlt-drc      .
           move      00                   to   w-coe-cmb-vlt-quc      .
           if        rr-lor-cdc-vlt       =    zero
                     move  "S"            to   w-coe-cmb-vlt-snd
           else      move  "N"            to   w-coe-cmb-vlt-snd      .
           move      rr-lor-cdc-vlt       to   w-coe-cmb-vlt-cdc      .
           move      12                   to   w-coe-cmb-vlt-lin      .
           move      20                   to   w-coe-cmb-vlt-pos      .
           move      12                   to   w-coe-cmb-vlt-dln      .
           move      37                   to   w-coe-cmb-vlt-dps      .
           move      "<GBD"               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   coe-cmb-vlt-cll-000  thru coe-cmb-vlt-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   coe-cmb-vlt-foi-000  thru coe-cmb-vlt-foi-999    .
       acc-lor-cdc-vlt-110.
           perform   coe-cmb-vlt-cll-000  thru coe-cmb-vlt-cll-999    .
           if        w-coe-cmb-vlt-ope    =    "F+"
                     go to acc-lor-cdc-vlt-115.
           if        w-coe-cmb-vlt-ope    =    "AC"
                     go to acc-lor-cdc-vlt-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-lor-cdc-vlt-115.
           perform   coe-cmb-vlt-foi-000  thru coe-cmb-vlt-foi-999    .
           go to     acc-lor-cdc-vlt-110.
       acc-lor-cdc-vlt-120.
           move      w-coe-cmb-vlt-cdc    to   v-num                  .
       acc-lor-cdc-vlt-200.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-lor-cdc-vlt-999.
       acc-lor-cdc-vlt-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-lor-cdc-vlt         .
       acc-lor-cdc-vlt-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore a zero non ammesso, a meno che non   *
      *                  * si sia in Up                                *
      *                  *---------------------------------------------*
           if        rr-lor-cdc-vlt       not  = zero
                     go to acc-lor-cdc-vlt-600.
           if        v-key                =    "UP  "
                     go to acc-lor-cdc-vlt-600
           else      go to acc-lor-cdc-vlt-100.
       acc-lor-cdc-vlt-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-lor-cdc-vlt-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-lor-cdc-vlt-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-lor-cdc-vlt-100.
       acc-lor-cdc-vlt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Listino di origine, coefficiente  *
      *    *                         di cambio                         *
      *    *-----------------------------------------------------------*
       vis-lor-cdc-vlt-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      05                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<GBD"               to   v-edm                  .
           move      12                   to   v-lin                  .
           move      20                   to   v-pos                  .
           if        rr-lor-cod-vlt       =    c-sgl
                     move  zero           to   v-num
           else      move  rr-lor-cdc-vlt to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-lor-cdc-vlt-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Listino di destinazione, codice      *
      *    *-----------------------------------------------------------*
       acc-lde-cod-lst-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-lde-cod-lst-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-lst-ope      .
           move      rr-lde-cod-lst       to   w-cod-cod-lst-cod      .
           move      08                   to   w-cod-cod-lst-lin      .
           move      52                   to   w-cod-cod-lst-pos      .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   cod-cod-zls-cll-000  thru cod-cod-zls-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-zls-foi-000  thru cod-cod-zls-foi-999    .
       acc-lde-cod-lst-110.
           perform   cod-cod-zls-cll-000  thru cod-cod-zls-cll-999    .
           if        w-cod-cod-lst-ope    =    "F+"
                     go to acc-lde-cod-lst-115.
           if        w-cod-cod-lst-ope    =    "AC"
                     go to acc-lde-cod-lst-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-lde-cod-lst-115.
           perform   cod-cod-zls-foi-000  thru cod-cod-zls-foi-999    .
           go to     acc-lde-cod-lst-110.
       acc-lde-cod-lst-120.
           move      w-cod-cod-lst-cod    to   v-alf                  .
       acc-lde-cod-lst-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-lde-cod-lst-999.
       acc-lde-cod-lst-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-lde-cod-lst         .
       acc-lde-cod-lst-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valori riferiti alla valuta     *
      *                  *---------------------------------------------*
           move      rr-lde-cod-vlt       to   w-sav-acc-sgl-vlt      .
           move      rr-lde-dec-vlt       to   w-sav-acc-dec-vlt      .
           move      rr-lde-tdc-vlt       to   w-sav-acc-tdc-vlt      .
      *                  *---------------------------------------------*
      *                  * Lettura tabella [zls]                       *
      *                  *---------------------------------------------*
           move      rr-lde-cod-lst       to   w-let-arc-zls-cod      .
           perform   let-arc-zls-000      thru let-arc-zls-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione per il codice    *
      *                  * listino                                     *
      *                  *---------------------------------------------*
           move      w-let-arc-zls-des    to   rr-lde-des-lst         .
      *                  *---------------------------------------------*
      *                  * Memorizzazione valuta per il codice listino *
      *                  *---------------------------------------------*
           move      w-let-arc-zls-vlt    to   rr-lde-cod-vlt         .
      *                  *---------------------------------------------*
      *                  * Lettura tabella [zvl]                       *
      *                  *---------------------------------------------*
           move      rr-lde-cod-vlt       to   w-let-arc-zvl-sgl      .
           perform   let-arc-zvl-000      thru let-arc-zvl-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione per la valuta in *
      *                  * lingua italiana                             *
      *                  *---------------------------------------------*
           move      w-let-arc-zvl-des    to   rr-lde-des-vlt         .
      *                  *---------------------------------------------*
      *                  * Memorizzazione numero decimali per la valu- *
      *                  * ta                                          *
      *                  *---------------------------------------------*
           move      w-let-arc-zvl-dec    to   rr-lde-dec-vlt         .
      *                  *---------------------------------------------*
      *                  * Memorizzazione tipo di cambio per la valu-  *
      *                  * ta                                          *
      *                  *---------------------------------------------*
           move      w-let-arc-zvl-tdc    to   rr-lde-tdc-vlt         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione listino         *
      *                  *---------------------------------------------*
           perform   vis-lde-des-lst-000  thru vis-lde-des-lst-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione codice valuta               *
      *                  *---------------------------------------------*
           perform   vis-lde-cod-vlt-000  thru vis-lde-cod-vlt-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione valuta          *
      *                  *---------------------------------------------*
           perform   vis-lde-des-vlt-000  thru vis-lde-des-vlt-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione coefficiente di cambio      *
      *                  *---------------------------------------------*
           perform   vis-lde-cdc-vlt-000  thru vis-lde-cdc-vlt-999    .
      *                  *---------------------------------------------*
      *                  * Se listino non esistente in [zls] : reimpo- *
      *                  * stazione                                    *
      *                  *---------------------------------------------*
           if        w-let-arc-zls-flg    not  = spaces
                     go to acc-lde-cod-lst-100.
      *                  *---------------------------------------------*
      *                  * Se valuta non esistente in [zvl] : reimpo-  *
      *                  * stazione                                    *
      *                  *---------------------------------------------*
           if        w-let-arc-zvl-flg    not  = spaces
                     go to acc-lde-cod-lst-100.
       acc-lde-cod-lst-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-lde-cod-lst-625.
      *                  *---------------------------------------------*
      *                  * Se codice valuta pari alla valuta standard  *
      *                  * si normalizza e si visualizza il coeffi-    *
      *                  * ciente di cambio                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        rr-lde-cod-vlt       not  = c-sgl
                     go to acc-lde-cod-lst-650.
      *                      *-----------------------------------------*
      *                      * Normalizzazione                         *
      *                      *-----------------------------------------*
           move      1                    to   rr-lde-cdc-vlt         .
      *                      *-----------------------------------------*
      *                      * Visualizzazione                         *
      *                      *-----------------------------------------*
           perform   vis-lde-cdc-vlt-000  thru vis-lde-cdc-vlt-999    .
       acc-lde-cod-lst-650.
      *                  *---------------------------------------------*
      *                  * Fine dipendenze                             *
      *                  *---------------------------------------------*
           go to     acc-lde-cod-lst-800.
       acc-lde-cod-lst-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-lde-cod-lst-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-lde-cod-lst-100.
       acc-lde-cod-lst-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Listino di destinazione, descri-  *
      *    *                         zione                             *
      *    *-----------------------------------------------------------*
       vis-lde-des-lst-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      57                   to   v-pos                  .
           move      rr-lde-des-lst       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-lde-des-lst-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Listino di destinazione, valuta   *
      *    *-----------------------------------------------------------*
       vis-lde-cod-vlt-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      52                   to   v-pos                  .
           move      rr-lde-cod-vlt       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-lde-cod-vlt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Listino di destinazione, descri-  *
      *    *                         zione valuta                      *
      *    *-----------------------------------------------------------*
       vis-lde-des-vlt-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      57                   to   v-pos                  .
           move      rr-lde-des-vlt       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-lde-des-vlt-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Listino di destinazione, coefficien- *
      *    *                      te di cambio                         *
      *    *-----------------------------------------------------------*
       acc-lde-cdc-vlt-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-lde-cdc-vlt-025.
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se la valuta e' pari alla valuta base : *
      *                      * no accettazione                         *
      *                      *-----------------------------------------*
           if        rr-lde-cod-vlt       =    c-sgl
                     go to acc-lde-cdc-vlt-999.
       acc-lde-cdc-vlt-050.
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      rr-lde-cdc-vlt       to   w-sav-acc-cdc-vlt      .
       acc-lde-cdc-vlt-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-coe-cmb-vlt-ope      .
           move      rr-lde-cod-vlt       to   w-coe-cmb-vlt-sdv      .
           move      rr-lde-tdc-vlt       to   w-coe-cmb-vlt-tdc      .    
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-coe-cmb-vlt-drc      .
           move      00                   to   w-coe-cmb-vlt-quc      .
           if        rr-lde-cdc-vlt       =    zero
                     move  "S"            to   w-coe-cmb-vlt-snd
           else      move  "N"            to   w-coe-cmb-vlt-snd      .
           move      rr-lde-cdc-vlt       to   w-coe-cmb-vlt-cdc      .
           move      12                   to   w-coe-cmb-vlt-lin      .
           move      52                   to   w-coe-cmb-vlt-pos      .
           move      12                   to   w-coe-cmb-vlt-dln      .
           move      69                   to   w-coe-cmb-vlt-dps      .
           move      "<GBD"               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   coe-cmb-vlt-cll-000  thru coe-cmb-vlt-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   coe-cmb-vlt-foi-000  thru coe-cmb-vlt-foi-999    .
       acc-lde-cdc-vlt-110.
           perform   coe-cmb-vlt-cll-000  thru coe-cmb-vlt-cll-999    .
           if        w-coe-cmb-vlt-ope    =    "F+"
                     go to acc-lde-cdc-vlt-115.
           if        w-coe-cmb-vlt-ope    =    "AC"
                     go to acc-lde-cdc-vlt-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-lde-cdc-vlt-115.
           perform   coe-cmb-vlt-foi-000  thru coe-cmb-vlt-foi-999    .
           go to     acc-lde-cdc-vlt-110.
       acc-lde-cdc-vlt-120.
           move      w-coe-cmb-vlt-cdc    to   v-num                  .
       acc-lde-cdc-vlt-200.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-lde-cdc-vlt-999.
       acc-lde-cdc-vlt-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-lde-cdc-vlt         .
       acc-lde-cdc-vlt-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore a zero non ammesso, a meno che non   *
      *                  * si sia in Up                                *
      *                  *---------------------------------------------*
           if        rr-lde-cdc-vlt       not  = zero
                     go to acc-lde-cdc-vlt-600.
           if        v-key                =    "UP  "
                     go to acc-lde-cdc-vlt-600
           else      go to acc-lde-cdc-vlt-100.
       acc-lde-cdc-vlt-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-lde-cdc-vlt-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-lde-cdc-vlt-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-lde-cdc-vlt-100.
       acc-lde-cdc-vlt-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Listino di destinazione, coeffi-  *
      *    *                         ciente di cambio                  *
      *    *-----------------------------------------------------------*
       vis-lde-cdc-vlt-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      05                   to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<GBD"               to   v-edm                  .
           move      12                   to   v-lin                  .
           move      52                   to   v-pos                  .
           if        rr-lde-cod-vlt       =    c-sgl
                     move  zero           to   v-num
           else      move  rr-lde-cdc-vlt to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-lde-cdc-vlt-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Codice filtro per selezio- *
      *    *                                ne ed ordinamento per il   *
      *    *                                file [dcp]                 *
      *    *-----------------------------------------------------------*
       acc-fso-dcp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-fso-dcp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-zos-dcp-ope      .
           move      rr-fso-dcp           to   w-cod-zos-dcp-cod      .
           move      16                   to   w-cod-zos-dcp-lin      .
           move      30                   to   w-cod-zos-dcp-pos      .
           move      16                   to   w-cod-zos-dcp-dln      .
           move      41                   to   w-cod-zos-dcp-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-zos-dcp-cll-000  thru cod-zos-dcp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-zos-dcp-foi-000  thru cod-zos-dcp-foi-999    .
       acc-fso-dcp-110.
           perform   cod-zos-dcp-cll-000  thru cod-zos-dcp-cll-999    .
           if        w-cod-zos-dcp-ope    =    "F+"
                     go to acc-fso-dcp-115.
           if        w-cod-zos-dcp-ope    =    "AC"
                     go to acc-fso-dcp-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-fso-dcp-115.
           perform   cod-zos-dcp-foi-000  thru cod-zos-dcp-foi-999    .
           go to     acc-fso-dcp-110.
       acc-fso-dcp-120.
           move      w-cod-zos-dcp-cod    to   v-num                  .
       acc-fso-dcp-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-fso-dcp-999.
       acc-fso-dcp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-fso-dcp             .
       acc-fso-dcp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura codice filtro selezione e ordina-   *
      *                  * mento per file [dcp]                        *
      *                  *---------------------------------------------*
           move      rr-fso-dcp           to   w-let-fso-dcp-cod      .
           perform   let-fso-dcp-000      thru let-fso-dcp-999        .
           move      w-let-fso-dcp-des    to   rr-fso-dcp-des         .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione filtro          *
      *                  *---------------------------------------------*
           perform   vis-des-fso-000      thru vis-des-fso-999        .
      *                  *---------------------------------------------*
      *                  * Se codice filtro non esistente : a reimpo-  *
      *                  * stazione                                    *
      *                  *---------------------------------------------*
           if        w-let-fso-dcp-flg    not  = spaces
                     go to acc-fso-dcp-100.
       acc-fso-dcp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-fso-dcp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-fso-dcp-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-fso-dcp-100.
       acc-fso-dcp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzaz. campo selezione : Codice filtro per selezio- *
      *    *                                ne ed ordinamento per il   *
      *    *                                file [dcp]                 *
      *    *-----------------------------------------------------------*
       vis-fso-dcp-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      16                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-fso-dcp           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-fso-dcp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzaz. campo selezione : Descrizione codice filtro  *
      *    *                                per selezione ed ordina-   *
      *    *                                mento per il [dcp]         *
      *    *-----------------------------------------------------------*
       vis-des-fso-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      rr-fso-dcp-des       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-des-fso-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Si/no duplicazione dei prezzi a zero *
      *    *-----------------------------------------------------------*
       acc-snd-paz-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione eventuale default              *
      *                  *---------------------------------------------*
           if        rr-snd-paz           =    zero
                     move  1              to   rr-snd-paz             .
       acc-snd-paz-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-snd-paz-lun    to   v-car                  .
           move      w-exp-snd-paz-num    to   v-ldt                  .
           move      "NS#"                to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      19                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-exp-snd-paz-tbl    to   v-txt                  .
           move      rr-snd-paz           to   v-num                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-snd-paz-999.
       acc-snd-paz-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   rr-snd-paz             .
       acc-snd-paz-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore zero non ammesso, a meno che non si  *
      *                  * sia su Up                                   *
      *                  *---------------------------------------------*
           if        rr-snd-paz           not  = zero
                     go to acc-snd-paz-600.
           if        v-key                =    "UP  "
                     go to acc-snd-paz-600
           else      go to acc-snd-paz-100.
       acc-snd-paz-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-snd-paz-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-snd-paz-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-snd-paz-100.
       acc-snd-paz-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-050.
      *              *-------------------------------------------------*
      *              * Controllo su listino di origine                 *
      *              *-------------------------------------------------*
            if       rr-lor-cod-vlt       not  = spaces
                     go to tdo-ric-sel-100.
           move      "Manca il listino di origine !"
                                          to   w-box-msg-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Controllo su coefficiente di cambio per il li-  *
      *              * stino di origine                                *
      *              *-------------------------------------------------*
            if       rr-lor-cdc-vlt       not  = zero
                     go to tdo-ric-sel-150.
           move      "Manca il cambio per il listino di origine !"
                                          to   w-box-msg-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-150.
      *              *-------------------------------------------------*
      *              * Controllo su listino di destinazione            *
      *              *-------------------------------------------------*
            if       rr-lde-cod-vlt       not  = spaces
                     go to tdo-ric-sel-200.
           move      "Manca il listino di destinazione !"
                                          to   w-box-msg-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Controllo su coefficiente di cambio per il li-  *
      *              * stino di destinazione                           *
      *              *-------------------------------------------------*
            if       rr-lde-cdc-vlt       not  = zero
                     go to tdo-ric-sel-250.
           move      "Manca il cambio per il listino di destinazione !"
                                          to   w-box-msg-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-250.
      *              *-------------------------------------------------*
      *              * Controllo che i due listini non siano uguali    *
      *              *-------------------------------------------------*
           if        rr-lor-cod-lst       not  = rr-lde-cod-lst
                     go to tdo-ric-sel-300.
           move      "Un listino non puo' essere duplicato su se stesso 
      -              "!         "         to   w-box-msg-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-300.
      *              *-------------------------------------------------*
      *              * Uscita per controlli superati                   *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Emissione messaggio di errore e set del flag di *
      *              * uscita ad errore                                *
      *              *-------------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di errore in uscita                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-ric-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione eventuale di si/no duplicazione *
      *              * dei prezzi a zero                               *
      *              *-------------------------------------------------*
           if        rr-snd-paz           =    zero
                     move  1              to   rr-snd-paz             .
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
           move      spaces               to   rr-lor-cod-lst         .
           move      spaces               to   rr-lor-des-lst         .
           move      spaces               to   rr-lor-cod-vlt         .
           move      spaces               to   rr-lor-des-vlt         .
           move      zero                 to   rr-lor-dec-vlt         .
           move      spaces               to   rr-lor-tdc-vlt         .
           move      zero                 to   rr-lor-cdc-vlt         .
           move      spaces               to   rr-lde-cod-lst         .
           move      spaces               to   rr-lde-des-lst         .
           move      spaces               to   rr-lde-cod-vlt         .
           move      spaces               to   rr-lde-des-vlt         .
           move      zero                 to   rr-lde-dec-vlt         .
           move      spaces               to   rr-lde-tdc-vlt         .
           move      zero                 to   rr-lde-cdc-vlt         .
           move      zero                 to   rr-fso-dcp             .
           move      spaces               to   rr-fso-dcp-des         .
           move      zero                 to   rr-snd-paz             .
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione sub-program : Duplicazione di un listino       *
      *    *-----------------------------------------------------------*
       exe-sub-pgm-000.
      *              *-------------------------------------------------*
      *              * Messaggio di programma in esecuzione            *
      *              *-------------------------------------------------*
           move      "PE"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-sub-pgm-100.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [dcp]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * [lst]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
       exe-sub-pgm-150.
      *              *-------------------------------------------------*
      *              * Richiesta tipo ordinamento per il filtro [dcp]  *
      *              *-------------------------------------------------*
           move      "TO"                 to   f-ope                  .
           move      rr-fso-dcp-alf       to   f-key                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
       exe-sub-pgm-200.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda delle combinazioni fra i   *
      *              * tipi di listino                                 *
      *              *-------------------------------------------------*
           if        rr-lor-cod-lst       =    spaces   and
                     rr-lde-cod-lst       not  = spaces
                     go to exe-sub-pgm-300
           else if   rr-lor-cod-lst       not  = spaces and
                     rr-lde-cod-lst       =    spaces
                     go to exe-sub-pgm-400
           else if   rr-lor-cod-lst       not  = spaces and
                     rr-lde-cod-lst       not  = spaces
                     go to exe-sub-pgm-500
           else      go to exe-sub-pgm-800.
       exe-sub-pgm-300.
      *              *-------------------------------------------------*
      *              * Listino Base --> Listino alternativo            *
      *              *-------------------------------------------------*
           perform   dup-bas-alt-000      thru dup-bas-alt-999        .
           go to     exe-sub-pgm-800.
       exe-sub-pgm-400.
      *              *-------------------------------------------------*
      *              * Listino alternativo --> Listino Base            *
      *              *-------------------------------------------------*
           perform   dup-alt-bas-000      thru dup-alt-bas-999        .
           go to     exe-sub-pgm-800.
       exe-sub-pgm-500.
      *              *-------------------------------------------------*
      *              * Listino alternativo --> Listino alternativo     *
      *              *-------------------------------------------------*
           perform   dup-alt-alt-000      thru dup-alt-alt-999        .
           go to     exe-sub-pgm-800.
       exe-sub-pgm-800.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [dcp]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * [lst]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
       exe-sub-pgm-900.
       exe-sub-pgm-999.
           exit.

      *    *===========================================================*
      *    * Duplicazione di : Listino Base --> Listino alternativo    *
      *    *-----------------------------------------------------------*
       dup-bas-alt-000.
      *              *-------------------------------------------------*
      *              * Azzeramento preliminare del listino alternativo *
      *              * di destinazione                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se azzeramento da effettuare           *
      *                  *---------------------------------------------*
           if        rr-fso-dcp           not  = zero
                     go to dup-bas-alt-100.
       dup-bas-alt-010.
      *                  *---------------------------------------------*
      *                  * Start su file [lst]                         *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "LSTPRO    "         to   f-key                  .
           move      01                   to   rf-lst-tip-rec         .
           move      rr-lde-cod-lst       to   rf-lst-cod-lst         .
           move      zero                 to   rf-lst-cod-cli         .
           move      rr-lde-cod-vlt       to   rf-lst-sgl-vlt         .
           move      zero                 to   rf-lst-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a duplicazione            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-bas-alt-050.
       dup-bas-alt-020.
      *                  *---------------------------------------------*
      *                  * Get Next su file [lst]                      *
      *                  *---------------------------------------------*
           move      "GN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Se At End : a duplicazione                  *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-bas-alt-050.
       dup-bas-alt-030.
      *                  *---------------------------------------------*
      *                  * Test Max su [lst] ; se fine : ad unlock e a *
      *                  * duplicazione                                *
      *                  *---------------------------------------------*
           if        rf-lst-tip-rec       not  = 01             or
                     rf-lst-cod-lst       not  = rr-lde-cod-lst or
                     rf-lst-cod-cli       not  = zero           or
                     rf-lst-sgl-vlt       not  = rr-lde-cod-vlt
                     go to dup-bas-alt-040.
       dup-bas-alt-032.
      *                  *---------------------------------------------*
      *                  * Selezione sul codice prodotto determinata   *
      *                  * dal filtro di selezione                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura record [dcp]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      rf-lst-num-pro       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                          *-------------------------------------*
      *                          * Se record non trovato : a riciclo   *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-bas-alt-038.
       dup-bas-alt-034.
      *                      *-----------------------------------------*
      *                      * Selezione                               *
      *                      *-----------------------------------------*
           move      "SE"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Se selezione non superata : a riciclo   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-bas-alt-038.
       dup-bas-alt-036.
      *                  *---------------------------------------------*
      *                  * Azzeramento prezzo di listino               *
      *                  *---------------------------------------------*
           move      zero                 to   rf-lst-prz-lst         .
      *                  *---------------------------------------------*
      *                  * Azzeramento provvigioni associate           *
      *                  *---------------------------------------------*
           move      zero                 to   rf-lst-per-pvg (1)     .
           move      zero                 to   rf-lst-per-pvg (2)     .
           move      zero                 to   rf-lst-per-pvg (3)     .
      *                  *---------------------------------------------*
      *                  * Azzeramento sconti associati                *
      *                  *---------------------------------------------*
           move      zero                 to   rf-lst-per-sco (1)     .
           move      zero                 to   rf-lst-per-sco (2)     .
           move      zero                 to   rf-lst-per-sco (3)     .
           move      zero                 to   rf-lst-per-sco (4)     .
           move      zero                 to   rf-lst-per-sco (5)     .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flags                       *
      *                  *---------------------------------------------*
           move      spaces               to   rf-lst-snx-prz         .
           move      spaces               to   rf-lst-snx-pvg         .
           move      spaces               to   rf-lst-snx-sco         .
      *                  *---------------------------------------------*
      *                  * Normalizzazione date di validita'           *
      *                  *---------------------------------------------*
           move      zero                 to   rf-lst-dva-ini         .
           move      zero                 to   rf-lst-dva-fin         .
      *                  *---------------------------------------------*
      *                  * Normalizzazione area libera per espansioni  *
      *                  *---------------------------------------------*
           move      spaces               to   rf-lst-alx-exp         .
      *                  *---------------------------------------------*
      *                  * Update record [lst]                         *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
       dup-bas-alt-038.
      *                  *---------------------------------------------*
      *                  * Release record [lst]                        *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Riciclo su Get Next su file [lst]           *
      *                  *---------------------------------------------*
           go to     dup-bas-alt-020.
       dup-bas-alt-040.
      *                  *---------------------------------------------*
      *                  * Release record [lst]                        *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
       dup-bas-alt-050.
      *                  *---------------------------------------------*
      *                  * A duplicazione                              *
      *                  *---------------------------------------------*
           go to     dup-bas-alt-100.
       dup-bas-alt-100.
      *              *-------------------------------------------------*
      *              * Duplicazione vera e propria                     *
      *              *-------------------------------------------------*
       dup-bas-alt-200.
      *                  *---------------------------------------------*
      *                  * Start filtro di ordinamento e selezione per *
      *                  * file [dcp]                                  *
      *                  *---------------------------------------------*
           move      "ST"                 to   f-ope                  .
           move      rr-fso-dcp           to   f-key                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-bas-alt-999.
       dup-bas-alt-300.
      *              *-------------------------------------------------*
      *              * Read Next filtro di ordinamento e selezione per *
      *              * file [dcp]                                      *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se At End : uscita                          *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-bas-alt-999.
       dup-bas-alt-350.
      *              *-------------------------------------------------*
      *              * Selezioni sul record                            *
      *              *-------------------------------------------------*
       dup-bas-alt-360.
      *                      *-----------------------------------------*
      *                      * Se prezzo pari a zero : selezione in    *
      *                      * base alle richieste                     *
      *                      *-----------------------------------------*
           if        rr-snd-paz           not  = 2
                     go to dup-bas-alt-364.
       dup-bas-alt-362.
      *                          *-------------------------------------*
      *                          * Se duplicazione anche dei prezzi a  *
      *                          * zero                                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * A selezione successiva          *
      *                              *---------------------------------*
           go to     dup-bas-alt-380.
       dup-bas-alt-364.
      *                          *-------------------------------------*
      *                          * Se non duplicazione dei prezzi a    *
      *                          * zero                                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Test                            *
      *                              *---------------------------------*
           if        rf-dcp-prz-lst       =    zero
                     go to dup-bas-alt-700.
       dup-bas-alt-380.
      *                  *---------------------------------------------*
      *                  * Se sigla valuta diversa da quanto ci si     *
      *                  * aspetta : no selezione                      *
      *                  *---------------------------------------------*
           if        rf-dcp-sgl-vlt       not  = rr-lor-cod-vlt
                     go to dup-bas-alt-700.
      *                  *---------------------------------------------*
      *                  * Se numero decimali valuta diversi da quanto *
      *                  * ci si aspetta : no selezione                *
      *                  *---------------------------------------------*
           if        rf-dcp-dec-vlt       not  = rr-lor-dec-vlt
                     go to dup-bas-alt-700.
       dup-bas-alt-400.
      *              *-------------------------------------------------*
      *              * Determinazione prezzo di listino in campo       *
      *              * w-det-new-prz-new, per sottoposizione al cambio *
      *              *-------------------------------------------------*
           move      rf-dcp-prz-lst       to   w-det-new-prz-old      .
           perform   det-new-prz-000      thru det-new-prz-999        .
       dup-bas-alt-450.
      *                  *---------------------------------------------*
      *                  * Lettura record da listino di destinazione,  *
      *                  * con lock                                    *
      *                  *---------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "LSTPRO    "         to   f-key                  .
           move      01                   to   rf-lst-tip-rec         .
           move      rr-lde-cod-lst       to   rf-lst-cod-lst         .
           move      zero                 to   rf-lst-cod-cli         .
           move      rr-lde-cod-vlt       to   rf-lst-sgl-vlt         .
           move      rf-dcp-num-pro       to   rf-lst-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito della let-  *
      *                  * tura                                        *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-bas-alt-600.
       dup-bas-alt-500.
      *                  *---------------------------------------------*
      *                  * Se record esistente                         *
      *                  *---------------------------------------------*
       dup-bas-alt-510.
      *                      *-----------------------------------------*
      *                      * Aggiornamento numero decimali valuta    *
      *                      *-----------------------------------------*
           move      rr-lde-dec-vlt       to   rf-lst-dec-vlt         .
      *                      *-----------------------------------------*
      *                      * Aggiornamento nuovo prezzo              *
      *                      *-----------------------------------------*
           move      w-det-new-prz-new    to   rf-lst-prz-lst         .
       dup-bas-alt-520.
      *                      *-----------------------------------------*
      *                      * Update del record                       *
      *                      *-----------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
       dup-bas-alt-530.
      *                      *-----------------------------------------*
      *                      * Unlock del record                       *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
       dup-bas-alt-540.
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     dup-bas-alt-700.
       dup-bas-alt-600.
      *                  *---------------------------------------------*
      *                  * Se record non esistente                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [lst]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                      *-----------------------------------------*
      *                      * Composizione record [lst]               *
      *                      *-----------------------------------------*
           move      01                   to   rf-lst-tip-rec         .
           move      rr-lde-cod-lst       to   rf-lst-cod-lst         .
           move      zero                 to   rf-lst-cod-cli         .
           move      rr-lde-cod-vlt       to   rf-lst-sgl-vlt         .
           move      rr-lde-dec-vlt       to   rf-lst-dec-vlt         .
           move      rf-dcp-num-pro       to   rf-lst-num-pro         .
           move      w-det-new-prz-new    to   rf-lst-prz-lst         .
           move      zero                 to   rf-lst-per-pvg (1)     .
           move      zero                 to   rf-lst-per-pvg (2)     .
           move      zero                 to   rf-lst-per-pvg (3)     .
           move      zero                 to   rf-lst-per-sco (1)     .
           move      zero                 to   rf-lst-per-sco (2)     .
           move      zero                 to   rf-lst-per-sco (3)     .
           move      zero                 to   rf-lst-per-sco (4)     .
           move      zero                 to   rf-lst-per-sco (5)     .
           move      spaces               to   rf-lst-snx-prz         .
           move      spaces               to   rf-lst-snx-pvg         .
           move      spaces               to   rf-lst-snx-sco         .
           move      zero                 to   rf-lst-dva-ini         .
           move      zero                 to   rf-lst-dva-fin         .
           move      spaces               to   rf-lst-alx-exp         .
      *                      *-----------------------------------------*
      *                      * Force Put su [lst]                      *
      *                      *-----------------------------------------*
           move      "FP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     dup-bas-alt-700.
       dup-bas-alt-700.
      *                  *---------------------------------------------*
      *                  * Riciclo su lettura sequenziale file [dcp]   *
      *                  *---------------------------------------------*
           go to     dup-bas-alt-300.
       dup-bas-alt-999.
           exit.

      *    *===========================================================*
      *    * Duplicazione di : Listino alternativo --> Listino Base    *
      *    *-----------------------------------------------------------*
       dup-alt-bas-000.
      *              *-------------------------------------------------*
      *              * Start su file [lst]                             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "LSTPRO    "         to   f-key                  .
           move      01                   to   rf-lst-tip-rec         .
           move      rr-lor-cod-lst       to   rf-lst-cod-lst         .
           move      zero                 to   rf-lst-cod-cli         .
           move      rr-lor-cod-vlt       to   rf-lst-sgl-vlt         .
           move      zero                 to   rf-lst-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-bas-999.
       dup-alt-bas-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [lst]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *              *-------------------------------------------------*
      *              * Se At End : uscita                              *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-bas-999.
       dup-alt-bas-200.
      *              *-------------------------------------------------*
      *              * Test Max                                        *
      *              *-------------------------------------------------*
           if        rf-lst-tip-rec       not  = 01             or
                     rf-lst-cod-lst       not  = rr-lor-cod-lst or
                     rf-lst-cod-cli       not  = zero           or
                     rf-lst-sgl-vlt       not  = rr-lor-cod-vlt
                     go to dup-alt-bas-999.
       dup-alt-bas-300.
      *              *-------------------------------------------------*
      *              * Selezione sul record                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Selezione su codice prodotto determinata    *
      *                  * dal filtro di selezione                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura record [dcp]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      rf-lst-num-pro       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                          *-------------------------------------*
      *                          * Se record non trovato : a riciclo   *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-bas-700.
      *                      *-----------------------------------------*
      *                      * Selezione                               *
      *                      *-----------------------------------------*
           move      "SE"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Se selezione non superata : a riciclo   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-bas-700.
       dup-alt-bas-330.
      *                  *---------------------------------------------*
      *                  * Se sigla valuta diversa da quanto ci si a-  *
      *                  * spetta : no selezione                       *
      *                  *---------------------------------------------*
           if        rf-lst-sgl-vlt       not  = rr-lor-cod-vlt
                     go to dup-alt-bas-700.
      *                  *---------------------------------------------*
      *                  * Se numero decimali valuta diversi da quanto *
      *                  * ci si aspetta : no selezione                *
      *                  *---------------------------------------------*
           if        rf-lst-dec-vlt       not  = rr-lor-dec-vlt
                     go to dup-alt-bas-700.
       dup-alt-bas-350.
      *                  *---------------------------------------------*
      *                  * Determinazione prezzo di listino in campo   *
      *                  * w-det-new-prz-new, per sottoposizione al    *
      *                  * cambio                                      *
      *                  *---------------------------------------------*
           move      rf-lst-prz-lst       to   w-det-new-prz-old      .
           perform   det-new-prz-000      thru det-new-prz-999        .
       dup-alt-bas-400.
      *              *-------------------------------------------------*
      *              * Lettura record [dcp], con lock                  *
      *              *-------------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      rf-lst-num-pro       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell' esito operazione     *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-bas-600.
       dup-alt-bas-500.
      *              *-------------------------------------------------*
      *              * Se record [dcp] esistente                       *
      *              *-------------------------------------------------*
       dup-alt-bas-525.
      *                  *---------------------------------------------*
      *                  * Controllo che sigla valuta e numero decima- *
      *                  * li valuta combacino con quanto espresso nel *
      *                  * record del listino alternativo, e devia-    *
      *                  * zione in base al risultato                  *
      *                  *---------------------------------------------*
           if        rf-dcp-sgl-vlt       =    rf-lst-sgl-vlt and
                     rf-dcp-dec-vlt       =    rf-lst-dec-vlt
                     go to dup-alt-bas-575.
       dup-alt-bas-550.
      *                  *---------------------------------------------*
      *                  * Se sigla valuta o numero decimali valuta    *
      *                  * non combaciano                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Unlock record [dcp]                     *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Continuazione senza aggiornamento       *
      *                      *-----------------------------------------*
           go to     dup-alt-bas-700.
       dup-alt-bas-575.
      *                  *---------------------------------------------*
      *                  * Se sigla valuta e numero decimali valuta    *
      *                  * combaciano                                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Identificativi                          *
      *                      *-----------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   rf-dcp-ide-dat         .
           move      s-ute                to   rf-dcp-ide-ute         .
           move      s-fas                to   rf-dcp-ide-fas         .
      *                      *-----------------------------------------*
      *                      * Aggiornamento nuovo prezzo              *
      *                      *-----------------------------------------*
           move      w-det-new-prz-new    to   rf-dcp-prz-lst         .
      *                      *-----------------------------------------*
      *                      * Update record [dcp]                     *
      *                      *-----------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Unlock record [dcp]                     *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     dup-alt-bas-700.
       dup-alt-bas-600.
      *              *-------------------------------------------------*
      *              * Se record [dcp] non esistente                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione senza aggiornamento           *
      *                  *---------------------------------------------*
           go to     dup-alt-bas-700.
       dup-alt-bas-700.
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale file [lst]       *
      *              *-------------------------------------------------*
           go to     dup-alt-bas-100.
       dup-alt-bas-999.
           exit.

      *    *===========================================================*
      *    * Duplicazione di : Listino alternativo --> Listino alter-  *
      *    *                   nativo                                  *
      *    *-----------------------------------------------------------*
       dup-alt-alt-000.
      *              *-------------------------------------------------*
      *              * Azzeramento preliminare del listino alternativo *
      *              * di destinazione                                 *
      *              *-------------------------------------------------*
       dup-alt-alt-010.
      *                  *---------------------------------------------*
      *                  * Start su file [lst]                         *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "LSTPRO    "         to   f-key                  .
           move      01                   to   rf-lst-tip-rec         .
           move      rr-lde-cod-lst       to   rf-lst-cod-lst         .
           move      zero                 to   rf-lst-cod-cli         .
           move      rr-lde-cod-vlt       to   rf-lst-sgl-vlt         .
           move      zero                 to   rf-lst-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : a duplicazione            *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-alt-050.
       dup-alt-alt-020.
      *                  *---------------------------------------------*
      *                  * Get Next su file [lst]                      *
      *                  *---------------------------------------------*
           move      "GN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Se At End : ad unlock e duplicazione        *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-alt-040.
       dup-alt-alt-030.
      *                  *---------------------------------------------*
      *                  * Test Max su [lst] ; se fine : ad unlock e a *
      *                  * duplicazione                                *
      *                  *---------------------------------------------*
           if        rf-lst-tip-rec       not  = 01             or
                     rf-lst-cod-lst       not  = rr-lde-cod-lst or
                     rf-lst-cod-cli       not  = zero           or
                     rf-lst-sgl-vlt       not  = rr-lde-cod-vlt
                     go to dup-alt-alt-040.
       dup-alt-alt-032.
      *                  *---------------------------------------------*
      *                  * Selezione sul codice prodotto determinata   *
      *                  * dal filtro di selezione                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura record [dcp]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      rf-lst-num-pro       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                          *-------------------------------------*
      *                          * Se record non trovato : a riciclo   *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-alt-038.
       dup-alt-alt-034.
      *                      *-----------------------------------------*
      *                      * Selezione                               *
      *                      *-----------------------------------------*
           move      "SE"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Se selezione non superata : a riciclo   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-alt-038.
       dup-alt-alt-036.
      *                  *---------------------------------------------*
      *                  * Azzeramento prezzo di listino               *
      *                  *---------------------------------------------*
           move      zero                 to   rf-lst-prz-lst         .
      *                  *---------------------------------------------*
      *                  * Azzeramento provvigioni associate           *
      *                  *---------------------------------------------*
           move      zero                 to   rf-lst-per-pvg (1)     .
           move      zero                 to   rf-lst-per-pvg (2)     .
           move      zero                 to   rf-lst-per-pvg (3)     .
      *                  *---------------------------------------------*
      *                  * Azzeramento sconti associati                *
      *                  *---------------------------------------------*
           move      zero                 to   rf-lst-per-sco (1)     .
           move      zero                 to   rf-lst-per-sco (2)     .
           move      zero                 to   rf-lst-per-sco (3)     .
           move      zero                 to   rf-lst-per-sco (4)     .
           move      zero                 to   rf-lst-per-sco (5)     .
      *                  *---------------------------------------------*
      *                  * Normalizzazione flags                       *
      *                  *---------------------------------------------*
           move      spaces               to   rf-lst-snx-prz         .
           move      spaces               to   rf-lst-snx-pvg         .
           move      spaces               to   rf-lst-snx-sco         .
      *                  *---------------------------------------------*
      *                  * Normalizzazione date di validita'           *
      *                  *---------------------------------------------*
           move      zero                 to   rf-lst-dva-ini         .
           move      zero                 to   rf-lst-dva-fin         .
      *                  *---------------------------------------------*
      *                  * Normalizzazione area libera per espansioni  *
      *                  *---------------------------------------------*
           move      spaces               to   rf-lst-alx-exp         .
      *                  *---------------------------------------------*
      *                  * Update record [lst]                         *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
       dup-alt-alt-038.
      *                  *---------------------------------------------*
      *                  * Release record [lst]                        *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Riciclo su Get Next su file [lst]           *
      *                  *---------------------------------------------*
           go to     dup-alt-alt-020.
       dup-alt-alt-040.
      *                  *---------------------------------------------*
      *                  * Release record [lst]                        *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
       dup-alt-alt-050.
      *                  *---------------------------------------------*
      *                  * A duplicazione                              *
      *                  *---------------------------------------------*
           go to     dup-alt-alt-100.
       dup-alt-alt-100.
      *              *-------------------------------------------------*
      *              * Duplicazione vera e propria                     *
      *              *-------------------------------------------------*
       dup-alt-alt-200.
      *                  *---------------------------------------------*
      *                  * Start su file [lst] di origine              *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "LSTPRO    "         to   f-key                  .
           move      01                   to   rf-lst-tip-rec         .
           move      rr-lor-cod-lst       to   rf-lst-cod-lst         .
           move      zero                 to   rf-lst-cod-cli         .
           move      rr-lor-cod-vlt       to   rf-lst-sgl-vlt         .
           move      zero                 to   rf-lst-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-alt-999.
       dup-alt-alt-300.
      *                  *---------------------------------------------*
      *                  * Lettura sequenziale file [lst] di origine   *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Se At End : uscita                          *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-alt-999.
      *                  *---------------------------------------------*
      *                  * Test Max                                    *
      *                  *---------------------------------------------*
           if        rf-lst-tip-rec       not  = 01             or
                     rf-lst-cod-lst       not  = rr-lor-cod-lst or
                     rf-lst-cod-cli       not  = zero           or
                     rf-lst-sgl-vlt       not  = rr-lor-cod-vlt
                     go to dup-alt-alt-999.
       dup-alt-alt-325.
      *                  *---------------------------------------------*
      *                  * Salvataggio parametri per operazione di ri- *
      *                  * pristino Start su [lst] di origine          *
      *                  *---------------------------------------------*
           move      rf-lst-tip-rec       to   w-sav-lst-tip-rec      .
           move      rf-lst-cod-lst       to   w-sav-lst-cod-lst      .
           move      rf-lst-cod-cli       to   w-sav-lst-cod-cli      .
           move      rf-lst-sgl-vlt       to   w-sav-lst-sgl-vlt      .
           move      rf-lst-num-pro       to   w-sav-lst-num-pro      .
       dup-alt-alt-350.
      *                  *---------------------------------------------*
      *                  * Selezione su codice prodotto determinata    *
      *                  * dal filtro di selezione                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura record [dcp]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      rf-lst-num-pro       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                          *-------------------------------------*
      *                          * Se record non trovato : a riciclo   *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-alt-800.
      *                      *-----------------------------------------*
      *                      * Selezione                               *
      *                      *-----------------------------------------*
           move      "SE"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                      *-----------------------------------------*
      *                      * Se selezione non superata : a riciclo   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-alt-800.
       dup-alt-alt-360.
      *                      *-----------------------------------------*
      *                      * Se prezzo pari a zero : selezione in    *
      *                      * base alle richieste                     *
      *                      *-----------------------------------------*
           if        rr-snd-paz           not  = 2
                     go to dup-alt-alt-364.
       dup-alt-alt-362.
      *                          *-------------------------------------*
      *                          * Se duplicazione anche dei prezzi a  *
      *                          * zero                                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * A selezione successiva          *
      *                              *---------------------------------*
           go to     dup-alt-alt-380.
       dup-alt-alt-364.
      *                          *-------------------------------------*
      *                          * Se non duplicazione dei prezzi a    *
      *                          * zero                                *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Test                            *
      *                              *---------------------------------*
           if        rf-lst-prz-lst       =    zero
                     go to dup-alt-alt-800.
       dup-alt-alt-380.
      *                      *-----------------------------------------*
      *                      * Se sigla valuta diversa da quanto ci si *
      *                      * aspetta : no selezione, a riciclo senza *
      *                      * ripristino Start                        *
      *                      *-----------------------------------------*
           if        rf-lst-sgl-vlt       not  = rr-lor-cod-vlt
                     go to dup-alt-alt-800.
      *                      *-----------------------------------------*
      *                      * Se numero decimali valuta diversi da    *
      *                      * quanto ci si aspetta : no selezione,    *
      *                      * a riciclo senza ripristino Start        *
      *                      *-----------------------------------------*
           if        rf-lst-dec-vlt       not  = rr-lor-dec-vlt
                     go to dup-alt-alt-800.
       dup-alt-alt-400.
      *                  *---------------------------------------------*
      *                  * Determinazione prezzo di listino in campo   *
      *                  * w-det-new-prz-new, per sottoposizione al    *
      *                  * cambio                                      *
      *                  *---------------------------------------------*
           move      rf-lst-prz-lst       to   w-det-new-prz-old      .
           perform   det-new-prz-000      thru det-new-prz-999        .
       dup-alt-alt-450.
      *                  *---------------------------------------------*
      *                  * Lettura record da listino di destinazione,  *
      *                  * con lock                                    *
      *                  *---------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "LSTPRO    "         to   f-key                  .
           move      01                   to   rf-lst-tip-rec         .
           move      rr-lde-cod-lst       to   rf-lst-cod-lst         .
           move      zero                 to   rf-lst-cod-cli         .
           move      rr-lde-cod-vlt       to   rf-lst-sgl-vlt         .
           move      w-sav-lst-num-pro    to   rf-lst-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'esito della let-  *
      *                  * tura                                        *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-alt-600.
       dup-alt-alt-500.
      *                  *---------------------------------------------*
      *                  * Se record [lst] di destinazione esistente   *
      *                  *---------------------------------------------*
       dup-alt-alt-510.
      *                      *-----------------------------------------*
      *                      * Aggiornamento numero decimali valuta    *
      *                      *-----------------------------------------*
           move      rr-lde-dec-vlt       to   rf-lst-dec-vlt         .
      *                      *-----------------------------------------*
      *                      * Aggiornamento nuovo prezzo              *
      *                      *-----------------------------------------*
           move      w-det-new-prz-new    to   rf-lst-prz-lst         .
       dup-alt-alt-520.
      *                      *-----------------------------------------*
      *                      * Update del record                       *
      *                      *-----------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
       dup-alt-alt-530.
      *                      *-----------------------------------------*
      *                      * Unlock del record                       *
      *                      *-----------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
       dup-alt-alt-540.
      *                      *-----------------------------------------*
      *                      * Continuazione con ripristino Start      *
      *                      *-----------------------------------------*
           go to     dup-alt-alt-700.
       dup-alt-alt-600.
      *                  *---------------------------------------------*
      *                  * Se record [lst] di destinazione non esi-    *
      *                  * stente                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [lst] di desti-  *
      *                      * nazione                                 *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                      *-----------------------------------------*
      *                      * Composizione record [lst] di destina-   *
      *                      * zione                                   *
      *                      *-----------------------------------------*
           move      01                   to   rf-lst-tip-rec         .
           move      rr-lde-cod-lst       to   rf-lst-cod-lst         .
           move      zero                 to   rf-lst-cod-cli         .
           move      rr-lde-cod-vlt       to   rf-lst-sgl-vlt         .
           move      rr-lde-dec-vlt       to   rf-lst-dec-vlt         .
           move      w-sav-lst-num-pro    to   rf-lst-num-pro         .
           move      w-det-new-prz-new    to   rf-lst-prz-lst         .
           move      zero                 to   rf-lst-per-pvg (1)     .
           move      zero                 to   rf-lst-per-pvg (2)     .
           move      zero                 to   rf-lst-per-pvg (3)     .
           move      zero                 to   rf-lst-per-sco (1)     .
           move      zero                 to   rf-lst-per-sco (2)     .
           move      zero                 to   rf-lst-per-sco (3)     .
           move      zero                 to   rf-lst-per-sco (4)     .
           move      zero                 to   rf-lst-per-sco (5)     .
           move      spaces               to   rf-lst-snx-prz         .
           move      spaces               to   rf-lst-snx-pvg         .
           move      spaces               to   rf-lst-snx-sco         .
           move      zero                 to   rf-lst-dva-ini         .
           move      zero                 to   rf-lst-dva-fin         .
           move      spaces               to   rf-lst-alx-exp         .
      *                      *-----------------------------------------*
      *                      * Force Put su [lst] di destinazione      *
      *                      *-----------------------------------------*
           move      "FP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                      *-----------------------------------------*
      *                      * Continuazione con ripristino Start      *
      *                      *-----------------------------------------*
           go to     dup-alt-alt-700.
       dup-alt-alt-700.
      *                  *---------------------------------------------*
      *                  * Ripristino Start su [lst] di origine        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Start su [lst] di origine               *
      *                      *-----------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "GT"                 to   f-cfr                  .
           move      "LSTPRO    "         to   f-key                  .
           move      w-sav-lst-tip-rec    to   rf-lst-tip-rec         .
           move      w-sav-lst-cod-lst    to   rf-lst-cod-lst         .
           move      w-sav-lst-cod-cli    to   rf-lst-cod-cli         .
           move      w-sav-lst-sgl-vlt    to   rf-lst-sgl-vlt         .
           move      w-sav-lst-num-pro    to   rf-lst-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/ioflst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-lst                 .
      *                      *-----------------------------------------*
      *                      * Se Start errata : uscita                *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to dup-alt-alt-999.
       dup-alt-alt-800.
      *                  *---------------------------------------------*
      *                  * Riciclo su lettura sequenziale file [lst]   *
      *                  * di origine                                  *
      *                  *---------------------------------------------*
           go to     dup-alt-alt-300.
       dup-alt-alt-999.
           exit.

      *    *===========================================================*
      *    * Determinazione nuovo prezzo di listino, per sottoposizio- *
      *    * ne al cambio                                              *
      *    *-----------------------------------------------------------*
       det-new-prz-000.
      *              *-------------------------------------------------*
      *              * Cambio dalla valuta di origine alla valuta base *
      *              *-------------------------------------------------*
           move      rr-lor-cod-vlt       to   w-cvs-vlt-sgl          .
           move      rr-lor-dec-vlt       to   w-cvs-vlt-dec          .
           move      rr-lor-tdc-vlt       to   w-cvs-vlt-tdc          .
           move      rr-lor-cdc-vlt       to   w-cvs-vlt-cdc          .
           move      w-det-new-prz-old    to   w-cvs-vlt-aav          .
           perform   cvs-alt-vlb-000      thru cvs-alt-vlb-999        .
      *              *-------------------------------------------------*
      *              * Cambio dalla valuta base alla valuta di desti-  *
      *              * nazione                                         *
      *              *-------------------------------------------------*
           move      rr-lde-cod-vlt       to   w-cvs-vlt-sgl          .
           move      rr-lde-dec-vlt       to   w-cvs-vlt-dec          .
           move      rr-lde-tdc-vlt       to   w-cvs-vlt-tdc          .
           move      rr-lde-cdc-vlt       to   w-cvs-vlt-cdc          .
           perform   cvs-vlb-alt-000      thru cvs-vlb-alt-999        .
      *              *-------------------------------------------------*
      *              * Memorizzazione del risultato                    *
      *              *-------------------------------------------------*
           move      w-cvs-vlt-aav        to   w-det-new-prz-new      .
       det-new-prz-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zls]                             *
      *    *-----------------------------------------------------------*
       let-arc-zls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zls-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice listino a Spaces                 *
      *              *-------------------------------------------------*
           if        w-let-arc-zls-cod    not  = spaces
                     go to let-arc-zls-400.
       let-arc-zls-200.
      *              *-------------------------------------------------*
      *              * Se codice listino a Spaces                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Descrizione listino                         *
      *                  *---------------------------------------------*
           move      "Listino Base        "
                                          to   w-let-arc-zls-des      .
      *                  *---------------------------------------------*
      *                  * Valuta per il listino, valuta base          *
      *                  *---------------------------------------------*
           move      c-sgl                to   w-let-arc-zls-vlt      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-zls-999.
       let-arc-zls-400.
      *              *-------------------------------------------------*
      *              * Se codice listino a non Spaces                  *
      *              *-------------------------------------------------*
       let-arc-zls-450.
      *                  *---------------------------------------------*
      *                  * Lettura per codice                          *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODLST    "         to   f-key                  .
           move      w-let-arc-zls-cod    to   rf-zls-cod-lst         .
           move      "pgm/dcp/fls/ioc/obj/iofzls"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zls                 .
      *                  *---------------------------------------------*
      *                  * Deviazione secondo l'esito della lettura    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-zls-550.
       let-arc-zls-500.
      *                  *---------------------------------------------*
      *                  * Se record esistente                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Descrizione listino                     *
      *                      *-----------------------------------------*
           move      rf-zls-des-lst       to   w-let-arc-zls-des      .
      *                      *-----------------------------------------*
      *                      * Valuta per il listino                   *
      *                      *-----------------------------------------*
           move      rf-zls-cod-vlt       to   w-let-arc-zls-vlt      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-zls-999.
       let-arc-zls-550.
      *                  *---------------------------------------------*
      *                  * Se record non esistente                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di uscita ad errore                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-let-arc-zls-flg      .
      *                      *-----------------------------------------*
      *                      * Descrizione listino                     *
      *                      *-----------------------------------------*
           move      all   "."            to   w-let-arc-zls-des      .
      *                      *-----------------------------------------*
      *                      * Valuta per il listino                   *
      *                      *-----------------------------------------*
           move      spaces               to   w-let-arc-zls-vlt      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-zls-999.
       let-arc-zls-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura tabella [zvl]                             *
      *    *-----------------------------------------------------------*
       let-arc-zvl-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zvl-flg      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del valore della sigla va- *
      *              * luta                                            *
      *              *-------------------------------------------------*
           if        w-let-arc-zvl-sgl    =    c-sgl
                     go to let-arc-zvl-200
           else if   w-let-arc-zvl-sgl    =    spaces
                     go to let-arc-zvl-400
           else      go to let-arc-zvl-600.
       let-arc-zvl-200.
      *              *-------------------------------------------------*
      *              * Se sigla valuta pari alla valuta base           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Descrizione valuta in lingua italiana       *
      *                  *---------------------------------------------*
           move      c-des                to   w-let-arc-zvl-des      .
      *                  *---------------------------------------------*
      *                  * Descrizione valuta internazionale           *
      *                  *---------------------------------------------*
           move      c-din                to   w-let-arc-zvl-din      .
      *                  *---------------------------------------------*
      *                  * Numero decimali valuta                      *
      *                  *---------------------------------------------*
           move      c-dec                to   w-let-arc-zvl-dec      .
      *                  *---------------------------------------------*
      *                  * Tipo di coefficiente per cambio valuta      *
      *                  *---------------------------------------------*
           move      c-tdc                to   w-let-arc-zvl-tdc      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-zvl-999.
       let-arc-zvl-400.
      *              *-------------------------------------------------*
      *              * Se sigla valuta a Spaces                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Descrizione valuta in lingua italiana       *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-arc-zvl-des      .
      *                  *---------------------------------------------*
      *                  * Descrizione valuta internazionale           *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-arc-zvl-din      .
      *                  *---------------------------------------------*
      *                  * Numero decimali valuta                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-let-arc-zvl-dec      .
      *                  *---------------------------------------------*
      *                  * Tipo di coefficiente per cambio valuta      *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-arc-zvl-tdc      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-zvl-999.
       let-arc-zvl-600.
      *              *-------------------------------------------------*
      *              * Se sigla valuta diversa dalla valuta base ed    *
      *              * anche diversa da Spaces                         *
      *              *-------------------------------------------------*
       let-arc-zvl-650.
      *                  *---------------------------------------------*
      *                  * Lettura per sigla valuta                    *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODVLT    "         to   f-key                  .
           move      w-let-arc-zvl-sgl    to   rf-zvl-sgl-vlt         .
           move      "pgm/dcc/fls/ioc/obj/iofzvl"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zvl                 .
      *                  *---------------------------------------------*
      *                  * Deviazione secondo l'esito della lettura    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-zvl-750.
       let-arc-zvl-700.
      *                  *---------------------------------------------*
      *                  * Se record esistente                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Descrizione valuta in lingua italiana   *
      *                      *-----------------------------------------*
           move      rf-zvl-des-ita       to   w-let-arc-zvl-des      .
      *                      *-----------------------------------------*
      *                      * Descrizione valuta internazionale       *
      *                      *-----------------------------------------*
           move      rf-zvl-des-int       to   w-let-arc-zvl-din      .
      *                      *-----------------------------------------*
      *                      * Numero decimali valuta                  *
      *                      *-----------------------------------------*
           move      rf-zvl-num-dec       to   w-let-arc-zvl-dec      .
      *                      *-----------------------------------------*
      *                      * Tipo di coefficiente per cambio valuta  *
      *                      *-----------------------------------------*
           move      rf-zvl-def-tdc       to   w-let-arc-zvl-tdc      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-zvl-999.
       let-arc-zvl-750.
      *                  *---------------------------------------------*
      *                  * Se record non esistente                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Flag di uscita ad errore                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-let-arc-zvl-flg      .
      *                      *-----------------------------------------*
      *                      * Descrizione valuta in lingua italiana   *
      *                      *-----------------------------------------*
           move      all   "."            to   w-let-arc-zvl-des      .
      *                      *-----------------------------------------*
      *                      * Descrizione valuta internazionale       *
      *                      *-----------------------------------------*
           move      all   "."            to   w-let-arc-zvl-din      .
      *                      *-----------------------------------------*
      *                      * Numero decimali valuta                  *
      *                      *-----------------------------------------*
           move      zero                 to   w-let-arc-zvl-dec      .
      *                      *-----------------------------------------*
      *                      * Tipo di coefficiente per cambio valuta  *
      *                      *-----------------------------------------*
           move      spaces               to   w-let-arc-zvl-tdc      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-arc-zvl-999.
       let-arc-zvl-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [zos] per [dcp]                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/lzosdcp0.lts"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione codice listino             *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acodzls0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del coefficiente di cambio *
      *    * valuta                                                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcc/prg/cpy/acoecmb0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice filtro ordina-  *
      *    * mento e selezione per file [dcp]                          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/azosdcp0.acs"                   .

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      74                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      w-box-msg-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      70                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      71                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Routine di conversione da altra valuta a valuta base      *
      *    *                                                           *
      *    * Input  : w-cvs-vlt-sgl = Sigla dell'altra valuta          *
      *    *                                                           *
      *    *          w-cvs-vlt-dec = Numero decimali dell'altra valu- *
      *    *                          ta                               *
      *    *                                                           *
      *    *          w-cvs-vlt-tdc = Tipo di coefficiente dell'altra  *
      *    *                          valuta                           *
      *    *                                                           *
      *    *          w-cvs-vlt-cdc = Coefficiente di cambio dell'al-  *
      *    *                          tra valuta                       *
      *    *                                                           *
      *    *          w-cvs-vlt-aav = Ammontare da convertire, espres- *
      *    *                          so nell'altra valuta             *
      *    *                                                           *
      *    * Output : w-cvs-vlt-avb = Ammontare convertito, espresso   *
      *    *                          nella valuta base                *
      *    *                                                           *
      *    *-----------------------------------------------------------*
      *    * Routine di conversione da valuta base ad altra valuta     *
      *    *                                                           *
      *    * Input  : w-cvs-vlt-sgl = Sigla dell'altra valuta          *
      *    *                                                           *
      *    *          w-cvs-vlt-dec = Numero decimali dell'altra valu- *
      *    *                          ta                               *
      *    *                                                           *
      *    *          w-cvs-vlt-tdc = Tipo di coefficiente dell'altra  *
      *    *                          valuta                           *
      *    *                                                           *
      *    *          w-cvs-vlt-cdc = Coefficiente di cambio dell'al-  *
      *    *                          tra valuta                       *
      *    *                                                           *
      *    *          w-cvs-vlt-avb = Ammontare da convertire, espres- *
      *    *                          so nella valuta base             *
      *    *                                                           *
      *    * Output : w-cvs-vlt-aav = Ammontare convertito, espresso   *
      *    *                          nell'altra valuta                *
      *    *                                                           *
      *    *-----------------------------------------------------------*
      *    * Routine di conversione da valuta a valuta                 *
      *    *                                                           *
      *    * Input  : Valuta da trasformare                            *
      *    *                                                           *
      *    *            - w-cvs-vdt-sgl = Sigla valuta                 *
      *    *                                                           *
      *    *            - w-cvs-vdt-dec = Numero decimali              *
      *    *                                                           *
      *    *            - w-cvs-vdt-tdc = Tipo di coefficiente         *
      *    *                                                           *
      *    *            - w-cvs-vdt-cdc = Coefficiente di cambio ri-   *
      *    *                              spetto alla valuta base      *
      *    *                                                           *
      *    *            - w-cvs-vdt-amm = Ammontare da convertire,     *
      *    *                              espresso nella valuta da     *
      *    *                              trasformare                  *
      *    *                                                           *
      *    *          Valuta in cui trasformare                        *
      *    *                                                           *
      *    *            - w-cvs-vnu-sgl = Sigla valuta                 *
      *    *                                                           *
      *    *            - w-cvs-vnu-dec = Numero decimali              *
      *    *                                                           *
      *    *            - w-cvs-vnu-tdc = Tipo di coefficiente         *
      *    *                                                           *
      *    *            - w-cvs-vnu-cdc = Coefficiente di cambio ri-   *
      *    *                              spetto alla valuta base      *
      *    *                                                           *
      *    * Output : Valuta in cui trasformare                        *
      *    *                                                           *
      *    *            - w-cvs-vnu-amm = Ammontare convertito,        *
      *    *                              espresso nella valuta        *
      *    *                              in cui trasformare           *
      *    *                                                           *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wcvsvlt0.cps"                   .
