       Identification Division.
       Program-Id.                                 pdcp450a           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    dcp                 *
      *                                Settore:    com                 *
      *                                   Fase:    dcp450              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 17/01/94    *
      *                       Ultima revisione:    NdK del 25/04/25    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Manutenzioni anagrafiche prodotti           *
      *                                                                *
      *                    Sottoprogramma per esecuzione funzione di : *
      *                                                                *
      *                    Manutenzione classificazione merceologica   *
      *                    prodotti                                    *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Progressivo di sequenza da filtro                 *
      *            *---------------------------------------------------*
               10  srt-prg-key            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice alfanumerico prodotto                      *
      *            *---------------------------------------------------*
               10  srt-alf-key            pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Descrizione del prodotto                          *
      *            *---------------------------------------------------*
               10  srt-des-key            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Classe merceologica prodotto                      *
      *            *---------------------------------------------------*
               10  srt-cla-key            pic  9(05)                  .
               10  srt-alc-key            pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Record [dcp]                                      *
      *            *---------------------------------------------------*
               10  srt-rec-dcp.
                   15  filler  occurs  1536
                                          pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Descrizione tipo interrogazione per l'overlay             *
      *    *-----------------------------------------------------------*
       01  w-des-tit-pgm-ovy              pic  x(40)       value
                     "      CLASSIFICAZIONE MERCEOLOGICA      "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pos-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pos-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-let-reg-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-let-reg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-ins-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-ins      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-mod-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-mod      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-acc-vis-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-acc-vis      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-snx-del      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pos-snx-del-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pos-snx-del      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-tus.
      *            *---------------------------------------------------*
      *            * Da accettazione campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-nok      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione testata                           *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione corpo                             *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione riga corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Da accettazione piede                             *
      *            *---------------------------------------------------*
               10  w-cnt-tus-acc-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi chiave                      *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-key-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per controllo se chiave vuota                     *
      *            *---------------------------------------------------*
               10  w-cnt-key-vuo-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi non chiave                  *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-nok-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per tasto Do su riga corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-rig-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su modalita' di funzionamento      *
      *        *-------------------------------------------------------*
           05  w-cnt-mfu.
      *            *---------------------------------------------------*
      *            * Tipo impostazione                                 *
      *            * - K : Impostazione campi chiave                   *
      *            * - T : Impostazione campi testata                  *
      *            * - C : Impostazione primo campo riga corpo         *
      *            * - R : Impostazione altri campi riga corpo         *
      *            * - P : Impostazione campi piede                    *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-imp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo funzione                                     *
      *            * - I : Inserimento                                 *
      *            * - M : Modifica                                    *
      *            * - V : Visualizzazione                             *
      *            *---------------------------------------------------*
               10  w-cnt-mfu-tip-fun      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flag di controllo su status visualizzazione titolo    *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis-tit          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione chiave                               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina testata in corso di trattamento     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-npt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Salvataggio per il campo precedente               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-svp      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Si/No pagina testata in corso di trattamento      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-snp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagine componenti la testata               *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-mpt      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Impostazione testata                              *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione pagine di testata                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-pte.
                   15  w-cnt-sts-imp-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Ingresso in pagine di testata                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-ing-pte.
                   15  w-cnt-sts-ing-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione corpo                                *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione riga corpo                           *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Impostazione piede                                *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-pie      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di inibizione manuale tasto Delt             *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-itd      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts chiave                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts testata                   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts pagine di testata         *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-pte.
                   15  w-cnt-sts-pmt-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts corpo                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts riga accettazione corpo   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts piede                     *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati chiave                       *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-key      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati testata                      *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-tes      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati pagine di testata            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-pte.
                   15  w-cnt-sts-vis-ptx  occurs 9
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati corpo                        *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-cor      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati riga di accettazione corpo   *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Visualizzazione dati piede                        *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-pie      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per trattamento corpo               *
      *        *-------------------------------------------------------*
           05  w-cnt-cor.
      *            *---------------------------------------------------*
      *            * Numero riga da accettare                          *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrg-dac      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero riga da visualizzare                       *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrg-dav      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Tipo visualizzazione riga                         *
      *            *---------------------------------------------------*
               10  w-cnt-cor-tvi-rig      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina corpo da visualizzare               *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrp-dav      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina corpo visualizzata                  *
      *            *---------------------------------------------------*
               10  w-cnt-cor-nrp-vis      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Tipo aggiornamento post-riga (+ o -)              *
      *            *---------------------------------------------------*
               10  w-cnt-cor-tip-agg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Work per numero pagina riga corpo                 *
      *            *---------------------------------------------------*
               10  w-cnt-cor-pag-max      pic  9(05)                  .
               10  w-cnt-cor-pag-att      pic  9(05)                  .
               10  w-cnt-cor-pag-rem      pic  9(02)                  .
               10  w-cnt-cor-pag-ep1      pic  x(04)                  .
               10  w-cnt-cor-pag-ep2      pic  x(04)                  .
               10  w-cnt-cor-pag-npa      pic  x(11)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per variazioni                      *
      *        *-------------------------------------------------------*
           05  w-cnt-var.
      *            *---------------------------------------------------*
      *            * Flag di variazioni in testata che si ripercuotono *
      *            * su tutte le righe corpo                           *
      *            *---------------------------------------------------*
               10  w-cnt-var-tes-cor      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per Slct da primo campo riga corpo  *
      *        *-------------------------------------------------------*
           05  w-cnt-slc.
      *            *---------------------------------------------------*
      *            * Numero riga di destinazione per Slct              *
      *            *---------------------------------------------------*
               10  w-cnt-slc-num-rig      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Rappresentazione alfa del numero riga             *
      *            *---------------------------------------------------*
               10  w-cnt-slc-rap-alf.
                   15  w-cnt-slc-rap-chr
                               occurs 04  pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Rappresentazione numerica del numero riga         *
      *            *---------------------------------------------------*
               10  w-cnt-slc-rap-num      pic  9(04)                  .
               10  w-cnt-slc-rap-n02 redefines
                   w-cnt-slc-rap-num.
                   15  w-cnt-slc-rap-cif
                               occurs 04  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per accettazioni singoli campi      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
               10  w-cnt-acc-flg-aum      pic  x(01)                  .
               10  w-cnt-acc-sav-tip      pic  x(01)                  .
               10  w-cnt-acc-sav-car      pic  9(02)                  .
               10  w-cnt-acc-sav-ldt      pic  9(02)                  .
               10  w-cnt-acc-sav-dec      pic  9(01)                  .
               10  w-cnt-acc-sav-sgn      pic  x(01)                  .
               10  w-cnt-acc-sav-edm      pic  x(10)                  .
               10  w-cnt-acc-sav-msk      pic  x(24)                  .
               10  w-cnt-acc-sav-lin      pic  9(02)                  .
               10  w-cnt-acc-sav-pos      pic  9(02)                  .
               10  w-cnt-acc-sav-alf      pic  x(80)                  .
               10  w-cnt-acc-sav-txt.
                   15  filler occurs 400  pic  x(01)                  .
               10  w-cnt-acc-sav-num      pic s9(13)v9(05)  trailing
                                                            separate
                                                            character .
               10  w-cnt-acc-sav-dat      pic  9(07)                  .
               10  w-cnt-acc-sav-ufk      pic  x(80)                  .
               10  w-cnt-acc-sav-mod      pic  x(01)                  .
               10  w-cnt-acc-sav-l23      pic  x(80)                  .
               10  w-cnt-acc-sav-l24      pic  x(80)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita per il tasto 'Exit'                *
      *            *---------------------------------------------------*
               10  w-cnt-acc-flg-exi      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di switch per il Sort                        *
      *            *---------------------------------------------------*
               10  w-cnt-acc-flg-sws      pic  x(01)                  .
               10  w-cnt-acc-flg-swo      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work area                                             *
      *        *-------------------------------------------------------*
           05  w-cnt-wrk.
               10  w-cnt-wrk-ctr-001      pic  9(05)                  .
               10  w-cnt-wrk-ctr-002      pic  9(05)                  .
               10  w-cnt-wrk-ctr-003      pic  9(05)                  .
               10  w-cnt-wrk-ctr-008      pic  9(05)                  .
               10  w-cnt-wrk-ctr-009      pic  9(05)                  .

      *    *===========================================================*
      *    * Link-area per accettazione codice filtro selezione e or-  *
      *    * dinamento per file [dcp]                                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/azosdcp0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice prodotto 'dcp'          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acoddcp0.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice classe prodotto         *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acmnzp10.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice gruppo prodotto         *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acmnzp20.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione codice sottogruppo prodotto    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acmnzp30.acl"                   .

      *    *===========================================================*
      *    * Link-area per accettazione unita' di misura               *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acodzum0.acl"                   .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [zos]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/azi/fls/rec/rfzos"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [zp1]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp1"                          .
      *        *-------------------------------------------------------*
      *        * [zp2]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp2"                          .
      *        *-------------------------------------------------------*
      *        * [zp3]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzp3"                          .
      *        *-------------------------------------------------------*
      *        * [zum]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfzum"                          .

      *    *===========================================================*
      *    * Work-area per bufferizzazione testata                     *
      *    *-----------------------------------------------------------*
       01  w-tes.
      *        *-------------------------------------------------------*
      *        * Valori chiave                                         *
      *        *-------------------------------------------------------*
           05  w-tes-val-key.
      *            *---------------------------------------------------*
      *            * Filtro di selezione                               *
      *            *---------------------------------------------------*
               10  w-tes-fso-dcp          pic  9(08)                  .
               10  w-tes-fso-dcp-alf redefines
                   w-tes-fso-dcp          pic  x(08)                  .
               10  w-tes-fso-dcp-des      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Altri valori per la selezione                     *
      *            *---------------------------------------------------*
               10  w-tes-cla-pro          pic  9(05)                  .
               10  w-tes-cla-pro-sns      pic  9(01)                  .
               10  w-tes-cla-pro-des      pic  x(40)                  .
               10  w-tes-cla-pro-mne      pic  x(05)                  .
               10  w-tes-cla-pro-sud      pic  9(02)                  .
               10  w-tes-gru-pro          pic  9(05)                  .
               10  w-tes-gru-pro-sns      pic  9(01)                  .
               10  w-tes-gru-pro-des      pic  x(40)                  .
               10  w-tes-gru-pro-sud      pic  9(02)                  .
               10  w-tes-sgr-pro          pic  9(05)                  .
               10  w-tes-sgr-pro-sns      pic  9(01)                  .
               10  w-tes-sgr-pro-des      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Valori sostitutivi                                *
      *            *---------------------------------------------------*
               10  w-tes-cla-sos          pic  9(05)                  .
               10  w-tes-gru-sos          pic  9(05)                  .
               10  w-tes-sgr-sos          pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Conferma impostazioni                             *
      *            *---------------------------------------------------*
               10  w-tes-cnf-imp          pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per bufferizzazione riga corpo                  *
      *    *-----------------------------------------------------------*
       01  w-rig.
           05  w-rig-001.
               10  w-rig-num-prg          pic  9(05)                  .
               10  w-rig-num-pro          pic  9(07)                  .
               10  w-rig-alf-pro          pic  x(14)                  .
               10  w-rig-alf-pro-des      pic  x(40)                  .
               10  w-rig-cla-pro          pic  9(05)                  .
               10  w-rig-cla-pro-des      pic  x(40)                  .
               10  w-rig-cla-pro-sud      pic  9(02)                  .
               10  w-rig-cla-pro-umi      pic  x(03)                  .
               10  w-rig-gru-pro          pic  9(05)                  .
               10  w-rig-gru-pro-des      pic  x(40)                  .
               10  w-rig-gru-pro-sud      pic  9(02)                  .
               10  w-rig-gru-pro-umi      pic  x(03)                  .
               10  w-rig-sgr-pro          pic  9(05)                  .
               10  w-rig-sgr-pro-des      pic  x(40)                  .
               10  w-rig-sgr-pro-sud      pic  9(02)                  .
               10  w-rig-sgr-pro-umi      pic  x(03)                  .
               10  w-rig-umi-ven          pic  x(03)                  .
               10  w-rig-umi-ven-des      pic  x(20)                  .
               10  w-rig-tip-pro          pic  9(02)                  .
               10  w-rig-syn-pro          pic  x(13)                  .
               10  w-rig-flg-ann          pic  x(01)                  .
               10  w-rig-flg-ann-rmv      pic  x(01)                  .
           05  w-rig-002.
               10  filler occurs 512      pic  x(01)                  .

      *    *===========================================================*
      *    * Area di comunicazione per gestione file relative di sup-  *
      *    * porto, con buffer in grado di ospitare l'area w-rig.      *
      *    *-----------------------------------------------------------*
       01  w-rlt-sup.
           05  w-rlt-sup-ope              pic  x(02)                  .
           05  w-rlt-sup-exs              pic  x(01)                  .
           05  w-rlt-sup-prg              pic  9(05)                  .
           05  w-rlt-sup-max              pic  9(05)                  .
           05  w-rlt-sup-ctr              pic  9(05)                  .
           05  w-rlt-sup-buf.
               10  filler occurs 3072     pic  x(01)                  .

      *    *===========================================================*
      *    * Work per linea corpo a video                              *
      *    *-----------------------------------------------------------*
       01  w-lin.
      *        *-------------------------------------------------------*
      *        * Numero righe di corpo effettive visibili contempora-  *
      *        * neamente in una pagina di corpo nell'area di scroll   *
      *        *-------------------------------------------------------*
           05  w-lin-num-lin-vis          pic  9(02)       value 08   .
      *        *-------------------------------------------------------*
      *        * Numero linee di display impegnate per ogni riga corpo *
      *        * nell'area di scroll                                   *
      *        *-------------------------------------------------------*
           05  w-lin-num-lin-prc          pic  9(02)       value 01   .
      *        *-------------------------------------------------------*
      *        * Prima linea di display utilizzata per le righe corpo  *
      *        * nell'area di scroll                                   *
      *        *-------------------------------------------------------*
           05  w-lin-pri-lin-vid          pic  9(02)       value 06   .
      *        *-------------------------------------------------------*
      *        * Immagine di una riga di corpo su video                *
      *        *-------------------------------------------------------*
           05  w-lin-imm.
      *            *---------------------------------------------------*
      *            * Linee di display per ogni riga corpo in scroll    *
      *            *---------------------------------------------------*
               10  w-lin-imm-dsp.
                   15  w-lin-imm-dsp-lin occurs 01
                                          pic  x(80)                  .
      *            *---------------------------------------------------*
      *            * Riga corpo in scroll rappresentata linearmente    *
      *            *---------------------------------------------------*
               10  w-lin-imm-scr redefines
                   w-lin-imm-dsp.
      *                *-----------------------------------------------*
      *                * Numero linea                                  *
      *                *-----------------------------------------------*
                   15  w-lin-imm-num-lin  pic  x(04)                  .
      *                *-----------------------------------------------*
      *                * Altri dati visualizzati                       *
      *                *-----------------------------------------------*
                   15  filler             pic  x(02)                  .
                   15  w-lin-imm-alf-pro  pic  x(14)                  .
                   15  filler             pic  x(01)                  .
                   15  w-lin-imm-des-pro  pic  x(40)                  .
                   15  filler             pic  x(01)                  .
                   15  w-lin-imm-flg-ann  pic  x(01)                  .
                   15  w-lin-imm-cla-pro  pic  x(05)                  .
                   15  filler             pic  x(01)                  .
                   15  w-lin-imm-gru-pro  pic  x(05)                  .
                   15  filler             pic  x(01)                  .
                   15  w-lin-imm-sgr-pro  pic  x(05)                  .

      *    *===========================================================*
      *    * Work-area per salvataggi                                  *
      *    *-----------------------------------------------------------*
       01  w-sav.
      *        *-------------------------------------------------------*
      *        * Salvataggio per codice prodotto                       *
      *        *-------------------------------------------------------*
           05  w-sav-num-pro              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Salvataggio per : Classe merceologica                 *
      *        *-------------------------------------------------------*
           05  w-sav-cla-pro              pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Salvataggio per : Gruppo merceologico                 *
      *        *-------------------------------------------------------*
           05  w-sav-gru-pro              pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Salvataggio per : Sottoruppo merceologico             *
      *        *-------------------------------------------------------*
           05  w-sav-sgr-pro              pic  9(05)                  .

      *    *===========================================================*
      *    * Work-area per selezioni sul record [dcp]                  *
      *    *-----------------------------------------------------------*
       01  w-sel-rec-dcp.
      *        *-------------------------------------------------------*
      *        * Flag di selezione superata                            *
      *        * - spaces : selezione superata                         *
      *        * - "#"    : selezione non superata                     *
      *        *-------------------------------------------------------*
           05  w-sel-rec-dcp-flg          pic  x(01)                  .

      *    *===========================================================*
      *    * Work per routine di caricamento righe                     *
      *    *-----------------------------------------------------------*
       01  w-car-eff-rig.
      *        *-------------------------------------------------------*
      *        * Contatori elementi caricati                           *
      *        *-------------------------------------------------------*
           05  w-car-eff-rig-ctr          pic  9(06)                  .
           05  w-car-eff-rig-num          pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Numero massimo elementi da caricare                   *
      *        *-------------------------------------------------------*
           05  w-car-eff-rig-max          pic  9(06)   value 009999   .
      *        *-------------------------------------------------------*
      *        * Flag di superamento numero massimo elementi           *
      *        *-------------------------------------------------------*
           05  w-car-eff-rig-flg          pic  x(01)                  .

      *    *===========================================================*
      *    * Work per accettazioni campi espansi                       *
      *    *-----------------------------------------------------------*
       01  w-exp.
      *        *-------------------------------------------------------*
      *        * Work per : Tipo prodotto                              *
      *        *-------------------------------------------------------*
           05  w-exp-tip-pro.
               10  w-exp-tip-pro-num      pic  9(02)       value 4    .
               10  w-exp-tip-pro-lun      pic  9(02)       value 25   .
               10  w-exp-tip-pro-tbl.
                   15  filler             pic  x(25) value
                            "Merce                    "               .
                   15  filler             pic  x(25) value
                            "Servizio                 "               .
                   15  filler             pic  x(25) value
                            "Imballo                  "               .
                   15  filler             pic  x(25) value
                            "Extra attivita' aziendale"               .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zum]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zum.
               10  w-let-arc-zum-flg      pic  x(01)                  .
               10  w-let-arc-zum-cod      pic  x(03)                  .
               10  w-let-arc-zum-des      pic  x(20)                  .

      *    *===========================================================*
      *    * Work per Let su archivio [zp1]                            *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/larczp10.ltw"                   .

      *    *===========================================================*
      *    * Work per Let su archivio [zp2]                            *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/larczp20.ltw"                   .

      *    *===========================================================*
      *    * Work per Let su archivio [zp3]                            *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/larczp30.ltw"                   .

      *    *===========================================================*
      *    * Work per Let su archivio [zos] per [dcp]                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/lzosdcp0.ltw"                   .

      *    *===========================================================*
      *    * Work-area per la ridefinizione dell'area libera per il    *
      *    * filtro 'dcp ' per trattamento codice filtro               *
      *    *-----------------------------------------------------------*
       01  w-zos-dcp-fso.
      *        *-------------------------------------------------------*
      *        * Comodo per trattamento codice filtro                  *
      *        *-------------------------------------------------------*
           05  w-zos-dcp-fso-cod          pic  9(08)                  .
           05  w-zos-dcp-fso-cod-r redefines
               w-zos-dcp-fso-cod.
               10  w-zos-dcp-fso-tip      pic  9(01)                  .
               10  w-zos-dcp-fso-num      pic  9(07)                  .

      *    *===========================================================*
      *    * Work-area per la ridefinizione dell'area libera per il    *
      *    * filtro 'dcp '                                             *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/wzosdcp0.wkl"                   .

      *    *===========================================================*
      *    * Work-area per coordinate di posizionamento campi          *
      *    *-----------------------------------------------------------*
       01  w-lpt.
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Codice classe                   *
      *        *-------------------------------------------------------*
           05  w-lpt-cla-pro-lin          pic  9(03)    value 008     .
           05  w-lpt-cla-pro-pos          pic  9(03)    value 030     .
           05  w-lpt-cla-pro-ppm          pic  9(03)    value 001     .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Codice gruppo                   *
      *        *-------------------------------------------------------*
           05  w-lpt-gru-pro-lin          pic  9(03)    value 010     .
           05  w-lpt-gru-pro-pos          pic  9(03)    value 030     .
           05  w-lpt-gru-pro-ppm          pic  9(03)    value 001     .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Codice sottogruppo              *
      *        *-------------------------------------------------------*
           05  w-lpt-sgr-pro-lin          pic  9(03)    value 012     .
           05  w-lpt-sgr-pro-pos          pic  9(03)    value 030     .
           05  w-lpt-sgr-pro-ppm          pic  9(03)    value 001     .

      *    *===========================================================*
      *    * Work-area per visualizzazioni                             *
      *    *-----------------------------------------------------------*
       01  w-vis.
      *        *-------------------------------------------------------*
      *        * Comodo per visualizzazione literal di sostituzione    *
      *        *-------------------------------------------------------*
           05  w-vis-lit-sos              pic  x(50)                  .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/werrbox0.cpw"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *================================================================*
       Linkage Section.
      *================================================================*

      *    *===========================================================*
      *    * Link-area comune per programmi della serie pdcp4500       *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/pdcp4500.pgl"                   .

      ******************************************************************
       Procedure Division                using i-ide
                                               w-ovy-exe
                                               w-tmn
                                               w-spg
                                               w-prs                  .
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di switch per il sort      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-flg-sws      .
           move      "A"                  to   w-cnt-acc-flg-swo      .
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
       main-050.
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-800.
       main-100.
      *              *-------------------------------------------------*
      *              * Accettazione campi chiave                       *
      *              *-------------------------------------------------*
           perform   acc-key-reg-000      thru acc-key-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita "E" : fine programma         *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-key    =    "E"
                     go to main-800.
       main-120.
      *              *-------------------------------------------------*
      *              * Lettura registrazione pre-esistente             *
      *              *-------------------------------------------------*
           perform   rou-let-reg-000      thru rou-let-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se esito negativo : ad uscita               *
      *                  *---------------------------------------------*
           if        w-cnt-rou-let-reg    not  = spaces
                     go to main-800.
      *              *-------------------------------------------------*
      *              * Routine pre-accettazione campi non chiave       *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     go to main-130
           else if   w-cnt-mfu-tip-fun    =    "M"
                     go to main-140
           else if   w-cnt-mfu-tip-fun    =    "V"
                     go to main-150
           else      go to main-100.
       main-130.
           move      spaces               to   w-cnt-pre-acc-ins      .
           perform   pre-acc-ins-000      thru pre-acc-ins-999        .
           if        w-cnt-pre-acc-ins    =    spaces
                     go to main-180
           else      go to main-100.
       main-140.
           move      spaces               to   w-cnt-pre-acc-mod      .
           perform   pre-acc-mod-000      thru pre-acc-mod-999        .
           if        w-cnt-pre-acc-mod    =    spaces
                     go to main-180
           else      go to main-100.
       main-150.
           move      spaces               to   w-cnt-pre-acc-vis      .
           perform   pre-acc-vis-000      thru pre-acc-vis-999        .
           if        w-cnt-pre-acc-vis    =    spaces
                     go to main-180
           else      go to main-100.
       main-180.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di modifica di almeno un   *
      *              * campo non chiave                                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-flg-aum      .
      *              *-------------------------------------------------*
      *              * Accettazione campi non chiave                   *
      *              *-------------------------------------------------*
           perform   acc-nok-reg-000      thru acc-nok-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "E"
                     go to main-200.
      *                      *-----------------------------------------*
      *                      * Test sul flag di switch per il sort     *
      *                      *-----------------------------------------*
           if        w-cnt-acc-flg-sws    not  = spaces
                     go to main-120.
      *                      *-----------------------------------------*
      *                      * Routine post-exit su campi non chiave   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se Inserimento                      *
      *                          *-------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-exi-ins-000
                                          thru pos-exi-ins-999
      *                          *-------------------------------------*
      *                          * Se Modifica                         *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-exi-mod-000
                                          thru pos-exi-mod-999
      *                          *-------------------------------------*
      *                          * Se Visualizzazione                  *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "V"
                     perform   pos-exi-vis-000
                                          thru pos-exi-vis-999        .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     main-800.
       main-200.
      *                  *---------------------------------------------*
      *                  * Se uscita per annullamento                  *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-nok    not  = "X"
                     go to main-300.
      *                      *-----------------------------------------*
      *                      * Routine post-conferma di annullamento   *
      *                      *-----------------------------------------*
           perform   pos-cnf-ann-000      thru pos-cnf-ann-999        .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     main-800.
       main-300.
      *                  *---------------------------------------------*
      *                  * Se uscita per conferma                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Routine post-conferma                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se post-conferma di Inserimento     *
      *                          *-------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "I"
                     perform   pos-cnf-ins-000
                                          thru pos-cnf-ins-999
      *                          *-------------------------------------*
      *                          * Se post-conferma di Modifica        *
      *                          *-------------------------------------*
           else if   w-cnt-mfu-tip-fun    =    "M"
                     perform   pos-cnf-mod-000
                                          thru pos-cnf-mod-999        .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     main-800.
       main-800.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione routine post-esecuzione programma    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pos-exe-pgm      .
           perform   pos-exe-pgm-000      thru pos-exe-pgm-999        .
           if        w-cnt-pos-exe-pgm    not  = spaces
                     go to main-050.
       main-900.
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Prsc :                        *
      *              * - se in tipo impostazione testata e su pagina   *
      *              *   maggiore di 1 : abilitato                     *
      *              * - altrimenti    : invariato                     *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "T" and
                     w-cnt-sts-imp-npt    >    1
                     move  "PRSC"         to   v-pfk (07)             .
      *              *-------------------------------------------------*
      *              * Tasto di funzione Nxsc :                        *
      *              * - se in tipo impostazione testata e se pagina   *
      *              *   gia' completamente impostata o testata gia'   *
      *              *   completamente impostata : abilitato           *
      *              *  - altrimenti             : invariato           *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    not  = "T"
                     go to exe-acc-cmp-050.
           if        w-cnt-sts-imp-tes    not  = spaces or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     move  "NXSC"         to   v-pfk (08)             .
       exe-acc-cmp-050.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Delt :                        *
      *              *  - se Impostazione chiave    : non abilitato    *
      *              *  - se Altri campi corpo      : non abilitato    *
      *              *  - se Inserimento            : non abilitato    *
      *              *  - se Visualizzazione        : non abilitato    *
      *              *  - se Disabilitato manualm.  : non abilitato    *
      *              *  - se Almeno una modifica    : non abilitato    *
      *              *  - altrimenti                : abilitato        *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "K"      or
                     w-cnt-mfu-tip-imp    =    "R"      or
                     w-cnt-mfu-tip-fun    =    "I"      or
                     w-cnt-mfu-tip-fun    =    "V"      or
                     w-cnt-sts-imp-itd    not  = spaces or
                     w-cnt-acc-flg-aum    not  = spaces
                     go to exe-acc-cmp-100.
           move      "DELT"               to   v-pfk (19)             .
       exe-acc-cmp-100.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Do :                          *
      *              *  - se Visualizzazione     : disabilitato        *
      *              *  - altrimenti             : inalterato          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     move  spaces         to   v-pfk (05)             .
      *              *-------------------------------------------------*
      *              * Tasti di funzione Insr e Remv :                 *
      *              *  - se Visualizzazione e in                      *
      *              *    primo campo riga corpo : disabilitati        *
      *              *  - altrimenti             : inalterati          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V" and
                     w-cnt-mfu-tip-imp    =    "C"
                     move  spaces         to   v-pfk (04)
                     move  spaces         to   v-pfk (06)             .
      *              *-------------------------------------------------*
      *              * Salvataggio parametri di accettazione           *
      *              *-------------------------------------------------*
           move      v-tip                to   w-cnt-acc-sav-tip      .
           move      v-car                to   w-cnt-acc-sav-car      .
           move      v-lin                to   w-cnt-acc-sav-lin      .
           move      v-pos                to   w-cnt-acc-sav-pos      .
           if        v-tip                =    "A" or
                     v-tip                =    "U" or
                     v-tip                =    "L" or
                     v-tip                =    "E"
                     move  v-alf          to   w-cnt-acc-sav-alf      .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  v-dec          to   w-cnt-acc-sav-dec
                     move  v-sgn          to   w-cnt-acc-sav-sgn
                     move  v-edm          to   w-cnt-acc-sav-edm
                     move  v-msk          to   w-cnt-acc-sav-msk
                     move  v-num          to   w-cnt-acc-sav-num      .
           if        v-tip                =    "D"
                     move  v-dat          to   w-cnt-acc-sav-dat      .
           if        v-tip                =    "T" or
                     v-tip                =    "E"
                     move  v-ldt          to   w-cnt-acc-sav-ldt
                     move  v-txt          to   w-cnt-acc-sav-txt      .
           move      v-ufk                to   w-cnt-acc-sav-ufk      .
       exe-acc-cmp-200.
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Memorizzazione segnale di campo modificato      *
      *              *-------------------------------------------------*
           move      v-mod                to   w-cnt-acc-sav-mod      .
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "DELT"
                     go to exe-acc-cmp-600.
      *              *-------------------------------------------------*
      *              * Se il campo impostato ha modificato il valore   *
      *              * precedente : ripetizione impostazione           *
      *              *-------------------------------------------------*
           if        w-cnt-acc-sav-mod    not  = spaces
                     go to exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Routine pre-richiesta di ratifica tasto Delete  *
      *              *-------------------------------------------------*
           perform   pre-snx-del-000      thru pre-snx-del-999        .
      *              *-------------------------------------------------*
      *              * Se errore : a ripristino                        *
      *              *-------------------------------------------------*
           if        w-cnt-pre-snx-del    not  = spaces
                     go to exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Salvataggio linee 23 e 24 di note operative     *
      *              *-------------------------------------------------*
           move      "GL"                 to   v-ope                  .
           move      23                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l23      .
           move      "GL"                 to   v-ope                  .
           move      24                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l24      .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative attuali            *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      spaces               to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Richiesta conferma annullamento                 *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#DEL"               to   v-not                  .
           move      "N"                  to   v-alf                  .
           move      "SN"                 to   v-msk                  .
           move      "DELT"               to   v-pfk (19)             .
           move      "UP  "               to   v-pfk (02)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                =    spaces
                     if      v-alf        =    "S"
                             move  "DELT" to   v-key
                     else    move  "UP  " to   v-key                  .
      *              *-------------------------------------------------*
      *              * Se non function key DELT si ripristina          *
      *              *-------------------------------------------------*
           if        v-key                not  = "DELT"
                     go to exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Routine post-richiesta di ratifica tasto Delete *
      *              *-------------------------------------------------*
           perform   pos-snx-del-000      thru pos-snx-del-999        .
      *              *-------------------------------------------------*
      *              * Se errore : a ripristino                        *
      *              *-------------------------------------------------*
           if        w-cnt-pos-snx-del    not  = spaces
                     go to exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Altrimenti : uscita                             *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-999.
       exe-acc-cmp-300.
      *              *-------------------------------------------------*
      *              * Ripristino linee 23 e 24 di note operative      *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      w-cnt-acc-sav-l23    to   v-nt1                  .
           move      w-cnt-acc-sav-l24    to   v-nt2                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-400.
      *              *-------------------------------------------------*
      *              * Ripristino parametri di impostazione            *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      w-cnt-acc-sav-tip    to   v-tip                  .
           move      w-cnt-acc-sav-car    to   v-car                  .
           move      w-cnt-acc-sav-lin    to   v-lin                  .
           move      w-cnt-acc-sav-pos    to   v-pos                  .
           if        v-tip                =    "A" or
                     v-tip                =    "U" or
                     v-tip                =    "L" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-alf
                                          to   v-alf                  .
           if        v-tip                =    "N" or
                     v-tip                =    "V" or
                     v-tip                =    "P" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-dec
                                          to   v-dec
                     move  w-cnt-acc-sav-sgn
                                          to   v-sgn
                     move  w-cnt-acc-sav-edm
                                          to   v-edm
                     move  w-cnt-acc-sav-msk
                                          to   v-msk
                     move  w-cnt-acc-sav-num
                                          to   v-num                  .
           if        v-tip                =    "D"
                     move  w-cnt-acc-sav-dat
                                          to   v-dat                  .
           if        v-tip                =    "T" or
                     v-tip                =    "E"
                     move  w-cnt-acc-sav-ldt
                                          to   v-ldt
                     move  w-cnt-acc-sav-txt
                                          to   v-txt                  .
           move      w-cnt-acc-sav-ufk    to   v-ufk                  .
      *              *-------------------------------------------------*
      *              * Ritorno alla impostazione                       *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-200.
       exe-acc-cmp-600.
      *              *-------------------------------------------------*
      *              * Flag globale di avvenuta almeno una modifica    *
      *              *-------------------------------------------------*
           if        w-cnt-acc-sav-mod    not  = spaces
                     move  "#"            to   w-cnt-acc-flg-aum      .
      *              *-------------------------------------------------*
      *              * Visualizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           perform   vis-tip-fun-000      thru vis-tip-fun-999        .
       exe-acc-cmp-800.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                not  = "EXIT"
                     go to exe-acc-cmp-850.
      *                  *---------------------------------------------*
      *                  * Subroutine di controllo per Exit            *
      *                  *---------------------------------------------*
           perform   exe-acc-cmp-exi-000  thru exe-acc-cmp-exi-999    .
      *                  *---------------------------------------------*
      *                  * Se Exit non attivato : a ripristino para-   *
      *                  * metri di impostazione                       *
      *                  *---------------------------------------------*
           if        w-cnt-acc-flg-exi    not  = spaces
                     go to exe-acc-cmp-400.
      *                  *---------------------------------------------*
      *                  * Altrimenti : ad uscita                      *
      *                  *---------------------------------------------*
           go to     exe-acc-cmp-900.
       exe-acc-cmp-850.
      *              *-------------------------------------------------*
      *              * Altro tasto funzione eventuale                  *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-900.
       exe-acc-cmp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-999.
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *                                                           *
      *    * Subroutine di controllo tasto 'Exit'                      *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-exi-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-flg-exi      .
       exe-acc-cmp-exi-050.
      *              *-------------------------------------------------*
      *              * Se impostazione campi chiave : si ignora        *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "K"
                     go to exe-acc-cmp-exi-920.
      *              *-------------------------------------------------*
      *              * Se in visualizzazione : si ignora               *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to exe-acc-cmp-exi-920.
      *              *-------------------------------------------------*
      *              * Se in impostazione altri campi riga corpo : si  *
      *              * ignora                                          *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "R"
                     go to exe-acc-cmp-exi-920.
      *              *-------------------------------------------------*
      *              * Se non avvenuta alcuna modifica : si ignora     *
      *              *-------------------------------------------------*
           if        w-cnt-acc-flg-aum    =    spaces
                     go to exe-acc-cmp-exi-920.
       exe-acc-cmp-exi-100.
      *              *-------------------------------------------------*
      *              * Salvataggio linee 23 e 24 di note operative     *
      *              *-------------------------------------------------*
           move      "GL"                 to   v-ope                  .
           move      23                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l23      .
           move      "GL"                 to   v-ope                  .
           move      24                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-alf                to   w-cnt-acc-sav-l24      .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative attuali            *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      spaces               to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Richiesta conferma di uscita                    *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#EXI"               to   v-not                  .
           move      "N"                  to   v-alf                  .
           move      "SN"                 to   v-msk                  .
           move      "EXIT"               to   v-pfk (20)             .
           move      "UP  "               to   v-pfk (02)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                =    spaces
                     if      v-alf        =    "S"
                             move  "EXIT" to   v-key
                     else    move  "UP  " to   v-key                  .
      *              *-------------------------------------------------*
      *              * Se non function key EXIT si ripristina          *
      *              *-------------------------------------------------*
           if        v-key                not  = "EXIT"
                     go to exe-acc-cmp-exi-600.
      *              *-------------------------------------------------*
      *              * Altrimenti : ad Exit attivato                   *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-exi-800.
       exe-acc-cmp-exi-600.
      *              *-------------------------------------------------*
      *              * Se uscita senza Exit                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di Exit non attivato                   *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-acc-flg-exi      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     exe-acc-cmp-exi-900.
       exe-acc-cmp-exi-800.
      *              *-------------------------------------------------*
      *              * Se uscita con Exit                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     exe-acc-cmp-exi-900.
       exe-acc-cmp-exi-900.
      *              *-------------------------------------------------*
      *              * Ripristino linee 23 e 24 di note operative      *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      w-cnt-acc-sav-l23    to   v-nt1                  .
           move      w-cnt-acc-sav-l24    to   v-nt2                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-exi-920.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-acc-cmp-exi-999.
       exe-acc-cmp-exi-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Test su flag di visualizzazione titolo          *
      *              *-------------------------------------------------*
           if        w-cnt-sts-vis-tit    not  = spaces
                     move  spaces         to   w-cnt-sts-vis-tit
                     go to vis-tit-pgm-999.
       vis-tit-pgm-100.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se impostazione chiave effettuata      *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-key    not  = spaces
                     go to vis-tit-pgm-200.
      *                  *---------------------------------------------*
      *                  * Erase video                                 *
      *                  *---------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-200.
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           perform   vis-tit-pgm-des-000  thru vis-tit-pgm-des-999    .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *                                                           *
      *    * Trattamento descrizione del programma                     *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-des-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione della fase di accetta-   *
      *              * zione                                           *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-imp    =    "C" or
                     w-cnt-mfu-tip-imp    =    "R" or
                     w-cnt-mfu-tip-imp    =    "T"
                     go to vis-tit-pgm-des-500.
       vis-tit-pgm-des-200.
      *              *-------------------------------------------------*
      *              * Prima pagina                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Descrizione del programma                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      w-des-tit-pgm-ovy    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-tit-pgm-des-900.
       vis-tit-pgm-des-500.
      *              *-------------------------------------------------*
      *              * Pagine successive                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Concatenamento con numero di record         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing numero record                   *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-car-eff-rig-ctr    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Concatenamento                          *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      w-des-tit-pgm-ovy    to   w-all-str-cat (1)      .
           move      "{"                  to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *
           move      03                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      "}"                  to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                      *-----------------------------------------*
      *                      * Allineamento al centro descrizione      *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                      *-----------------------------------------*
      *                      * Visualizzazione dati documento          *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-tit-pgm-des-900.
       vis-tit-pgm-des-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-tit-pgm-des-999.
       vis-tit-pgm-des-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione tipo funzionamento                        *
      *    *-----------------------------------------------------------*
       vis-tip-fun-000.
           move      "TF"                 to   v-ope                  .
           move      w-cnt-mfu-tip-fun    to   v-tfu                  .
           move      w-cnt-acc-flg-aum    to   v-tfm                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Visualizzazione titolo programma                *
      *              *-------------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
           move      "#"                  to   w-cnt-sts-vis-tit      .
      *              *-------------------------------------------------*
      *              * Open dei moduli di accettazione                 *
      *              *-------------------------------------------------*
           perform   opn-mdl-acc-000      thru opn-mdl-acc-999        .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Routine post-esecuzione programma                         *
      *    *-----------------------------------------------------------*
       pos-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Close dei moduli di accettazione                *
      *              *-------------------------------------------------*
           perform   cls-mdl-acc-000      thru cls-mdl-acc-999        .
       pos-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Open dei moduli di accettazione                           *
      *    *-----------------------------------------------------------*
       opn-mdl-acc-000.
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice filtro ordina-  *
      *              * mento e selezione per file [dcp]                *
      *              *-------------------------------------------------*
           perform   cod-zos-dcp-opn-000  thru cod-zos-dcp-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice prodotto 'dcp'  *
      *              *-------------------------------------------------*
           perform   cod-cod-dcp-opn-000  thru cod-cod-dcp-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice classe          *
      *              *-------------------------------------------------*
           perform   cod-mne-zp1-opn-000  thru cod-mne-zp1-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice gruppo          *
      *              *-------------------------------------------------*
           perform   cod-mne-zp2-opn-000  thru cod-mne-zp2-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione codice sottogruppo     *
      *              *-------------------------------------------------*
           perform   cod-mne-zp3-opn-000  thru cod-mne-zp3-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione unita' di misura       *
      *              *-------------------------------------------------*
           perform   cod-cod-zum-opn-000  thru cod-cod-zum-opn-999    .
       opn-mdl-acc-999.
           exit.

      *    *===========================================================*
      *    * Close dei moduli di accettazione                          *
      *    *-----------------------------------------------------------*
       cls-mdl-acc-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice filtro ordina- *
      *              * mento e selezione per file [dcp]                *
      *              *-------------------------------------------------*
           perform   cod-zos-dcp-cls-000  thru cod-zos-dcp-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice prodotto 'dcp' *
      *              *-------------------------------------------------*
           perform   cod-cod-dcp-cls-000  thru cod-cod-dcp-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice classe         *
      *              *-------------------------------------------------*
           perform   cod-mne-zp1-cls-000  thru cod-mne-zp1-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice gruppo         *
      *              *-------------------------------------------------*
           perform   cod-mne-zp2-cls-000  thru cod-mne-zp2-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione codice sottogruppo    *
      *              *-------------------------------------------------*
           perform   cod-mne-zp3-cls-000  thru cod-mne-zp3-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo accettazione unita' di misura      *
      *              *-------------------------------------------------*
           perform   cod-cod-zum-cls-000  thru cod-cod-zum-cls-999    .
       cls-mdl-acc-999.
           exit.

      *    *===========================================================*
      *    * Open files                                                *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [zos]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofzos"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zos                 .
      *              *-------------------------------------------------*
      *              * Apertura filtro per selezione ed ordinamento    *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [zp1]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
      *              *-------------------------------------------------*
      *              * [zp2]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
      *              *-------------------------------------------------*
      *              * [zp3]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
      *              *-------------------------------------------------*
      *              * [zum]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zum                 .
      *              *-------------------------------------------------*
      *              * File relative di supporto                       *
      *              *-------------------------------------------------*
           move      "OP"                 to   w-rlt-sup-ope          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files                                               *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [zos]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofzos"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zos                 .
      *              *-------------------------------------------------*
      *              * Close filtro per selezione ed ordinamento       *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Cancel del modulo utilizzato                *
      *                  *---------------------------------------------*
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [zp1]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp1"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp1                 .
      *              *-------------------------------------------------*
      *              * [zp2]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp2"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp2                 .
      *              *-------------------------------------------------*
      *              * [zp3]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzp3"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zp3                 .
      *              *-------------------------------------------------*
      *              * [zum]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofzum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zum                 .
      *              *-------------------------------------------------*
      *              * File relative di supporto                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Close                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   w-rlt-sup-ope          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
      *                  *---------------------------------------------*
      *                  * Cancel                                      *
      *                  *---------------------------------------------*
           perform   cnc-rlt-sup-000      thru cnc-rlt-sup-999        .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi chiave della registrazione             *
      *    *-----------------------------------------------------------*
       acc-key-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-fun      .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo impostazione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-sts-imp-npt      .
           move      spaces               to   w-cnt-sts-imp-key
                                               w-cnt-sts-imp-tes
                                               w-cnt-sts-imp-pte
                                               w-cnt-sts-ing-pte
                                               w-cnt-sts-imp-cor
                                               w-cnt-sts-imp-rig
                                               w-cnt-sts-imp-pie
                                               w-cnt-sts-imp-itd      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key
                                               w-cnt-sts-pmt-tes
                                               w-cnt-sts-pmt-pte
                                               w-cnt-sts-pmt-cor
                                               w-cnt-sts-pmt-rig
                                               w-cnt-sts-pmt-pie      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-key
                                               w-cnt-sts-vis-tes
                                               w-cnt-sts-vis-pte
                                               w-cnt-sts-vis-cor
                                               w-cnt-sts-vis-rig
                                               w-cnt-sts-vis-pie      .
      *              *-------------------------------------------------*
      *              * Normalizzazione area di controllo variazioni    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-var-tes-cor      .
      *              *-------------------------------------------------*
      *              * Normalizzazione registrazione                   *
      *              *-------------------------------------------------*
           perform   nor-key-nok-000      thru nor-key-nok-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           perform   pmt-key-reg-000      thru pmt-key-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per prima pagina testata            *
      *                  *---------------------------------------------*
           perform   pmt-tes-reg-000      thru pmt-tes-reg-999        .
           move      "#"                  to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : chiave                      *
      *              *-------------------------------------------------*
           move      "K"                  to   w-cnt-mfu-tip-imp      .
       acc-key-reg-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Accettazione codice filtro di ordinamento e *
      *                  * selezione per file [dcp]                    *
      *                  *---------------------------------------------*
           perform   acc-fso-dcp-000      thru acc-fso-dcp-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
       acc-key-reg-200.
      *                  *---------------------------------------------*
      *                  * Codice classe                               *
      *                  *---------------------------------------------*
           perform   acc-cla-pro-000      thru acc-cla-pro-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-100.
       acc-key-reg-300.
      *                  *---------------------------------------------*
      *                  * Codice gruppo                               *
      *                  *---------------------------------------------*
           perform   acc-gru-pro-000      thru acc-gru-pro-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-200.
       acc-key-reg-400.
      *                  *---------------------------------------------*
      *                  * Codice sottogruppo                          *
      *                  *---------------------------------------------*
           perform   acc-sgr-pro-000      thru acc-sgr-pro-999        .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-300.
       acc-key-reg-800.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma impostazioni          *
      *                  *---------------------------------------------*
           perform   acc-cnf-imp-000      thru acc-cnf-imp-999        .
           if        w-cnt-tus-acc-key    =    "E"
                     move  spaces         to   w-cnt-tus-acc-key
                     go to acc-key-reg-100.
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-key-reg-999.
           if        v-key                =    "UP  "
                     go to acc-key-reg-100.
       acc-key-reg-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-key      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visual. dati chiave    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-key      .
      *              *-------------------------------------------------*
      *              * Test se chiave vuota                            *
      *              *-------------------------------------------------*
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-key-reg-999.
      *              *-------------------------------------------------*
      *              * Controllo globale su tasto Do su chiave         *
      *              *-------------------------------------------------*
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-key-reg-100.
           move      "S"                  to   w-cnt-tus-acc-key      .
       acc-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campi chiave della registrazione          *
      *    *-----------------------------------------------------------*
       vis-key-reg-000.
      *              *-------------------------------------------------*
      *              * Filtro di ordinamento e selezione [dcp]         *
      *              *-------------------------------------------------*
           perform   vis-fso-dcp-000      thru vis-fso-dcp-999        .
           perform   vis-fso-dcp-des-000  thru vis-fso-dcp-des-999    .
      *              *-------------------------------------------------*
      *              * Codice classe prodotto                          *
      *              *-------------------------------------------------*
           perform   vis-cla-pro-000      thru vis-cla-pro-999        .
      *              *-------------------------------------------------*
      *              * Codice gruppo prodotto                          *
      *              *-------------------------------------------------*
           perform   vis-gru-pro-000      thru vis-gru-pro-999        .
      *              *-------------------------------------------------*
      *              * Codice sottogruppo prodotto                     *
      *              *-------------------------------------------------*
           perform   vis-sgr-pro-000      thru vis-sgr-pro-999        .
       vis-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per campi chiave                  *
      *    *-----------------------------------------------------------*
       pmt-key-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate dalla chiave              *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-key-reg-100.
      *              *-------------------------------------------------*
      *              * Visualizzazioni prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Filtro di ordinamento e selezione [dcp]     *
      *                  *---------------------------------------------*
           perform   pmt-fso-dcp-000      thru pmt-fso-dcp-999        .
      *                  *---------------------------------------------*
      *                  * Linea di trattini di separazione            *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "--------------------------------------------------
      -              "------------------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Codice classe                               *
      *                  *---------------------------------------------*
           perform   pmt-cla-pro-000      thru pmt-cla-pro-999        .
      *                  *---------------------------------------------*
      *                  * Codice gruppo                               *
      *                  *---------------------------------------------*
           perform   pmt-gru-pro-000      thru pmt-gru-pro-999        .
      *                  *---------------------------------------------*
      *                  * Codice sottogruppo                          *
      *                  *---------------------------------------------*
           perform   pmt-sgr-pro-000      thru pmt-sgr-pro-999        .
       pmt-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Prompt : Codice filtro per selezione ed ordinamento per   *
      *    *          file [dcp]                                       *
      *    *-----------------------------------------------------------*
       pmt-fso-dcp-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice filtro di selezione :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "       anagrafica prodotti  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-fso-dcp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice classe                    *
      *    *-----------------------------------------------------------*
       pmt-cla-pro-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      w-lpt-cla-pro-lin    to   v-lin                  .
           move      w-lpt-cla-pro-ppm    to   v-pos                  .
           move      "Classe                     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-cla-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice gruppo                    *
      *    *-----------------------------------------------------------*
       pmt-gru-pro-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      w-lpt-gru-pro-lin    to   v-lin                  .
           move      w-lpt-gru-pro-ppm    to   v-pos                  .
           move      "Gruppo                     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-gru-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice sottogruppo               *
      *    *-----------------------------------------------------------*
       pmt-sgr-pro-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      w-lpt-sgr-pro-lin    to   v-lin                  .
           move      w-lpt-sgr-pro-ppm    to   v-pos                  .
           move      "Sottogruppo                :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-sgr-pro-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice filtro per selezione ed ordi- *
      *    *                      namento per il file [dcp]            *
      *    *-----------------------------------------------------------*
       acc-fso-dcp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-fso-dcp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-zos-dcp-ope      .
           move      w-tes-fso-dcp        to   w-cod-zos-dcp-cod      .
           move      04                   to   w-cod-zos-dcp-lin      .
           move      30                   to   w-cod-zos-dcp-pos      .
           move      04                   to   w-cod-zos-dcp-dln      .
           move      41                   to   w-cod-zos-dcp-dps      .
           move      "<B"                 to   v-edm                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-zos-dcp-cll-000  thru cod-zos-dcp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-zos-dcp-foi-000  thru cod-zos-dcp-foi-999    .
       acc-fso-dcp-110.
           perform   cod-zos-dcp-cll-000  thru cod-zos-dcp-cll-999    .
           if        w-cod-zos-dcp-ope    =    "F+"
                     go to acc-fso-dcp-115.
           if        w-cod-zos-dcp-ope    =    "AC"
                     go to acc-fso-dcp-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-fso-dcp-115.
           perform   cod-zos-dcp-foi-000  thru cod-zos-dcp-foi-999    .
           go to     acc-fso-dcp-110.
       acc-fso-dcp-120.
           move      w-cod-zos-dcp-cod    to   v-num                  .
       acc-fso-dcp-150.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-fso-dcp-999.
       acc-fso-dcp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-fso-dcp          .
       acc-fso-dcp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura codice filtro selezione e ordina-   *
      *                  * mento per file [dcp]                        *
      *                  *---------------------------------------------*
           move      w-tes-fso-dcp        to   w-let-fso-dcp-cod      .
           perform   let-fso-dcp-000      thru let-fso-dcp-999        .
           move      w-let-fso-dcp-des    to   w-tes-fso-dcp-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione filtro          *
      *                  *---------------------------------------------*
           perform   vis-fso-dcp-des-000  thru vis-fso-dcp-des-999    .
      *                  *---------------------------------------------*
      *                  * Se codice filtro non esistente : a reimpo-  *
      *                  * stazione                                    *
      *                  *---------------------------------------------*
           if        w-let-fso-dcp-flg    not  = spaces
                     go to acc-fso-dcp-100.
      *                  *---------------------------------------------*
      *                  * Lettura archivio [zos] per [dcp] completa   *
      *                  *---------------------------------------------*
           perform   let-zos-dcp-cmp-000  thru let-zos-dcp-cmp-999    .
       acc-fso-dcp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-fso-dcp-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-fso-dcp-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-fso-dcp-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-fso-dcp-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-fso-dcp-999.
       acc-fso-dcp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice filtro per selezione ed    *
      *    *                         ordinamento file [dcp]            *
      *    *-----------------------------------------------------------*
       vis-fso-dcp-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      07                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      04                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-tes-fso-dcp        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-fso-dcp-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Descrizione codice filtro per se- *
      *    *                         lezione ed ordinamento file [dcp] *
      *    *-----------------------------------------------------------*
       vis-fso-dcp-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-tes-fso-dcp-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-fso-dcp-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Classe merceologica          *
      *    *-----------------------------------------------------------*
       acc-cla-pro-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-tes-cla-pro        to   w-sav-cla-pro          .
      *                  *---------------------------------------------*
      *                  * Test se richiesta sostituzione              *
      *                  *---------------------------------------------*
           if        w-tes-cla-pro-sns    =    zero
                     go to acc-cla-pro-100.
      *                  *---------------------------------------------*
      *                  * Forzatura del tasto Pf1                     *
      *                  *---------------------------------------------*
           move      "[1] "               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A test su Pf1                               *
      *                  *---------------------------------------------*
           go to     acc-cla-pro-300.
       acc-cla-pro-100.
      *              *-------------------------------------------------*
      *              * Note operative                                  *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      "[F1] per sostituzione"
                                          to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zp1-ope      .
           move      w-tes-cla-pro        to   w-cod-mne-zp1-cla      .
           move      zero                 to   w-cod-mne-zp1-gru      .
           move      zero                 to   w-cod-mne-zp1-sgr      .
           move      w-lpt-cla-pro-lin    to   w-cod-mne-zp1-lin      .
           move      w-lpt-cla-pro-pos    to   w-cod-mne-zp1-pos      .
           move      w-lpt-cla-pro-lin    to   w-cod-mne-zp1-dln      .
           move      w-lpt-cla-pro-pos    to   w-cod-mne-zp1-dps      .
           add       11                   to   w-cod-mne-zp1-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "[1] "               to   v-pfk (14)             .
           perform   cod-mne-zp1-cll-000  thru cod-mne-zp1-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zp1-foi-000  thru cod-mne-zp1-foi-999    .
       acc-cla-pro-110.
           perform   cod-mne-zp1-cll-000  thru cod-mne-zp1-cll-999    .
           if        w-cod-mne-zp1-ope    =    "F+"
                     go to acc-cla-pro-115.
           if        w-cod-mne-zp1-ope    =    "AC"
                     go to acc-cla-pro-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cla-pro-115.
           perform   cod-mne-zp1-foi-000  thru cod-mne-zp1-foi-999    .
           go to     acc-cla-pro-110.
       acc-cla-pro-120.
           move      w-cod-mne-zp1-cla    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Cancellazione eventuali note operative          *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cla-pro-999.
       acc-cla-pro-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-cla-pro          .
       acc-cla-pro-300.
      *              *-------------------------------------------------*
      *              * Se Pf1                                          *
      *              *-------------------------------------------------*
           if        v-key                not  = "[1] "
                     go to acc-cla-pro-400.
      *                  *---------------------------------------------*
      *                  * Subroutine di accettazione valore sostitu-  *
      *                  * tivo                                        *
      *                  *---------------------------------------------*
           perform   acc-cla-pro-sos-000  thru acc-cla-pro-sos-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-cla-pro-999.
      *                  *---------------------------------------------*
      *                  * Visualizzazione sostituzione effettuata     *
      *                  *---------------------------------------------*
           perform   vis-cla-pro-sos-000  thru vis-cla-pro-sos-999    .
      *                  *---------------------------------------------*
      *                  * Se sostituzione non effettuata ma impostati *
      *                  * valori : rivisualizzazione valori impostati *
      *                  *---------------------------------------------*
           if        w-tes-cla-pro-sns    not  = zero
                     go to acc-cla-pro-800.
      *                  *---------------------------------------------*
      *                  * Visualizzazione codice impostato            *
      *                  *---------------------------------------------*
           perform   vis-cla-pro-000      thru vis-cla-pro-999        .
       acc-cla-pro-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [zp1]                      *
      *                  *---------------------------------------------*
           move      w-tes-cla-pro        to   w-let-arc-zp1-cla      .
           perform   let-arc-zp1-000      thru let-arc-zp1-999        .
      *                   *--------------------------------------------*
      *                   * Bufferizzazione di :                       *
      *                   * - Descrizione                              *
      *                   * - Ulteriore suddivisione                   *
      *                   * - Unita' di misura da proporre             *
      *                   *--------------------------------------------*
           if        w-tes-cla-pro        =    zero
                     move  "Tutte"        to   w-tes-cla-pro-des
           else      move  w-let-arc-zp1-des
                                          to   w-tes-cla-pro-des      .
           move      w-let-arc-zp1-sud    to   w-tes-cla-pro-sud      .
           move      w-let-arc-zp1-mne    to   w-tes-cla-pro-mne      .
      *                   *--------------------------------------------*
      *                   * Visualizzazione descrizione                *
      *                   *--------------------------------------------*
           perform   vis-cla-pro-des-000  thru vis-cla-pro-des-999    .
       acc-cla-pro-450.
      *                  *---------------------------------------------*
      *                  * Controllo con valori letti da filtro        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se codice a zero : nessun controllo     *
      *                      *-----------------------------------------*
           if        w-tes-cla-pro        =    zero
                     go to acc-cla-pro-600.
      *                      *-----------------------------------------*
      *                      * Controllo con codice min                *
      *                      *-----------------------------------------*
           if        w-zos-dcp-cla-min    =    zero
                     go to acc-cla-pro-500.
           if        w-tes-cla-pro        <    w-zos-dcp-cla-min
                     go to acc-cla-pro-550.
       acc-cla-pro-500.
      *                      *-----------------------------------------*
      *                      * Controllo con codice max                *
      *                      *-----------------------------------------*
           if        w-zos-dcp-cla-max    =    zero
                     go to acc-cla-pro-600.
           if        w-tes-cla-pro        >    w-zos-dcp-cla-max
                     go to acc-cla-pro-550.
           go to     acc-cla-pro-600.
       acc-cla-pro-550.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Incompatibilita' con il filtro di selezione !   "
                                          to   w-err-box-err-msg      .
      *                      *-----------------------------------------*
      *                      * Box di errore                           *
      *                      *-----------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
       acc-cla-pro-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore impostato uguale a precedente :   *
      *                  * oltre                                       *
      *                  *---------------------------------------------*
           if        w-tes-cla-pro        =    w-sav-cla-pro
                     go to acc-cla-pro-800.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione dati  *
      *                      * gruppo merceologico                     *
      *                      *-----------------------------------------*
           if        w-tes-gru-pro        =    zero
                     go to acc-cla-pro-620.
           move      zero                 to   w-tes-gru-pro          .
           move      spaces               to   w-tes-gru-pro-des      .
           move      zero                 to   w-tes-gru-pro-sud      .
           perform   vis-gru-pro-000      thru vis-gru-pro-999        .
           perform   vis-gru-pro-des-000  thru vis-gru-pro-des-999    .
       acc-cla-pro-620.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione dati  *
      *                      * sottogruppo merceologico                *
      *                      *-----------------------------------------*
           if        w-tes-sgr-pro        =    zero
                     go to acc-cla-pro-640.
           move      zero                 to   w-tes-sgr-pro          .
           move      spaces               to   w-tes-sgr-pro-des      .
           perform   vis-sgr-pro-000      thru vis-sgr-pro-999        .
           perform   vis-sgr-pro-des-000  thru vis-sgr-pro-des-999    .
       acc-cla-pro-640.
       acc-cla-pro-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cla-pro-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cla-pro-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cla-pro-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cla-pro-999.
       acc-cla-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Classe merceologica       *
      *    *-----------------------------------------------------------*
       vis-cla-pro-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-lpt-cla-pro-lin    to   v-lin                  .
           move      w-lpt-cla-pro-pos    to   v-pos                  .
           move      w-tes-cla-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cla-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Descrizione classe        *
      *    *-----------------------------------------------------------*
       vis-cla-pro-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      w-lpt-cla-pro-lin    to   v-lin                  .
           move      w-lpt-cla-pro-pos    to   v-pos                  .
           add       11                   to   v-pos                  .
           move      w-tes-cla-pro-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cla-pro-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice classe                        *
      *    *                                                           *
      *    * Subroutine di sostituzione                                *
      *    *-----------------------------------------------------------*
       acc-cla-pro-sos-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione segnale di sostituzione     *
      *                  *---------------------------------------------*
           move      zero                 to   w-tes-cla-pro-sns      .
      *                  *---------------------------------------------*
      *                  * Salvataggio immagine video                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      w-lpt-cla-pro-lin    to   v-lin                  .
           subtract  1                    from v-lin                  .
           move      w-lpt-cla-pro-pos    to   v-pos                  .
           subtract  1                    from v-pos                  .
           move      w-lpt-cla-pro-lin    to   v-lto                  .
           add       1                    to   v-lto                  .
           move      w-lpt-cla-pro-pos    to   v-pto                  .
           add       50                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cla-pro-sos-010.
      *                  *---------------------------------------------*
      *                  * Prompts per il box                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Valore da sostituire                    *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      w-lpt-cla-pro-lin    to   v-lin                  .
           move      w-lpt-cla-pro-pos    to   v-pos                  .
           move      "Da sostituire :"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Con                                     *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      w-lpt-cla-pro-lin    to   v-lin                  .
           move      w-lpt-cla-pro-pos    to   v-pos                  .
           add       29                   to   v-pos                  .
           move      "Con :"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cla-pro-sos-100.
      *              *-------------------------------------------------*
      *              * Visualizzazioni                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore da sostituire        *
      *                  *---------------------------------------------*
           perform   vis-cla-pro-so1-000  thru vis-cla-pro-so1-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore sostitutivo          *
      *                  *---------------------------------------------*
           perform   vis-cla-pro-so2-000  thru vis-cla-pro-so2-999    .
       acc-cla-pro-sos-200.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore da sostituire                        *
      *                  *---------------------------------------------*
           perform   acc-cla-pro-so1-000  thru acc-cla-pro-so1-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-cla-pro-sos-600.
           if        v-key                =    "UP  "
                     go to acc-cla-pro-sos-600.
           if        v-key                =    "DOWN"
                     go to acc-cla-pro-sos-600.
       acc-cla-pro-sos-300.
      *                  *---------------------------------------------*
      *                  * Valore sostitutivo                          *
      *                  *---------------------------------------------*
           perform   acc-cla-pro-so2-000  thru acc-cla-pro-so2-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-cla-pro-sos-600.
           if        v-key                =    "UP  "
                     go to acc-cla-pro-sos-200.
       acc-cla-pro-sos-600.
      *              *-------------------------------------------------*
      *              * Controlli su valori accettati                   *
      *              *-------------------------------------------------*
       acc-cla-pro-sos-800.
      *              *-------------------------------------------------*
      *              * Dipendenza dalle impostazioni                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di sostituzione effettuata          *
      *                  *---------------------------------------------*
           if        w-tes-cla-pro        not  = zero or
                     w-tes-cla-sos        not  = zero
                     move  1              to   w-tes-cla-pro-sns      .
       acc-cla-pro-sos-900.
      *              *-------------------------------------------------*
      *              * Normalizzazione stato di uscita                 *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     acc-cla-pro-sos-999.
       acc-cla-pro-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice classe                        *
      *    *                                                           *
      *    * Subroutine di visualizzazione sostituzione                *
      *    *-----------------------------------------------------------*
       vis-cla-pro-sos-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del segnale di sostitu-  *
      *              * zione effettuata                                *
      *              *-------------------------------------------------*
           if        w-tes-cla-pro-sns    =    zero
                     go to vis-cla-pro-sos-100
           else      go to vis-cla-pro-sos-500.
       vis-cla-pro-sos-100.
      *              *-------------------------------------------------*
      *              * Se sostituzione non effettuata                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-cla-pro-lin    to   v-lin                  .
           move      w-lpt-cla-pro-pos    to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-cla-pro-sos-900.
       vis-cla-pro-sos-500.
      *              *-------------------------------------------------*
      *              * Se sostituzione effettuata                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing codice da sostituire                *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-tes-cla-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Concatenamento prima parte                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-vis-lit-sos          .
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "( Sostituzione di :"
                                          to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      "- con :"            to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Editing codice sostitutivo                  *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-tes-cla-sos        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Concatenamento seconda parte                *
      *                  *---------------------------------------------*
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-vis-lit-sos        to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      ")"                  to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-cla-pro-lin    to   v-lin                  .
           move      w-lpt-cla-pro-pos    to   v-pos                  .
           move      w-vis-lit-sos        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-cla-pro-sos-900.
       vis-cla-pro-sos-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-cla-pro-sos-999.
       vis-cla-pro-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice classe                        *
      *    *                                                           *
      *    * Subroutine di accettazione valore da sostituire           *
      *    *-----------------------------------------------------------*
       acc-cla-pro-so1-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione ventuale default               *
      *                  *---------------------------------------------*
           if        w-zos-dcp-cla-min    =    zero
                     go to acc-cla-pro-so1-100.
           if        w-tes-cla-pro        not  = zero
                     go to acc-cla-pro-so1-100.
           move      w-zos-dcp-cla-min    to   w-tes-cla-pro          .
       acc-cla-pro-so1-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zp1-ope      .
           move      w-tes-cla-pro        to   w-cod-mne-zp1-cla      .
           move      w-lpt-cla-pro-lin    to   w-cod-mne-zp1-lin      .
           move      w-lpt-cla-pro-pos    to   w-cod-mne-zp1-pos      .
           add       16                   to   w-cod-mne-zp1-pos      .
           move      zero                 to   w-cod-mne-zp1-dln      .
           move      zero                 to   w-cod-mne-zp1-dps      .
           move      "<"                  to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-zp1-cll-000  thru cod-mne-zp1-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zp1-foi-000  thru cod-mne-zp1-foi-999    .
       acc-cla-pro-so1-110.
           perform   cod-mne-zp1-cll-000  thru cod-mne-zp1-cll-999    .
           if        w-cod-mne-zp1-ope    =    "F+"
                     go to acc-cla-pro-so1-115.
           if        w-cod-mne-zp1-ope    =    "AC"
                     go to acc-cla-pro-so1-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cla-pro-so1-115.
           perform   cod-mne-zp1-foi-000  thru cod-mne-zp1-foi-999    .
           go to     acc-cla-pro-so1-110.
       acc-cla-pro-so1-120.
           move      w-cod-mne-zp1-cla    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cla-pro-so1-999.
       acc-cla-pro-so1-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-cla-pro          .
       acc-cla-pro-so1-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Controllo con valori letti da filtro        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Controllo con codice min                *
      *                      *-----------------------------------------*
           if        w-zos-dcp-cla-min    =    zero
                     go to acc-cla-pro-so1-500.
           if        w-tes-cla-pro        <    w-zos-dcp-cla-min
                     go to acc-cla-pro-so1-550.
       acc-cla-pro-so1-500.
      *                      *-----------------------------------------*
      *                      * Controllo con codice max                *
      *                      *-----------------------------------------*
           if        w-zos-dcp-cla-max    =    zero
                     go to acc-cla-pro-so1-600.
           if        w-tes-cla-pro        >    w-zos-dcp-cla-max
                     go to acc-cla-pro-so1-550.
           go to     acc-cla-pro-so1-600.
       acc-cla-pro-so1-550.
      *                      *-----------------------------------------*
      *                      * Messaggio di errore                     *
      *                      *-----------------------------------------*
           move      "Incompatibilita' con il filtro di selezione !   "
                                          to   w-err-box-err-msg      .
      *                      *-----------------------------------------*
      *                      * Box di errore                           *
      *                      *-----------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
       acc-cla-pro-so1-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cla-pro-so1-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cla-pro-so1-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cla-pro-so1-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cla-pro-so1-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cla-pro-so1-999.
       acc-cla-pro-so1-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice classe                     *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore da sostituire        *
      *    *-----------------------------------------------------------*
       vis-cla-pro-so1-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-lpt-cla-pro-lin    to   v-lin                  .
           move      w-lpt-cla-pro-pos    to   v-pos                  .
           add       16                   to   v-pos                  .
           move      w-tes-cla-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cla-pro-so1-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice classe                        *
      *    *                                                           *
      *    * Subroutine di accettazione valore sostitutivo             *
      *    *-----------------------------------------------------------*
       acc-cla-pro-so2-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-cla-pro-so2-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zp1-ope      .
           move      w-tes-cla-sos        to   w-cod-mne-zp1-cla      .
           move      w-lpt-cla-pro-lin    to   w-cod-mne-zp1-lin      .
           move      w-lpt-cla-pro-pos    to   w-cod-mne-zp1-pos      .
           add       35                   to   w-cod-mne-zp1-pos      .
           move      zero                 to   w-cod-mne-zp1-dln      .
           move      zero                 to   w-cod-mne-zp1-dps      .
           move      "<"                  to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-zp1-cll-000  thru cod-mne-zp1-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zp1-foi-000  thru cod-mne-zp1-foi-999    .
       acc-cla-pro-so2-110.
           perform   cod-mne-zp1-cll-000  thru cod-mne-zp1-cll-999    .
           if        w-cod-mne-zp1-ope    =    "F+"
                     go to acc-cla-pro-so2-115.
           if        w-cod-mne-zp1-ope    =    "AC"
                     go to acc-cla-pro-so2-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cla-pro-so2-115.
           perform   cod-mne-zp1-foi-000  thru cod-mne-zp1-foi-999    .
           go to     acc-cla-pro-so2-110.
       acc-cla-pro-so2-120.
           move      w-cod-mne-zp1-cla    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cla-pro-so2-999.
       acc-cla-pro-so2-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-cla-sos          .
       acc-cla-pro-so2-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-cla-pro-so2-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-cla-pro-so2-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-cla-pro-so2-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-cla-pro-so2-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-cla-pro-so2-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-cla-pro-so2-999.
       acc-cla-pro-so2-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice classe                     *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore sostitutivo          *
      *    *-----------------------------------------------------------*
       vis-cla-pro-so2-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-lpt-cla-pro-lin    to   v-lin                  .
           move      w-lpt-cla-pro-pos    to   v-pos                  .
           add       35                   to   v-pos                  .
           move      w-tes-cla-sos        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-cla-pro-so2-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Gruppo merceologico          *
      *    *-----------------------------------------------------------*
       acc-gru-pro-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se valore da accettare                 *
      *                  *---------------------------------------------*
           if        w-tes-cla-pro        =    zero
                     go to acc-gru-pro-999.
           if        w-tes-cla-pro-sud    =    01
                     go to acc-gru-pro-999.
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-tes-gru-pro        to   w-sav-gru-pro          .
      *                  *---------------------------------------------*
      *                  * Test se richiesta sostituzione              *
      *                  *---------------------------------------------*
           if        w-tes-gru-pro-sns    =    zero
                     go to acc-gru-pro-100.
      *                  *---------------------------------------------*
      *                  * Forzatura del tasto Pf1                     *
      *                  *---------------------------------------------*
           move      "[1] "               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A test su Pf1                               *
      *                  *---------------------------------------------*
           go to     acc-gru-pro-300.
       acc-gru-pro-100.
      *              *-------------------------------------------------*
      *              * Note operative                                  *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      "[F1] per sostituzione"
                                          to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zp2-ope      .
           move      w-tes-cla-pro        to   w-cod-mne-zp2-cla      .
           move      w-tes-cla-pro-des    to   w-cod-mne-zp2-dcl      .
           move      w-tes-gru-pro        to   w-cod-mne-zp2-gru      .
           move      zero                 to   w-cod-mne-zp2-sgr      .
           move      w-lpt-gru-pro-lin    to   w-cod-mne-zp2-lin      .
           move      w-lpt-gru-pro-pos    to   w-cod-mne-zp2-pos      .
           move      w-lpt-gru-pro-lin    to   w-cod-mne-zp2-dln      .
           move      w-lpt-gru-pro-pos    to   w-cod-mne-zp2-dps      .
           add       11                   to   w-cod-mne-zp2-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "[1] "               to   v-pfk (14)             .
           perform   cod-mne-zp2-cll-000  thru cod-mne-zp2-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zp2-foi-000  thru cod-mne-zp2-foi-999    .
       acc-gru-pro-110.
           perform   cod-mne-zp2-cll-000  thru cod-mne-zp2-cll-999    .
           if        w-cod-mne-zp2-ope    =    "F+"
                     go to acc-gru-pro-115.
           if        w-cod-mne-zp2-ope    =    "AC"
                     go to acc-gru-pro-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-gru-pro-115.
           perform   cod-mne-zp2-foi-000  thru cod-mne-zp2-foi-999    .
           go to     acc-gru-pro-110.
       acc-gru-pro-120.
           move      w-cod-mne-zp2-gru    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Cancellazione eventuali note operative          *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-gru-pro-999.
       acc-gru-pro-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-gru-pro          .
       acc-gru-pro-300.
      *              *-------------------------------------------------*
      *              * Se Pf1                                          *
      *              *-------------------------------------------------*
           if        v-key                not  = "[1] "
                     go to acc-gru-pro-400.
      *                  *---------------------------------------------*
      *                  * Subroutine di accettazione valore sostitu-  *
      *                  * tivo                                        *
      *                  *---------------------------------------------*
           perform   acc-gru-pro-sos-000  thru acc-gru-pro-sos-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-gru-pro-999.
      *                  *---------------------------------------------*
      *                  * Visualizzazione sostituzione effettuata     *
      *                  *---------------------------------------------*
           perform   vis-gru-pro-sos-000  thru vis-gru-pro-sos-999    .
      *                  *---------------------------------------------*
      *                  * Se sostituzione non effettuata ma impostati *
      *                  * valori : rivisualizzazione valori impostati *
      *                  *---------------------------------------------*
           if        w-tes-gru-pro-sns    not  = zero
                     go to acc-gru-pro-800.
      *                  *---------------------------------------------*
      *                  * Visualizzazione codice impostato            *
      *                  *---------------------------------------------*
           perform   vis-gru-pro-000      thru vis-gru-pro-999        .
       acc-gru-pro-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [zp2]                      *
      *                  *---------------------------------------------*
           move      w-tes-cla-pro        to   w-let-arc-zp2-cla      .
           move      w-tes-gru-pro        to   w-let-arc-zp2-gru      .
           perform   let-arc-zp2-000      thru let-arc-zp2-999        .
      *                   *--------------------------------------------*
      *                   * Bufferizzazione di :                       *
      *                   * - Descrizione                              *
      *                   * - Ulteriore suddivisione                   *
      *                   * - Unita' di misura da proporre             *
      *                   *--------------------------------------------*
           move      w-let-arc-zp2-des    to   w-tes-gru-pro-des      .
           move      w-let-arc-zp2-sud    to   w-tes-gru-pro-sud      .
      *                   *--------------------------------------------*
      *                   * Visualizzazione descrizione                *
      *                   *--------------------------------------------*
           perform   vis-gru-pro-des-000  thru vis-gru-pro-des-999    .
       acc-gru-pro-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore impostato uguale a precedente :   *
      *                  * oltre                                       *
      *                  *---------------------------------------------*
           if        w-tes-gru-pro        =    w-sav-gru-pro
                     go to acc-gru-pro-800.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione dati  *
      *                      * sottogruppo merceologico                *
      *                      *-----------------------------------------*
           if        w-tes-sgr-pro        =    zero
                     go to acc-gru-pro-640.
           move      zero                 to   w-tes-sgr-pro          .
           move      spaces               to   w-tes-sgr-pro-des      .
           perform   vis-sgr-pro-000      thru vis-sgr-pro-999        .
           perform   vis-sgr-pro-des-000  thru vis-sgr-pro-des-999    .
       acc-gru-pro-640.
       acc-gru-pro-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-gru-pro-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-gru-pro-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-gru-pro-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-gru-pro-999.
       acc-gru-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Gruppo merceologico       *
      *    *-----------------------------------------------------------*
       vis-gru-pro-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-lpt-gru-pro-lin    to   v-lin                  .
           move      w-lpt-gru-pro-pos    to   v-pos                  .
           move      w-tes-gru-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-gru-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Descrizione gruppo        *
      *    *-----------------------------------------------------------*
       vis-gru-pro-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      w-lpt-gru-pro-lin    to   v-lin                  .
           move      w-lpt-gru-pro-pos    to   v-pos                  .
           add       11                   to   v-pos                  .
           move      w-tes-gru-pro-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-gru-pro-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice gruppo                        *
      *    *                                                           *
      *    * Subroutine di sostituzione                                *
      *    *-----------------------------------------------------------*
       acc-gru-pro-sos-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione segnale di sostituzione     *
      *                  *---------------------------------------------*
           move      zero                 to   w-tes-gru-pro-sns      .
      *                  *---------------------------------------------*
      *                  * Salvataggio immagine video                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      w-lpt-gru-pro-lin    to   v-lin                  .
           subtract  1                    from v-lin                  .
           move      w-lpt-gru-pro-pos    to   v-pos                  .
           subtract  1                    from v-pos                  .
           move      w-lpt-gru-pro-lin    to   v-lto                  .
           add       1                    to   v-lto                  .
           move      w-lpt-gru-pro-pos    to   v-pto                  .
           add       50                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-gru-pro-sos-010.
      *                  *---------------------------------------------*
      *                  * Prompts per il box                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Valore da sostituire                    *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      w-lpt-gru-pro-lin    to   v-lin                  .
           move      w-lpt-gru-pro-pos    to   v-pos                  .
           move      "Da sostituire :"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Con                                     *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      w-lpt-gru-pro-lin    to   v-lin                  .
           move      w-lpt-gru-pro-pos    to   v-pos                  .
           add       29                   to   v-pos                  .
           move      "Con :"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-gru-pro-sos-100.
      *              *-------------------------------------------------*
      *              * Visualizzazioni                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore da sostituire        *
      *                  *---------------------------------------------*
           perform   vis-gru-pro-so1-000  thru vis-gru-pro-so1-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore sostitutivo          *
      *                  *---------------------------------------------*
           perform   vis-gru-pro-so2-000  thru vis-gru-pro-so2-999    .
       acc-gru-pro-sos-200.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore da sostituire                        *
      *                  *---------------------------------------------*
           perform   acc-gru-pro-so1-000  thru acc-gru-pro-so1-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-gru-pro-sos-600.
           if        v-key                =    "UP  "
                     go to acc-gru-pro-sos-600.
           if        v-key                =    "DOWN"
                     go to acc-gru-pro-sos-600.
       acc-gru-pro-sos-300.
      *                  *---------------------------------------------*
      *                  * Valore sostitutivo                          *
      *                  *---------------------------------------------*
           perform   acc-gru-pro-so2-000  thru acc-gru-pro-so2-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-gru-pro-sos-600.
           if        v-key                =    "UP  "
                     go to acc-gru-pro-sos-200.
       acc-gru-pro-sos-600.
      *              *-------------------------------------------------*
      *              * Controlli su valori accettati                   *
      *              *-------------------------------------------------*
       acc-gru-pro-sos-800.
      *              *-------------------------------------------------*
      *              * Dipendenza dalle impostazioni                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di sostituzione effettuata          *
      *                  *---------------------------------------------*
           if        w-tes-gru-pro        not  = zero or
                     w-tes-gru-sos        not  = zero
                     move  1              to   w-tes-gru-pro-sns      .
       acc-gru-pro-sos-900.
      *              *-------------------------------------------------*
      *              * Normalizzazione stato di uscita                 *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     acc-gru-pro-sos-999.
       acc-gru-pro-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice gruppo                        *
      *    *                                                           *
      *    * Subroutine di visualizzazione sostituzione                *
      *    *-----------------------------------------------------------*
       vis-gru-pro-sos-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del segnale di sostitu-  *
      *              * zione effettuata                                *
      *              *-------------------------------------------------*
           if        w-tes-gru-pro-sns    =    zero
                     go to vis-gru-pro-sos-100
           else      go to vis-gru-pro-sos-500.
       vis-gru-pro-sos-100.
      *              *-------------------------------------------------*
      *              * Se sostituzione non effettuata                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-gru-pro-lin    to   v-lin                  .
           move      w-lpt-gru-pro-pos    to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-gru-pro-sos-900.
       vis-gru-pro-sos-500.
      *              *-------------------------------------------------*
      *              * Se sostituzione effettuata                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing codice da sostituire                *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-tes-gru-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Concatenamento prima parte                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-vis-lit-sos          .
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "( Sostituzione di :"
                                          to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      "- con :"            to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Editing codice sostitutivo                  *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-tes-gru-sos        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Concatenamento seconda parte                *
      *                  *---------------------------------------------*
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-vis-lit-sos        to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      ")"                  to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-gru-pro-lin    to   v-lin                  .
           move      w-lpt-gru-pro-pos    to   v-pos                  .
           move      w-vis-lit-sos        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-gru-pro-sos-900.
       vis-gru-pro-sos-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-gru-pro-sos-999.
       vis-gru-pro-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice gruppo                        *
      *    *                                                           *
      *    * Subroutine di accettazione valore da sostituire           *
      *    *-----------------------------------------------------------*
       acc-gru-pro-so1-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-zos-dcp-gru-min    =    zero
                     go to acc-gru-pro-so1-100.
           move      w-zos-dcp-gru-min    to   w-tes-gru-pro          .
           perform   vis-gru-pro-so1-000  thru vis-gru-pro-so1-999    .
           go to     acc-gru-pro-so1-999.
       acc-gru-pro-so1-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zp2-ope      .
           move      w-tes-cla-pro        to   w-cod-mne-zp2-cla      .
           move      w-tes-cla-pro-des    to   w-cod-mne-zp2-dcl      .
           move      w-tes-gru-pro        to   w-cod-mne-zp2-gru      .
           move      w-lpt-gru-pro-lin    to   w-cod-mne-zp2-lin      .
           move      w-lpt-gru-pro-pos    to   w-cod-mne-zp2-pos      .
           add       16                   to   w-cod-mne-zp2-pos      .
           move      zero                 to   w-cod-mne-zp2-dln      .
           move      zero                 to   w-cod-mne-zp2-dps      .
           move      "<"                  to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-zp2-cll-000  thru cod-mne-zp2-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zp2-foi-000  thru cod-mne-zp2-foi-999    .
       acc-gru-pro-so1-110.
           perform   cod-mne-zp2-cll-000  thru cod-mne-zp2-cll-999    .
           if        w-cod-mne-zp2-ope    =    "F+"
                     go to acc-gru-pro-so1-115.
           if        w-cod-mne-zp2-ope    =    "AC"
                     go to acc-gru-pro-so1-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-gru-pro-so1-115.
           perform   cod-mne-zp2-foi-000  thru cod-mne-zp2-foi-999    .
           go to     acc-gru-pro-so1-110.
       acc-gru-pro-so1-120.
           move      w-cod-mne-zp2-gru    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-gru-pro-so1-999.
       acc-gru-pro-so1-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-gru-pro          .
       acc-gru-pro-so1-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-gru-pro-so1-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-gru-pro-so1-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-gru-pro-so1-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-gru-pro-so1-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-gru-pro-so1-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-gru-pro-so1-999.
       acc-gru-pro-so1-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice gruppo                     *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore da sostituire        *
      *    *-----------------------------------------------------------*
       vis-gru-pro-so1-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-lpt-gru-pro-lin    to   v-lin                  .
           move      w-lpt-gru-pro-pos    to   v-pos                  .
           add       16                   to   v-pos                  .
           move      w-tes-gru-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-gru-pro-so1-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice gruppo                        *
      *    *                                                           *
      *    * Subroutine di accettazione valore sostitutivo             *
      *    *-----------------------------------------------------------*
       acc-gru-pro-so2-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-gru-pro-so2-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zp2-ope      .
           move      w-tes-cla-sos        to   w-cod-mne-zp2-cla      .
           move      spaces               to   w-cod-mne-zp2-dcl      .
           move      w-tes-gru-sos        to   w-cod-mne-zp2-gru      .
           move      w-lpt-gru-pro-lin    to   w-cod-mne-zp2-lin      .
           move      w-lpt-gru-pro-pos    to   w-cod-mne-zp2-pos      .
           add       35                   to   w-cod-mne-zp2-pos      .
           move      zero                 to   w-cod-mne-zp2-dln      .
           move      zero                 to   w-cod-mne-zp2-dps      .
           move      "<"                  to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-zp2-cll-000  thru cod-mne-zp2-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zp2-foi-000  thru cod-mne-zp2-foi-999    .
       acc-gru-pro-so2-110.
           perform   cod-mne-zp2-cll-000  thru cod-mne-zp2-cll-999    .
           if        w-cod-mne-zp2-ope    =    "F+"
                     go to acc-gru-pro-so2-115.
           if        w-cod-mne-zp2-ope    =    "AC"
                     go to acc-gru-pro-so2-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-gru-pro-so2-115.
           perform   cod-mne-zp2-foi-000  thru cod-mne-zp2-foi-999    .
           go to     acc-gru-pro-so2-110.
       acc-gru-pro-so2-120.
           move      w-cod-mne-zp2-gru    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-gru-pro-so2-999.
       acc-gru-pro-so2-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-gru-sos          .
       acc-gru-pro-so2-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-gru-pro-so2-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-gru-pro-so2-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-gru-pro-so2-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-gru-pro-so2-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-gru-pro-so2-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-gru-pro-so2-999.
       acc-gru-pro-so2-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice gruppo                     *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore sostitutivo          *
      *    *-----------------------------------------------------------*
       vis-gru-pro-so2-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-lpt-gru-pro-lin    to   v-lin                  .
           move      w-lpt-gru-pro-pos    to   v-pos                  .
           add       35                   to   v-pos                  .
           move      w-tes-gru-sos        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-gru-pro-so2-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Sottogruppo merceologico     *
      *    *-----------------------------------------------------------*
       acc-sgr-pro-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se valore da accettare                 *
      *                  *---------------------------------------------*
           if        w-tes-gru-pro        =    zero
                     go to acc-sgr-pro-999.
           if        w-tes-gru-pro-sud    =    01
                     go to acc-sgr-pro-999.
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-tes-sgr-pro        to   w-sav-sgr-pro          .
      *                  *---------------------------------------------*
      *                  * Test se richiesta sostituzione              *
      *                  *---------------------------------------------*
           if        w-tes-sgr-pro-sns    =    zero
                     go to acc-sgr-pro-100.
      *                  *---------------------------------------------*
      *                  * Forzatura del tasto Pf1                     *
      *                  *---------------------------------------------*
           move      "[1] "               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A test su Pf1                               *
      *                  *---------------------------------------------*
           go to     acc-sgr-pro-300.
       acc-sgr-pro-100.
      *              *-------------------------------------------------*
      *              * Note operative                                  *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      "[F1] per sostituzione"
                                          to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zp3-ope      .
           move      w-tes-cla-pro        to   w-cod-mne-zp3-cla      .
           move      w-tes-cla-pro-des    to   w-cod-mne-zp3-dcl      .
           move      w-tes-gru-pro        to   w-cod-mne-zp3-gru      .
           move      w-tes-gru-pro-des    to   w-cod-mne-zp3-dgr      .
           move      w-tes-sgr-pro        to   w-cod-mne-zp3-sgr      .
           move      w-lpt-sgr-pro-lin    to   w-cod-mne-zp3-lin      .
           move      w-lpt-sgr-pro-pos    to   w-cod-mne-zp3-pos      .
           move      w-lpt-sgr-pro-lin    to   w-cod-mne-zp3-dln      .
           move      w-lpt-sgr-pro-pos    to   w-cod-mne-zp3-dps      .
           add       11                   to   w-cod-mne-zp3-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "[1] "               to   v-pfk (14)             .
           perform   cod-mne-zp3-cll-000  thru cod-mne-zp3-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zp3-foi-000  thru cod-mne-zp3-foi-999    .
       acc-sgr-pro-110.
           perform   cod-mne-zp3-cll-000  thru cod-mne-zp3-cll-999    .
           if        w-cod-mne-zp3-ope    =    "F+"
                     go to acc-sgr-pro-115.
           if        w-cod-mne-zp3-ope    =    "AC"
                     go to acc-sgr-pro-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-sgr-pro-115.
           perform   cod-mne-zp3-foi-000  thru cod-mne-zp3-foi-999    .
           go to     acc-sgr-pro-110.
       acc-sgr-pro-120.
           move      w-cod-mne-zp3-sgr    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Cancellazione eventuali note operative          *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-sgr-pro-999.
       acc-sgr-pro-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-sgr-pro          .
       acc-sgr-pro-300.
      *              *-------------------------------------------------*
      *              * Se Pf1                                          *
      *              *-------------------------------------------------*
           if        v-key                not  = "[1] "
                     go to acc-sgr-pro-400.
      *                  *---------------------------------------------*
      *                  * Subroutine di accettazione valore sostitu-  *
      *                  * tivo                                        *
      *                  *---------------------------------------------*
           perform   acc-sgr-pro-sos-000  thru acc-sgr-pro-sos-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-sgr-pro-999.
      *                  *---------------------------------------------*
      *                  * Visualizzazione sostituzione effettuata     *
      *                  *---------------------------------------------*
           perform   vis-sgr-pro-sos-000  thru vis-sgr-pro-sos-999    .
      *                  *---------------------------------------------*
      *                  * Se sostituzione non effettuata ma impostati *
      *                  * valori : rivisualizzazione valori impostati *
      *                  *---------------------------------------------*
           if        w-tes-sgr-pro-sns    not  = zero
                     go to acc-sgr-pro-800.
      *                  *---------------------------------------------*
      *                  * Visualizzazione codice impostato            *
      *                  *---------------------------------------------*
           perform   vis-sgr-pro-000      thru vis-sgr-pro-999        .
       acc-sgr-pro-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [zp3]                      *
      *                  *---------------------------------------------*
           move      w-tes-cla-pro        to   w-let-arc-zp3-cla      .
           move      w-tes-gru-pro        to   w-let-arc-zp3-gru      .
           move      w-tes-sgr-pro        to   w-let-arc-zp3-sgr      .
           perform   let-arc-zp3-000      thru let-arc-zp3-999        .
      *                   *--------------------------------------------*
      *                   * Bufferizzazione di :                       *
      *                   * - Descrizione                              *
      *                   * - Ulteriore suddivisione                   *
      *                   * - Unita' di misura da proporre             *
      *                   *--------------------------------------------*
           move      w-let-arc-zp3-des    to   w-tes-sgr-pro-des      .
      *                   *--------------------------------------------*
      *                   * Visualizzazione descrizione                *
      *                   *--------------------------------------------*
           perform   vis-sgr-pro-des-000  thru vis-sgr-pro-des-999    .
       acc-sgr-pro-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-sgr-pro-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-sgr-pro-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-sgr-pro-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-sgr-pro-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-sgr-pro-999.
       acc-sgr-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Sottogruppo merceologico  *
      *    *-----------------------------------------------------------*
       vis-sgr-pro-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-lpt-sgr-pro-lin    to   v-lin                  .
           move      w-lpt-sgr-pro-pos    to   v-pos                  .
           move      w-tes-sgr-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sgr-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo testata : Descrizione sottogruppo   *
      *    *-----------------------------------------------------------*
       vis-sgr-pro-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      w-lpt-sgr-pro-lin    to   v-lin                  .
           move      w-lpt-sgr-pro-pos    to   v-pos                  .
           add       11                   to   v-pos                  .
           move      w-tes-sgr-pro-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sgr-pro-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice sottogruppo                   *
      *    *                                                           *
      *    * Subroutine di sostituzione                                *
      *    *-----------------------------------------------------------*
       acc-sgr-pro-sos-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione segnale di sostituzione     *
      *                  *---------------------------------------------*
           move      zero                 to   w-tes-sgr-pro-sns      .
      *                  *---------------------------------------------*
      *                  * Salvataggio immagine video                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      w-lpt-sgr-pro-lin    to   v-lin                  .
           subtract  1                    from v-lin                  .
           move      w-lpt-sgr-pro-pos    to   v-pos                  .
           subtract  1                    from v-pos                  .
           move      w-lpt-sgr-pro-lin    to   v-lto                  .
           add       1                    to   v-lto                  .
           move      w-lpt-sgr-pro-pos    to   v-pto                  .
           add       50                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-sgr-pro-sos-010.
      *                  *---------------------------------------------*
      *                  * Prompts per il box                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Valore da sostituire                    *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      w-lpt-sgr-pro-lin    to   v-lin                  .
           move      w-lpt-sgr-pro-pos    to   v-pos                  .
           move      "Da sostituire :"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Con                                     *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      w-lpt-sgr-pro-lin    to   v-lin                  .
           move      w-lpt-sgr-pro-pos    to   v-pos                  .
           add       29                   to   v-pos                  .
           move      "Con :"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-sgr-pro-sos-100.
      *              *-------------------------------------------------*
      *              * Visualizzazioni                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore da sostituire        *
      *                  *---------------------------------------------*
           perform   vis-sgr-pro-so1-000  thru vis-sgr-pro-so1-999    .
      *                  *---------------------------------------------*
      *                  * Visualizzazione valore sostitutivo          *
      *                  *---------------------------------------------*
           perform   vis-sgr-pro-so2-000  thru vis-sgr-pro-so2-999    .
       acc-sgr-pro-sos-200.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valore da sostituire                        *
      *                  *---------------------------------------------*
           perform   acc-sgr-pro-so1-000  thru acc-sgr-pro-so1-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-sgr-pro-sos-600.
           if        v-key                =    "UP  "
                     go to acc-sgr-pro-sos-600.
           if        v-key                =    "DOWN"
                     go to acc-sgr-pro-sos-600.
       acc-sgr-pro-sos-300.
      *                  *---------------------------------------------*
      *                  * Valore sostitutivo                          *
      *                  *---------------------------------------------*
           perform   acc-sgr-pro-so2-000  thru acc-sgr-pro-so2-999    .
           if        w-cnt-tus-acc-key    not  = spaces
                     go to acc-sgr-pro-sos-600.
           if        v-key                =    "UP  "
                     go to acc-sgr-pro-sos-200.
       acc-sgr-pro-sos-600.
      *              *-------------------------------------------------*
      *              * Controlli su valori accettati                   *
      *              *-------------------------------------------------*
       acc-sgr-pro-sos-800.
      *              *-------------------------------------------------*
      *              * Dipendenza dalle impostazioni                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di sostituzione effettuata          *
      *                  *---------------------------------------------*
           if        w-tes-sgr-pro        not  = zero or
                     w-tes-sgr-sos        not  = zero
                     move  1              to   w-tes-sgr-pro-sns      .
       acc-sgr-pro-sos-900.
      *              *-------------------------------------------------*
      *              * Normalizzazione stato di uscita                 *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-key      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     acc-sgr-pro-sos-999.
       acc-sgr-pro-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice sottogruppo                   *
      *    *                                                           *
      *    * Subroutine di visualizzazione sostituzione                *
      *    *-----------------------------------------------------------*
       vis-sgr-pro-sos-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del segnale di sostitu-  *
      *              * zione effettuata                                *
      *              *-------------------------------------------------*
           if        w-tes-sgr-pro-sns    =    zero
                     go to vis-sgr-pro-sos-100
           else      go to vis-sgr-pro-sos-500.
       vis-sgr-pro-sos-100.
      *              *-------------------------------------------------*
      *              * Se sostituzione non effettuata                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-sgr-pro-lin    to   v-lin                  .
           move      w-lpt-sgr-pro-pos    to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-sgr-pro-sos-900.
       vis-sgr-pro-sos-500.
      *              *-------------------------------------------------*
      *              * Se sostituzione effettuata                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing codice da sostituire                *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-tes-sgr-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Concatenamento prima parte                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-vis-lit-sos          .
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "( Sostituzione di :"
                                          to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      "- con :"            to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Editing codice sostitutivo                  *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-tes-sgr-sos        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Concatenamento seconda parte                *
      *                  *---------------------------------------------*
           move      50                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-vis-lit-sos        to   w-all-str-cat (1)      .
           move      v-edt                to   w-all-str-cat (2)      .
           move      ")"                  to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-vis-lit-sos          .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      50                   to   v-car                  .
           move      w-lpt-sgr-pro-lin    to   v-lin                  .
           move      w-lpt-sgr-pro-pos    to   v-pos                  .
           move      w-vis-lit-sos        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     vis-sgr-pro-sos-900.
       vis-sgr-pro-sos-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-sgr-pro-sos-999.
       vis-sgr-pro-sos-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice sottogruppo                   *
      *    *                                                           *
      *    * Subroutine di accettazione valore da sostituire           *
      *    *-----------------------------------------------------------*
       acc-sgr-pro-so1-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-zos-dcp-sgr-min    =    zero
                     go to acc-sgr-pro-so1-100.
           move      w-zos-dcp-sgr-min    to   w-tes-sgr-pro          .
           perform   vis-sgr-pro-so1-000  thru vis-sgr-pro-so1-999    .
           go to     acc-sgr-pro-so1-999.
       acc-sgr-pro-so1-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zp3-ope      .
           move      w-tes-cla-pro        to   w-cod-mne-zp3-cla      .
           move      w-tes-cla-pro-des    to   w-cod-mne-zp3-dcl      .
           move      w-tes-gru-pro        to   w-cod-mne-zp3-gru      .
           move      w-tes-gru-pro-des    to   w-cod-mne-zp3-dgr      .
           move      w-tes-sgr-pro        to   w-cod-mne-zp3-sgr      .
           move      w-lpt-sgr-pro-lin    to   w-cod-mne-zp3-lin      .
           move      w-lpt-sgr-pro-pos    to   w-cod-mne-zp3-pos      .
           add       16                   to   w-cod-mne-zp3-pos      .
           move      zero                 to   w-cod-mne-zp3-dln      .
           move      zero                 to   w-cod-mne-zp3-dps      .
           move      "<"                  to   v-edm                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-zp3-cll-000  thru cod-mne-zp3-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zp3-foi-000  thru cod-mne-zp3-foi-999    .
       acc-sgr-pro-so1-110.
           perform   cod-mne-zp3-cll-000  thru cod-mne-zp3-cll-999    .
           if        w-cod-mne-zp3-ope    =    "F+"
                     go to acc-sgr-pro-so1-115.
           if        w-cod-mne-zp3-ope    =    "AC"
                     go to acc-sgr-pro-so1-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-sgr-pro-so1-115.
           perform   cod-mne-zp3-foi-000  thru cod-mne-zp3-foi-999    .
           go to     acc-sgr-pro-so1-110.
       acc-sgr-pro-so1-120.
           move      w-cod-mne-zp3-sgr    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-sgr-pro-so1-999.
       acc-sgr-pro-so1-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-sgr-pro          .
       acc-sgr-pro-so1-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-sgr-pro-so1-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-sgr-pro-so1-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-sgr-pro-so1-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-sgr-pro-so1-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-sgr-pro-so1-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-sgr-pro-so1-999.
       acc-sgr-pro-so1-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice sottogruppo                *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore da sostituire        *
      *    *-----------------------------------------------------------*
       vis-sgr-pro-so1-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-lpt-sgr-pro-lin    to   v-lin                  .
           move      w-lpt-sgr-pro-pos    to   v-pos                  .
           add       16                   to   v-pos                  .
           move      w-tes-sgr-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sgr-pro-so1-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Codice sottogruppo                   *
      *    *                                                           *
      *    * Subroutine di accettazione valore sostitutivo             *
      *    *-----------------------------------------------------------*
       acc-sgr-pro-so2-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-sgr-pro-so2-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zp3-ope      .
           move      w-tes-cla-sos        to   w-cod-mne-zp3-cla      .
           move      spaces               to   w-cod-mne-zp3-dcl      .
           move      w-tes-gru-sos        to   w-cod-mne-zp3-gru      .
           move      spaces               to   w-cod-mne-zp3-dgr      .
           move      w-tes-sgr-sos        to   w-cod-mne-zp3-sgr      .
           move      w-lpt-sgr-pro-lin    to   w-cod-mne-zp3-lin      .
           move      w-lpt-sgr-pro-pos    to   w-cod-mne-zp3-pos      .
           add       35                   to   w-cod-mne-zp3-pos      .
           move      zero                 to   w-cod-mne-zp3-dln      .
           move      zero                 to   w-cod-mne-zp3-dps      .
           move      "<"                  to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-zp3-cll-000  thru cod-mne-zp3-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zp3-foi-000  thru cod-mne-zp3-foi-999    .
       acc-sgr-pro-so2-110.
           perform   cod-mne-zp3-cll-000  thru cod-mne-zp3-cll-999    .
           if        w-cod-mne-zp3-ope    =    "F+"
                     go to acc-sgr-pro-so2-115.
           if        w-cod-mne-zp3-ope    =    "AC"
                     go to acc-sgr-pro-so2-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-sgr-pro-so2-115.
           perform   cod-mne-zp3-foi-000  thru cod-mne-zp3-foi-999    .
           go to     acc-sgr-pro-so2-110.
       acc-sgr-pro-so2-120.
           move      w-cod-mne-zp3-sgr    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-sgr-pro-so2-999.
       acc-sgr-pro-so2-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-tes-sgr-sos          .
       acc-sgr-pro-so2-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-sgr-pro-so2-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-sgr-pro-so2-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                not  = "DO  "
                     go to acc-sgr-pro-so2-999.
           perform   cnt-key-vuo-000      thru cnt-key-vuo-999        .
           if        w-cnt-key-vuo-flg    not  = spaces
                     move  "E"            to   w-cnt-tus-acc-key
                     go to acc-sgr-pro-so2-999.
           perform   cnt-tdo-key-000      thru cnt-tdo-key-999        .
           if        w-cnt-tdo-key-flg    not  = spaces
                     go to acc-sgr-pro-so2-100
           else      move  "S"            to   w-cnt-tus-acc-key
                     go to acc-sgr-pro-so2-999.
       acc-sgr-pro-so2-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Codice sottogruppo                *
      *    *                                                           *
      *    * Subroutine di visualizzazione valore sostitutivo          *
      *    *-----------------------------------------------------------*
       vis-sgr-pro-so2-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-lpt-sgr-pro-lin    to   v-lin                  .
           move      w-lpt-sgr-pro-pos    to   v-pos                  .
           add       35                   to   v-pos                  .
           move      w-tes-sgr-sos        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-sgr-pro-so2-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Conferma impostazioni                *
      *    *-----------------------------------------------------------*
       acc-cnf-imp-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea 23                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Linea 24                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Conferma impostazioni (S/N/E) ? "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione valore da impostare         *
      *                  *---------------------------------------------*
           move      spaces               to   w-tes-cnf-imp          .
       acc-cnf-imp-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      33                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-tes-cnf-imp        to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-cnf-imp-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-tes-cnf-imp          .
       acc-cnf-imp-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se impostata una function-key prevista : Ok *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  " or
                     v-key                =    "DO  " or
                     v-key                =    "EXIT"
                     go to acc-cnf-imp-450.
      *                  *---------------------------------------------*
      *                  * Se impostato un carattere previsto : Ok     *
      *                  *---------------------------------------------*
           if        w-tes-cnf-imp        =    "S" or
                     w-tes-cnf-imp        =    "N" or
                     w-tes-cnf-imp        =    "E"
                     go to acc-cnf-imp-450.
      *                  *---------------------------------------------*
      *                  * Altrimenti : reimpostazione                 *
      *                  *---------------------------------------------*
           go to     acc-cnf-imp-100.
       acc-cnf-imp-450.
      *                  *---------------------------------------------*
      *                  * Cancellazione prompts                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Linea 23                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Linea 24                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cnf-imp-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda della function-key o   *
      *                  * del carattere impostato                     *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-cnf-imp-625
           else if   v-key                =    "DO  "
                     go to acc-cnf-imp-650
           else if   v-key                =    "EXIT"
                     go to acc-cnf-imp-675.
           if        w-tes-cnf-imp        =    "N"
                     go to acc-cnf-imp-625
           else if   w-tes-cnf-imp        =    "S"
                     go to acc-cnf-imp-650
           else if   w-tes-cnf-imp        =    "E"
                     go to acc-cnf-imp-675.
       acc-cnf-imp-625.
      *                  *---------------------------------------------*
      *                  * Se Up o 'N'                                 *
      *                  *---------------------------------------------*
           move      "UP  "               to   v-key                  .
           go to     acc-cnf-imp-999.
       acc-cnf-imp-650.
      *                  *---------------------------------------------*
      *                  * Se Do o 'S'                                 *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
           go to     acc-cnf-imp-999.
       acc-cnf-imp-675.
      *                  *---------------------------------------------*
      *                  * Se Exit o 'E'                               *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-key      .
           go to     acc-cnf-imp-999.
       acc-cnf-imp-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campi non chiave della registrazione         *
      *    *-----------------------------------------------------------*
       acc-nok-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-nok      .
      *              *-------------------------------------------------*
      *              * Visualizzazione tipo funzionamento              *
      *              *-------------------------------------------------*
           perform   vis-tip-fun-000      thru vis-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione se in modi- *
      *              * fica o visualizzazione, per testata e corpo     *
      *              *-------------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M" or
                     w-cnt-mfu-tip-fun    =    "V"
                     move  "#"            to   w-cnt-sts-imp-tes
                     move  all "#"        to   w-cnt-sts-imp-pte
                     move  all "#"        to   w-cnt-sts-ing-pte
                     move  "#"            to   w-cnt-sts-imp-cor      .
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione per piede   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-pie      .
       acc-nok-reg-200.
      *              *-------------------------------------------------*
      *              * Trattamento testata                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione del numero di pagine che     *
      *                  * compongono la testata                       *
      *                  *---------------------------------------------*
           perform   dmp-tes-reg-000      thru dmp-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati corpo                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-cor      
                                               w-cnt-sts-vis-cor      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati riga corpo             *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-rig      
                                               w-cnt-sts-vis-rig      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati piede                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-pie      
                                               w-cnt-sts-vis-pie      .
      *                  *---------------------------------------------*
      *                  * Prompts per campi chiave                    *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-key    =    spaces
                     perform pmt-key-reg-000
                                          thru pmt-key-reg-999
                     move    "#"          to   w-cnt-sts-pmt-key      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati campi chiave           *
      *                  *---------------------------------------------*
           if        w-cnt-sts-vis-key    =    spaces
                     perform vis-key-reg-000
                                          thru vis-key-reg-999
                     move    "#"          to   w-cnt-sts-vis-key      .
      *                  *---------------------------------------------*
      *                  * Prompts per pagina di testata               *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-ptx
                    (w-cnt-sts-imp-npt)   =    spaces
                     perform pmt-tes-reg-000
                                          thru pmt-tes-reg-999
                     move    "#"          to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Visualizzazione dati pagina testata         *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "M"      or
                     w-cnt-mfu-tip-fun    =    "V"      or
                     w-cnt-sts-imp-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces or
                     w-cnt-sts-ing-ptx
                    (w-cnt-sts-imp-npt)   not  = spaces
                     if    w-cnt-sts-vis-ptx
                          (w-cnt-sts-imp-npt)
                                          =    spaces
                           perform vis-tes-reg-000
                                          thru vis-tes-reg-999
                           move    "#"    to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Flag di ingresso in pagina di testata       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-ing-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Accettazione dati testata                   *
      *                  *---------------------------------------------*
           perform   acc-tes-reg-000      thru acc-tes-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita definitivo                   *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "S" or
                     w-cnt-tus-acc-tes    =    "X" or
                     w-cnt-tus-acc-tes    =    "E"
                     move  w-cnt-tus-acc-tes
                                          to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999.
      *                  *---------------------------------------------*
      *                  * Se spostamento di pagina                    *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-tes    =    "-"
                     go to acc-nok-reg-225
           else      go to acc-nok-reg-250.
       acc-nok-reg-225.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina precedente      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' 1 si ignora *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  > 1
                     go to acc-nok-reg-200.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina attuale a : no    *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-npt)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-npt)     .
       acc-nok-reg-230.
      *                          *-------------------------------------*
      *                          * Decremento numero pagina attuale    *
      *                          *-------------------------------------*
           subtract  1                    from w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : decremento ulteriore        *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces and
                     w-cnt-sts-imp-npt    >    1
                     go to acc-nok-reg-230.
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-250.
      *                      *-----------------------------------------*
      *                      * Se spostamento a pagina successiva      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Salvataggio numero pagina attuale   *
      *                          *-------------------------------------*
           move      w-cnt-sts-imp-npt    to   w-cnt-sts-imp-svp      .
       acc-nok-reg-260.
      *                          *-------------------------------------*
      *                          * Status di impostazione dati della   *
      *                          * della pagina attuale a : si'        *
      *                          *-------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ptx
                                              (w-cnt-sts-imp-npt)     .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si pone lo status di impostazione   *
      *                          * dati generale testata a si'         *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  "#"            to   w-cnt-sts-imp-tes      .
      *                          *-------------------------------------*
      *                          * Se la pagina attuale e' la massima  *
      *                          * si va' ad accettazione corpo        *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-npt    not  < w-cnt-sts-imp-mpt
                     move  w-cnt-sts-imp-svp
                                          to   w-cnt-sts-imp-npt
                     go to acc-nok-reg-300.
      *                          *-------------------------------------*
      *                          * Incremento numero pagina attuale    *
      *                          *-------------------------------------*
           add       1                    to   w-cnt-sts-imp-npt      .
      *                          *-------------------------------------*
      *                          * Test se pagina da trattare          *
      *                          *-------------------------------------*
           perform   snp-tes-reg-000      thru snp-tes-reg-999        .
      *                          *-------------------------------------*
      *                          * Se no : a re-incremento             *
      *                          *-------------------------------------*
           if        w-cnt-sts-imp-snp    not  = spaces
                     go to acc-nok-reg-260.
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della chiave a : no            *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      .
           move      spaces               to   w-cnt-sts-vis-key      .
      *                          *-------------------------------------*
      *                          * Status di visualizzazione prompts e *
      *                          * dati della pagina impostata a : no  *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ptx
                                              (w-cnt-sts-imp-svp)     .
           move      spaces               to   w-cnt-sts-vis-ptx
                                              (w-cnt-sts-imp-svp)     .
      *                          *-------------------------------------*
      *                          * Riciclo ad impostazione testata     *
      *                          *-------------------------------------*
           go to     acc-nok-reg-200.
       acc-nok-reg-300.
      *                  *---------------------------------------------*
      *                  * Numero riga corpo da accettare : 1          *
      *                  *---------------------------------------------*
           move       1                   to   w-cnt-cor-nrg-dac      .
       acc-nok-reg-400.
      *              *-------------------------------------------------*
      *              * Trattamento corpo                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati chiave                 *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-key      
                                               w-cnt-sts-vis-key      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati testata                *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-tes
                                               w-cnt-sts-pmt-pte
                                               w-cnt-sts-vis-tes
                                               w-cnt-sts-vis-pte      .
      *                  *---------------------------------------------*
      *                  * Assestamento flags di controllo visualizza- *
      *                  * zione prompts e dati piede                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-pie      
                                               w-cnt-sts-vis-pie      .
      *                  *---------------------------------------------*
      *                  * Accettazione dati corpo                     *
      *                  *---------------------------------------------*
           perform   acc-cor-reg-000      thru acc-cor-reg-999        .
      *                  *---------------------------------------------*
      *                  * Se tipo uscita definitivo                   *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-cor    =    "S" or
                     w-cnt-tus-acc-cor    =    "X" or
                     w-cnt-tus-acc-cor    =    "E"
                     move  w-cnt-tus-acc-cor
                                          to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999.
      *                  *---------------------------------------------*
      *                  * Se tipo uscita "-"                          *
      *                  *---------------------------------------------*
           if        w-cnt-tus-acc-cor    =    "-"
                     go to acc-nok-reg-200.
       acc-nok-reg-800.
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Se attualmente visualizzato il corpo si e-  *
      *                  * segue la visualizzazione dei prompts della  *
      *                  * riga corpo espansa                          *
      *                  *---------------------------------------------*
           if        w-cnt-sts-pmt-cor    =    spaces
                     go to acc-nok-reg-805.
           perform   pmt-rig-cor-000      thru pmt-rig-cor-999        .
       acc-nok-reg-805.
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-nok-reg-810.
      *                  *---------------------------------------------*
      *                  * Test se sola visualizzazione                *
      *                  *---------------------------------------------*
           if        w-cnt-mfu-tip-fun    =    "V"
                     go to acc-nok-reg-820
           else      go to acc-nok-reg-830.
       acc-nok-reg-820.
      *                      *-----------------------------------------*
      *                      * Accettazione se sola visualizzazione    *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#VIS"               to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "E"                  to   v-msk                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "E"
                     move  "EXIT"         to   v-key                  .
           go to     acc-nok-reg-840.
       acc-nok-reg-830.
      *                      *-----------------------------------------*
      *                      * Accettazione se inserimento o modifica  *
      *                      *-----------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "#SAV"               to   v-not                  .
           move      spaces               to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-nok-reg-840.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "E"           to   w-cnt-tus-acc-nok
                     go to acc-nok-reg-999
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-nok-reg-840.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-nok-reg-850
           else if   v-key                =    "EXIT"
                     go to acc-nok-reg-860
           else if   v-key                =    "UP  "
                     go to acc-nok-reg-870
           else      go to acc-nok-reg-810.
       acc-nok-reg-850.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-tus-acc-nok      .
           perform   cnt-tdo-nok-000      thru cnt-tdo-nok-999        .
           if        w-cnt-tdo-nok-flg    not  = spaces
                     go to acc-nok-reg-870.
           go to     acc-nok-reg-999.
       acc-nok-reg-860.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Subroutine di controllo per Exit        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se Exit non attivato : come 'Up'    *
      *                          *-------------------------------------*
           perform   exe-acc-cmp-exi-000  thru exe-acc-cmp-exi-999    .
           if        w-cnt-acc-flg-exi    not  = spaces
                     go to acc-nok-reg-870.
      *                          *-------------------------------------*
      *                          * Se Exit attivato                    *
      *                          *-------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-nok      .
           go to     acc-nok-reg-999.
       acc-nok-reg-870.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nr riga corpo da accettare : max        *
      *                      *-----------------------------------------*
           move      w-rlt-sup-max        to   w-cnt-cor-nrg-dac      .
      *                      *-----------------------------------------*
      *                      * Ad accettazione corpo                   *
      *                      *-----------------------------------------*
           move      spaces               to   v-key                  .
           go to     acc-nok-reg-400.
       acc-nok-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione numero pagine che compongono la testata    *
      *    *-----------------------------------------------------------*
       dmp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * La testata e' composta di nr. 1 pagine          *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-sts-imp-mpt      .
       dmp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione si/no pagina w-cnt-sts-imp-npt da trattare *
      *    *-----------------------------------------------------------*
       snp-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Flag di uscita a Si                             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-snp      .
       snp-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione testata registrazione                        *
      *    *-----------------------------------------------------------*
       acc-tes-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-tes      .
      *              *-------------------------------------------------*
      *              * Normalizzazione function-key                    *
      *              *-------------------------------------------------*
           move      spaces               to   v-key                  .
      *              *-------------------------------------------------*
      *              * Tipo impostazione : testata                     *
      *              *-------------------------------------------------*
           move      "T"                  to   w-cnt-mfu-tip-imp      .
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Disabilitazione forzata del tasto Delt      *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-itd      .
      *                  *---------------------------------------------*
      *                  * Fine Pagina                                 *
      *                  *---------------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-tes      .
           go to     acc-tes-reg-999.
       acc-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione testata registrazione                     *
      *    *-----------------------------------------------------------*
       vis-tes-reg-000.
       vis-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts testata                           *
      *    *-----------------------------------------------------------*
       pmt-tes-reg-000.
       pmt-tes-reg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo testata : Presa visione per pagina     *
      *    *-----------------------------------------------------------*
       acc-pre-vpg-000.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      spaces               to   v-msk                  .
           move      spaces               to   v-alf                  .
           move      spaces               to   v-not                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Delt                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DELT"
                     move  "X"            to   w-cnt-tus-acc-tes
                     go to acc-pre-vpg-999.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-tes
                             go to acc-pre-vpg-999
                     else    move  spaces to   w-cnt-tdo-nok-flg
                             go to acc-pre-vpg-000.
       acc-pre-vpg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione corpo a partire dalla riga con numero d'or-  *
      *    * dine : w-cnt-cor-nrg-dac                                  *
      *    *-----------------------------------------------------------*
       acc-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita da corpo            *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-cor      .
      *              *-------------------------------------------------*
      *              * Confronto tra numero d'ordine riga da accettare *
      *              * e numero d'ordine dell'ultima riga              *
      *              *-------------------------------------------------*
           if        w-cnt-cor-nrg-dac    not  > w-rlt-sup-max
                     go to acc-cor-reg-025.
      *              *-------------------------------------------------*
      *              * Se oltre numero riga massimo si esce con status *
      *              * di uscita "+"                                   *
      *              *-------------------------------------------------*
           move      "+"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-025.
      *              *-------------------------------------------------*
      *              * Video in 'OFF'                                  *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Prompts per corpo                               *
      *              *-------------------------------------------------*
           if        w-cnt-sts-pmt-cor    =    spaces
                     perform pmt-cor-reg-000
                                          thru pmt-cor-reg-999
                     move    "#"          to   w-cnt-sts-pmt-cor      .
      *              *-------------------------------------------------*
      *              * Visualizzazione dati corpo                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione nr pagina da visualizzare    *
      *                  *---------------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrp-dav      .
           add       w-lin-num-lin-vis    to   w-cnt-cor-nrp-dav      .
           subtract  1                    from w-cnt-cor-nrp-dav      .
           divide    w-lin-num-lin-vis    into w-cnt-cor-nrp-dav      .
      *                  *---------------------------------------------*
      *                  * Se non e' visualizzata nessuna pagina corpo *
      *                  * o una pagina corpo diversa da quella da vi- *
      *                  * sualizzare si procede alla visualizzazione  *
      *                  *---------------------------------------------*
           if        w-cnt-sts-vis-cor    =    spaces           or
                     w-cnt-cor-nrp-vis    not  = w-cnt-cor-nrp-dav
                     perform vis-cor-reg-000
                                          thru vis-cor-reg-999
                     move    "#"          to   w-cnt-sts-vis-cor
                     move    w-cnt-cor-nrp-dav
                                          to   w-cnt-cor-nrp-vis      .
      *              *-------------------------------------------------*
      *              * Lettura riga da file relative di supporto       *
      *              *-------------------------------------------------*
           move      "RD"                 to   w-rlt-sup-ope          .
           move      w-cnt-cor-nrg-dac    to   w-rlt-sup-prg          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
           move      w-rlt-sup-buf        to   w-rig                  .
       acc-cor-reg-050.
      *              *-------------------------------------------------*
      *              * Routine pre-accettazione riga corpo             *
      *              *-------------------------------------------------*
           perform   pre-rig-cor-000      thru pre-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts per riga d'accettazione *
      *              *-------------------------------------------------*
           perform   pmt-rig-cor-000      thru pmt-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione dati per riga di accettazione   *
      *              *-------------------------------------------------*
           perform   vis-rig-cor-000      thru vis-rig-cor-999        .
      *              *-------------------------------------------------*
      *              * Video in 'ON'                                   *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Flag di status impostazione corpo               *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-cor      .
      *              *-------------------------------------------------*
      *              * Flag di status impostione riga attuale          *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-rig      .
      *              *-------------------------------------------------*
      *              * Indicatore linea in corso di trattamento        *
      *              *-------------------------------------------------*
           move      "I"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione tipo uscita da riga corpo       *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tus-acc-rig      .
       acc-cor-reg-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo impostazione : primo campo riga corpo  *
      *                  *---------------------------------------------*
           move      "C"                  to   w-cnt-mfu-tip-imp      .
      *                  *---------------------------------------------*
      *                  * Accettazione Codice alfanumerico prodotto   *
      *                  *---------------------------------------------*
           perform   acc-alf-pro-000      thru acc-alf-pro-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-925.
      *                  *---------------------------------------------*
      *                  * Tipo impostazione : altri campi riga corpo  *
      *                  *---------------------------------------------*
           move      "R"                  to   w-cnt-mfu-tip-imp      .
       acc-cor-reg-200.
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Codice classe                               *
      *                  *---------------------------------------------*
           perform   acc-rig-cla-000      thru acc-rig-cla-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
       acc-cor-reg-250.
      *                  *---------------------------------------------*
      *                  * Codice gruppo                               *
      *                  *---------------------------------------------*
           perform   acc-rig-gru-000      thru acc-rig-gru-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-200.
       acc-cor-reg-300.
      *                  *---------------------------------------------*
      *                  * Codice sottogruppo                          *
      *                  *---------------------------------------------*
           perform   acc-rig-sgr-000      thru acc-rig-sgr-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-250.
       acc-cor-reg-350.
      *                  *---------------------------------------------*
      *                  * Unita' di misura                            *
      *                  *---------------------------------------------*
           perform   acc-rig-umi-000      thru acc-rig-umi-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-300.
       acc-cor-reg-400.
      *                  *---------------------------------------------*
      *                  * Tipo prodotto                               *
      *                  *---------------------------------------------*
           perform   acc-rig-tip-000      thru acc-rig-tip-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-350.
       acc-cor-reg-450.
      *                  *---------------------------------------------*
      *                  * Sinonimo                                    *
      *                  *---------------------------------------------*
           perform   acc-rig-syn-000      thru acc-rig-syn-999        .
           if        w-cnt-tus-acc-rig    not  = spaces
                     go to acc-cor-reg-900.
           if        v-key                =    "UP  "
                     go to acc-cor-reg-400.
       acc-cor-reg-800.
      *              *-------------------------------------------------*
      *              * Controllo finale su riga impostata              *
      *              *-------------------------------------------------*
           perform   cnt-tdo-rig-000      thru cnt-tdo-rig-999        .
           if        w-cnt-tdo-rig-flg    not  = spaces
                     move  spaces         to   w-cnt-tdo-rig-flg
                     move  "UP  "         to   v-key
                     go to acc-cor-reg-200.
       acc-cor-reg-900.
      *              *-------------------------------------------------*
      *              * Tests per uscita significativa da interno riga  *
      *              *-------------------------------------------------*
           if        w-cnt-tus-acc-rig    =    spaces or
                     w-cnt-tus-acc-rig    =    "S"
                     go to acc-cor-reg-905.
      *                  *---------------------------------------------*
      *                  * Se Exit da interno riga                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione numero riga             *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
           go to     acc-cor-reg-000.
       acc-cor-reg-905.
      *                  *---------------------------------------------*
      *                  * Se Do da interno riga                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Routine post-accettazione riga          *
      *                      *-----------------------------------------*
           move      "+"                  to   w-cnt-cor-tip-agg      .
           perform   pos-rig-cor-000      thru pos-rig-cor-999        .
      *                      *-----------------------------------------*
      *                      * Update riga su file relative di suppor- *
      *                      * to                                      *
      *                      *-----------------------------------------*
           move      "UP"                 to   w-rlt-sup-ope          .
           move      w-cnt-cor-nrg-dac    to   w-rlt-sup-prg          .
           move      w-rig                to   w-rlt-sup-buf          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
      *                      *-----------------------------------------*
      *                      * Visualizzazione linea corpo             *
      *                      *-----------------------------------------*
           move      "R"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Incremento del numero d'ordine della    *
      *                      * riga da accettare                       *
      *                      *-----------------------------------------*
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-925.
      *              *-------------------------------------------------*
      *              * Tests per uscita significativa dal primo campo  *
      *              * di impostazione della riga                      *
      *              *-------------------------------------------------*
           if        w-cnt-tus-acc-rig    =    "U"
                     go to acc-cor-reg-935
           else if   w-cnt-tus-acc-rig    =    "D"
                     go to acc-cor-reg-940
           else if   w-cnt-tus-acc-rig    =    "S"
                     go to acc-cor-reg-945
           else if   w-cnt-tus-acc-rig    =    "T"
                     go to acc-cor-reg-965
           else if   w-cnt-tus-acc-rig    =    "B"
                     go to acc-cor-reg-970
           else if   w-cnt-tus-acc-rig    =    "N"
                     go to acc-cor-reg-975
           else if   w-cnt-tus-acc-rig    =    "P"
                     go to acc-cor-reg-980
           else if   w-cnt-tus-acc-rig    =    "."
                     go to acc-cor-reg-985.
       acc-cor-reg-930.
      *                  *---------------------------------------------*
      *                  * Se Exit da primo campo di impostazione riga *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-935.
      *                  *---------------------------------------------*
      *                  * Se Up da primo campo di impostazione riga   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Decremento numero riga da accettare     *
      *                      *-----------------------------------------*
           subtract  1                    from w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-940.
      *                  *---------------------------------------------*
      *                  * Se Down da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Incremento del numero riga              *
      *                      *-----------------------------------------*
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-945.
      *                  *---------------------------------------------*
      *                  * Se Do da primo campo di impostazione riga   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Status di uscita a 'S'                  *
      *                      *-----------------------------------------*
           move      "S"                  to   w-cnt-tus-acc-cor      .
           go to     acc-cor-reg-990.
       acc-cor-reg-965.
      *                  *---------------------------------------------*
      *                  * Se Tab da primo campo di impostazione riga  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Ad accettazione ultimo record           *
      *                      *-----------------------------------------*
           move      w-rlt-sup-max        to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-970.
      *                  *---------------------------------------------*
      *                  * Se Back da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
           move      1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-975.
      *                  *---------------------------------------------*
      *                  * Se Nxsc da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Determinazione numero d'ordine della    *
      *                      * prima riga appartenente alla pagina     *
      *                      * successiva a quella attuale             *
      *                      *-----------------------------------------*
           move      w-cnt-cor-nrg-dac    to   w-cnt-wrk-ctr-001      .
           add       w-lin-num-lin-vis    to   w-cnt-wrk-ctr-001      .
           subtract  1                    from w-cnt-wrk-ctr-001      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-001      .
           multiply  w-lin-num-lin-vis    by   w-cnt-wrk-ctr-001      .
           add       1                    to   w-cnt-wrk-ctr-001      .
      *                      *-----------------------------------------*
      *                      * Se questa e' maggiore del numero riga   *
      *                      * massimo si esce con '+'                 *
      *                      *-----------------------------------------*
           if        w-cnt-wrk-ctr-001    >    w-rlt-sup-max
                     move  "+"            to   w-cnt-tus-acc-cor
                     go to acc-cor-reg-990.
      *                      *-----------------------------------------*
      *                      * Altrimenti : ad accettazione della pri- *
      *                      * ma riga della pagina successiva         *
      *                      *-----------------------------------------*
           move      w-cnt-wrk-ctr-001    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-980.
      *                  *---------------------------------------------*
      *                  * Se Prsc da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Se si e' sulla prima pagina : si ignora *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  > w-lin-num-lin-vis
                     go to acc-cor-reg-000.
      *                      *-----------------------------------------*
      *                      * Se non si e' sulla prima pagina : alla  *
      *                      * accettazione della prima riga della pa- *
      *                      * gina precedente                         *
      *                      *-----------------------------------------*
           subtract  w-lin-num-lin-vis    from w-cnt-cor-nrg-dac      .
           subtract  1                    from w-cnt-cor-nrg-dac      .
           divide    w-lin-num-lin-vis    into w-cnt-cor-nrg-dac      .
           multiply  w-lin-num-lin-vis    by   w-cnt-cor-nrg-dac      .
           add       1                    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-985.
      *                  *---------------------------------------------*
      *                  * Se Slct da primo campo di impostazione riga *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione del numero riga         *
      *                      *-----------------------------------------*
           move      "N"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-cor-nrg-dac    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                      *-----------------------------------------*
      *                      * Ad accettazione nr riga selezionato     *
      *                      *-----------------------------------------*
           move      w-cnt-slc-num-rig    to   w-cnt-cor-nrg-dac      .
           go to     acc-cor-reg-000.
       acc-cor-reg-990.
      *              *-------------------------------------------------*
      *              * Assestamento status di impostazione corpo       *
      *              *-------------------------------------------------*
           if        w-rlt-sup-max        =    zero
                     move  spaces         to   w-cnt-sts-imp-cor
           else      move  "#"            to   w-cnt-sts-imp-cor      .
       acc-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina corpo numero : w-cnt-cor-nrp-dav   *
      *    *-----------------------------------------------------------*
       vis-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate, escluse fincature        *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      w-lin-pri-lin-vid    to   v-lin                  .
           move      w-lin-pri-lin-vid    to   v-lto                  .
           add       w-lin-num-lin-vis    to   v-lto                  .
           subtract  1                    from v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-cor-reg-150.
      *              *-------------------------------------------------*
      *              * Determinazione numero d'ordine del primo numero *
      *              * riga da visualizzare                            *
      *              *-------------------------------------------------*
           move      w-cnt-cor-nrp-dav    to   w-cnt-wrk-ctr-008      .
           multiply  w-lin-num-lin-vis    by   w-cnt-wrk-ctr-008      .
           add       1                    to   w-cnt-wrk-ctr-008      .
           subtract  w-lin-num-lin-vis    from w-cnt-wrk-ctr-008      .
      *              *-------------------------------------------------*
      *              * Determinazione numero d'ordine dell'ultimo nu-  *
      *              * mero riga da visualizzare                       *
      *              *-------------------------------------------------*
           move      w-cnt-wrk-ctr-008    to   w-cnt-wrk-ctr-009      .
           add       w-lin-num-lin-vis    to   w-cnt-wrk-ctr-009      .
           subtract  1                    from w-cnt-wrk-ctr-009      .
      *              *-------------------------------------------------*
      *              * Visualizzazione numero pagina in corso di trat- *
      *              * tamento                                         *
      *              *-------------------------------------------------*
           perform   vis-cor-reg-npg-000  thru vis-cor-reg-npg-999    .
       vis-cor-reg-200.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se si e' entro il massimo  *
      *              * numero di records caricati oppure no            *
      *              *-------------------------------------------------*
           if        w-cnt-wrk-ctr-008    >    w-rlt-sup-max
                     go to vis-cor-reg-300
           else      go to vis-cor-reg-400.
       vis-cor-reg-300.
      *              *-------------------------------------------------*
      *              * Se si e' oltre il massimo numero di records ca- *
      *              * ricati                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione linea a Spaces              *
      *                  *---------------------------------------------*
           move      "B"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-wrk-ctr-008    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     vis-cor-reg-500.
       vis-cor-reg-400.
      *              *-------------------------------------------------*
      *              * Se non si e' oltre il massimo numero di records *
      *              * caricati                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura file relative di supporto           *
      *                  *---------------------------------------------*
           move      "RD"                 to   w-rlt-sup-ope          .
           move      w-cnt-wrk-ctr-008    to   w-rlt-sup-prg          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
           move      w-rlt-sup-buf        to   w-rig                  .
      *                  *---------------------------------------------*
      *                  * Visualizzazione riga                        *
      *                  *---------------------------------------------*
           move      "R"                  to   w-cnt-cor-tvi-rig      .
           move      w-cnt-wrk-ctr-008    to   w-cnt-cor-nrg-dav      .
           perform   vis-lin-cor-000      thru vis-lin-cor-999        .
       vis-cor-reg-500.
      *              *-------------------------------------------------*
      *              * Incremento numero riga da visualizzare          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-wrk-ctr-008      .
      *              *-------------------------------------------------*
      *              * Test se oltre ultima riga da visualizzare       *
      *              *-------------------------------------------------*
           if        w-cnt-wrk-ctr-008    not  > w-cnt-wrk-ctr-009
                     go to vis-cor-reg-200.
       vis-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina corpo                              *
      *    *                                                           *
      *    * Numero pagina corpo                                       *
      *    *-----------------------------------------------------------*
       vis-cor-reg-npg-000.
      *              *-------------------------------------------------*
      *              * Numero di pagina                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione pagina attuale               *
      *                  *---------------------------------------------*
           divide    w-lin-num-lin-vis    into w-rlt-sup-max
                                        giving w-cnt-cor-pag-max
                                     remainder w-cnt-cor-pag-rem      .
           if        w-cnt-cor-pag-rem    >    zero
                     add 1                to   w-cnt-cor-pag-max      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-009
                                        giving w-cnt-cor-pag-att      .
      *                  *---------------------------------------------*
      *                  * Editing pagina attuale                      *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-cnt-cor-pag-att    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-edt                to   w-cnt-cor-pag-ep1      .
      *                  *---------------------------------------------*
      *                  * Editing pagina finale                       *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<"                  to   v-edm                  .
           move      w-cnt-cor-pag-max    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           move      v-edt                to   w-cnt-cor-pag-ep2      .
      *                  *---------------------------------------------*
      *                  * Composizione                                *
      *                  *---------------------------------------------*
           move      spaces               to   w-cnt-cor-pag-npa      .
           string    "["
                                delimited by   size
                     w-cnt-cor-pag-ep1
                                delimited by   spaces
                     "/"
                                delimited by   size
                     w-cnt-cor-pag-ep2
                                delimited by   spaces
                     "]"
                                delimited by   size
                                          into w-cnt-cor-pag-npa      .
      *                  *---------------------------------------------*
      *                  * Allineamento al centro                      *
      *                  *---------------------------------------------*
           move      11                   to   w-all-str-lun          .
           move      w-cnt-cor-pag-npa    to   w-all-str-alf          .
           perform   all-str-cen-000      thru all-str-cen-999        .
           move      w-all-str-alf        to   w-cnt-cor-pag-npa      .
      *                  *---------------------------------------------*
      *                  * Riempimento con '-'                         *
      *                  *---------------------------------------------*
           inspect   w-cnt-cor-pag-npa
                                     replacing all " " by   "-"       .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      11                   to   v-car                  .
      *
           move      w-lin-pri-lin-vid    to   v-lin                  .
           add       w-lin-num-lin-vis    to   v-lin                  .
      *
           move      36                   to   v-pos                  .
           move      w-cnt-cor-pag-npa    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       vis-cor-reg-npg-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-cor-reg-npg-999.
       vis-cor-reg-npg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione linea corpo numero : w-cnt-cor-nrg-dav    *
      *    *-----------------------------------------------------------*
       vis-lin-cor-000.
      *              *-------------------------------------------------*
      *              * Abblencamento immagine linea di corpo           *
      *              *-------------------------------------------------*
           move      spaces               to   w-lin-imm              .
      *              *-------------------------------------------------*
      *              * Determinazione numero linea assoluta a video    *
      *              *-------------------------------------------------*
           move      w-cnt-cor-nrg-dav    to   w-cnt-wrk-ctr-001      .
           subtract  1                    from w-cnt-wrk-ctr-001      .
           divide    w-lin-num-lin-vis    into w-cnt-wrk-ctr-001
                                        giving w-cnt-wrk-ctr-003
                                     remainder w-cnt-wrk-ctr-002      .
           multiply  w-lin-num-lin-prc    by   w-cnt-wrk-ctr-002      .
           add       w-lin-pri-lin-vid    to   w-cnt-wrk-ctr-002      .
      *              *-------------------------------------------------*
      *              * Test su tipo visualizzazione riga               *
      *              *-------------------------------------------------*
           if        w-cnt-cor-tvi-rig    =    "I"
                     go to vis-lin-cor-100
           else if   w-cnt-cor-tvi-rig    =    "B"
                     go to vis-lin-cor-150
           else if   w-cnt-cor-tvi-rig    =    "S"
                     go to vis-lin-cor-200
           else if   w-cnt-cor-tvi-rig    =    "N"
                     go to vis-lin-cor-300
           else      go to vis-lin-cor-400.
       vis-lin-cor-100.
      *              *-------------------------------------------------*
      *              * Se visualizzazione indicatore linea             *
      *              *-------------------------------------------------*
           move      "===>"               to   w-lin-imm-num-lin      .
           move      04                   to   v-car                  .
           go to     vis-lin-cor-900.
       vis-lin-cor-150.
      *              *-------------------------------------------------*
      *              * Se visualizzazione linea a blanks               *
      *              *-------------------------------------------------*
           move      80                   to   v-car                  .
           go to     vis-lin-cor-900.
       vis-lin-cor-200.
      *              *-------------------------------------------------*
      *              * Se visualizzazione numero linea a spaces        *
      *              *-------------------------------------------------*
           move      spaces               to   w-lin-imm-num-lin      .
           move      04                   to   v-car                  .
           go to     vis-lin-cor-900.
       vis-lin-cor-300.
      *              *-------------------------------------------------*
      *              * Se visualizzazione numero d'ordine riga         *
      *              *-------------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      spaces               to   v-edm                  .
           move      w-rlt-sup-prg        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-num-lin      .
           go to     vis-lin-cor-900.
       vis-lin-cor-400.
      *              *-------------------------------------------------*
      *              * Se visualizzazione riga intera                  *
      *              *-------------------------------------------------*
       vis-lin-cor-420.
      *                  *---------------------------------------------*
      *                  * Editing Numero d'ordine riga                *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      spaces               to   v-edm                  .
           move      w-rlt-sup-prg        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-num-lin      .
       vis-lin-cor-440.
      *                  *---------------------------------------------*
      *                  * Codice alfanumerico prodotto                *
      *                  *---------------------------------------------*
           move      w-rig-alf-pro        to   w-lin-imm-alf-pro      .
       vis-lin-cor-460.
      *                  *---------------------------------------------*
      *                  * Descrizione prodotto                        *
      *                  *---------------------------------------------*
           move      w-rig-alf-pro-des    to   w-lin-imm-des-pro      .
       vis-lin-cor-470.
      *                  *---------------------------------------------*
      *                  * Flag di annullamento modifica               *
      *                  *---------------------------------------------*
           if        w-rig-flg-ann        not  = spaces
                     move  "*"            to   w-lin-imm-flg-ann
           else      move  spaces         to   w-lin-imm-flg-ann      .
       vis-lin-cor-480.
      *                  *---------------------------------------------*
      *                  * Editing Codice classe                       *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "B"                  to   v-edm                  .
           move      w-rig-cla-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-cla-pro      .
       vis-lin-cor-490.
      *                  *---------------------------------------------*
      *                  * Editing Codice gruppo                       *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "B"                  to   v-edm                  .
           move      w-rig-gru-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-gru-pro      .
       vis-lin-cor-500.
      *                  *---------------------------------------------*
      *                  * Editing Codice sottogruppo                  *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "B"                  to   v-edm                  .
           move      w-rig-sgr-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-lin-imm-sgr-pro      .
       vis-lin-cor-800.
      *                  *---------------------------------------------*
      *                  * Parametri per visualizzazione               *
      *                  *---------------------------------------------*
           move      80                   to   v-car                  .
       vis-lin-cor-900.
      *              *-------------------------------------------------*
      *              * Esecuzione visualizzazione prima linea          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-lin-imm-dsp-lin (1)
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se una sola linea : uscita                      *
      *              *-------------------------------------------------*
           if        w-lin-num-lin-prc    =    1
                     go to vis-lin-cor-999.
      *              *-------------------------------------------------*
      *              * Esecuzione visualizzazione altre linee          *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-wrk-ctr-003      .
       vis-lin-cor-925.
           add       1                    to   w-cnt-wrk-ctr-003      .
           if        w-cnt-wrk-ctr-003    >    w-lin-num-lin-prc
                     go to vis-lin-cor-999.
           add       1                    to   w-cnt-wrk-ctr-002      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-cnt-wrk-ctr-002    to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-lin-imm-dsp-lin
                    (w-cnt-wrk-ctr-003)   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     vis-lin-cor-925.
       vis-lin-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts area linee di corpo               *
      *    *-----------------------------------------------------------*
       pmt-cor-reg-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate sia dall'area per la fin- *
      *              * catura che dall'area delle righe effettive      *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      w-lin-pri-lin-vid    to   v-lto                  .
           add       w-lin-num-lin-vis    to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Fincatura : Linea 04                            *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "N.R.               Codice e descrizione prodotto  
      -              "              Cla   Gru  S.gr "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Fincatura : Linea 05                            *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "----  --------------------------------------------
      -              "-----------  ----- ----- -----"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Eventuali indicatori relativi a switch di sort  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      05                   to   v-lin                  .
      *
           if        w-cnt-acc-flg-sws    =    "P"
                     move  02             to   v-pos
           else if   w-cnt-acc-flg-sws    =    "C"
                     move  13             to   v-pos
           else if   w-cnt-acc-flg-sws    =    "D"
                     move  40             to   v-pos
           else if   w-cnt-acc-flg-sws    =    "M"
                     move  66             to   v-pos
           else      move  02             to   v-pos                  .
      *
           if        w-cnt-acc-flg-swo    =    spaces
                     move  "--"           to   v-alf
           else if   w-cnt-acc-flg-swo    =    "A"
                     move  "\/"           to   v-alf
           else      move  "/\"           to   v-alf                  .
      *
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Fincatura : Linea 14                            *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-cor-reg-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione riga corpo di accettazione in w-rig       *
      *    *-----------------------------------------------------------*
       vis-rig-cor-000.
      *              *-------------------------------------------------*
      *              * Codice alfanumerico prodotto                    *
      *              *-------------------------------------------------*
           perform   vis-alf-pro-000      thru vis-alf-pro-999        .
           perform   vis-alf-pro-des-000  thru vis-alf-pro-des-999    .
      *              *-------------------------------------------------*
      *              * Codice classe                                   *
      *              *-------------------------------------------------*
           perform   vis-rig-cla-000      thru vis-rig-cla-999        .
           perform   vis-des-cla-000      thru vis-des-cla-999        .
      *              *-------------------------------------------------*
      *              * Codice gruppo                                   *
      *              *-------------------------------------------------*
           perform   vis-rig-gru-000      thru vis-rig-gru-999        .
           perform   vis-des-gru-000      thru vis-des-gru-999        .
      *              *-------------------------------------------------*
      *              * Codice sottogruppo                              *
      *              *-------------------------------------------------*
           perform   vis-rig-sgr-000      thru vis-rig-sgr-999        .
           perform   vis-des-sgr-000      thru vis-des-sgr-999        .
      *              *-------------------------------------------------*
      *              * Unita' di misura                                *
      *              *-------------------------------------------------*
           perform   vis-rig-umi-000      thru vis-rig-umi-999        .
           perform   vis-des-umi-000      thru vis-des-umi-999        .
      *              *-------------------------------------------------*
      *              * Tipo prodotto                                   *
      *              *-------------------------------------------------*
           perform   vis-rig-tip-000      thru vis-rig-tip-999        .
      *              *-------------------------------------------------*
      *              * Sinonimo                                        *
      *              *-------------------------------------------------*
           perform   vis-rig-syn-000      thru vis-rig-syn-999        .
      *              *-------------------------------------------------*
      *              * Flag modifica annullata                         *
      *              *-------------------------------------------------*
           perform   vis-flg-ann-000      thru vis-flg-ann-999        .
       vis-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per riga corpo di accettazione    *
      *    *-----------------------------------------------------------*
       pmt-rig-cor-000.
      *              *-------------------------------------------------*
      *              * Erase linee impegnate dall'area di impostazione *
      *              * della singola riga corpo espansa a piede        *
      *              *-------------------------------------------------*
           move      "EL"                 to   v-ope                  .
           move      15                   to   v-lin                  .
           move      21                   to   v-lto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-rig-cor-100.
      *              *-------------------------------------------------*
      *              * Codice alfanumerico prodotto                    *
      *              *-------------------------------------------------*
           perform   pmt-alf-pro-000      thru pmt-alf-pro-999        .
      *              *-------------------------------------------------*
      *              * Codice classe                                   *
      *              *-------------------------------------------------*
           perform   pmt-rig-cla-000      thru pmt-rig-cla-999        .
      *              *-------------------------------------------------*
      *              * Codice gruppo                                   *
      *              *-------------------------------------------------*
           perform   pmt-rig-gru-000      thru pmt-rig-gru-999        .
      *              *-------------------------------------------------*
      *              * Codice sottogruppo                              *
      *              *-------------------------------------------------*
           perform   pmt-rig-sgr-000      thru pmt-rig-sgr-999        .
      *              *-------------------------------------------------*
      *              * Unita' di misura                                *
      *              *-------------------------------------------------*
           perform   pmt-rig-umi-000      thru pmt-rig-umi-999        .
      *              *-------------------------------------------------*
      *              * Tipo prodotto                                   *
      *              *-------------------------------------------------*
           perform   pmt-rig-tip-000      thru pmt-rig-tip-999        .
      *              *-------------------------------------------------*
      *              * Sinonimo                                        *
      *              *-------------------------------------------------*
           perform   pmt-rig-syn-000      thru pmt-rig-syn-999        .
       pmt-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice alfanumerico prodotto     *
      *    *-----------------------------------------------------------*
       pmt-alf-pro-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Codice prodotto    :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       pmt-alf-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice classe                    *
      *    *-----------------------------------------------------------*
       pmt-rig-cla-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Classe             :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-cla-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice gruppo                    *
      *    *-----------------------------------------------------------*
       pmt-rig-gru-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Gruppo             :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-gru-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Codice sottogruppo               *
      *    *-----------------------------------------------------------*
       pmt-rig-sgr-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Sottogruppo        :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-sgr-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Unita' di misura                 *
      *    *-----------------------------------------------------------*
       pmt-rig-umi-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Unita' di misura   :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-umi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Tipo prodotto                    *
      *    *-----------------------------------------------------------*
       pmt-rig-tip-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Tipo prodotto      :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-tip-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompt : Sinonimo                         *
      *    *-----------------------------------------------------------*
       pmt-rig-syn-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Sinonimo           :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-rig-syn-999.
           exit.

      *    *===========================================================*
      *    * Accettazione 1.campo corpo : Codice alfanumerico prodotto *
      *    *-----------------------------------------------------------*
       acc-alf-pro-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-rig-num-pro        to   w-sav-num-pro          .
       acc-alf-pro-100.
      *              *-------------------------------------------------*
      *              * Ripristino valore precedente                    *
      *              *-------------------------------------------------*
           move      w-sav-num-pro        to   w-rig-num-pro          .
       acc-alf-pro-125.
      *              *-------------------------------------------------*
      *              * Note operative (se I linea di accettazione)     *
      *              *-------------------------------------------------*
           if        w-cnt-cor-nrg-dac    >    1
                     go to acc-alf-pro-130.
      *
           move      "NT"                 to   v-ope                  .
           move      "Tasti funzione F1, F2, F3 o F4 per riordinare l'el
      -              "enco"               to   v-nt1                  .
           move      "Se ripremuti, inversione della madalita' di ordina
      -              "mento"              to   v-nt2                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       acc-alf-pro-130.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Parametri generali di accettazione          *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      14                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      22                   to   v-pos                  .
      *                  *---------------------------------------------*
      *                  * Tasti funzione                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Up   : sempre ammesso, a meno che non   *
      *                      *        si sia alla riga numero 1        *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    >    1
                     move  "UP  "         to   v-pfk (01)
           else      move  spaces         to   v-pfk (01)             .
      *                      *-----------------------------------------*
      *                      * Down : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "DOWN"               to   v-pfk (02)             .
      *                      *-----------------------------------------*
      *                      * Find : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "FIND"               to   v-pfk (03)             .
      *                      *-----------------------------------------*
      *                      * Insr : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "INSR"               to   v-pfk (04)             .
      *                      *-----------------------------------------*
      *                      * Do   : sempre ammesso, purche' sia con- *
      *                      *        cesso dallo status delle impo-   *
      *                      *        stazioni; eventualmente disat-   *
      *                      *        tivato dal richiamo della sub-   *
      *                      *        routine di accettazione          *
      *                      *-----------------------------------------*
           if        w-cnt-sts-imp-tes    not  = spaces and
                     w-cnt-sts-imp-cor    not  = spaces and
                     w-cnt-sts-imp-pie    not  = spaces
                     move  "DO  "         to   v-pfk (05)
           else      move  spaces         to   v-pfk (05)             .
      *                      *-----------------------------------------*
      *                      * Remv : mai ammesso                      *
      *                      *-----------------------------------------*
           move      spaces               to   v-pfk (06)             .
      *                      *-----------------------------------------*
      *                      * Prsc : sempre ammesso, a meno che non   *
      *                      *        si sia alla pagina numero 1      *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    >    w-lin-num-lin-vis
                     move  "PRSC"         to   v-pfk (07)
           else      move  spaces         to   v-pfk (07)             .
      *                      *-----------------------------------------*
      *                      * Nxsc : sempre ammesso                   *
      *                      *-----------------------------------------*
           move      "NXSC"               to   v-pfk (08)             .
      *                      *-----------------------------------------*
      *                      * Back : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sulla prima riga     *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  = 1
                     move  "BACK"         to   v-pfk (09)
           else      move  spaces         to   v-pfk (09)             .
      *                      *-----------------------------------------*
      *                      * Tab  : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sull'ultima riga     *
      *                      *-----------------------------------------*
           if        w-cnt-cor-nrg-dac    not  = w-rlt-sup-max
                     move  "TAB "         to   v-pfk (10)
           else      move  spaces         to   v-pfk (10)             .
      *                      *-----------------------------------------*
      *                      * Slct : sempre ammesso, a meno che non   *
      *                      *        si sia gia' sull'unica riga      *
      *                      *-----------------------------------------*
           if        w-rlt-sup-max        not  < 2
                     move  "SLCT"         to   v-pfk (11)
           else      move  spaces         to   v-pfk (11)             .
      *                      *-----------------------------------------*
      *                      * PF1 : solo piu' di 9 elementi           *
      *                      *-----------------------------------------*
           if        w-rlt-sup-max        >    9
                     move  "[1] "         to   v-pfk (14)             .
      *                      *-----------------------------------------*
      *                      * PF2 : solo piu' di 9 elementi           *
      *                      *-----------------------------------------*
           if        w-rlt-sup-max        >    9
                     move  "[2] "         to   v-pfk (15)             .
      *                      *-----------------------------------------*
      *                      * PF3 : solo piu' di 9 elementi           *
      *                      *-----------------------------------------*
           if        w-rlt-sup-max        >    9
                     move  "[3] "         to   v-pfk (16)             .
      *                      *-----------------------------------------*
      *                      * PF4 : solo piu' di 9 elementi           *
      *                      *-----------------------------------------*
           if        w-rlt-sup-max        >    9
                     move  "[4] "         to   v-pfk (17)             .
      *                      *-----------------------------------------*
      *                      * Valore di accettazione                  *
      *                      *-----------------------------------------*
           move      w-rig-alf-pro        to   v-alf                  .
      *                      *-----------------------------------------*
      *                      * Richiamo subroutine di accettazione     *
      *                      *-----------------------------------------*
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-alf-pro-190.
      *              *-------------------------------------------------*
      *              * Cancellazione note operative attuali            *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      spaces               to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       acc-alf-pro-200.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  spaces         to   w-cnt-acc-flg-sws
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-alf-pro-999.
       acc-alf-pro-225.
      *              *-------------------------------------------------*
      *              * Test se Return                                  *
      *              *-------------------------------------------------*
           if        v-key                =    spaces
                     go to acc-alf-pro-400.
       acc-alf-pro-250.
      *              *-------------------------------------------------*
      *              * Se Slct                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "SLCT"
                     go to acc-alf-pro-300
           else      go to acc-alf-pro-350.
       acc-alf-pro-300.
      *                  *---------------------------------------------*
      *                  * Conversione numero riga impostato in forma- *
      *                  * to numerico                                 *
      *                  *---------------------------------------------*
           move      v-alf                to   w-cnt-slc-rap-alf      .
           move      zero                 to   w-cnt-slc-rap-num      .
           move      5                    to   w-cnt-wrk-ctr-001      .
           move      4                    to   w-cnt-wrk-ctr-002      .
       acc-alf-pro-310.
           subtract  1                    from w-cnt-wrk-ctr-001      .
           if        w-cnt-wrk-ctr-001   =    zero
                     go to acc-alf-pro-320.
           if        w-cnt-slc-rap-chr
                    (w-cnt-wrk-ctr-001)   <    "0"   or
                     w-cnt-slc-rap-chr
                    (w-cnt-wrk-ctr-001)   >    "9"
                     go to acc-alf-pro-310.
           move      w-cnt-slc-rap-chr
                    (w-cnt-wrk-ctr-001)   to   w-cnt-slc-rap-cif
                                              (w-cnt-wrk-ctr-002)     .
           subtract  1                    from w-cnt-wrk-ctr-002      .
           go to     acc-alf-pro-310.
       acc-alf-pro-320.
      *                  *---------------------------------------------*
      *                  * Se numero riga impostato minore di 1 o mag- *
      *                  * maggiore del massimo : reimpostazione       *
      *                  *---------------------------------------------*
           if        w-cnt-slc-rap-num    =    zero       or
                     w-cnt-slc-rap-num    >    w-rlt-sup-max
                     go to acc-alf-pro-100.
      *                  *---------------------------------------------*
      *                  * Se numero riga impostato pari a numero riga *
      *                  * attuale : reimpostazione                    *
      *                  *---------------------------------------------*
           if        w-cnt-slc-rap-num    =    w-cnt-cor-nrg-dac
                     go to acc-alf-pro-100.
      *                  *---------------------------------------------*
      *                  * Preparazione parametri e uscita             *
      *                  *---------------------------------------------*
           move      w-cnt-slc-rap-num    to   w-cnt-slc-num-rig      .
           move      "."                  to   w-cnt-tus-acc-rig      .
           go to     acc-alf-pro-999.
       acc-alf-pro-350.
      *              *-------------------------------------------------*
      *              * Se premuto un altro tasto funzione non deve es- *
      *              * sere avvenuta variazione del campo di imposta-  *
      *              * zione                                           *
      *              *-------------------------------------------------*
           if        v-mod                not  = spaces
                     go to acc-alf-pro-100.
       acc-cod-cli-360.
      *              *-------------------------------------------------*
      *              * Se F1, F2, F3 o F4                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tasto funzione                      *
      *                  *---------------------------------------------*
           if        v-key                not  = "[1] " and
                     v-key                not  = "[2] " and
                     v-key                not  = "[3] " and
                     v-key                not  = "[4] "
                     go to acc-alf-pro-380.
      *                  *---------------------------------------------*
      *                  * Richiamo subroutine di switch ordinamento   *
      *                  *---------------------------------------------*
           perform   rou-swc-srt-000      thru rou-swc-srt-999        .
      *                  *---------------------------------------------*
      *                  * Forzatura uscita                            *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-tus-acc-rig       .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     acc-alf-pro-999.
       acc-alf-pro-380.
      *              *-------------------------------------------------*
      *              * Se Up                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "UP  "
                     move  "U"            to   w-cnt-tus-acc-rig
                     go to acc-alf-pro-999.
      *              *-------------------------------------------------*
      *              * Se Down                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "DOWN"
                     move  "D"            to   w-cnt-tus-acc-rig
                     go to acc-alf-pro-999.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-nok-000
                                          thru cnt-tdo-nok-999
                     if      w-cnt-tdo-nok-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-alf-pro-999
                     else    go to acc-alf-pro-100.
      *              *-------------------------------------------------*
      *              * Se Tab                                          *
      *              *-------------------------------------------------*
           if        v-key                =    "TAB "
                     move  "T"            to   w-cnt-tus-acc-rig
                     go to acc-alf-pro-999.
      *              *-------------------------------------------------*
      *              * Se Back                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "BACK"
                     move  "B"            to   w-cnt-tus-acc-rig
                     go to acc-alf-pro-999.
      *              *-------------------------------------------------*
      *              * Se Nxsc                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "NXSC"
                     move  "N"            to   w-cnt-tus-acc-rig
                     go to acc-alf-pro-999.
      *              *-------------------------------------------------*
      *              * Se Prsc                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "PRSC"
                     move  "P"            to   w-cnt-tus-acc-rig
                     go to acc-alf-pro-999.
       acc-alf-pro-400.
      *              *-------------------------------------------------*
      *              * Se Return                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se variazione del valore di default : a re- *
      *                  * impostazione                                *
      *                  *---------------------------------------------*
           if        v-mod                not  = spaces
                     go to acc-alf-pro-100.
       acc-alf-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Codice alfanumerico prodotto            *
      *    *-----------------------------------------------------------*
       vis-alf-pro-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      14                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-alf-pro        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-alf-pro-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione : Descrizione prodotto                    *
      *    *-----------------------------------------------------------*
       vis-alf-pro-des-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      41                   to   v-pos                  .
           move      w-rig-alf-pro-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-alf-pro-des-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Classe merceologica                  *
      *    *-----------------------------------------------------------*
       acc-rig-cla-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-rig-cla-pro        to   w-sav-cla-pro          .
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-rig-flg-ann-rmv    not  = spaces
                     go to acc-rig-cla-999.
       acc-rig-cla-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zp1-ope      .
           move      w-rig-cla-pro        to   w-cod-mne-zp1-cla      .
           move      zero                 to   w-cod-mne-zp1-gru      .
           move      zero                 to   w-cod-mne-zp1-sgr      .
           move      16                   to   w-cod-mne-zp1-lin      .
           move      22                   to   w-cod-mne-zp1-pos      .
           move      16                   to   w-cod-mne-zp1-dln      .
           move      30                   to   w-cod-mne-zp1-dps      .
           move      "<B"                 to   v-edm                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-zp1-cll-000  thru cod-mne-zp1-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zp1-foi-000  thru cod-mne-zp1-foi-999    .
       acc-rig-cla-110.
           perform   cod-mne-zp1-cll-000  thru cod-mne-zp1-cll-999    .
           if        w-cod-mne-zp1-ope    =    "F+"
                     go to acc-rig-cla-115.
           if        w-cod-mne-zp1-ope    =    "AC"
                     go to acc-rig-cla-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-cla-115.
           perform   cod-mne-zp1-foi-000  thru cod-mne-zp1-foi-999    .
           go to     acc-rig-cla-110.
       acc-rig-cla-120.
           move      w-cod-mne-zp1-cla    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-cla-999.
       acc-rig-cla-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-cla-pro          .
       acc-rig-cla-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [zp1]                      *
      *                  *---------------------------------------------*
           move      w-rig-cla-pro        to   w-let-arc-zp1-cla      .
           perform   let-arc-zp1-000      thru let-arc-zp1-999        .
      *                   *--------------------------------------------*
      *                   * Bufferizzazione di :                       *
      *                   * - Descrizione                              *
      *                   * - Ulteriore suddivisione                   *
      *                   * - Unita' di misura da proporre             *
      *                   *--------------------------------------------*
           move      w-let-arc-zp1-des    to   w-rig-cla-pro-des      .
           move      w-let-arc-zp1-sud    to   w-rig-cla-pro-sud      .
           move      w-let-arc-zp1-umi    to   w-rig-cla-pro-umi      .
      *                   *--------------------------------------------*
      *                   * Visualizzazione descrizione                *
      *                   *--------------------------------------------*
           perform   vis-des-cla-000      thru vis-des-cla-999        .
      *                  *---------------------------------------------*
      *                  * Se lettura errata : reimpostazione          *
      *                  *---------------------------------------------*
           if        w-let-arc-zp1-flg    not  = spaces
                     go to acc-rig-cla-100.
       acc-rig-cla-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore impostato uguale a precedente :   *
      *                  * oltre                                       *
      *                  *---------------------------------------------*
           if        w-rig-cla-pro        =    w-sav-cla-pro
                     go to acc-rig-cla-800.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione dati  *
      *                      * gruppo merceologico                     *
      *                      *-----------------------------------------*
           if        w-rig-gru-pro        =    zero
                     go to acc-rig-cla-620.
           move      zero                 to   w-rig-gru-pro          .
           move      spaces               to   w-rig-gru-pro-des      .
           move      zero                 to   w-rig-gru-pro-sud      .
           move      spaces               to   w-rig-gru-pro-umi      .
           perform   vis-rig-gru-000      thru vis-rig-gru-999        .
           perform   vis-des-gru-000      thru vis-des-gru-999        .
       acc-rig-cla-620.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione dati  *
      *                      * sottogruppo merceologico                *
      *                      *-----------------------------------------*
           if        w-rig-sgr-pro        =    zero
                     go to acc-rig-cla-640.
           move      zero                 to   w-rig-sgr-pro          .
           move      spaces               to   w-rig-sgr-pro-des      .
           move      zero                 to   w-rig-sgr-pro-sud      .
           move      spaces               to   w-rig-sgr-pro-umi      .
           perform   vis-rig-sgr-000      thru vis-rig-sgr-999        .
           perform   vis-des-sgr-000      thru vis-des-sgr-999        .
       acc-rig-cla-640.
       acc-rig-cla-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-cla-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-cla-100.
       acc-rig-cla-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Classe merceologica               *
      *    *-----------------------------------------------------------*
       vis-rig-cla-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      16                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-cla-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-cla-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Descrizione classe                *
      *    *-----------------------------------------------------------*
       vis-des-cla-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-rig-cla-pro-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-des-cla-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Gruppo merceologico                  *
      *    *-----------------------------------------------------------*
       acc-rig-gru-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-rig-flg-ann-rmv    not  = spaces
                     go to acc-rig-gru-999.
           if        w-rig-cla-pro        =    zero
                     go to acc-rig-gru-999.
           if        w-rig-cla-pro-sud    =    01
                     go to acc-rig-gru-999.
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-rig-gru-pro        to   w-sav-gru-pro          .
       acc-rig-gru-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zp2-ope      .
           move      w-rig-cla-pro        to   w-cod-mne-zp2-cla      .
           move      w-rig-cla-pro-des    to   w-cod-mne-zp2-dcl      .
           move      w-rig-gru-pro        to   w-cod-mne-zp2-gru      .
           move      zero                 to   w-cod-mne-zp2-sgr      .
           move      17                   to   w-cod-mne-zp2-lin      .
           move      22                   to   w-cod-mne-zp2-pos      .
           move      17                   to   w-cod-mne-zp2-dln      .
           move      30                   to   w-cod-mne-zp2-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-zp2-cll-000  thru cod-mne-zp2-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zp2-foi-000  thru cod-mne-zp2-foi-999    .
       acc-rig-gru-110.
           perform   cod-mne-zp2-cll-000  thru cod-mne-zp2-cll-999    .
           if        w-cod-mne-zp2-ope    =    "F+"
                     go to acc-rig-gru-115.
           if        w-cod-mne-zp2-ope    =    "AC"
                     go to acc-rig-gru-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-gru-115.
           perform   cod-mne-zp2-foi-000  thru cod-mne-zp2-foi-999    .
           go to     acc-rig-gru-110.
       acc-rig-gru-120.
           move      w-cod-mne-zp2-gru    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-gru-999.
       acc-rig-gru-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-gru-pro          .
       acc-rig-gru-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [zp2]                      *
      *                  *---------------------------------------------*
           move      w-rig-cla-pro        to   w-let-arc-zp2-cla      .
           move      w-rig-gru-pro        to   w-let-arc-zp2-gru      .
           perform   let-arc-zp2-000      thru let-arc-zp2-999        .
      *                   *--------------------------------------------*
      *                   * Bufferizzazione di :                       *
      *                   * - Descrizione                              *
      *                   * - Ulteriore suddivisione                   *
      *                   * - Unita' di misura da proporre             *
      *                   *--------------------------------------------*
           move      w-let-arc-zp2-des    to   w-rig-gru-pro-des      .
           move      w-let-arc-zp2-sud    to   w-rig-gru-pro-sud      .
           move      w-let-arc-zp2-umi    to   w-rig-gru-pro-umi      .
      *                   *--------------------------------------------*
      *                   * Visualizzazione descrizione                *
      *                   *--------------------------------------------*
           perform   vis-des-gru-000      thru vis-des-gru-999        .
      *                  *---------------------------------------------*
      *                  * Se lettura errata : reimpostazione          *
      *                  *---------------------------------------------*
           if        w-let-arc-zp2-flg    not  = spaces
                     go to acc-rig-gru-100.
      *                  *---------------------------------------------*
      *                  * Se valore a zero : reimpostazione, a meno   *
      *                  * che non sia su tasto Up                     *
      *                  *---------------------------------------------*
           if        w-rig-gru-pro        not  = zero
                     go to acc-rig-gru-450.
           if        v-key                =    "UP  "
                     go to acc-rig-gru-600
           else      go to acc-rig-gru-100.
       acc-rig-gru-450.
       acc-rig-gru-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se valore impostato uguale a precedente :   *
      *                  * oltre                                       *
      *                  *---------------------------------------------*
           if        w-rig-gru-pro        =    w-sav-gru-pro
                     go to acc-rig-gru-800.
      *                      *-----------------------------------------*
      *                      * Normalizzazione e visualizzazione dati  *
      *                      * sottogruppo merceologico                *
      *                      *-----------------------------------------*
           if        w-rig-sgr-pro        =    zero
                     go to acc-rig-gru-640.
           move      zero                 to   w-rig-sgr-pro          .
           move      spaces               to   w-rig-sgr-pro-des      .
           move      zero                 to   w-rig-sgr-pro-sud      .
           move      spaces               to   w-rig-sgr-pro-umi      .
           perform   vis-rig-sgr-000      thru vis-rig-sgr-999        .
           perform   vis-des-sgr-000      thru vis-des-sgr-999        .
       acc-rig-gru-640.
       acc-rig-gru-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-gru-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-gru-100.
       acc-rig-gru-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Gruppo merceologico               *
      *    *-----------------------------------------------------------*
       vis-rig-gru-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      17                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-gru-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-gru-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Descrizione gruppo                *
      *    *-----------------------------------------------------------*
       vis-des-gru-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-rig-gru-pro-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-des-gru-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Sottogruppo merceologico             *
      *    *-----------------------------------------------------------*
       acc-rig-sgr-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-rig-flg-ann-rmv    not  = spaces
                     go to acc-rig-sgr-999.
           if        w-rig-gru-pro        =    zero
                     go to acc-rig-sgr-999.
           if        w-rig-gru-pro-sud    =    01
                     go to acc-rig-sgr-999.
      *                  *---------------------------------------------*
      *                  * Salvataggio valore precedente               *
      *                  *---------------------------------------------*
           move      w-rig-sgr-pro        to   w-sav-sgr-pro          .
       acc-rig-sgr-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-mne-zp3-ope      .
           move      w-rig-cla-pro        to   w-cod-mne-zp3-cla      .
           move      w-rig-cla-pro-des    to   w-cod-mne-zp3-dcl      .
           move      w-rig-gru-pro        to   w-cod-mne-zp3-gru      .
           move      w-rig-gru-pro-des    to   w-cod-mne-zp3-dgr      .
           move      w-rig-sgr-pro        to   w-cod-mne-zp3-sgr      .
           move      18                   to   w-cod-mne-zp3-lin      .
           move      22                   to   w-cod-mne-zp3-pos      .
           move      18                   to   w-cod-mne-zp3-dln      .
           move      30                   to   w-cod-mne-zp3-dps      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-mne-zp3-cll-000  thru cod-mne-zp3-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-mne-zp3-foi-000  thru cod-mne-zp3-foi-999    .
       acc-rig-sgr-110.
           perform   cod-mne-zp3-cll-000  thru cod-mne-zp3-cll-999    .
           if        w-cod-mne-zp3-ope    =    "F+"
                     go to acc-rig-sgr-115.
           if        w-cod-mne-zp3-ope    =    "AC"
                     go to acc-rig-sgr-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-sgr-115.
           perform   cod-mne-zp3-foi-000  thru cod-mne-zp3-foi-999    .
           go to     acc-rig-sgr-110.
       acc-rig-sgr-120.
           move      w-cod-mne-zp3-sgr    to   v-num                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-sgr-999.
       acc-rig-sgr-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-num                to   w-rig-sgr-pro          .
       acc-rig-sgr-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura archivio [zp3]                      *
      *                  *---------------------------------------------*
           move      w-rig-cla-pro        to   w-let-arc-zp3-cla      .
           move      w-rig-gru-pro        to   w-let-arc-zp3-gru      .
           move      w-rig-sgr-pro        to   w-let-arc-zp3-sgr      .
           perform   let-arc-zp3-000      thru let-arc-zp3-999        .
      *                   *--------------------------------------------*
      *                   * Bufferizzazione di :                       *
      *                   * - Descrizione                              *
      *                   * - Ulteriore suddivisione                   *
      *                   * - Unita' di misura da proporre             *
      *                   *--------------------------------------------*
           move      w-let-arc-zp3-des    to   w-rig-sgr-pro-des      .
           move      w-let-arc-zp3-sud    to   w-rig-sgr-pro-sud      .
           move      w-let-arc-zp3-umi    to   w-rig-sgr-pro-umi      .
      *                   *--------------------------------------------*
      *                   * Visualizzazione descrizione                *
      *                   *--------------------------------------------*
           perform   vis-des-sgr-000      thru vis-des-sgr-999        .
      *                  *---------------------------------------------*
      *                  * Se lettura errata : reimpostazione          *
      *                  *---------------------------------------------*
           if        w-let-arc-zp3-flg    not  = spaces
                     go to acc-rig-sgr-100.
      *                  *---------------------------------------------*
      *                  * Se valore a zero : reimpostazione, a meno   *
      *                  * che non sia su tasto Up                     *
      *                  *---------------------------------------------*
           if        w-rig-sgr-pro        not  = zero
                     go to acc-rig-sgr-450.
           if        v-key                =    "UP  "
                     go to acc-rig-sgr-600
           else      go to acc-rig-sgr-100.
       acc-rig-sgr-450.
       acc-rig-sgr-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rig-sgr-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-sgr-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-sgr-100.
       acc-rig-sgr-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Sottogruppo merceologico          *
      *    *-----------------------------------------------------------*
       vis-rig-sgr-000.
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      18                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-sgr-pro        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-sgr-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Descrizione sottogruppo           *
      *    *-----------------------------------------------------------*
       vis-des-sgr-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-rig-sgr-pro-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-des-sgr-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Unita' di misura                     *
      *    *-----------------------------------------------------------*
       acc-rig-umi-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-rig-flg-ann-rmv    not  = spaces
                     go to acc-rig-umi-999.
      *                  *---------------------------------------------*
      *                  * Preparazione valore di default              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Solo in inserimento e con valori a spazi*
      *                      *-----------------------------------------*
           if        w-cnt-mfu-tip-fun    not  = "I"
                     go to acc-rig-umi-100.
           if        w-rig-umi-ven        not  = spaces
                     go to acc-rig-umi-100.
      *                      *-----------------------------------------*
      *                      * Se contenuta nel sottogruppo            *
      *                      *-----------------------------------------*
           if        w-rig-sgr-pro-umi    not  = spaces
                     move  w-rig-sgr-pro-umi
                                          to   w-rig-umi-ven
                     go to acc-rig-umi-100.
      *                      *-----------------------------------------*
      *                      * Se contenuta nel gruppo                 *
      *                      *-----------------------------------------*
           if        w-rig-gru-pro-sud    =    01 and
                     w-rig-gru-pro-umi    not  = spaces
                     move  w-rig-gru-pro-umi
                                          to   w-rig-umi-ven
                     go to acc-rig-umi-100.
      *                      *-----------------------------------------*
      *                      * Se contenuta nella classe               *
      *                      *-----------------------------------------*
           if        w-rig-cla-pro-sud    =    01
                     move  w-rig-cla-pro-umi
                                          to   w-rig-umi-ven
                     go to acc-rig-umi-100.
       acc-rig-umi-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-umi-ope      .
           move      w-rig-umi-ven        to   w-cod-cod-umi-cod      .
           move      19                   to   w-cod-cod-umi-lin      .
           move      22                   to   w-cod-cod-umi-pos      .
           move      "<B"                 to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-zum-cll-000  thru cod-cod-zum-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-zum-foi-000  thru cod-cod-zum-foi-999    .
       acc-rig-umi-110.
           perform   cod-cod-zum-cll-000  thru cod-cod-zum-cll-999    .
           if        w-cod-cod-umi-ope    =    "F+"
                     go to acc-rig-umi-115.
           if        w-cod-cod-umi-ope    =    "AC"
                     go to acc-rig-umi-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-umi-115.
           perform   cod-cod-zum-foi-000  thru cod-cod-zum-foi-999    .
           go to     acc-rig-umi-110.
       acc-rig-umi-120.
           move      w-cod-cod-umi-cod    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-umi-999.
       acc-rig-umi-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-rig-umi-ven          .
       acc-rig-umi-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura tabella unita' di misura            *
      *                  *---------------------------------------------*
           move      w-rig-umi-ven        to   w-let-arc-zum-cod      .
           perform   let-arc-zum-000      thru let-arc-zum-999        .
      *                  *---------------------------------------------*
      *                  * Memorizzazione dati associati al codice     *
      *                  * unita' di misura                            *
      *                  *---------------------------------------------*
           move      w-let-arc-zum-des    to   w-rig-umi-ven-des      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione descrizione unita' di mi-   *
      *                  * sura                                        *
      *                  *---------------------------------------------*
           perform   vis-des-umi-000      thru vis-des-umi-999        .
      *                  *---------------------------------------------*
      *                  * Se unita' di misura non esistente : reimpo- *
      *                  * stazione                                    *
      *                  *---------------------------------------------*
           if        w-let-arc-zum-flg    not  = spaces
                     go to acc-rig-umi-100.
       acc-rig-umi-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rig-umi-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-umi-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-umi-100.
       acc-rig-umi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Unita' di misura                  *
      *    *-----------------------------------------------------------*
       vis-rig-umi-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-umi-ven        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-umi-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Descrizione unita' di misura      *
      *    *-----------------------------------------------------------*
       vis-des-umi-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-rig-umi-ven-des    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-des-umi-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Tipo prodotto                        *
      *    *-----------------------------------------------------------*
       acc-rig-tip-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-rig-flg-ann-rmv    not  = spaces
                     go to acc-rig-tip-999.
       acc-rig-tip-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-pro-lun    to   v-car                  .
           move      w-exp-tip-pro-num    to   v-ldt                  .
           move      "MSIE#"              to   v-msk                  .
           move      spaces               to   v-edm                  .
           move      20                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-exp-tip-pro-tbl    to   v-txt                  .
           if        w-rig-tip-pro        =    01
                     move  01             to   v-num
           else if   w-rig-tip-pro        =    02
                     move  02             to   v-num
           else if   w-rig-tip-pro        =    03
                     move  03             to   v-num
           else if   w-rig-tip-pro        =    09
                     move  04             to   v-num
           else      move  zero           to   v-num                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-tip-999.
       acc-rig-tip-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           if        v-num                =    01
                     move  01             to   w-rig-tip-pro
           else if   v-num                =    02
                     move  02             to   w-rig-tip-pro
           else if   v-num                =    03
                     move  03             to   w-rig-tip-pro
           else if   v-num                =    04
                     move  09             to   w-rig-tip-pro
           else      move  zero           to   w-rig-tip-pro          .
       acc-rig-tip-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se zero : reimpostazione                    *
      *                  *---------------------------------------------*
           if        w-rig-tip-pro        not  = zero
                     go to acc-rig-tip-600.
           if        v-key                =    "UP  "
                     go to acc-rig-tip-600
           else      go to acc-rig-tip-100.
       acc-rig-tip-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rig-tip-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-tip-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-tip-100.
       acc-rig-tip-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Tipo prodotto                     *
      *    *-----------------------------------------------------------*
       vis-rig-tip-000.
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-exp-tip-pro-lun    to   v-car                  .
           move      w-exp-tip-pro-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      20                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-exp-tip-pro-tbl    to   v-txt                  .
           if        w-rig-tip-pro        =    01
                     move  01             to   v-num
           else if   w-rig-tip-pro        =    02
                     move  02             to   v-num
           else if   w-rig-tip-pro        =    03
                     move  03             to   v-num
           else if   w-rig-tip-pro        =    09
                     move  04             to   v-num
           else      move  zero           to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-tip-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Sinonimo prodotto                    *
      *    *-----------------------------------------------------------*
       acc-rig-syn-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se campo da accettare                  *
      *                  *---------------------------------------------*
           if        w-rig-flg-ann-rmv    not  = spaces
                     go to acc-rig-syn-999.
       acc-rig-syn-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-cod-dcp-ope      .
           move      "S"                  to   w-cod-cod-dcp-tac      .
           move      w-rig-num-pro        to   w-cod-cod-dcp-num      .
           move      w-rig-syn-pro        to   w-cod-cod-dcp-alf      .
           move      21                   to   w-cod-cod-dcp-lin      .
           move      22                   to   w-cod-cod-dcp-pos      .
           move      zero                 to   w-cod-cod-dcp-dln      .
           move      zero                 to   w-cod-cod-dcp-dps      .
           move      spaces               to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "INSR"               to   v-pfk (04)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-cod-dcp-cll-000  thru cod-cod-dcp-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-cod-dcp-foi-000  thru cod-cod-dcp-foi-999    .
       acc-rig-syn-110.
           perform   cod-cod-dcp-cll-000  thru cod-cod-dcp-cll-999    .
           if        w-cod-cod-dcp-ope    =    "F+"
                     go to acc-rig-syn-115.
           if        w-cod-cod-dcp-ope    =    "AC"
                     go to acc-rig-syn-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-rig-syn-115.
           perform   cod-cod-dcp-foi-000  thru cod-cod-dcp-foi-999    .
           go to     acc-rig-syn-110.
       acc-rig-syn-120.
           move      w-cod-cod-dcp-alf    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-tus-acc-rig
                     go to acc-rig-syn-999.
       acc-rig-syn-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   w-rig-syn-pro          .
       acc-rig-syn-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-rig-syn-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-rig-syn-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform cnt-tdo-rig-000
                                          thru cnt-tdo-rig-999
                     if      w-cnt-tdo-rig-flg
                                          =    spaces
                             move  "S"    to   w-cnt-tus-acc-rig
                             go to acc-rig-syn-999
                     else    move  spaces to   w-cnt-tdo-rig-flg
                             go to acc-rig-syn-100.
       acc-rig-syn-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Sinonimo prodotto                 *
      *    *-----------------------------------------------------------*
       vis-rig-syn-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      13                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      w-rig-syn-pro        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-rig-syn-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione campo : Indicatore modifica annullata     *
      *    *-----------------------------------------------------------*
       vis-flg-ann-000.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      21                   to   v-lin                  .
           move      61                   to   v-pos                  .
      *
           if        w-rig-flg-ann        =    spaces
                     move  spaces         to   v-alf
           else      move  "[MODIFICA ANNULLATA]"
                                          to   v-alf                  .
      *
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-flg-ann-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi chiave           *
      *    *-----------------------------------------------------------*
       cnt-tdo-key-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-key-flg      .
       cnt-tdo-key-999.
           exit.
           
      *    *===========================================================*
      *    * Controllo se chiave vuota                                 *
      *    *-----------------------------------------------------------*
       cnt-key-vuo-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-key-vuo-flg      .
       cnt-key-vuo-999.
           exit.

      *    *===========================================================*
      *    * Controllo su impostazione tasto Do campi non chiave       *
      *    *-----------------------------------------------------------*
       cnt-tdo-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-nok-flg      .
       cnt-tdo-nok-999.
           exit.
           
      *    *===========================================================*
      *    * Controllo su impostazione tasto Do riga corpo             *
      *    *-----------------------------------------------------------*
       cnt-tdo-rig-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-rig-flg      .
       cnt-tdo-rig-010.
      *              *-------------------------------------------------*
      *              * Controllo su gruppo merceologico                *
      *              *-------------------------------------------------*
           if        w-rig-cla-pro        =    zero
                     go to cnt-tdo-rig-020.
           if        w-rig-cla-pro-sud    =    01
                     go to cnt-tdo-rig-020.
           if        w-rig-gru-pro        not  = zero
                     go to cnt-tdo-rig-020.
           move      "Manca il codice gruppo merceologico"
                                          to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-020.
      *              *-------------------------------------------------*
      *              * Controllo su sottogruppo merceologico           *
      *              *-------------------------------------------------*
           if        w-rig-cla-pro        =    zero
                     go to cnt-tdo-rig-040.
           if        w-rig-gru-pro        =    zero
                     go to cnt-tdo-rig-040.
           if        w-rig-cla-pro-sud    =    01
                     go to cnt-tdo-rig-040.
           if        w-rig-gru-pro-sud    =    01
                     go to cnt-tdo-rig-040.
           if        w-rig-sgr-pro        not  = zero
                     go to cnt-tdo-rig-040.
           move      "Manca il codice sottogruppo merceologico"
                                          to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-040.
      *              *-------------------------------------------------*
      *              * Controllo su tipo prodotto                      *
      *              *-------------------------------------------------*
           if        w-rig-tip-pro        not  = zero
                     go to cnt-tdo-rig-600.
           move      "Manca il tipo prodotto"
                                          to   w-err-box-err-msg      .
           go to     cnt-tdo-rig-900.
       cnt-tdo-rig-600.
      *              *-------------------------------------------------*
      *              * Normalizzazioni post-controlli bloccanti        *
      *              *-------------------------------------------------*
       cnt-tdo-rig-800.
      *              *-------------------------------------------------*
      *              * Uscita per controlli e normalizzazioni eseguiti *
      *              *-------------------------------------------------*
           go to     cnt-tdo-rig-999.
       cnt-tdo-rig-900.
      *              *-------------------------------------------------*
      *              * Emissione messaggio di errore e set del flag di *
      *              * uscita ad errore                                *
      *              *-------------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di errore in uscita                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-rig-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     cnt-tdo-rig-999.
       cnt-tdo-rig-999.
           exit.

      *    *===========================================================*
      *    * Preparazioni pre-accettazione riga corpo                  *
      *    *-----------------------------------------------------------*
       pre-rig-cor-000.
       pre-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Azioni post-accettazione riga corpo                       *
      *    *-----------------------------------------------------------*
       pos-rig-cor-000.
       pos-rig-cor-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati chiave e non chiave                  *
      *    *-----------------------------------------------------------*
       nor-key-nok-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione dati chiave                     *
      *              *-------------------------------------------------*
           perform   nor-key-reg-000      thru nor-key-reg-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave testata         *
      *              *-------------------------------------------------*
           perform   nor-nok-tes-000      thru nor-nok-tes-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave riga corpo      *
      *              *-------------------------------------------------*
           perform   nor-nok-rig-000      thru nor-nok-rig-999        .
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave piede           *
      *              *-------------------------------------------------*
           perform   nor-nok-pie-000      thru nor-nok-pie-999        .
      *              *-------------------------------------------------*
      *              * Inizializzazione file relative di supporto      *
      *              *-------------------------------------------------*
           move      "BE"                 to   w-rlt-sup-ope          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       nor-key-nok-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati chiave                               *
      *    *-----------------------------------------------------------*
       nor-key-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione selettori sulle chiavi          *
      *              *-------------------------------------------------*
           move      zero                 to   w-tes-fso-dcp          .
           move      spaces               to   w-tes-fso-dcp-des      .
      *              *-------------------------------------------------*
      *              * Normalizzazione selettori sui dati              *
      *              *-------------------------------------------------*
           move      zero                 to   w-tes-cla-pro          .
           move      zero                 to   w-tes-cla-pro-sns      .
           move      spaces               to   w-tes-cla-pro-des      .
           move      spaces               to   w-tes-cla-pro-mne      .
           move      zero                 to   w-tes-cla-pro-sud      .
           move      zero                 to   w-tes-gru-pro          .
           move      zero                 to   w-tes-gru-pro-sns      .
           move      spaces               to   w-tes-gru-pro-des      .
           move      zero                 to   w-tes-gru-pro-sud      .
           move      zero                 to   w-tes-sgr-pro          .
           move      zero                 to   w-tes-sgr-pro-sns      .
           move      spaces               to   w-tes-sgr-pro-des      .
      *              *-------------------------------------------------*
      *              * Normalizzazione valori sostitutivi              *
      *              *-------------------------------------------------*
           move      zero                 to   w-tes-cla-sos          .
           move      zero                 to   w-tes-gru-sos          .
           move      zero                 to   w-tes-sgr-sos          .
      *              *-------------------------------------------------*
      *              * Normalizzazione conferma ipostazioni            *
      *              *-------------------------------------------------*
           move      spaces               to   w-tes-cnf-imp          .
      *              *-------------------------------------------------*
      *              * Normalizzazione work area di [zos] per [dcp]    *
      *              *-------------------------------------------------*
           perform   nor-zos-dcp-000      thru nor-zos-dcp-999        .
       nor-key-reg-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave testata                   *
      *    *-----------------------------------------------------------*
       nor-nok-tes-000.
       nor-nok-tes-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave riga corpo                *
      *    *-----------------------------------------------------------*
       nor-nok-rig-000.
           move      zero                 to   w-rig-num-prg          .
           move      zero                 to   w-rig-num-pro          .
           move      spaces               to   w-rig-alf-pro          .
           move      spaces               to   w-rig-alf-pro-des      .
           move      zero                 to   w-rig-cla-pro          .
           move      spaces               to   w-rig-cla-pro-des      .
           move      zero                 to   w-rig-cla-pro-sud      .
           move      spaces               to   w-rig-cla-pro-umi      .
           move      zero                 to   w-rig-gru-pro          .
           move      spaces               to   w-rig-gru-pro-des      .
           move      zero                 to   w-rig-gru-pro-sud      .
           move      spaces               to   w-rig-gru-pro-umi      .
           move      zero                 to   w-rig-sgr-pro          .
           move      spaces               to   w-rig-sgr-pro-des      .
           move      zero                 to   w-rig-sgr-pro-sud      .
           move      spaces               to   w-rig-sgr-pro-umi      .
           move      spaces               to   w-rig-umi-ven          .
           move      spaces               to   w-rig-umi-ven-des      .
           move      zero                 to   w-rig-tip-pro          .
           move      spaces               to   w-rig-syn-pro          .
           move      spaces               to   w-rig-flg-ann          .
           move      spaces               to   w-rig-flg-ann-rmv      .
       nor-nok-rig-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione dati non chiave piede                     *
      *    *-----------------------------------------------------------*
       nor-nok-pie-000.
       nor-nok-pie-999.
           exit.

      *    *===========================================================*
      *    * Lettura registrazione pre-esistente                       *
      *    *-----------------------------------------------------------*
       rou-let-reg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-let-reg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione file relative di supporto      *
      *              *-------------------------------------------------*
           move      "BE"                 to   w-rlt-sup-ope          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       rou-let-reg-100.
      *              *-------------------------------------------------*
      *              * Esecuzione caricamento file relative di appog-  *
      *              * gio in ordine ascendente o discendente          *
      *              *-------------------------------------------------*
           if        w-cnt-acc-flg-swo    =    "D"
                     go to rou-let-reg-140
           else      go to rou-let-reg-120.
       rou-let-reg-120.
      *              *-------------------------------------------------*
      *              * Se ordine ascendente                            *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   car-fil-rap-000
                                          thru car-fil-rap-999        .
      *
           go to     rou-let-reg-180.
       rou-let-reg-140.
      *              *-------------------------------------------------*
      *              * Se ordine discendente                           *
      *              *-------------------------------------------------*
           sort      srt                  on   descending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   car-fil-rap-000
                                          thru car-fil-rap-999        .
      *
           go to     rou-let-reg-180.
       rou-let-reg-180.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del numero di records ca-  *
      *              * ricati nel file relative di appoggio            *
      *              *-------------------------------------------------*
           if        w-rlt-sup-max        =    zero
                     go to rou-let-reg-200
           else      go to rou-let-reg-300.
       rou-let-reg-200.
      *              *-------------------------------------------------*
      *              * Se numero di records caricati : zero            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "Nessun prodotto da trattare !                     
      -              "      "             to   w-err-box-err-msg      .
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Status di uscita ad errore                  *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-rou-let-reg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-300.
      *              *-------------------------------------------------*
      *              * Se numero di records caricati maggiore di zero  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Modifica                                    *
      *                  *---------------------------------------------*
           move      "M"                  to   w-cnt-mfu-tip-fun      .
      *                  *---------------------------------------------*
      *                  * Test per visualizzazione                    *
      *                  *---------------------------------------------*
           if        w-ovy-exe-vis        =    "V"
                     move  "V"            to   w-cnt-mfu-tip-fun      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     rou-let-reg-999.
       rou-let-reg-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per inserimento                  *
      *    *-----------------------------------------------------------*
       pre-acc-ins-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-ins      .
       pre-acc-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per modifica                     *
      *    *-----------------------------------------------------------*
       pre-acc-mod-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-mod      .
       pre-acc-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-accettazioni per visualizzazione              *
      *    *-----------------------------------------------------------*
       pre-acc-vis-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-acc-vis      .
       pre-acc-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-richiesta di ratifica tasto Delete            *
      *    *-----------------------------------------------------------*
       pre-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-snx-del      .
      *              *-------------------------------------------------*
      *              * Si ignora comunque il tasto Delt                *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-pre-snx-del      .
       pre-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-richiesta di ratifica tasto Delete           *
      *    *-----------------------------------------------------------*
       pos-snx-del-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pos-snx-del      .
      *              *-------------------------------------------------*
      *              * Si ignora comunque il tasto Delt                *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-pos-snx-del      .
       pos-snx-del-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su inserimento                          *
      *    *-----------------------------------------------------------*
       pos-exi-ins-000.
       pos-exi-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su modifica                             *
      *    *-----------------------------------------------------------*
       pos-exi-mod-000.
       pos-exi-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-exit su visualizzazione                      *
      *    *-----------------------------------------------------------*
       pos-exi-vis-000.
       pos-exi-vis-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di inserimento                      *
      *    *-----------------------------------------------------------*
       pos-cnf-ins-000.
       pos-cnf-ins-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di modifica                         *
      *    *-----------------------------------------------------------*
       pos-cnf-mod-000.
      *              *-------------------------------------------------*
      *              * Scaricamento file relative di appoggio          *
      *              *-------------------------------------------------*
           perform   sca-fil-rap-000      thru sca-fil-rap-999        .
       pos-cnf-mod-999.
           exit.

      *    *===========================================================*
      *    * Routine post-conferma di annullamento                     *
      *    *-----------------------------------------------------------*
       pos-cnf-ann-000.
       pos-cnf-ann-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione contatori righe                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-car-eff-rig-ctr      .
           move      zero                 to   w-car-eff-rig-num      .
      *              *-------------------------------------------------*
      *              * Normalizzazione segnale di superamento massimo  *
      *              * righe da caricare                               *
      *              *-------------------------------------------------*
           move      spaces               to   w-car-eff-rig-flg      .
       stp-srt-inp-050.
      *              *-------------------------------------------------*
      *              * Messaggio di caricamento in esecuzione          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "                   --- Caricamento prodotti in ese
      -              "cuzione ---                   "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Start filtro di ordinamento e selezione per il  *
      *              * file [dcp]                                      *
      *              *-------------------------------------------------*
           move      "ST"                 to   f-ope                  .
           move      w-tes-fso-dcp        to   f-key                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se errore su Start : uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-900.
       stp-srt-inp-200.
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Read Next filtro di ordinamento e selezione per *
      *              * file [dcp]                                      *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/prg/obj/bzosdcp0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se At End : uscita                          *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-900.
       stp-srt-inp-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
       stp-srt-inp-400.
      *              *-------------------------------------------------*
      *              * Selezioni sul record                            *
      *              *-------------------------------------------------*
           perform   sel-rec-dcp-000      thru sel-rec-dcp-999        .
      *                  *---------------------------------------------*
      *                  * Test su flag di selezione                   *
      *                  *---------------------------------------------*
           if        w-sel-rec-dcp-flg    not  = spaces
                     go to stp-srt-inp-200.
       stp-srt-inp-600.
      *              *-------------------------------------------------*
      *              * Composizione record di sort                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore righe                  *
      *                  *---------------------------------------------*
           add       1                    to   w-car-eff-rig-num      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione record di sort              *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
      *                  *---------------------------------------------*
      *                  * Composizione chiave                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione preliminare chiavi      *
      *                      *-----------------------------------------*
           move      zero                 to   srt-prg-key            .
           move      spaces               to   srt-alf-key            .
           move      spaces               to   srt-des-key            .
           move      zero                 to   srt-cla-key            .
           move      spaces               to   srt-alc-key            .
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione dello switch di  *
      *                      * sort                                    *
      *                      *-----------------------------------------*
           if        w-cnt-acc-flg-sws    =    "P"
                     go to stp-srt-inp-610
           else if   w-cnt-acc-flg-sws    =    "C"
                     go to stp-srt-inp-620
           else if   w-cnt-acc-flg-sws    =    "D"
                     go to stp-srt-inp-630
           else if   w-cnt-acc-flg-sws    =    "M"
                     go to stp-srt-inp-640
           else      go to stp-srt-inp-610.
       stp-srt-inp-610.
      *                      *-----------------------------------------*
      *                      * Ordinamento per progressivo filtro      *
      *                      *-----------------------------------------*
           move      w-car-eff-rig-num    to   srt-prg-key            .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-680.
       stp-srt-inp-620.
      *                      *-----------------------------------------*
      *                      * Ordinamento per codice prodotto         *
      *                      *-----------------------------------------*
           move      rf-dcp-alf-pro       to   srt-alf-key            .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-680.
       stp-srt-inp-630.
      *                      *-----------------------------------------*
      *                      * Ordinamento per descrizione prodotto    *
      *                      *-----------------------------------------*
           move      rf-dcp-des-pro       to   srt-des-key            .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-680.
       stp-srt-inp-640.
      *                      *-----------------------------------------*
      *                      * Ordinamento per classe merceologica     *
      *                      *-----------------------------------------*
           move      rf-dcp-cla-pro       to   srt-cla-key            .
           move      rf-dcp-alf-pro       to   srt-alc-key            .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-680.
       stp-srt-inp-680.
      *                  *---------------------------------------------*
      *                  * Composizione dati                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Record [dcp]                            *
      *                      *-----------------------------------------*
           move      rf-dcp               to   srt-rec-dcp            .
       stp-srt-inp-700.
      *              *-------------------------------------------------*
      *              * Rilascio del record al Sort                     *
      *              *-------------------------------------------------*
           release   srt-rec                                          .
       stp-srt-inp-800.
      *              *-------------------------------------------------*
      *              * Riciclo a record successivo                     *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-200.
       stp-srt-inp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-999.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione caricamento file relative di appoggio          *
      *    *-----------------------------------------------------------*
       car-fil-rap-000.
       car-fil-rap-100.
      *              *-------------------------------------------------*
      *              * La preparazione della catena avviene dai record *
      *              * rilasciati dalla routine in input di sort       *
      *              *-------------------------------------------------*
       car-fil-rap-200.
      *              *-------------------------------------------------*
      *              * Indicatore di programma in esecuzione           *
      *              *-------------------------------------------------*
           move      "IE"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se At End : uscita                          *
      *                  *---------------------------------------------*
           return    srt    at end
                            go to car-fil-rap-900                     .
       car-fil-rap-300.
      *              *-------------------------------------------------*
      *              * Normalizzazione record [dcp]                    *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * Ripresa record [dcp]                            *
      *              *-------------------------------------------------*
           move      srt-rec-dcp          to   rf-dcp                 .
       car-fil-rap-500.
      *              *-------------------------------------------------*
      *              * Caricamento effettivo del record nella catena   *
      *              * movimenti per la registrazione                  *
      *              *-------------------------------------------------*
           perform   car-eff-rig-000      thru car-eff-rig-999        .
      *                  *---------------------------------------------*
      *                  * Test su flag di uscita                      *
      *                  *---------------------------------------------*
           if        w-car-eff-rig-flg    =    spaces
                     go to car-fil-rap-600.
      *                  *---------------------------------------------*
      *                  * Box di superamento numero elementi massimo  *
      *                  * da caricare                                 *
      *                  *---------------------------------------------*
           perform   box-err-rig-000      thru box-err-rig-999        .
      *                  *---------------------------------------------*
      *                  * Fine lettura                                *
      *                  *---------------------------------------------*
           go to     car-fil-rap-900.
       car-fil-rap-600.
      *              *-------------------------------------------------*
      *              * Riciclo a Read Next su file [dcp]               *
      *              *-------------------------------------------------*
           go to     car-fil-rap-200.
       car-fil-rap-900.
      *              *-------------------------------------------------*
      *              * Eliminazione messaggio di caricamento in esecu- *
      *              * zione                                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       car-fil-rap-950.
      *              *-------------------------------------------------*
      *              * Forzatura flag di visualizzazione prompt e dati *
      *              * campi chiave                                    *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-pmt-key      .
           move      "#"                  to   w-cnt-sts-vis-key      .
       car-fil-rap-999.
           exit.

      *    *===========================================================*
      *    * Selezioni sul record [dcp]                                *
      *    *-----------------------------------------------------------*
       sel-rec-dcp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di selezione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-sel-rec-dcp-flg      .
       sel-rec-dcp-100.
      *              *-------------------------------------------------*
      *              * Codice classe                                   *
      *              *-------------------------------------------------*
           if        w-tes-cla-pro-sns    =    zero and
                     w-tes-cla-pro        =    zero
                     go to sel-rec-dcp-200.
           if        rf-dcp-cla-pro       not  = w-tes-cla-pro
                     go to sel-rec-dcp-900.
       sel-rec-dcp-200.
      *              *-------------------------------------------------*
      *              * Codice gruppo                                   *
      *              *-------------------------------------------------*
           if        w-tes-gru-pro-sns    =    zero and
                     w-tes-gru-pro        =    zero
                     go to sel-rec-dcp-300.
           if        rf-dcp-gru-pro       not  = w-tes-gru-pro
                     go to sel-rec-dcp-900.
       sel-rec-dcp-300.
      *              *-------------------------------------------------*
      *              * Codice sottogruppo                              *
      *              *-------------------------------------------------*
           if        w-tes-sgr-pro-sns    =    zero and
                     w-tes-sgr-pro        =    zero
                     go to sel-rec-dcp-800.
           if        rf-dcp-sgr-pro       not  = w-tes-sgr-pro
                     go to sel-rec-dcp-900.
       sel-rec-dcp-800.
      *              *-------------------------------------------------*
      *              * Uscita per selezione superata                   *
      *              *-------------------------------------------------*
           go to     sel-rec-dcp-999.
       sel-rec-dcp-900.
      *              *-------------------------------------------------*
      *              * Se selezione non superata                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di selezione non superata              *
      *                  *---------------------------------------------*
           move      "#"                  to   w-sel-rec-dcp-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita per selezione non superata           *
      *                  *---------------------------------------------*
           go to     sel-rec-dcp-999.
       sel-rec-dcp-999.
           exit.

      *    *===========================================================*
      *    * Caricamento effettivo delle righe                         *
      *    *-----------------------------------------------------------*
       car-eff-rig-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione dati non chiave riga corpo      *
      *              *-------------------------------------------------*
           perform   nor-nok-rig-000      thru nor-nok-rig-999        .
       car-eff-rig-100.
      *              *-------------------------------------------------*
      *              * Composizione area 'w-rig'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore righe da caricare      *
      *                  *---------------------------------------------*
           add       1                    to   w-car-eff-rig-ctr      .
      *                  *---------------------------------------------*
      *                  * Test sul massimo righe caricabili           *
      *                  *---------------------------------------------*
           if        w-car-eff-rig-ctr    >    w-car-eff-rig-max
                     move  "#"            to   w-car-eff-rig-flg
                     go to car-eff-rig-999.
      *                  *---------------------------------------------*
      *                  * Numero progressivo record caricato          *
      *                  *---------------------------------------------*
           move      w-rlt-sup-max        to   w-rig-num-prg          .
           add       1                    to   w-rig-num-prg          .
      *                      *-----------------------------------------*
      *                      * Valori determinati direttamente da      *
      *                      * record [dcp]                            *
      *                      *-----------------------------------------*
           move      rf-dcp-num-pro       to   w-rig-num-pro          .
           move      rf-dcp-alf-pro       to   w-rig-alf-pro          .
           move      rf-dcp-des-pro       to   w-rig-alf-pro-des      .
           move      rf-dcp-cla-pro       to   w-rig-cla-pro          .
           move      rf-dcp-gru-pro       to   w-rig-gru-pro          .
           move      rf-dcp-sgr-pro       to   w-rig-sgr-pro          .
           move      rf-dcp-umi-ven       to   w-rig-umi-ven          .
           move      rf-dcp-tip-pro       to   w-rig-tip-pro          .
           move      rf-dcp-syn-pro       to   w-rig-syn-pro          .
      *                      *-----------------------------------------*
      *                      * Eventuali sostituzioni                  *
      *                      *-----------------------------------------*
           perform   car-eff-rig-sos-000  thru car-eff-rig-sos-999    .
      *                      *-----------------------------------------*
      *                      * Valori determinati indirettamente da    *
      *                      * record [dcp]                            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Lettura archivio [zp1]              *
      *                          *-------------------------------------*
           move      w-rig-cla-pro        to   w-let-arc-zp1-cla      .
           perform   let-arc-zp1-000      thru let-arc-zp1-999        .
           move      w-let-arc-zp1-des    to   w-rig-cla-pro-des      .
      *                          *-------------------------------------*
      *                          * Lettura archivio [zp2]              *
      *                          *-------------------------------------*
           move      w-rig-cla-pro        to   w-let-arc-zp2-cla      .
           move      w-rig-gru-pro        to   w-let-arc-zp2-gru      .
           perform   let-arc-zp2-000      thru let-arc-zp2-999        .
           move      w-let-arc-zp2-des    to   w-rig-gru-pro-des      .
      *                          *-------------------------------------*
      *                          * Lettura archivio [zp3]              *
      *                          *-------------------------------------*
           move      w-rig-cla-pro        to   w-let-arc-zp3-cla      .
           move      w-rig-gru-pro        to   w-let-arc-zp3-gru      .
           move      w-rig-sgr-pro        to   w-let-arc-zp3-sgr      .
           perform   let-arc-zp3-000      thru let-arc-zp3-999        .
           move      w-let-arc-zp3-des    to   w-rig-sgr-pro-des      .
      *                          *-------------------------------------*
      *                          * Lettura archivio [zum]              *
      *                          *-------------------------------------*
           move      w-rig-umi-ven        to   w-let-arc-zum-cod      .
           perform   let-arc-zum-000      thru let-arc-zum-999        .
           move      w-let-arc-zum-des    to   w-rig-umi-ven-des      .
       car-eff-rig-800.
      *              *-------------------------------------------------*
      *              * Bufferizzazione riga pre-modifica               *
      *              *-------------------------------------------------*
           move      w-rig-001            to   w-rig-002              .
      *              *-------------------------------------------------*
      *              * Put su file relative di appoggio                *
      *              *-------------------------------------------------*
           move      "PT"                 to   w-rlt-sup-ope          .
           move      w-rig                to   w-rlt-sup-buf          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
       car-eff-rig-999.
           exit.

      *    *===========================================================*
      *    * Caricamento effettivo delle righe                         *
      *    *                                                           *
      *    * Eventuali sostituzioni                                    *
      *    *-----------------------------------------------------------*
       car-eff-rig-sos-000.
      *              *-------------------------------------------------*
      *              * Codice classe                                   *
      *              *-------------------------------------------------*
           if        w-tes-cla-pro-sns    =    zero
                     go to car-eff-rig-sos-200.
           move      w-tes-cla-sos        to   w-rig-cla-pro          .
       car-eff-rig-sos-200.
      *              *-------------------------------------------------*
      *              * Codice gruppo                                   *
      *              *-------------------------------------------------*
           if        w-tes-gru-pro-sns    =    zero
                     go to car-eff-rig-sos-300.
           move      w-tes-gru-sos        to   w-rig-gru-pro          .
       car-eff-rig-sos-300.
      *              *-------------------------------------------------*
      *              * Codice sottogruppo                              *
      *              *-------------------------------------------------*
           if        w-tes-sgr-pro-sns    =    zero
                     go to car-eff-rig-sos-900.
           move      w-tes-sgr-sos        to   w-rig-sgr-pro          .
       car-eff-rig-sos-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     car-eff-rig-sos-999.
       car-eff-rig-sos-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione scaricamento da file relative di appoggio      *
      *    *-----------------------------------------------------------*
       sca-fil-rap-000.
      *              *-------------------------------------------------*
      *              * Messaggio di aggiornamento in esecuzione        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "            --- Aggiornamento anagrafiche prodotti
      -              " in esecuzione ---            "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       sca-fil-rap-050.
      *              *-------------------------------------------------*
      *              * Contatore records scaricati a zero              *
      *              *-------------------------------------------------*
           move      zero                 to   w-rlt-sup-ctr          .
       sca-fil-rap-100.
      *              *-------------------------------------------------*
      *              * Incremento contatore records scaricati          *
      *              *-------------------------------------------------*
           add       1                    to   w-rlt-sup-ctr          .
      *              *-------------------------------------------------*
      *              * Se maggiore del numero di records caricati  :   *
      *              * uscita                                          *
      *              *-------------------------------------------------*
           if        w-rlt-sup-ctr        >    w-rlt-sup-max
                     go to sca-fil-rap-900.
       sca-fil-rap-150.
      *              *-------------------------------------------------*
      *              * Lettura riga da file relative di supporto       *
      *              *-------------------------------------------------*
           move      "RD"                 to   w-rlt-sup-ope          .
           move      w-rlt-sup-ctr        to   w-rlt-sup-prg          .
           perform   cll-rlt-sup-000      thru cll-rlt-sup-999        .
           move      w-rlt-sup-buf        to   w-rig                  .
       sca-fil-rap-180.
      *              *-------------------------------------------------*
      *              * Test se riga modificata                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test sul flag di annullamento               *
      *                  *---------------------------------------------*
           if        w-rig-flg-ann        not  = spaces
                     go to sca-fil-rap-400.
      *                  *---------------------------------------------*
      *                  * Se e' stata richiesta almeno una sostitu-   *
      *                  * zione il test che segue viene ignorato      *
      *                  *---------------------------------------------*
           if        w-tes-cla-pro-sns    not  = zero or
                     w-tes-gru-pro-sns    not  = zero or
                     w-tes-sgr-pro-sns    not  = zero
                     go to sca-fil-rap-190.
      *                  *---------------------------------------------*
      *                  * Se non e' avvenuta alcuna modifica si rici- *
      *                  * cla alla riga successiva                    *
      *                  *---------------------------------------------*
           if        w-rig-001            =    w-rig-002
                     go to sca-fil-rap-400.
       sca-fil-rap-190.
      *              *-------------------------------------------------*
      *              * Lettura, con lock, del record [dcp]             *
      *              *-------------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      w-rig-num-pro        to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda dell'esito della lettura   *
      *              *-------------------------------------------------*
           if        f-sts                =    e-not-err
                     go to sca-fil-rap-250.
       sca-fil-rap-200.
      *              *-------------------------------------------------*
      *              * Se record non esistente                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Riciclo a rilettura riga da file relative   *
      *                  * di supporto                                 *
      *                  *---------------------------------------------*
           go to     sca-fil-rap-100.
       sca-fil-rap-250.
      *              *-------------------------------------------------*
      *              * Se record esistente                             *
      *              *-------------------------------------------------*
       sca-fil-rap-300.
      *                  *---------------------------------------------*
      *                  * Aggiornamento dati nel record               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Data, utente, fase, di ultimo inseri-   *
      *                      * mento o modifica                        *
      *                      *-----------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   rf-dcp-ide-dat         .
           move      s-ute                to   rf-dcp-ide-ute         .
           move      s-fas                to   rf-dcp-ide-fas         .
      *                      *-----------------------------------------*
      *                      * Dati gestiti dal programma              *
      *                      *-----------------------------------------*
           move      w-rig-cla-pro        to   rf-dcp-cla-pro         .
           move      w-rig-gru-pro        to   rf-dcp-gru-pro         .
           move      w-rig-sgr-pro        to   rf-dcp-sgr-pro         .
           move      w-rig-umi-ven        to   rf-dcp-umi-ven         .
           move      w-rig-tip-pro        to   rf-dcp-tip-pro         .
           move      w-rig-syn-pro        to   rf-dcp-syn-pro         .
       sca-fil-rap-350.
      *                  *---------------------------------------------*
      *                  * Update record                               *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Unlock record                               *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
       sca-fil-rap-400.
      *                  *---------------------------------------------*
      *                  * Riciclo a rilettura riga da file relative   *
      *                  * di supporto                                 *
      *                  *---------------------------------------------*
           go to     sca-fil-rap-100.
       sca-fil-rap-900.
      *              *-------------------------------------------------*
      *              * Eliminazione messaggio di aggiornamento in ese- *
      *              * cuzione                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 23                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       sca-fil-rap-999.
           exit.

      *    *===========================================================*
      *    * Box per superamento massimo righe caricabili              *
      *    *-----------------------------------------------------------*
       box-err-rig-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Costruzione box di dialogo                      *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      08                   to   v-lin                  .
           move      15                   to   v-pos                  .
           move      17                   to   v-lto                  .
           move      66                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal nel box di dialogo - 1                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      48                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      "Il numero di prodotti selezionati e' maggiore di"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal nel box di dialogo - 2                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      "quello gestibile dal programma (9999).         "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal nel box di dialogo - 3                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      "Si consiglia di operare una serie di selezioni "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal nel box di dialogo - 4                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      "sul minimo e massimo per poter agire su tutti  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal nel box di dialogo - 5                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      "gli elementi desiderati.                       "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal nel box di dialogo - 6                  *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Literal di presa visione                        *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      32                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      "Premere 'OK' per presa visione :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       box-err-rig-800.
      *              *-------------------------------------------------*
      *              * Accettazione campo di conferma                  *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      63                   to   v-pos                  .
           move      spaces               to   v-edm                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           if        v-alf                not  = "OK"
                     go to box-err-rig-800.
       box-err-rig-900.
      *              *-------------------------------------------------*
      *              * Restore video                                   *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       box-err-rig-999.
           exit.

      *    *===========================================================*
      *    * Routine per invio singolo documento                       *
      *    *                                                           *
      *    * Per reinviare un singolo documento in caso di errata      *
      *    * ricezione da parte del server di posta                    *
      *    *-----------------------------------------------------------*
       rou-swc-srt-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tasto funzione       *
      *              *-------------------------------------------------*
           if        v-key                =   "[1] "
                     go to rou-swc-srt-100
           else if   v-key                =   "[2] "
                     go to rou-swc-srt-200
           else if   v-key                =   "[3] "
                     go to rou-swc-srt-300
           else if   v-key                =   "[4] "
                     go to rou-swc-srt-400
           else      go to rou-swc-srt-900.
       rou-swc-srt-100.
      *              *-------------------------------------------------*
      *              * Tasto funzione [1] - Progressivo filtro         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su switch attuale                      *
      *                  *---------------------------------------------*
           if        w-cnt-acc-flg-sws    =   "P"
                     go to rou-swc-srt-600.
      *                  *---------------------------------------------*
      *                  * Indicatore tipo ordinamento                 *
      *                  *---------------------------------------------*
           move      "P"                  to  w-cnt-acc-flg-sws       .
      *                  *---------------------------------------------*
      *                  * Indicatore ordinamento                      *
      *                  *---------------------------------------------*
           move      "A"                  to  w-cnt-acc-flg-swo       .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     rou-swc-srt-900.
       rou-swc-srt-200.
      *              *-------------------------------------------------*
      *              * Tasto funzione [2] - Codice alfanumerico        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su switch attuale                      *
      *                  *---------------------------------------------*
           if        w-cnt-acc-flg-sws    =   "C"
                     go to rou-swc-srt-600.
      *                  *---------------------------------------------*
      *                  * Indicatore tipo ordinamento                 *
      *                  *---------------------------------------------*
           move      "C"                  to  w-cnt-acc-flg-sws       .
      *                  *---------------------------------------------*
      *                  * Indicatore ordinamento                      *
      *                  *---------------------------------------------*
           move      "A"                  to  w-cnt-acc-flg-swo       .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     rou-swc-srt-900.
       rou-swc-srt-300.
      *              *-------------------------------------------------*
      *              * Tasto funzione [3] - Descrizione                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su switch attuale                      *
      *                  *---------------------------------------------*
           if        w-cnt-acc-flg-sws    =   "D"
                     go to rou-swc-srt-600.
      *                  *---------------------------------------------*
      *                  * Indicatore tipo ordinamento                 *
      *                  *---------------------------------------------*
           move      "D"                  to  w-cnt-acc-flg-sws       .
      *                  *---------------------------------------------*
      *                  * Indicatore ordinamento                      *
      *                  *---------------------------------------------*
           move      "A"                  to  w-cnt-acc-flg-swo       .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     rou-swc-srt-900.
       rou-swc-srt-400.
      *              *-------------------------------------------------*
      *              * Tasto funzione [4] - Merceologia                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su switch attuale                      *
      *                  *---------------------------------------------*
           if        w-cnt-acc-flg-sws    =   "M"
                     go to rou-swc-srt-600.
      *                  *---------------------------------------------*
      *                  * Indicatore tipo ordinamento                 *
      *                  *---------------------------------------------*
           move      "M"                  to  w-cnt-acc-flg-sws       .
      *                  *---------------------------------------------*
      *                  * Indicatore ordinamento                      *
      *                  *---------------------------------------------*
           move      "A"                  to  w-cnt-acc-flg-swo       .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     rou-swc-srt-900.
       rou-swc-srt-600.
      *              *-------------------------------------------------*
      *              * Eventuale inversione ordinamento                *
      *              *-------------------------------------------------*
           if        w-cnt-acc-flg-swo    =    "D"
                     move  "A"            to   w-cnt-acc-flg-swo
           else      move  "D"            to   w-cnt-acc-flg-swo      .
       rou-swc-srt-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     rou-swc-srt-999.
       rou-swc-srt-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [zp1]                         *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/larczp10.lts"                   .

      *    *===========================================================*
      *    * Routine di lettura archivio [zp2]                         *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/larczp20.lts"                   .

      *    *===========================================================*
      *    * Routine di lettura archivio [zp3]                         *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/larczp30.lts"                   .

      *    *===========================================================*
      *    * Routine lettura tabella [zum]                             *
      *    *-----------------------------------------------------------*
       let-arc-zum-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zum-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice unita' di misura a spaces        *
      *              *-------------------------------------------------*
           if        w-let-arc-zum-cod    =    spaces
                     go to let-arc-zum-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODUMI    "         to   f-key                  .
           move      w-let-arc-zum-cod    to   rf-zum-cod-umi         .
           move      "pgm/dcp/fls/ioc/obj/iofzum"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zum                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zum-400.
       let-arc-zum-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zum-des-umi       to   w-let-arc-zum-des      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zum-999.
       let-arc-zum-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zum-flg      .
           move      all   "."            to   w-let-arc-zum-des      .
           go to     let-arc-zum-999.
       let-arc-zum-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zum-des      .
       let-arc-zum-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [zos] per [dcp] completa      *
      *    *-----------------------------------------------------------*
       let-zos-dcp-cmp-000.
      *              *-------------------------------------------------*
      *              * Test su codice filtro                           *
      *              *-------------------------------------------------*
           if        w-tes-fso-dcp        =    zero
                     go to let-zos-dcp-cmp-900.
           move      w-tes-fso-dcp        to   w-zos-dcp-fso-cod      .
           if        w-zos-dcp-fso-tip    not  = zero
                     go to let-zos-dcp-cmp-900.
       let-zos-dcp-cmp-100.
      *              *-------------------------------------------------*
      *              * Lettura                                         *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFLT    "         to   f-key                  .
           move      "dcp "               to   rf-zos-tip-rec         .
           move      w-zos-dcp-fso-num    to   rf-zos-cod-flt         .
           move      "pgm/azi/fls/ioc/obj/iofzos"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zos                 .
      *                  *---------------------------------------------*
      *                  * Se record non trovato : uscita              *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-zos-dcp-cmp-900.
       let-zos-dcp-cmp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori letti                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Area dati in work di trattamento            *
      *                  *---------------------------------------------*
           move      rf-zos-dat-flt       to   w-zos-dcp              .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     let-zos-dcp-cmp-900.
       let-zos-dcp-cmp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-zos-dcp-cmp-999.
       let-zos-dcp-cmp-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [zos] per [dcp]                  *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/lzosdcp0.lts"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice filtro ordina-  *
      *    * mento e selezione per file [dcp]                          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/azosdcp0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per accettazione codice prodotto 'dcp'        *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acoddcp0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice classe          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acmnzp10.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice gruppo          *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acmnzp20.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione del codice sottogruppo     *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acmnzp30.acs"                   .

      *    *===========================================================*
      *    * Subroutines per l'accettazione unita' di misura           *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/acodzum0.acs"                   .

      *    *===========================================================*
      *    * Work-area per la normalizzazione dell'area libera per il  *
      *    * filtro 'dcp '                                             *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcp/prg/cpy/wzosdcp0.wks"                   .

      *    *===========================================================*
      *    * Richiamo sottoprogramma per gestione catena righe         *
      *    *-----------------------------------------------------------*
       cll-rlt-sup-000.
           move      "pgm/dcp/prg/obj/pdcp4502"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using w-rlt-sup              .
       cll-rlt-sup-999.
           exit.

      *    *===========================================================*
      *    * Cancellazione sottoprogramma per gestione catena righe    *
      *    *-----------------------------------------------------------*
       cnc-rlt-sup-000.
           move      "pgm/dcp/prg/obj/pdcp4502"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       cnc-rlt-sup-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/werrbox0.cps"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

