       Identification Division.
       Program-Id.                                 pxpg0018           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    swd                 *
      *                        Area gestionale:    xpg                 *
      *                                Settore:                        *
      *                                   Fase:                        *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 20/05/04    *
      *                       Ultima revisione:    NdK del 19/04/13    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Invio e-mail (.e)                           *
      *                                                                *
      *                    Utilizzo di comando scritto in  Perl        *
      *                    prelevando gli indirizzi da un file ASCII   *
      *                    opzionale                                   *
      *                                                                *
      *                    Pathname utilizzati :                       *
      *                                                                *
      *                    '/abd/etc/t_mailer' : comando Perl          *
      *                    '/abd/tmp/sogg.txt' : oggetto del messaggio *
      *                    '/abd/asc/mess.txt' : testo del messaggio   *
      *                    '/abd/asc/mail.001' : lista di default      *
      *                                                                *
      *                    N.B.: l'allegato (PDF) si deve trovare      *
      *                          nella cartella 'pdf/out' dell'utente  *
      *                          e il nome deve essere esatto e con    *
      *                          l'estensione '.pdf'                   *
      *                                                                *
      *                    ___ DA PERFEZIONARE ___                     *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "swd"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "xpg"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "   "                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "e-mail"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pxpg0018"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "         INVIO POSTA ELETTRONICA        "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mvideo" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mmessg" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                 "mbckgx" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output su files *
      *    * di tipo line sequential                                   *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/g"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mopsys" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/o"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine rou-opn-fls-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-rou-opn-fls      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine qry-rou-pri-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-qry-rou-pri      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di tipo uscita da routines di accettazione      *
      *        *-------------------------------------------------------*
           05  w-cnt-acc.
      *            *---------------------------------------------------*
      *            * Da accettazione campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-acc-ric-sel      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di uscita da controlli su tasto Do              *
      *        *-------------------------------------------------------*
           05  w-cnt-tdo.
      *            *---------------------------------------------------*
      *            * Per tasto Do su campi richieste                   *
      *            *---------------------------------------------------*
               10  w-cnt-tdo-ric-flg      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status impostazioni             *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-imp.
      *            *---------------------------------------------------*
      *            * Impostazione richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-imp-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione prompts  *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-pmt.
      *            *---------------------------------------------------*
      *            * Visualizzazione prompts richieste                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-pmt-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status visualizzazione dati     *
      *        *-------------------------------------------------------*
           05  w-cnt-sts-vis.
      *            *---------------------------------------------------*
      *            * Visualizzazione dati richieste                    *
      *            *---------------------------------------------------*
               10  w-cnt-sts-vis-ric      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No richieste pre esecuzione interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento ciclico interrogazione        *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-cic      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No funzionamento automatico interrogazione     *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-aut      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di Si/No primo giro di esecuzione            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-prm-gir      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento qry-routine       *
      *        *-------------------------------------------------------*
           05  w-cnt-qry.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-qry-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-qry-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-liv.
                   15  w-cnt-qry-sav-l05  pic  x(64)                  .
                   15  w-cnt-qry-sav-l04  pic  x(64)                  .
                   15  w-cnt-qry-sav-l03  pic  x(64)                  .
                   15  w-cnt-qry-sav-l02  pic  x(64)                  .
                   15  w-cnt-qry-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-qry-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Literals                                              *
      *        *-------------------------------------------------------*
           05  w-cnt-lit.
               10  w-cnt-lit-t80          pic  x(80) value all "="    .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*

      *    *===========================================================*
      *    * Work-area richieste per stampa                            *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Pathname del file in input                            *
      *        *-------------------------------------------------------*
           05  rr-pth-inp                 pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Oggetto                                               *
      *        *-------------------------------------------------------*
           05  rr-ogg-msg.
               10  rr-ogg-rig occurs 2    pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Testo                                                 *
      *        *-------------------------------------------------------*
           05  rr-tst-msg.
               10  rr-tst-rig occurs 10   pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Pathname del file allegato                            *
      *        *-------------------------------------------------------*
           05  rr-pth-all                 pic  x(40)                  .

      *    *===========================================================*
      *    * File area generica                                        *
      *    *-----------------------------------------------------------*
       01  f-xxx.
           05  f-xxx-bas                  pic  x(40)                  .
           05  f-xxx-ptc                  pic  x(40)                  .
           05  f-xxx-ppb                  pic  x(40)                  .
           05  f-xxx-ute                  pic  x(08)                  .
           05  f-xxx-msg                  pic  x(08)                  .
           05  f-xxx-sgt                  pic  x(08)                  .
           05  f-xxx-cmd                  pic  x(17)                  .
           05  f-xxx-pdf                  pic  x(40)                  .
           05  f-xxx-snr                  pic  x(01)                  .
           05  f-xxx-dfp                  pic  x(08)                  .
           05  f-xxx-ppp                  pic  x(40)                  .
           05  f-xxx-msa                  pic  x(40)                  .
           05  f-xxx-psm                  pic  x(40)                  .
           05  f-xxx-uid                  pic  x(40)                  .
           05  f-xxx-pwd                  pic  x(20)                  .

      *    *===========================================================*
      *    * Work generica per tutto il programma                      *
      *    *-----------------------------------------------------------*
       01  w-gen.
      *        *-------------------------------------------------------*
      *        * Contatore generico di comodo                          *
      *        *-------------------------------------------------------*
           05  w-gen-ctr-001              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per testo soggetto                             *
      *        *-------------------------------------------------------*
           05  w-gen-txt-sgt              pic  x(80)                  .

      *    *===========================================================*
      *    * Link-area per accettazione indirizzo e-mail               *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/aindeml0.acl"                   .

      *    *===========================================================*
      *    * Work per buffer elenco dei PDF                            *
      *    *-----------------------------------------------------------*
       01  w-buf-pdf.
      *        *-------------------------------------------------------*
      *        * Work per buffer                                       *
      *        *-------------------------------------------------------*
           05  w-buf-pdf-fnd.
      *            *---------------------------------------------------*
      *            * Flag di uscita                                    *
      *            *---------------------------------------------------*
               10  w-buf-pdf-fnd-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo archivio di richiesta                        *
      *            *---------------------------------------------------*
               10  w-buf-pdf-fnd-tar      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di selezione                                 *
      *            *---------------------------------------------------*
               10  w-buf-pdf-fnd-fds      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Set selezionato                                   *
      *            *---------------------------------------------------*
               10  w-buf-pdf-fnd-sts      pic  x(06)                  .
      *            *---------------------------------------------------*
      *            * Data documento selezionato                        *
      *            *---------------------------------------------------*
               10  w-buf-pdf-fnd-dds      pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Area di comodo                                    *
      *            *---------------------------------------------------*
               10  w-buf-pdf-fnd-c01      pic  9(03)                  .
               10  w-buf-pdf-fnd-c02      pic  9(03)                  .
               10  w-buf-pdf-fnd-c03      pic  9(03)                  .
               10  w-buf-pdf-fnd-c04      pic  9(03)                  .
               10  w-buf-pdf-fnd-c05      pic  9(03)                  .
               10  w-buf-pdf-fnd-nli      pic  9(03)                  .
               10  w-buf-pdf-fnd-crb      pic  9(03)                  .
               10  w-buf-pdf-fnd-cpb      pic  9(03)                  .
               10  w-buf-pdf-fnd-cpa      pic  9(03)                  .
               10  w-buf-pdf-fnd-max      pic  9(03) value 540        .
               10  w-buf-pdf-fnd-buf occurs 540.
                   15  w-buf-pdf-fnd-pdf  pic  x(53)                  .
               10  w-buf-pdf-fnd-ltp.
                   15  filler             pic  x(07) value "Pagina "  .
                   15  w-buf-pdf-fnd-lt1  pic  9(02)                  .
                   15  filler             pic  x(04) value " di "     .
                   15  w-buf-pdf-fnd-lt2  pic  9(02)                  .

      *    *===========================================================*
      *    * Work per subroutines di Err                               *
      *    *-----------------------------------------------------------*
       01  w-err.
      *        *-------------------------------------------------------*
      *        * Work per Err con box centrale                         *
      *        *-------------------------------------------------------*
           05  w-err-box-err.
               10  w-err-box-err-msg      pic  x(65)                  .
               10  w-err-box-err-m02      pic  x(65)                  .
               10  w-err-box-err-m03      pic  x(65)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-dic-ini-pgm      .
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
           if        w-cnt-rou-opn-fls    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Segnale primo giro di esecuzione                *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-prm-gir      .
      *              *-------------------------------------------------*
      *              * Se no richieste : a esecuzione esportazione     *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-500.
       main-250.
      *              *-------------------------------------------------*
      *              * Accettazione richieste di selezione             *
      *              *-------------------------------------------------*
           perform   acc-ric-sel-000      thru acc-ric-sel-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per Exit                          *
      *                  *---------------------------------------------*
           if        w-cnt-acc-ric-sel    =    "E"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Regolarizzazione richieste di selezione         *
      *              *-------------------------------------------------*
           perform   reg-ric-sel-000      thru reg-ric-sel-999        .
       main-500.
      *              *-------------------------------------------------*
      *              * Esecuzione esportazione file                    *
      *              *-------------------------------------------------*
           perform   exe-exp-fil-000      thru exe-exp-fil-999        .
      *              *-------------------------------------------------*
      *              * Se no richieste : a fine programma              *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Test se fine esecuzione da operatore            *
      *              *-------------------------------------------------*
           if        w-cnt-qry-rou-pri    not  = spaces
                     go to main-750.
      *              *-------------------------------------------------*
      *              * Segnale non piu' primo giro di esecuzione       *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-prm-gir      .
      *              *-------------------------------------------------*
      *              * Test se tipo esecuzione ciclico                 *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S" or
                     w-cnt-fun-snx-cic    not  = "S"
                     go to main-750
           else      go to main-250.
       main-750.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *    *===========================================================*
      *    * Esecuzione accettazione di un campo                       *
      *    *-----------------------------------------------------------*
       exe-acc-cmp-000.
      *              *-------------------------------------------------*
      *              * Tasto di funzione Exit : sempre abilitato       *
      *              *-------------------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       exe-acc-cmp-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "S"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione titolo programma                          *
      *    *-----------------------------------------------------------*
       vis-tit-pgm-000.
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 01                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      01                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sigla del programma                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      i-ide-fas            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Descrizione del programma                       *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      i-ide-des            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 03                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      03                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Trattini a linea 22                             *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      22                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all   "="            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-tit-pgm-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
       pre-exe-pgm-100.
      *              *-------------------------------------------------*
      *              * Lettura User ID per invio posta sa segreteria   *
      *              *-------------------------------------------------*
           move      "PS"                 to   s-ope                  .
           move      "uid-ssm"            to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-alf                to   f-xxx-uid              .
      *              *-------------------------------------------------*
      *              * Lettura Password per invio posta sa segreteria  *
      *              *-------------------------------------------------*
           move      "PS"                 to   s-ope                  .
           move      "pwd-ssm"            to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-alf                to   f-xxx-pwd              .
      *              *-------------------------------------------------*
      *              * Lettura della personalizzazione relativa al     *
      *              * mail server                                     *
      *              *-------------------------------------------------*
           move      "PS"                 to   s-ope                  .
           move      "msa-isp"            to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-alf                to   f-xxx-msa              .
      *              *-------------------------------------------------*
      *              * Lettura della personalizzazione relativa al     *
      *              * postmaster                                      *
      *              *-------------------------------------------------*
           move      "PS"                 to   s-ope                  .
           move      "eml-psm"            to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-alf                to   f-xxx-psm              .
      *              *-------------------------------------------------*
      *              * Indirizzo mail mittente eventualmente legato    *
      *              * al codice utente                                *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *
           if        s-adx                not  = spaces
                     move  s-adx          to   f-xxx-psm              .
       pre-exe-pgm-180.
      *              *-------------------------------------------------*
      *              * Test se valori esistenti                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        f-xxx-msa            not  = spaces and
                     f-xxx-psm            not  = spaces
                     go to pre-exe-pgm-200.
      *                  *---------------------------------------------*
      *                  * Messaggio di errore                         *
      *                  *---------------------------------------------*
           move      "ATTENZIONE : mancano le personalizzazioni generali
      -              " per la posta."     to   w-err-box-err-msg      .
      *
           move      "Il programma pertanto non e' eseguibile!          
      -              "            "       to   w-err-box-err-m02      .
           perform   box-msg-e02-000      thru box-msg-e02-999        .
      *                  *---------------------------------------------*
      *                  * Uscita con errore                           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-pre-exe-pgm      .
           go to     pre-exe-pgm-999.
       pre-exe-pgm-200.
      *              *-------------------------------------------------*
      *              * Pathname programma                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Informazioni generali da segreteria         *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Codice utente in campo di destinazione      *
      *                  *---------------------------------------------*
           move      s-ute                to   f-xxx-ute              .
      *                  *---------------------------------------------*
      *                  * Default nome testo messaggio                *
      *                  *---------------------------------------------*
           move      "mess.txt"           to   f-xxx-msg              .
      *                  *---------------------------------------------*
      *                  * Default nome testo soggetto                 *
      *                  *---------------------------------------------*
           move      "sogg.txt"           to   f-xxx-sgt              .
      *                  *---------------------------------------------*
      *                  * Comando di invio                            *
      *                  *---------------------------------------------*
           move      "/abd/etc/t_mailer"  to   f-xxx-cmd              .
      *                  *---------------------------------------------*
      *                  * Default nome lista                          *
      *                  *---------------------------------------------*
           move      "mail.001"           to   f-xxx-dfp              .
      *                  *---------------------------------------------*
      *                  * Default per Si/no ricevuta                  *
      *                  *---------------------------------------------*
           move      "N"                  to   f-xxx-snr              .
      *                  *---------------------------------------------*
      *                  * Pathname dei comandi da segreteria          *
      *                  *---------------------------------------------*
           move      "PB"                 to   s-ope                  .
           move      "etc "               to   s-nam                  .
           call      "swd/mod/prg/obj/msegrt"
                                          using s                     .
           move      s-pat                to   f-xxx-ptc              .
      *                  *---------------------------------------------*
      *                  * Pathname di base da segreteria              *
      *                  *---------------------------------------------*
           move      "PB"                 to   s-ope                  .
           move      "asc "               to   s-nam                  .
           call      "swd/mod/prg/obj/msegrt"
                                          using s                     .
           move      s-pat                to   f-xxx-bas              .
      *                  *---------------------------------------------*
      *                  * Pathname per file 'pdf' utente              *
      *                  *---------------------------------------------*
           move      spaces               to   f-xxx-pdf              .
           string    f-xxx-bas  delimited by   spaces
                     "/"        delimited by   size
                     f-xxx-ute  delimited by   spaces
                     "/pdf/out/"
                                delimited by   size
                                          into f-xxx-pdf              .
       pre-exe-pgm-400.
      *              *-------------------------------------------------*
      *              * Operazioni preliminari per la ricerca PDF       *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-pdf-000  thru pre-exe-pgm-pdf-999    .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *                                                           *
      *    * Operazioni preliminari per la ricerca PDF                 *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-pdf-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Composizione nome file contenente l'elenco      *
      *              *-------------------------------------------------*
           move      spaces               to   f-xxx-ppb              .
           string    f-xxx-bas  delimited by   spaces
                     "/"        delimited by   size
                     f-xxx-ute  delimited by   spaces
                     "/tmp/LISTA"
                                delimited by   size
                                          into f-xxx-ppb              .
      *              *-------------------------------------------------*
      *              * Comando di preparazione                         *
      *              *-------------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      f-xxx-ptc            to   w-all-str-cat (1)      .
           move      "/t_dir_pdf"         to   w-all-str-cat (2)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      f-xxx-ute            to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   o-shs                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo 'mopsys'                    *
      *              *-------------------------------------------------*
           move      "SH"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pre-exe-pgm-pdf-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     pre-exe-pgm-pdf-999.
       pre-exe-pgm-pdf-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No richieste ad utente                       *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No funzionamento ciclico                     *
      *              *-------------------------------------------------*
           move      "N"                  to   w-cnt-fun-snx-cic      .
      *              *-------------------------------------------------*
      *              * Si/No funzionamento automatico                  *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-aut      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Open files per richieste                                  *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-rou-opn-fls      .
      *              *-------------------------------------------------*
      *              * Open modulo accettazione indirizzo e-mail       *
      *              *-------------------------------------------------*
           perform   cod-ind-eml-opn-000  thru cod-ind-eml-opn-999    .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files per richieste                                 *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Close modulo accettazione indirizzo e-mail      *
      *              *-------------------------------------------------*
           perform   cod-ind-eml-cls-000  thru cod-ind-eml-cls-999    .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo utilizzato                 *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mcvout"                         .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Accettazione richieste di selezione                       *
      *    *-----------------------------------------------------------*
       acc-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-acc-ric-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status impostazione             *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione prompts  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-pmt-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione status visualizzazione dati     *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri di selezione          *
      *              *-------------------------------------------------*
           perform   nor-ric-sel-000      thru nor-ric-sel-999        .
      *              *-------------------------------------------------*
      *              * Visualizzazione prompts                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in 'OFF'                              *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione titolo programma            *
      *                  *---------------------------------------------*
           perform   vis-tit-pgm-000      thru vis-tit-pgm-999        .
      *                  *---------------------------------------------*
      *                  * Prompts per richieste di selezione          *
      *                  *---------------------------------------------*
           perform   pmt-ric-sel-000      thru pmt-ric-sel-999        .
           move      "#"                  to   w-cnt-sts-pmt-ric      .
      *                  *---------------------------------------------*
      *                  * Video in 'ON'                               *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione func-key di impostazione    *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Abilitazione tasto Do                       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *                  *---------------------------------------------*
      *                  * Pathname del file in input                  *
      *                  *---------------------------------------------*
           perform   acc-ind-eml-000      thru acc-ind-eml-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
       acc-ric-sel-200.
      *                  *---------------------------------------------*
      *                  * Oggetto                                     *
      *                  *---------------------------------------------*
           perform   acc-ogg-msg-000      thru acc-ogg-msg-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-100.
       acc-ric-sel-300.
      *                  *---------------------------------------------*
      *                  * Testo                                       *
      *                  *---------------------------------------------*
           perform   acc-tst-msg-000      thru acc-tst-msg-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-200.
       acc-ric-sel-400.
      *                  *---------------------------------------------*
      *                  * Pathname del file allegato                  *
      *                  *---------------------------------------------*
           perform   acc-pth-all-000      thru acc-pth-all-999        .
           if        w-cnt-acc-ric-sel    not  = spaces
                     go to acc-ric-sel-999.
           if        v-key                =    "UP  "
                     go to acc-ric-sel-300.
       acc-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Flag di controllo status impostazioni           *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-imp-ric      .
      *              *-------------------------------------------------*
      *              * Flag di controllo status visualizzazione        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-sts-vis-ric      .
      *              *-------------------------------------------------*
      *              * Conferma impostazioni                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Cancellazione eventuali note operative      *
      *                  *---------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-ric-sel-910.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "MX"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      "Conferma impostazioni (S/N/E) ?"
                                          to   v-not                  .
           move      "S"                  to   v-alf                  .
           move      "SNE"                to   v-msk                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-key                not  = spaces
                     go to acc-ric-sel-920.
           if        v-alf                =    "S"
                     move   "DO  "        to   v-key
           else if   v-alf                =    "E"
                     move   "EXIT"        to   v-key
           else if   v-alf                =    "N"
                     move   "UP  "        to   v-key                  .
       acc-ric-sel-920.
      *                  *---------------------------------------------*
      *                  * Test su risposta dell'utente                *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     go to acc-ric-sel-930
           else if   v-key                =    "EXIT"
                     go to acc-ric-sel-940
           else if   v-key                =    "UP  "
                     go to acc-ric-sel-950
           else      go to acc-ric-sel-910.
       acc-ric-sel-930.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
           perform   tdo-ric-sel-000      thru tdo-ric-sel-999        .
           if        w-cnt-tdo-ric-flg    =    spaces
                     move  "S"            to   w-cnt-acc-ric-sel
                     go to acc-ric-sel-999
           else      move  spaces         to   w-cnt-tdo-ric-flg
                     go to acc-ric-sel-900.
       acc-ric-sel-940.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           move      "E"                  to   w-cnt-acc-ric-sel      .
           go to     acc-ric-sel-999.
       acc-ric-sel-950.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad accettazioni                         *
      *                      *-----------------------------------------*
           go to     acc-ric-sel-100.
       acc-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione prompts per richieste di selezione        *
      *    *-----------------------------------------------------------*
       pmt-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Pathname del file in input                      *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "E-mail destinatario        :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Oggetto                                         *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Oggetto                    :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Testo                                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Testo del messaggio        :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Pathname del file allegato                      *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Archivio allegato          :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       pmt-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Indirizzo mail destinatario          *
      *    *-----------------------------------------------------------*
       acc-ind-eml-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-ind-eml-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   w-cod-ind-eml-ope      .
           move      rr-pth-inp           to   w-cod-ind-eml-ind      .
           move      05                   to   w-cod-ind-eml-lin      .
           move      30                   to   w-cod-ind-eml-pos      .
           move      06                   to   w-cod-ind-eml-dln      .
           move      30                   to   w-cod-ind-eml-dps      .
           move      "B"                  to   v-edm                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           perform   cod-ind-eml-cll-000  thru cod-ind-eml-cll-999    .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
           perform   cod-ind-eml-foi-000  thru cod-ind-eml-foi-999    .
       acc-ind-eml-110.
           perform   cod-ind-eml-cll-000  thru cod-ind-eml-cll-999    .
           if        w-cod-ind-eml-ope    =    "F+"
                     go to acc-ind-eml-115.
           if        w-cod-ind-eml-ope    =    "AC"
                     go to acc-ind-eml-120.
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
       acc-ind-eml-115.
           perform   cod-ind-eml-foi-000  thru cod-ind-eml-foi-999    .
           go to     acc-ind-eml-110.
       acc-ind-eml-120.
           move      w-cod-ind-eml-ind    to   v-alf                  .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-ind-eml-999.
       acc-ind-eml-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-pth-inp             .
       acc-ind-eml-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se valore mancante                     *
      *                  *---------------------------------------------*
           if        rr-pth-inp           not  = spaces
                     go to acc-ind-eml-410.
           if        v-key                =    "UP  "
                     go to acc-ind-eml-999.
           go to     acc-ind-eml-100.
       acc-ind-eml-410.
      *                  *---------------------------------------------*
      *                  * Se valore presente                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test che non ci siano blanks embedded   *
      *                      *-----------------------------------------*
           move      rr-pth-inp           to   w-all-str-alf          .
           move      40                   to   w-all-str-lun          .
           perform   all-str-ble-000      thru all-str-ble-999        .
           if        w-all-str-flg        not  = spaces
                     go to acc-ind-eml-100.
      *                      *-----------------------------------------*
      *                      * Test che ci sia un carattere '@'        *
      *                      *-----------------------------------------*
           move      zero                 to   w-all-str-i01          .
           inspect   rr-pth-inp       tallying w-all-str-i01
                                     for all   "@"                    .
           if        w-all-str-i01        not  = 01
                     go to acc-ind-eml-100.
      *                      *-----------------------------------------*
      *                      * Test che ci siano caratteri '.'         *
      *                      *-----------------------------------------*
           move      zero                 to   w-all-str-i01          .
           inspect   rr-pth-inp       tallying w-all-str-i01
                                     for all   "."                    .
           if        w-all-str-i01        not  > zero
                     go to acc-ind-eml-100.
      *                      *-----------------------------------------*
      *                      * Test che non ci siano caratteri '"'     *
      *                      *-----------------------------------------*
           move      zero                 to   w-all-str-i01          .
           inspect   rr-pth-inp       tallying w-all-str-i01
                                     for all   """"                   .
           if        w-all-str-i01        >    zero
                     go to acc-ind-eml-100.
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     acc-ind-eml-600.
       acc-ind-eml-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-ind-eml-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-ind-eml-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-ind-eml-100.
       acc-ind-eml-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Oggetto                              *
      *    *-----------------------------------------------------------*
       acc-ogg-msg-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-ogg-msg-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "T"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      02                   to   v-ldt                  .
           move      08                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-ogg-msg           to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-ogg-msg-999.
       acc-ogg-msg-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-txt                to   rr-ogg-msg             .
       acc-ogg-msg-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se spaces : reimpostazione                  *
      *                  *---------------------------------------------*
           if        rr-ogg-msg           not  = spaces
                     go to acc-ogg-msg-600.
           if        v-key                not  = "UP  "
                     go to acc-ogg-msg-100
           else      go to acc-ogg-msg-600.
       acc-ogg-msg-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-ogg-msg-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-ogg-msg-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-ogg-msg-100.
       acc-ogg-msg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo : Testo                                *
      *    *-----------------------------------------------------------*
       acc-tst-msg-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-tst-msg-100.
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "T"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      10                   to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      10                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-tst-msg           to   v-txt                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-cnt-sts-imp-ric    not  = spaces
                     move  "DO  "         to   v-pfk (05)             .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-tst-msg-999.
       acc-tst-msg-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-txt                to   rr-tst-msg             .
       acc-tst-msg-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se spaces : reimpostazione                  *
      *                  *---------------------------------------------*
           if        rr-tst-msg           not  = spaces
                     go to acc-tst-msg-600.
           if        v-key                not  = "UP  "
                     go to acc-tst-msg-100
           else      go to acc-tst-msg-600.
       acc-tst-msg-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-tst-msg-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-tst-msg-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-tst-msg-100.
       acc-tst-msg-999.
           exit.

      *    *===========================================================*
      *    * Accettazione campo selezione : Pathname allegato          *
      *    *-----------------------------------------------------------*
       acc-pth-all-000.
      *              *-------------------------------------------------*
      *              * Pre-accettazione                                *
      *              *-------------------------------------------------*
       acc-pth-all-100.
      *              *-------------------------------------------------*
      *              * Note operative                                  *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           move      "L'allegato deve trovarsi nell'apposita cartella de
      -              "i 'pdf' utente."    to   v-not                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione valore                             *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           move      12                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      rr-pth-all           to   v-alf                  .
           perform   exe-acc-cmp-000      thru exe-acc-cmp-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione note operative                    *
      *              *-------------------------------------------------*
           move      "NT"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-cnt-acc-ric-sel
                     go to acc-pth-all-999.
       acc-pth-all-200.
      *              *-------------------------------------------------*
      *              * Valore impostato in campo di destinazione       *
      *              *-------------------------------------------------*
           move      v-alf                to   rr-pth-all             .
       acc-pth-all-300.
      *              *-------------------------------------------------*
      *              * Se Find                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        v-key                not  = "FIND"
                     go to acc-pth-all-400.
      *                  *---------------------------------------------*
      *                  * Find su PDF dell'utente                     *
      *                  *---------------------------------------------*
           perform   fnd-lst-pdf-000      thru fnd-lst-pdf-999        .
      *                      *-----------------------------------------*
      *                      * Test su esito lettura                   *
      *                      *-----------------------------------------*
           if        w-buf-pdf-fnd-flg    not  = spaces
                     go to acc-pth-all-100.
      *                  *---------------------------------------------*
      *                  * Ad accettazione                             *
      *                  *---------------------------------------------*
           go to     acc-pth-all-100.
       acc-pth-all-400.
      *              *-------------------------------------------------*
      *              * Controllo valore impostato                      *
      *              *-------------------------------------------------*
       acc-pth-all-600.
      *              *-------------------------------------------------*
      *              * Dipendenze dall'impostazione                    *
      *              *-------------------------------------------------*
       acc-pth-all-800.
      *              *-------------------------------------------------*
      *              * Se Do                                           *
      *              *-------------------------------------------------*
           if        v-key                =    "DO  "
                     perform tdo-ric-sel-000
                                          thru tdo-ric-sel-999
                     if      w-cnt-tdo-ric-flg
                                          =    spaces
                             move  "S"    to   w-cnt-acc-ric-sel
                             go to acc-pth-all-999
                     else    move  spaces to   w-cnt-tdo-ric-flg
                             go to acc-pth-all-100.
       acc-pth-all-999.
           exit.

      *    *===========================================================*
      *    * Controllo su tasto Do in parametri di selezione           *
      *    *-----------------------------------------------------------*
       tdo-ric-sel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-100.
      *              *-------------------------------------------------*
      *              * Controllo su pathanme in input                  *
      *              *-------------------------------------------------*
           if        rr-pth-inp           not  = spaces
                     go to tdo-ric-sel-200.
           move      "Manca il nome dell'archivio da trattare !       "
                                          to   w-err-box-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-200.
      *              *-------------------------------------------------*
      *              * Controllo su oggetto                            *
      *              *-------------------------------------------------*
           if        rr-ogg-msg           not  = spaces
                     go to tdo-ric-sel-300.
           move      "Manca l'oggetto del messaggio !                 "
                                          to   w-err-box-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-300.
      *              *-------------------------------------------------*
      *              * Controllo su testo                              *
      *              *-------------------------------------------------*
           if        rr-tst-msg           not  = spaces
                     go to tdo-ric-sel-800.
           move      "Manca il testo del messaggio !                  "
                                          to   w-err-box-err-msg      .
           go to     tdo-ric-sel-900.
       tdo-ric-sel-800.
      *              *-------------------------------------------------*
      *              * Uscita per controlli superati                   *
      *              *-------------------------------------------------*
           go to     tdo-ric-sel-999.
       tdo-ric-sel-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione messaggio di errore         *
      *                  *---------------------------------------------*
           perform   box-msg-err-000      thru box-msg-err-999        .
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-tdo-ric-flg      .
       tdo-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Regolarizzazione dei parametri di selezione               *
      *    *-----------------------------------------------------------*
       reg-ric-sel-000.
       reg-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Normalizzazione richieste di selezione                    *
      *    *-----------------------------------------------------------*
       nor-ric-sel-000.
           move      spaces               to   rr-pth-inp             .
           move      spaces               to   rr-ogg-msg             .
           move      spaces               to   rr-tst-msg             .
           move      spaces               to   rr-pth-all             .
       nor-ric-sel-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione routine di esportazione                        *
      *    *-----------------------------------------------------------*
       exe-exp-fil-000.
      *              *-------------------------------------------------*
      *              * Preparazione pathname di base files sequenziali *
      *              *-------------------------------------------------*
           perform   pre-bas-pth-000      thru pre-bas-pth-999        .
      *              *-------------------------------------------------*
      *              * Bufferizzazione del testo                       *
      *              *-------------------------------------------------*
           perform   buf-tst-msg-000      thru buf-tst-msg-999        .
      *              *-------------------------------------------------*
      *              * Prompt per Esecuzione comando                   *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Spedizione messaggio in corso ..."
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Esecuzione comando                              *
      *              *-------------------------------------------------*
           perform   exe-snd-eml-000      thru exe-snd-eml-999        .
      *              *-------------------------------------------------*
      *              * Prompt per Esecuzione comando                   *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "Spedizione messaggio effettuata  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Attesa di 1 secondo                             *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/mwait0"                         .
       exe-exp-fil-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-exp-fil-999.
       exe-exp-fil-999.
           exit.

      *    *===========================================================*
      *    * Emissione vera e propria                                  *
      *    *-----------------------------------------------------------*
       exe-snd-eml-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Comando di spedizione                           *
      *              *                                                 *
      *              *   - Comando                                     *
      *              *                                                 *
      *              *   - Utente Tangram                              *
      *              *   - Server di posta                             *
      *              *   - Mittente                                    *
      *              *                                                 *
      *              *   - File contenente indirizzi o indirizzo       *
      *              *   - File messaggio o oggetto                    *
      *              *   - File attachement                            *
      *              *   - Nome attachement                            *
      *              *                                                 *
      *              *   - Soggetto manuale                            *
      *              *   - Si/no ricevuta                              *
      *              *                                                 *
      *              *   - Account  (Autenticazione opzionale)         *
      *              *   - Password (Autenticazione opzionale)         *
      *              *-------------------------------------------------*
           move      spaces               to   o-shs                  .
      *
           string    f-xxx-cmd  delimited by   spaces
                     " "        delimited by   size
                     f-xxx-ute  delimited by   spaces
                     ","        delimited by   size
                     f-xxx-msa  delimited by   spaces
                     ","        delimited by   size
                     f-xxx-psm  delimited by   spaces
                     ","        delimited by   size
      *
                     rr-pth-inp delimited by   spaces
                     ","        delimited by   size
                     f-xxx-msg  delimited by   spaces
                     ","        delimited by   size
                     f-xxx-pdf  delimited by   spaces
                     rr-pth-all delimited by   spaces
                     ","        delimited by   size
                     rr-pth-all delimited by   spaces
                     ","        delimited by   size
      *
                     ","        delimited by   size
                     f-xxx-snr  delimited by   spaces
                     ","        delimited by   size
      *
                     f-xxx-uid  delimited by   spaces
                     ","        delimited by   size
                     f-xxx-pwd  delimited by   spaces
                     ","        delimited by   size
                                          into o-shs                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo 'mopsys'                    *
      *              *-------------------------------------------------*
           move      "SH"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *              *-------------------------------------------------*
      *              * Erase video                                     *
      *              *-------------------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-snd-eml-999.
           exit.

      *    *===========================================================*
      *    * Preparazione pathname di base files sequenziali           *
      *    *-----------------------------------------------------------*
       pre-bas-pth-000.
      *              *-------------------------------------------------*
      *              * Pathname di base da segreteria                  *
      *              *-------------------------------------------------*
           move      "PB"                 to   s-ope                  .
           move      "asc "               to   s-nam                  .
           call      "swd/mod/prg/obj/msegrt"
                                          using s                     .
      *              *-------------------------------------------------*
      *              * String                                          *
      *              *-------------------------------------------------*
           move      s-pat                to   f-xxx-ppb              .
       pre-bas-pth-999.
           exit.

      *    *===========================================================*
      *    * Routine di Bufferizzazione del testo della circolare      *
      *    *-----------------------------------------------------------*
       buf-tst-msg-000.
      *              *-------------------------------------------------*
      *              * Apertura file testo                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione pathname                       *
      *                  *---------------------------------------------*
           move      spaces               to   f-xxx-ppp              .
           string    f-xxx-ppb  delimited by   spaces
                     "/"        delimited by   size
                     f-xxx-ute  delimited by   spaces
                     "/tmp/"    delimited by   size
                     f-xxx-msg  delimited by   spaces
                                          into f-xxx-ppp              .
      *                  *---------------------------------------------*
      *                  * Cancellazione testo precedente              *
      *                  *---------------------------------------------*
           move      "PD"                 to   s-ope                  .
           move      f-xxx-ppp            to   s-pat                  .
           move      "K"                  to   s-sts                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Apertura del file in output                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      f-xxx-ppp            to   g-pat                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       buf-tst-msg-100.
      *              *-------------------------------------------------*
      *              * Normalizzazione contatore di comodo             *
      *              *-------------------------------------------------*
           move      zero                 to   w-gen-ctr-001          .
       buf-tst-msg-200.
      *              *-------------------------------------------------*
      *              * Incremento contatore di comodo                  *
      *              *-------------------------------------------------*
           add       1                    to   w-gen-ctr-001          .
           if        w-gen-ctr-001        >    10
                     go to buf-tst-msg-900.
       buf-tst-msg-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
       buf-tst-msg-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
       buf-tst-msg-600.
      *              *-------------------------------------------------*
      *              * Scrittura riga                                  *
      *              *-------------------------------------------------*
           move      rr-tst-rig
                    (w-gen-ctr-001)       to   g-rec                  .
      *              *-------------------------------------------------*
      *              * Scrittura su sequenziale                        *
      *              *-------------------------------------------------*
           move      "PN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       buf-tst-msg-800.
      *              *-------------------------------------------------*
      *              * Riciclo a riga successiva                       *
      *              *-------------------------------------------------*
           go to     buf-tst-msg-200.
       buf-tst-msg-900.
      *              *-------------------------------------------------*
      *              * Chiusura del file in output                     *
      *              *-------------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       buf-tst-msg-920.
      *              *-------------------------------------------------*
      *              * Apertura file soggetto                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione pathname                       *
      *                  *---------------------------------------------*
           move      spaces               to   f-xxx-ppp              .
           string    f-xxx-ppb  delimited by   spaces
                     "/"        delimited by   size
                     f-xxx-ute  delimited by   spaces
                     "/tmp/"    delimited by   size
                     f-xxx-sgt  delimited by   spaces
                                          into f-xxx-ppp              .
      *                  *---------------------------------------------*
      *                  * Cancellazione testo precedente              *
      *                  *---------------------------------------------*
           move      "PD"                 to   s-ope                  .
           move      f-xxx-ppp            to   s-pat                  .
           move      "K"                  to   s-sts                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Apertura del file in output                 *
      *                  *---------------------------------------------*
           move      "OO"                 to   g-ope                  .
           move      "seq "               to   g-nam                  .
           move      f-xxx-ppp            to   g-pat                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       buf-tst-msg-940.
      *              *-------------------------------------------------*
      *              * Scrittura riga                                  *
      *              *-------------------------------------------------*
           move      rr-ogg-msg           to   g-rec                  .
      *              *-------------------------------------------------*
      *              * Scrittura su sequenziale                        *
      *              *-------------------------------------------------*
           move      "PN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       buf-tst-msg-980.
      *              *-------------------------------------------------*
      *              * Chiusura del file in output                     *
      *              *-------------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvout"
                                         using g                      .
       buf-tst-msg-990.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     buf-tst-msg-999.
       buf-tst-msg-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore                               *
      *    *-----------------------------------------------------------*
       box-msg-err-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-err-999.
           exit.

      *    *===========================================================*
      *    * Box per messaggio di errore esteso, su due righe          *
      *    *-----------------------------------------------------------*
       box-msg-e02-000.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      11                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      15                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 01                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-msg    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 02                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      w-err-box-err-m02    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       box-msg-e02-999.
           exit.

      *    *===========================================================*
      *    * Find su lista PDF dell-utente                             *
      *    *-----------------------------------------------------------*
       fnd-lst-pdf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-buf-pdf-fnd-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazioni iniziali                        *
      *              *-------------------------------------------------*
           move      zero                 to   w-buf-pdf-fnd-crb      .
       fnd-lst-pdf-100.
      *              *-------------------------------------------------*
      *              * Apertura del file temporaneo                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Open                                        *
      *                  *---------------------------------------------*
           move      "OI"                 to   g-ope                  .
           move      "pdf "               to   g-nam                  .
           move      f-xxx-ppb            to   g-pat                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se errore : uscita con flag di errore       *
      *                  *---------------------------------------------*
           if        g-sts                =    e-not-err
                     go to fnd-lst-pdf-200.
      *                  *---------------------------------------------*
      *                  * Chiusura del file in input                  *
      *                  *---------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo utilizzato             *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mcvinp"                         .
      *                  *---------------------------------------------*
      *                  * Flag di uscita                              *
      *                  *---------------------------------------------*
           move      "N"                  to   w-buf-pdf-fnd-flg      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     fnd-lst-pdf-999.
       fnd-lst-pdf-200.
      *              *-------------------------------------------------*
      *              * Read file sequenziale                           *
      *              *-------------------------------------------------*
           move      "GN"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *                  *---------------------------------------------*
      *                  * Se fine file : uscita con flag              *
      *                  *---------------------------------------------*
           if        g-sts                not  = e-not-err
                     go to fnd-lst-pdf-500.
       fnd-lst-pdf-300.
      *              *-------------------------------------------------*
      *              * Incremento numero records nel buffer            *
      *              *-------------------------------------------------*
           add       1                    to   w-buf-pdf-fnd-crb      .
      *              *-------------------------------------------------*
      *              * Test se buffer oltre il numero previsto         *
      *              *-------------------------------------------------*
           if        w-buf-pdf-fnd-crb    >    w-buf-pdf-fnd-max
                     move  w-buf-pdf-fnd-max
                                          to   w-buf-pdf-fnd-crb
                     go to fnd-lst-pdf-500.
       fnd-lst-pdf-400.
      *              *-------------------------------------------------*
      *              * Bufferizzazione                                 *
      *              *-------------------------------------------------*
           move      g-rec                to   w-buf-pdf-fnd-pdf
                                              (w-buf-pdf-fnd-crb)     .
       fnd-lst-pdf-420.
      *              *-------------------------------------------------*
      *              * A riciclo                                       *
      *              *-------------------------------------------------*
           go to     fnd-lst-pdf-200.
       fnd-lst-pdf-500.
      *              *-------------------------------------------------*
      *              * Operazioni di controllo                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Controllo numero records letti con lo stes- *
      *                  * so valore                                   *
      *                  *---------------------------------------------*
           if        w-buf-pdf-fnd-crb    =    zero
                     go to fnd-lst-pdf-999.
      *                      *-----------------------------------------*
      *                      * Determinazione numero pagine nel buffer *
      *                      *-----------------------------------------*
           move      w-buf-pdf-fnd-crb    to   w-buf-pdf-fnd-cpb      .
           subtract  1                    from w-buf-pdf-fnd-cpb      .
           divide    6                    into w-buf-pdf-fnd-cpb      .
           add       1                    to   w-buf-pdf-fnd-cpb      .
      *                      *-----------------------------------------*
      *                      * Inizializzazione numero record nel buf- *
      *                      * fer attualmente trattato                *
      *                      *-----------------------------------------*
           move      1                    to   w-buf-pdf-fnd-c01      .
      *                      *-----------------------------------------*
      *                      * Salvataggio immagine video              *
      *                      *-----------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Video in Off                            *
      *                      *-----------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione box vuoto               *
      *                      *-----------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      15                   to   v-lto                  .
           move      72                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Fincatura                               *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      11                   to   v-pos                  .
           move      "                  STAMPE 'PDF' DISPONIBILI        
      -              "          "         to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura fincatura                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      11                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura di chiusura              *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      11                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione pagina video contenente *
      *                      * il record attualmente trattato          *
      *                      *-----------------------------------------*
           perform   fnd-lst-pdf-950      thru fnd-lst-pdf-959        .
      *                      *-----------------------------------------*
      *                      * Video in On                             *
      *                      *-----------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       fnd-lst-pdf-550.
      *                      *-----------------------------------------*
      *                      * Determinazione numero linea a video     *
      *                      *-----------------------------------------*
           move      w-buf-pdf-fnd-c01    to   w-buf-pdf-fnd-nli      .
       fnd-lst-pdf-555.
           if        w-buf-pdf-fnd-nli    >    6
                     subtract  6          from w-buf-pdf-fnd-nli
                     go to fnd-lst-pdf-555.
      *                          *-------------------------------------*
      *                          * Incremento numero linea a video     *
      *                          * per posizionamento verticale        *
      *                          *-------------------------------------*
           add       06                   to   w-buf-pdf-fnd-nli      .
       fnd-lst-pdf-560.
      *                      *-----------------------------------------*
      *                      * Espansione record attualmente trattato  *
      *                      *-----------------------------------------*
       fnd-lst-pdf-575.
      *                      *-----------------------------------------*
      *                      * Accettazione del mark-point             *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      spaces               to   v-ufk                  .
           if        w-buf-pdf-fnd-c01    >    1
                     move  "UP  "         to   v-pfk (01)             .
           if        w-buf-pdf-fnd-c01    <    w-buf-pdf-fnd-crb
                     move  "DOWN"         to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           if        w-buf-pdf-fnd-cpa    >    1
                     move  "PRSC"         to   v-pfk (07)             .
           if        w-buf-pdf-fnd-cpa    <    w-buf-pdf-fnd-cpb
                     move  "NXSC"         to   v-pfk (08)             .
           move      "SLCT"               to   v-pfk (10)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-buf-pdf-fnd-nli    to   v-lin                  .
           move      11                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       fnd-lst-pdf-580.
           if        v-key                =    spaces or
                     v-key                =    "DO  " or
                     v-key                =    "SLCT"
                     go to fnd-lst-pdf-582
           else if   v-key                =    "UP  "
                     go to fnd-lst-pdf-584
           else if   v-key                =    "DOWN"
                     go to fnd-lst-pdf-586
           else if   v-key                =    "EXIT"
                     go to fnd-lst-pdf-598
           else if   v-key                =    "NXSC"
                     go to fnd-lst-pdf-592
           else if   v-key                =    "PRSC"
                     go to fnd-lst-pdf-594
           else      go to fnd-lst-pdf-575.
       fnd-lst-pdf-582.
      *              *-------------------------------------------------*
      *              * Se spaces, Do o select                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Restore video                               *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Memorizzazione valori selezionati           *
      *                  *---------------------------------------------*
           move      w-buf-pdf-fnd-pdf
                    (w-buf-pdf-fnd-c01)
                    (01 : 40)             to   rr-pth-all             .
      *                  *---------------------------------------------*
      *                  * Preparazione flag di uscita                 *
      *                  *---------------------------------------------*
           move      spaces               to   w-buf-pdf-fnd-flg      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     fnd-lst-pdf-999.
       fnd-lst-pdf-584.
      *              *-------------------------------------------------*
      *              * Se Up                                           *
      *              *-------------------------------------------------*
           subtract  1                    from w-buf-pdf-fnd-c01      .
           if        w-buf-pdf-fnd-nli    =    07
                     go to fnd-lst-pdf-590
           else      go to fnd-lst-pdf-550.
       fnd-lst-pdf-586.
      *              *-------------------------------------------------*
      *              * Se Down                                         *
      *              *-------------------------------------------------*
           if        w-buf-pdf-fnd-c01    <    w-buf-pdf-fnd-crb
                     add   1              to   w-buf-pdf-fnd-c01
                     go to fnd-lst-pdf-588
           else      go to fnd-lst-pdf-575.
       fnd-lst-pdf-588.
           if        w-buf-pdf-fnd-nli    =    12
                     go to fnd-lst-pdf-590
           else      go to fnd-lst-pdf-550.
       fnd-lst-pdf-590.
           perform   fnd-lst-pdf-950      thru fnd-lst-pdf-959        .
           go to     fnd-lst-pdf-550.
       fnd-lst-pdf-592.
      *              *-------------------------------------------------*
      *              * Se Next screen                                  *
      *              *-------------------------------------------------*
           add       1                    to   w-buf-pdf-fnd-cpa      .
           go to     fnd-lst-pdf-596.
       fnd-lst-pdf-594.
      *              *-------------------------------------------------*
      *              * Se Previous screen                              *
      *              *-------------------------------------------------*
           subtract  1                    from w-buf-pdf-fnd-cpa      .
       fnd-lst-pdf-596.
           move      w-buf-pdf-fnd-cpa    to   w-buf-pdf-fnd-c01      .
           multiply  6                    by   w-buf-pdf-fnd-c01      .
           subtract  5                    from w-buf-pdf-fnd-c01      .
           go to     fnd-lst-pdf-590.
       fnd-lst-pdf-598.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di selezione                           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-buf-pdf-fnd-fds      .
      *                  *---------------------------------------------*
      *                  * Restore video                               *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       fnd-lst-pdf-800.
      *              *-------------------------------------------------*
      *              * Chiusura del file in input                      *
      *              *-------------------------------------------------*
           move      "CL"                 to   g-ope                  .
           call      "swd/mod/prg/obj/mcvinp"
                                         using g                      .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo utilizzato                 *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mcvinp"                         .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     fnd-lst-pdf-999.
       fnd-lst-pdf-950.
      *              *=================================================*
      *              * Visualizzazione pagina video contenente il re-  *
      *              * cord attualmente trattato                       *
      *              *-------------------------------------------------*
           move      w-buf-pdf-fnd-c01    to   w-buf-pdf-fnd-c02      .
           add       5                    to   w-buf-pdf-fnd-c02      .
           divide    6                    into w-buf-pdf-fnd-c02      .
           move      w-buf-pdf-fnd-c02    to   w-buf-pdf-fnd-cpa      .
           subtract  1                    from w-buf-pdf-fnd-c02      .
           multiply  6                    by   w-buf-pdf-fnd-c02      .
           add       1                    to   w-buf-pdf-fnd-c02      .
           add       5
                     w-buf-pdf-fnd-c02  giving w-buf-pdf-fnd-c03      .
           move      w-buf-pdf-fnd-c03    to   w-buf-pdf-fnd-c04      .
           if        w-buf-pdf-fnd-c03    >    w-buf-pdf-fnd-crb
                     move  w-buf-pdf-fnd-crb
                                          to   w-buf-pdf-fnd-c03      .
           move      07                   to   w-buf-pdf-fnd-c05      .
       fnd-lst-pdf-951.
      *                  *---------------------------------------------*
      *                  * File PDF                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      w-buf-pdf-fnd-c05    to   v-lin                  .
           move      11                   to   v-pos                  .
           move      w-buf-pdf-fnd-pdf
                    (w-buf-pdf-fnd-c02)   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Incremento contatori                        *
      *                  *---------------------------------------------*
           add       1                    to   w-buf-pdf-fnd-c02      .
           add       1                    to   w-buf-pdf-fnd-c05      .
           if        w-buf-pdf-fnd-c02    not  > w-buf-pdf-fnd-c03
                     go to fnd-lst-pdf-951.
       fnd-lst-pdf-952.
           if        w-buf-pdf-fnd-c02    >    w-buf-pdf-fnd-c04
                     go to fnd-lst-pdf-955.
           if        w-buf-pdf-fnd-crb    not  > 6
                     go to fnd-lst-pdf-955.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      w-buf-pdf-fnd-c05    to   v-lin                  .
           move      11                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           add       1                    to   w-buf-pdf-fnd-c02      .
           add       1                    to   w-buf-pdf-fnd-c05      .
           go to     fnd-lst-pdf-952.
       fnd-lst-pdf-955.
      *                  *---------------------------------------------*
      *                  * Literal 'pagina'                            *
      *                  *---------------------------------------------*
           move      w-buf-pdf-fnd-cpa    to   w-buf-pdf-fnd-lt1      .
           move      w-buf-pdf-fnd-cpb    to   w-buf-pdf-fnd-lt2      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      33                   to   v-pos                  .
           move      w-buf-pdf-fnd-ltp    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       fnd-lst-pdf-959.
           exit.
       fnd-lst-pdf-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per l'accettazione indirizzo e-mail           *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/aindeml0.acs"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

