       Identification Division.
       Program-Id.                                 pxpg0003           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    swd                 *
      *                        Area gestionale:    xpg                 *
      *                                Settore:                        *
      *                                   Fase:                        *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 01/01/01    *
      *                       Ultima revisione:    NdK del 01/04/25    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Gestione menu'                              *
      *                                                                *
      * ============================================================== *
      *                                                                *
      * A LINEA 5315 EVENTUALE VIRUS DA ABBINARE A MODULO 'msegrt'     *
      *                                                                *
      * ============================================================== *
      *                                                                *
      * Funzioni speciali richiamabili da menu'                        *
      * ---------------------------------------                        *
      *                                                                *
      * - .a : Cambio azienda                       [F4]               *
      * - .b : Blocco stampante                                        *
      * - .c : Calendario                                     pxpg0014 *
      * - .d : Cambio dipendenza                                       *
      * - .e : E-mail (DA PERFEZIONARE)                       pxpg0018 *
      *                                                                *
      * - .i : Informazioni sessione                                   *
      * - .l : Blocco provvisorio video                                *
      * - .m : Messaggi tra utenti                  [F2]      pxpg0015 *
      * - .n : Note e promemoria utente                       pxpg0013 *
      *                                                                *
      * - .o : Ora legale - solare                            pxpg1300 *
      * - .p : Stampe su disco                      [PRINT]   pxpg0006 *
      *                                                                *
      * - .r : Programmi recenti                    [SELECT]           *
      * - .s : Salvataggi                                              *
      * - .t : Rubrica telefonica      (moduli specifici)              *
      * - .tc                          Clienti      [F1]      pxpg001c *
      * - .tf                          Fornitori              pxpg001f *
      * - .tv                          Vettori                pxpg001v *
      * - .ta                          Agenti                 pxpg001a *
      * - .tb                          Banche                 pxpg001b *
      *                                                                *
      * - .u : Cambio utente                        [F3]               *
      *                                                                *
      * - .w : Cambio password utente                         pxpg2200 *
      *                                                                *
      * - .0 : Calcolatrice                                   pxpg0016 *
      *                                                                *
      * - .iban : Controllo IBAN                              pxpg0019 *
      *                                                                *
      * ============================================================== *
      *                                                                *
      * Funzioni speciali richiamabili da menu' (Supervisore)          *
      * ---------------------------------------                        *
      *                                                                *
      * - .k : Sequenzializzazione files                               *
      * - .x : Esecuzione programma da pathname                        *
      * - .y : Esecuzione di shell script                              *
      * - .z : Codici di errore di I-O                                 *
      *                                                                *
      * ============================================================== *
      *                                                                *
      * Funzioni speciali, obsolete                                    *
      * ---------------------------                                    *
      *                                                                *
      * - .q : Disimpegno stampante                                    *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [auc]                                        *
      *    *-----------------------------------------------------------*
           select  optional  auc   assign to disk         f-auc-pat
                             organization is indexed
                             access mode  is dynamic
                             record key   is auc-key
                             file status  is f-auc-sts                .

      *    *===========================================================*
      *    * File Control [pss]                                        *
      *    *-----------------------------------------------------------*
           select  optional  pss   assign to disk       f-pss-pat
                             organization is indexed
                             access mode  is dynamic
                             record key   is pss-key
                             file status  is            f-pss-sts     .
       
      *    *===========================================================*
      *    * File Control [pfc]                                        *
      *    *-----------------------------------------------------------*
           select  optional  pfc   assign to disk           f-pfc-pat
                             organization is indexed
                             access mode  is dynamic
                             record key   is pfc-k01
                   alternate record key   is pfc-k02
                   alternate record key   is pfc-k03
                   alternate record key   is pfc-k04
                   alternate record key   is pfc-k05
                             with   duplicates
                             file status  is                f-pfc-sts .
       
      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [auc]                                    *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/fls/rec/rfauc"                          .

      *    *===========================================================*
      *    * File Description [pss]                                    *
      *    *-----------------------------------------------------------*
       fd  pss       label record standard                            .
       01  pss-rec.
           05  pss-key.
               10  pss-tre                pic  x(04)                  .
               10  pss-kre                pic  x(40)                  .
           05  pss-dat.
               10  pss-chr.
                   15  filler      occurs 1536
                                          pic  x(01)                  .

      *    *===========================================================*
      *    * File Description [pfc]                                    *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/fls/rec/rfpfc"                          .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area ausiliaria per controllo i-o su [auc]                *
      *    *-----------------------------------------------------------*
       01  f-auc.
      *        *-------------------------------------------------------*
      *        * File name                                             *
      *        *-------------------------------------------------------*
           05  f-auc-nam                  pic  x(04) value "auc "     .
      *        *-------------------------------------------------------*
      *        * File pathname                                         *
      *        *-------------------------------------------------------*
           05  f-auc-pat                  pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * File status                                           *
      *        *-------------------------------------------------------*
           05  f-auc-sts                  pic  x(02)                  .

      *    *===========================================================*
      *    * Area ausiliaria per controllo i-o su [pss]                *
      *    *-----------------------------------------------------------*
       01  f-pss.
      *        *-------------------------------------------------------*
      *        * File name                                             *
      *        *-------------------------------------------------------*
           05  f-pss-nam                  pic  x(04) value "pss "     .
      *        *-------------------------------------------------------*
      *        * File pathname                                         *
      *        *-------------------------------------------------------*
           05  f-pss-pat                  pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * File status                                           *
      *        *-------------------------------------------------------*
           05  f-pss-sts                  pic  x(02)                  .

      *    *===========================================================*
      *    * Area ausiliaria per controllo i-o su [pfc]                *
      *    *-----------------------------------------------------------*
       01  f-pfc.
      *        *-------------------------------------------------------*
      *        * File name                                             *
      *        *-------------------------------------------------------*
           05  f-pfc-nam                  pic  x(04) value "pfc "     .
      *        *-------------------------------------------------------*
      *        * File pathname                                         *
      *        *-------------------------------------------------------*
           05  f-pfc-pat                  pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * File status                                           *
      *        *-------------------------------------------------------*
           05  f-pfc-sts                  pic  x(02)                  .

      *    *===========================================================*
      *    * Area di definizione del pacchetto applicativo e delle ca- *
      *    * ratteristiche della release                               *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/a"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mopsys"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/o"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mvideo"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/v"                                  .
       
      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Work per records di [auc] 'azi'                           *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/prg/cpy/waucazi0.cpw"                   .

      *    *===========================================================*
      *    * Work per records di [auc] 'ute'                           *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/prg/cpy/waucute0.cpw"                   .

      *    *===========================================================*
      *    * Work per records di [auc] 'cmd'                           *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/prg/cpy/wauccmd0.cpw"                   .

      *    *===========================================================*
      *    * Work per records di [auc] 'mnu'                           *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/prg/cpy/waucmnu0.cpw"                   .

      *    *===========================================================*
      *    * Work per records di [auc] 'psg'                           *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/prg/cpy/waucpsg0.cpw"                   .

      *    *===========================================================*
      *    * Work per records di [auc] 'fcs'                           *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/prg/cpy/waucfcs0.cpw"                   .

      *    *===========================================================*
      *    * Work per records di [pss] 'tst'                           *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/prg/cpy/wpsstst0.cpw"                   .

      *    *===========================================================*
      *    * Work per records di [pss] 'mod'                           *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/prg/cpy/wpssmod0.cpw"                   .

      *    *===========================================================*
      *    * Work per records di [pss] 'stp'                           *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/prg/cpy/wpssstp0.cpw"                   .

      *    *===========================================================*
      *    * Work per records di [pss] 'imp'                           *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/prg/cpy/wpssimp0.cpw"                   .

      *    *===========================================================*
      *    * Work-area per trattamento esecuzione desk-accessory       *
      *    *-----------------------------------------------------------*
       01  w-exe-dac.
      *        *-------------------------------------------------------*
      *        * Si/No in esecuzione di desk-accessory                 *
      *        *  - N : No                                             *
      *        *  - S : Si                                             *
      *        *-------------------------------------------------------*
           05  w-exe-dac-snx-dac          pic  x(01) value "N"        .
      *        *-------------------------------------------------------*
      *        * Tipo di desk-accessory                                *
      *        *  - Spaces : Non significativo                         *
      *        *  - "HELP" : Desk-accessori di tipo Help               *
      *        *  - "SHCP" : Desk-accessori di tipo Screen-Hard-Copy   *
      *        *-------------------------------------------------------*
           05  w-exe-dac-tip-dac          pic  x(04) value spaces     .
      *        *-------------------------------------------------------*
      *        * Si/No in impostazione ridotta per desk-accessory      *
      *        *  - N : No                                             *
      *        *  - S : Si                                             *
      *        *-------------------------------------------------------*
           05  w-exe-dac-snx-ird          pic  x(01) value "N"        .

      *    *===========================================================*
      *    * Work-area per livello di profondita' applicativa          *
      *    *-----------------------------------------------------------*
       01  w-liv-prf.
      *        *-------------------------------------------------------*
      *        * Livello di profondita' applicativa                    *
      *        *-------------------------------------------------------*
           05  w-liv-prf-liv              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Numero di moduli di i-o ancora in essere              *
      *        *-------------------------------------------------------*
           05  w-liv-prf-nma              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Filenames corrispondenti ai moduli di i-o ancora in   *
      *        * essere                                                *
      *        *-------------------------------------------------------*
           05  w-liv-prf-fna.
               10  w-liv-prf-fne occurs 10.
                   15  w-liv-prf-fnn      pic  x(04)                  .
                   15  filler             pic  x(01)                  .
                   15  w-liv-prf-fnc      pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-liv-prf-c01              pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per determinazione backgrounds in esecuzione    *
      *    *-----------------------------------------------------------*
       01  w-snx-bkg.
      *        *-------------------------------------------------------*
      *        * Si/No bakground attualmente in esecuzione             *
      *        * - S : Si                                              *
      *        * - N : No                                              *
      *        *-------------------------------------------------------*
           05  w-snx-bkg-snx              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Nome programma background in esecuzione               *
      *        *-------------------------------------------------------*
           05  w-snx-bkg-pro              pic  x(10)                  .
      *        *-------------------------------------------------------*
      *        * Descrizione programma background in esecuzione        *
      *        *-------------------------------------------------------*
           05  w-snx-bkg-des              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Program-start-time del background in esecuzione       *
      *        *-------------------------------------------------------*
           05  w-snx-bkg-pst              pic  9(15)                  .
           05  w-snx-bkg-r01 redefines
               w-snx-bkg-pst.
               10  w-snx-bkg-dat          pic  9(07)                  .
               10  w-snx-bkg-tim          pic  9(08)                  .
      *        *-------------------------------------------------------*
      *        * Status del background in esecuzione                   *
      *        * - N : Non ci sono backgrounds in esecuzione           *
      *        * - S : Ci sono backgrounds in esecuzione ma non ancora *
      *        *       terminati                                       *
      *        * - T : Ci sono backgrounds in esecuzione terminati     *
      *        *-------------------------------------------------------*
           05  w-snx-bkg-sts              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Puntatore di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-snx-bkg-pnt              pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per descrizione azienda in uso                  *
      *    *-----------------------------------------------------------*
       01  w-des-azi.
      *        *-------------------------------------------------------*
      *        * Codice azienda attualmente in uso                     *
      *        *-------------------------------------------------------*
           05  w-des-azi-cod              pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Descrizione azienda allineata al centro               *
      *        *-------------------------------------------------------*
           05  w-des-azi-adx              pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per utente attuale                              *
      *    *-----------------------------------------------------------*
       01  w-uta.
      *        *-------------------------------------------------------*
      *        * Codice utente                                         *
      *        *-------------------------------------------------------*
           05  w-uta-cod-ute              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Descrizione utente                                    *
      *        *-------------------------------------------------------*
           05  w-uta-des-ute              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Tipo di utente                                        *
      *        *-------------------------------------------------------*
           05  w-uta-tip-ute              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Password per l' utente                                *
      *        *-------------------------------------------------------*
           05  w-uta-pwd-ute              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Livello di protezione massimo per l'utente            *
      *        *-------------------------------------------------------*
           05  w-uta-liv-pro              pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Status utente                                         *
      *        *-------------------------------------------------------*
           05  w-uta-sts-ute              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Menu' iniziale per l'utente                           *
      *        *-------------------------------------------------------*
           05  w-uta-mnu-ini              pic  x(06)                  .
      *        *-------------------------------------------------------*
      *        * Numero aziende su cui l'utente puo' operare           *
      *        *-------------------------------------------------------*
           05  w-uta-num-azi              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Elenco aziende su cui l'utente puo' operare           *
      *        *-------------------------------------------------------*
           05  w-uta-tbl-azi.
               10  w-uta-ele-azi occurs 20.
                   15  w-uta-cod-azi  pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Numero parametri di abilitazione per l'utente         *
      *        *-------------------------------------------------------*
           05  w-uta-num-abl              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Elenco parametri di abilitazione per l'utente         *
      *        *-------------------------------------------------------*
           05  w-uta-tbl-abl.
               10  w-uta-ele-abl occurs 50.
                   15  w-uta-tip-abl      pic  x(01)                  .
                   15  w-uta-tel-abl      pic  x(01)                  .
                   15  w-uta-cod-abl      pic  x(06)                  .
      *            *---------------------------------------------------*
      *            * Si/No background per l'utente                     *
      *            * - N : No, mai                                     *
      *            * - S : Si, se possibile                            *
      *            *---------------------------------------------------*
               10  w-uta-bkg-ute          pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per comando relativo a menu'                    *
      *    *-----------------------------------------------------------*
       01  w-cor-ame.
      *        *-------------------------------------------------------*
      *        * Status di lettura                                     *
      *        * - Spaces : record trovato                             *
      *        * - #      : record non trovato                         *
      *        *-------------------------------------------------------*
           05  w-cor-ame-exs              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Codice comando relativo a menu'                       *
      *        *-------------------------------------------------------*
           05  w-cor-ame-cod              pic  x(06)                  .
      *        *-------------------------------------------------------*
      *        * Tipo comando                                          *
      *        * - 00 : Task                                           *
      *        * - 01 : Menu'                                          *
      *        * - 03 : Procedura                                      *
      *        *-------------------------------------------------------*
           05  w-cor-ame-tip              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Pathname per l'esecuzione                             *
      *        *-------------------------------------------------------*
           05  w-cor-ame-pth              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  w-cor-ame-sap              pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  w-cor-ame-arg              pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  w-cor-ame-set              pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  w-cor-ame-fas              pic  x(06)                  .
      *        *-------------------------------------------------------*
      *        * Programma gestionale                                  *
      *        *-------------------------------------------------------*
           05  w-cor-ame-pro              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Menu' di rientro                                      *
      *        *-------------------------------------------------------*
           05  w-cor-ame-mdr              pic  x(06)                  .
      *        *-------------------------------------------------------*
      *        * Password per il comando                               *
      *        *-------------------------------------------------------*
           05  w-cor-ame-pwd              pic  x(06)                  .
      *        *-------------------------------------------------------*
      *        * Tipo di utente che puo' operare il comando            *
      *        * - 00 : Normale - Privilegiato - Supervisore           *
      *        * - 01 : Privilegiato - Supervisore                     *
      *        * - 02 : Supervisore                                    *
      *        *-------------------------------------------------------*
           05  w-cor-ame-tut              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Livello di protezione del comando                     *
      *        *-------------------------------------------------------*
           05  w-cor-ame-lip              pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Status comando                                        *
      *        * - 00 : Puo' operare                                   *
      *        * - 01 : Bloccato                                       *
      *        *-------------------------------------------------------*
           05  w-cor-ame-sts              pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per lettura codice utente                       *
      *    *-----------------------------------------------------------*
       01  w-let-ute.
      *        *-------------------------------------------------------*
      *        * Codice utente                                         *
      *        *-------------------------------------------------------*
           05  w-let-ute-cod              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Status di uscita                                      *
      *        * - Spaces : utente esistente                           *
      *        * - #      : utente non esistente                       *
      *        *-------------------------------------------------------*
           05  w-let-ute-exs              pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per lettura menu'                               *
      *    *-----------------------------------------------------------*
       01  w-let-mnu.
      *        *-------------------------------------------------------*
      *        * Codice menu'                                          *
      *        *-------------------------------------------------------*
           05  w-let-mnu-mnu              pic  x(06)                  .
      *        *-------------------------------------------------------*
      *        * Numero pagina da visualizzare                         *
      *        *-------------------------------------------------------*
           05  w-let-mnu-npm              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Status di uscita da lettura                           *
      *        * - Spaces : pagina di menu' esistente                  *
      *        * - #      : pagina di menu' non esistente              *
      *        *-------------------------------------------------------*
           05  w-let-mnu-exs              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Numero totale di pagine che compongono il menu'       *
      *        *-------------------------------------------------------*
           05  w-let-mnu-ntp              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Esiste una pagina precedente per il menu'             *
      *        * - S : Si                                              *
      *        * - N : No                                              *
      *        *-------------------------------------------------------*
           05  w-let-mnu-epp              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Esiste una pagina successiva per il menu'             *
      *        * - S : Si                                              *
      *        * - N : No                                              *
      *        *-------------------------------------------------------*
           05  w-let-mnu-eps              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area per mark points per la pagina di menu'           *
      *        *-------------------------------------------------------*
           05  w-let-mnu-amk.
      *            *---------------------------------------------------*
      *            * Numero di mark points nella pagina                *
      *            *---------------------------------------------------*
               10  w-let-mnu-nmk          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Coordinate  e valori associati per i mark points  *
      *            * nella pagina                                      *
      *            *---------------------------------------------------*
               10  w-let-mnu-cmk occurs 18.
      *                *-----------------------------------------------*
      *                * Linea                                         *
      *                *-----------------------------------------------*
                   15  w-let-mnu-lmk      pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Posizione                                     *
      *                *-----------------------------------------------*
                   15  w-let-mnu-pmk      pic  9(02)                  .
      *                *-----------------------------------------------*
      *                * Valore                                        *
      *                *-----------------------------------------------*
                   15  w-let-mnu-vmk      pic  x(06)                  .
      *        *-------------------------------------------------------*
      *        * Area per pagina vera e propria di menu'               *
      *        *-------------------------------------------------------*
           05  w-let-mnu-avp.
      *            *---------------------------------------------------*
      *            * Linee del menu                                    *
      *            *---------------------------------------------------*
               10  w-let-mnu-lvp occurs 18.
                   15  w-let-mnu-cvp
                                     occurs 80
                                          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area per composizione chiave                          *
      *        *-------------------------------------------------------*
           05  w-let-mnu-key.
      *            *---------------------------------------------------*
      *            * Codice menu'                                      *
      *            *---------------------------------------------------*
               10  w-let-mnu-kmn          pic  x(06)                  .
      *            *---------------------------------------------------*
      *            * Numero pagina                                     *
      *            *---------------------------------------------------*
               10  w-let-mnu-knp          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work area locale                                      *
      *        *-------------------------------------------------------*
           05  w-let-mnu-wrk.
               10  w-let-mnu-i01          pic  9(02)                  .
               10  w-let-mnu-i02          pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per visualizzazione menu'                       *
      *    *-----------------------------------------------------------*
       01  w-vis-mnu.
      *        *-------------------------------------------------------*
      *        * Comodo per linea 02                                   *
      *        *-------------------------------------------------------*
           05  w-vis-mnu-l02.
      *            *---------------------------------------------------*
      *            * Nome del menu'                                    *
      *            *---------------------------------------------------*
               10  w-vis-mnu-l02-mnu      pic  x(06)                  .
               10  filler                 pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Descrizione azienda centrata                      *
      *            *---------------------------------------------------*
               10  w-vis-mnu-l02-adx      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Nome del prodotto software                        *
      *            *---------------------------------------------------*
               10  filler                 pic  x(04)                  .
               10  w-vis-mnu-l02-nps      pic  x(16)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per linea 24                                   *
      *        *-------------------------------------------------------*
           05  w-vis-mnu-l24.
               10  w-vis-mnu-l24-pmt      pic  x(63)                  .
               10  filler                 pic  x(01)                  .
               10  w-vis-mnu-l24-ltp.
                   15  w-vis-mnu-l24-pap  pic  x(01)                  .
                   15  w-vis-mnu-l24-pag  pic  x(06)                  .
                   15  filler             pic  x(01)                  .
                   15  w-vis-mnu-l24-np1  pic  9(01)                  .
                   15  filler             pic  x(01)                  .
                   15  w-vis-mnu-l24-dix  pic  x(02)                  .
                   15  filler             pic  x(01)                  .
                   15  w-vis-mnu-l24-np2  pic  9(01)                  .
                   15  w-vis-mnu-l24-pch  pic  x(01)                  .
               10  filler                 pic  x(01)                  .
               10  filler                 pic  x(35)                  .
               10  w-vis-mnu-l24-ltx      pic  x(16)                  .
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work area locale                                      *
      *        *-------------------------------------------------------*
           05  w-vis-mnu-wrk.
               10  w-vis-mnu-i01          pic  9(02)                  .
               10  w-vis-mnu-i02          pic  9(02)                  .
               10  w-vis-mnu-c01          pic  9(02)                  .
               10  w-vis-mnu-c02          pic  9(02)                  .
               10  w-vis-mnu-pnt          pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per visualizzazione linea                       *
      *    *-----------------------------------------------------------*
       01  w-vis-lin.
      *        *-------------------------------------------------------*
      *        * Numero linea da visualizzare                          *
      *        *-------------------------------------------------------*
           05  w-vis-lin-nli              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Contenuto linea da visualizzare                       *
      *        *-------------------------------------------------------*
           05  w-vis-lin-cli.
               10  filler  occurs 132     pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per determinazione nr caratteri per linea a    *
      *        * seconda del modo di utilizzo attuale, 80 o 132 co-    *
      *        * lonne                                                 *
      *        *-------------------------------------------------------*
           05  w-vis-lin-car              pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per accettazione comando o menu'                *
      *    *-----------------------------------------------------------*
       01  w-acc-com.
      *        *-------------------------------------------------------*
      *        * Posizione di accettazione comando                     *
      *        *-------------------------------------------------------*
           05  w-acc-com-pac              pic  9(03) value zero       .
      *        *-------------------------------------------------------*
      *        * Linea di accettazione comando                         *
      *        *-------------------------------------------------------*
           05  w-acc-com-lac              pic  9(03) value zero       .
      *        *-------------------------------------------------------*
      *        * Posizione di accettazione fine lavoro                 *
      *        *-------------------------------------------------------*
           05  w-acc-com-paf              pic  9(02) value zero       .
      *        *-------------------------------------------------------*
      *        * Comando o menu' impostato                             *
      *        *-------------------------------------------------------*
           05  w-acc-com-com              pic  x(06)                  .
      *        *-------------------------------------------------------*
      *        * Descrizione comando per la ricerca                    *
      *        *-------------------------------------------------------*
           05  w-acc-des-com              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Function key impostata                                *
      *        *-------------------------------------------------------*
           05  w-acc-com-key              pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Indice per mark-point                                 *
      *        *-------------------------------------------------------*
           05  w-acc-com-i01              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Work area locale                                      *
      *        *-------------------------------------------------------*
           05  w-acc-com-wrk.
      *            *---------------------------------------------------*
      *            * Contatori                                         *
      *            *---------------------------------------------------*
               10  w-acc-com-wct          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Work per test se blanks embedded in comando       *
      *            *---------------------------------------------------*
               10  w-acc-com-wbe.
                   15  w-acc-com-wbc occurs 06
                                          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Tentativi di accesso                                  *
      *        *-------------------------------------------------------*
           05  w-acc-pwd-nrt              pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per controllo riservatezza e password su menu'  *
      *    *-----------------------------------------------------------*
       01  w-rep-mnu.
      *        *-------------------------------------------------------*
      *        * Exit status                                           *
      *        * - Spaces : controllo superato                         *
      *        * - #      : controllo non superato                     *
      *        *-------------------------------------------------------*
           05  w-rep-mnu-exs              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Puntatore                                             *
      *        *-------------------------------------------------------*
           05  w-rep-mnu-pnt              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Area di comodo per area e settore gestionale          *
      *        *-------------------------------------------------------*
           05  w-rep-mnu-ags.
               10  w-rep-mnu-arg          pic  x(03)                  .
               10  w-rep-mnu-set          pic  x(03)                  .

      *    *===========================================================*
      *    * Work-area per accettazione password                       *
      *    *-----------------------------------------------------------*
       01  w-acc-pwd.
      *        *-------------------------------------------------------*
      *        * Exit status                                           *
      *        * - Spaces : controllo superato                         *
      *        * - #      : controllo non superato                     *
      *        *-------------------------------------------------------*
           05  w-acc-pwd-exs              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Literal per la password                               *
      *        *-------------------------------------------------------*
           05  w-acc-pwd-lit              pic  x(13)                  .
      *        *-------------------------------------------------------*
      *        * Codice per la password                                *
      *        *-------------------------------------------------------*
           05  w-acc-pwd-cod              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Password richiesta                                    *
      *        *-------------------------------------------------------*
           05  w-acc-pwd-psw              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Password impostata                                    *
      *        *-------------------------------------------------------*
           05  w-acc-pwd-acc              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Function key impostata                                *
      *        *-------------------------------------------------------*
           05  w-acc-pwd-key              pic  x(04)                  .

      *    *===========================================================*
      *    * Work-area per disimpegno stampante                        *
      *    *-----------------------------------------------------------*
       01  w-dim-stp.
      *        *-------------------------------------------------------*
      *        * Codice utente attuale                                 *
      *        *-------------------------------------------------------*
           05  w-dim-stp-ute              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Tipo utente attuale                                   *
      *        *-------------------------------------------------------*
           05  w-dim-stp-tut              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Codice stampante impegnata                            *
      *        *-------------------------------------------------------*
           05  w-dim-stp-stp              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Descrizione codice stampante impegnata                *
      *        *-------------------------------------------------------*
           05  w-dim-stp-des              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Canale di stampa del codice stampante impegnata       *
      *        *-------------------------------------------------------*
           05  w-dim-stp-can              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Status di impegno del canale di stampa                *
      *        *-------------------------------------------------------*
           05  w-dim-stp-sdi              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Literals per status di impegno del canale di stampa   *
      *        *-------------------------------------------------------*
           05  w-dim-stp-lsi.
               10  filler                 pic  x(40) value
                           "Stampante non impegnata                 " .
               10  filler                 pic  x(40) value
                           "Stampante pre-impegnata per selezione   " .
               10  filler                 pic  x(40) value
                           "Stampante impegnata per manutenzione    " .
               10  filler                 pic  x(40) value
                           "Stampante impegnata per montaggio modulo" .
               10  filler                 pic  x(40) value
                           "Stampante impegnata per lo spool        " .
               10  filler                 pic  x(40) value
                           "Stampante impegnata in fase di stampa   " .
               10  filler                 pic  x(40) value
                           ".....................................   " .
           05  w-dim-stp-lsr redefines
               w-dim-stp-lsi.
               10  w-dim-stp-lsx occurs 07
                                          pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per conferma                                   *
      *        *-------------------------------------------------------*
           05  w-dim-stp-snx              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Indici e contatori di comodo                          *
      *        *-------------------------------------------------------*
           05  w-dim-stp-i01              pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per blocco spooler stampante                    *
      *    *-----------------------------------------------------------*
       01  w-blo-spl.
      *        *-------------------------------------------------------*
      *        * Template per il blocco dello spooler di stampa        *
      *        *-------------------------------------------------------*
           05  w-blo-spl-tem.
               10  w-blo-spl-tex occurs 80
                                          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Codice stampante da bloccare                          *
      *        *-------------------------------------------------------*
           05  w-blo-spl-stp              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Descrizione codice stampante                          *
      *        *-------------------------------------------------------*
           05  w-blo-spl-des              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Canale di stampa del codice stampante impegnata       *
      *        *-------------------------------------------------------*
           05  w-blo-spl-can              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Canale di stampa, prima parte                         *
      *        *-------------------------------------------------------*
           05  w-blo-spl-cn1              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Canale di stampa, seconda parte                       *
      *        *-------------------------------------------------------*
           05  w-blo-spl-cn2              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per conferma                                   *
      *        *-------------------------------------------------------*
           05  w-blo-spl-snx              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Indice su template                                    *
      *        *-------------------------------------------------------*
           05  w-blo-spl-i01              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Indice su area o-shs                                  *
      *        *-------------------------------------------------------*
           05  w-blo-spl-i02              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo 1                                 *
      *        *-------------------------------------------------------*
           05  w-blo-spl-c01              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo 2                                 *
      *        *-------------------------------------------------------*
           05  w-blo-spl-c02              pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per blocco terminale                            *
      *    *-----------------------------------------------------------*
       01  w-blo-ter.
      *        *-------------------------------------------------------*
      *        * Password per l'utente                                 *
      *        *-------------------------------------------------------*
           05  w-blo-ter-pwu              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Parola per il blocco impostata                        *
      *        *-------------------------------------------------------*
           05  w-blo-ter-acc              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Salvataggio parola per il blocco impostata            *
      *        *-------------------------------------------------------*
           05  w-blo-ter-sav              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Function key impostata                                *
      *        *-------------------------------------------------------*
           05  w-blo-ter-key              pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Tempo di durata del blocco                            *
      *        *-------------------------------------------------------*
           05  w-blo-ter-tim              pic  9(06)                  .
           05  w-blo-ter-tim-r redefines
               w-blo-ter-tim.
               10  w-blo-ter-ore          pic  9(02)                  .
               10  w-blo-ter-min          pic  9(02)                  .
               10  w-blo-ter-sec          pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per variazione del codice azienda               *
      *    *-----------------------------------------------------------*
       01  w-var-azi.
      *        *-------------------------------------------------------*
      *        * Segnale di variazione codice azienda effettivamente   *
      *        * eseguito                                              *
      *        * - Spaces : non eseguito                               *
      *        * - S      : effettivamente eseguito                    *
      *        *-------------------------------------------------------*
           05  w-var-azi-snx              pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per variazione del codice utente                *
      *    *-----------------------------------------------------------*
       01  w-var-ute.
      *        *-------------------------------------------------------*
      *        * Segnale di variazione codice utente effettivamente e- *
      *        * seguito                                               *
      *        * - Spaces : non eseguito                               *
      *        * - S      : effettivamente eseguito                    *
      *        *-------------------------------------------------------*
           05  w-var-ute-snx              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Segnale di variazione codice azienda eseguito         *
      *        * - Spaces : non eseguito                               *
      *        * - S      : eseguito                                   *
      *        *-------------------------------------------------------*
           05  w-var-ute-azi              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Codice utente precedente                              *
      *        *-------------------------------------------------------*
           05  w-var-ute-old              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Codice utente impostato                               *
      *        *-------------------------------------------------------*
           05  w-var-ute-new              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Function key impostata                                *
      *        *-------------------------------------------------------*
           05  w-var-ute-key              pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Conferma impostazione                                 *
      *        *-------------------------------------------------------*
           05  w-var-ute-cnf              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-var-ute-c01              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Salvataggio codice azienda attuale                    *
      *        *-------------------------------------------------------*
           05  w-var-ute-sva              pic  x(04)                  .

      *    *===========================================================*
      *    * Work-area per visualizzazione informazioni generali       *
      *    *-----------------------------------------------------------*
       01  w-inf-gen.
      *        *-------------------------------------------------------*
      *        * Codice azienda                                        *
      *        *-------------------------------------------------------*
           05  w-inf-gen-azi-cod          pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Codice utente                                         *
      *        *-------------------------------------------------------*
           05  w-inf-gen-ute-cod          pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Codice terminale                                      *
      *        *-------------------------------------------------------*
           05  w-inf-gen-ter-cod          pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Ora di inizio background                              *
      *        *-------------------------------------------------------*
           05  w-inf-gen-bkg-ori          pic  9(08)                  .
      *        *-------------------------------------------------------*
      *        * Work per date and time                                *
      *        *-------------------------------------------------------*
           05  w-inf-gen-bkg-det.
               10  w-inf-gen-bkg-sdt      pic  9(15)                  .
               10  w-inf-gen-bkg-sdr redefines
                   w-inf-gen-bkg-sdt.
                   15  w-inf-gen-bkg-dat  pic  9(07)                  .
                   15  w-inf-gen-bkg-tim  pic  9(08)                  .
                   15  w-inf-gen-bkg-t01  redefines
                       w-inf-gen-bkg-tim.
                       20  w-inf-gen-bkg-thh
                                          pic  9(02)                  .
                       20  w-inf-gen-bkg-tmm
                                          pic  9(02)                  .
                       20  w-inf-gen-bkg-tss
                                          pic  9(02)                  .
                       20  w-inf-gen-bkg-tcc
                                          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per editing                                    *
      *        *-------------------------------------------------------*
           05  w-inf-edt.
               10  w-inf-edt-mes          pic  x(09)                  .
               10  w-inf-edt-set          pic  x(09)                  .
               10  w-inf-edt-gio          pic  x(02)                  .
               10  w-inf-edt-ann          pic  x(04)                  .

      *    *===========================================================*
      *    * Work-area per esecuzione secondo pathname                 *
      *    *-----------------------------------------------------------*
       01  w-exe-pth.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  w-exe-pth-sap              pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  w-exe-pth-arg              pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Direttorio programmi                                  *
      *        *-------------------------------------------------------*
           05  w-exe-pth-prg              pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Direttorio oggetti                                    *
      *        *-------------------------------------------------------*
           05  w-exe-pth-obj              pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Nome interno del programma                            *
      *        *-------------------------------------------------------*
           05  w-exe-pth-pro              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Pathname per l'esecuzione                             *
      *        *-------------------------------------------------------*
           05  w-exe-pth-pth              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per test se blanks embedded                      *
      *        *-------------------------------------------------------*
           05  w-exe-pth-wct              pic  9(02)                  .
           05  w-exe-pth-wbe.
               10  w-exe-pth-wbc occurs 40
                                          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per accettazione conferma finale                 *
      *        *-------------------------------------------------------*
           05  w-exe-pth-sne              pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per l'esecuzione di una certa operazione alla   *
      *    * prossima apertura di un file                              *
      *    *-----------------------------------------------------------*
       01  w-nxt-opn.
      *        *-------------------------------------------------------*
      *        * Nome del file interessato                             *
      *        *-------------------------------------------------------*
           05  w-nxt-opn-nam              pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Tipo operazione                                       *
      *        * - 01 : Sequenzializzazione                            *
      *        * - 02 : Indicizzazione senza sostituzione              *
      *        * - 03 : Indicizzazione con sostituzione                *
      *        * - 04 : Operazione su se' stesso                       *
      *        * - 05 : Nessuna operazione                             *
      *        *-------------------------------------------------------*
           05  w-nxt-opn-top              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Tipo di filtro                                        *
      *        * 0 : Nessuno                                           *
      *        * 1 : Standard                                          *
      *        * 2 : Programma                                         *
      *        *-------------------------------------------------------*
           05  w-nxt-opn-tpf              pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Filtro                                                *
      *        *-------------------------------------------------------*
           05  w-nxt-opn-nmf              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per accettazione campo espanso Tipo operazione   *
      *        *-------------------------------------------------------*
           05  w-nxt-opn-eto.
               10  w-nxt-opn-eto-num      pic  9(02)       value 05   .
               10  w-nxt-opn-eto-lun      pic  9(02)       value 40   .
               10  w-nxt-opn-eto-tbl.
                   15  filler             pic  x(40) value
                            "Sequenzializzazione                     ".
                   15  filler             pic  x(40) value
                            "Indicizzazione senza sostituzione       ".
                   15  filler             pic  x(40) value
                            "Indicizzazione con sostituzione         ".
                   15  filler             pic  x(40) value
                            "Operazione su se' stesso                ".
                   15  filler             pic  x(40) value
                            "Nessuna operazione                      ".
      *        *-------------------------------------------------------*
      *        * Work per accettazione campo espanso Tipo filtro       *
      *        *-------------------------------------------------------*
           05  w-nxt-opn-etf.
               10  w-nxt-opn-etf-num      pic  9(02)       value 03   .
               10  w-nxt-opn-etf-lun      pic  9(02)       value 20   .
               10  w-nxt-opn-etf-tbl.
                   15  filler             pic  x(20) value
                            "Nessuno             "                    .
                   15  filler             pic  x(20) value
                            "Standard            "                    .
                   15  filler             pic  x(20) value
                            "Programma           "                    .
      *        *-------------------------------------------------------*
      *        * Work per accettazione conferma finale                 *
      *        *-------------------------------------------------------*
           05  w-nxt-opn-sne              pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per esecuzione shell script                     *
      *    *-----------------------------------------------------------*
       01  w-exe-shl.
      *        *-------------------------------------------------------*
      *        * Tipi di shell eseguibili                              *
      *        *  - Spaces : Tutti i tipi                              *
      *        *  - NN     : Tutti i tipi, fatta eccezione per una     *
      *        *             shell interattiva a comandi manuali       *
      *        *-------------------------------------------------------*
           05  w-exe-shl-tds              pic  x(02)                  .
      *        *-------------------------------------------------------*
      *        * Shell script                                          *
      *        *-------------------------------------------------------*
           05  w-exe-shl-scr              pic  x(60)                  .
      *        *-------------------------------------------------------*
      *        * Carattere di conferma                                 *
      *        *-------------------------------------------------------*
           05  w-exe-shl-sne              pic  x(60)                  .
      *        *-------------------------------------------------------*
      *        * Contatore per terminazione con low-value              *
      *        *-------------------------------------------------------*
           05  w-exe-shl-c01              pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per editings                                    *
      *    *-----------------------------------------------------------*
       01  w-edt.
      *        *-------------------------------------------------------*
      *        * Work per editing ora in formato hh:mm:ss              *
      *        *-------------------------------------------------------*
           05  w-edt-ora-hms.
               10  w-edt-ora-hhh          pic  9(02)                  .
               10  filler                 pic  x(01)      value ":"   .
               10  w-edt-ora-mmm          pic  9(02)                  .
               10  filler                 pic  x(01)      value ":"   .
               10  w-edt-ora-sss          pic  9(02)                  .

      *    *===========================================================*
      *    * Work per subroutines di Find                              *
      *    *-----------------------------------------------------------*
       01  w-fnd.
      *        *-------------------------------------------------------*
      *        * Work per Find su codici stampante di [pss]            *
      *        *-------------------------------------------------------*
           05  w-fnd-pss-stp.
               10  w-fnd-pss-stp-sel      pic  x(01)                  .
               10  w-fnd-pss-stp-cod      pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Work per Find su codici modulo di [pss]               *
      *        *-------------------------------------------------------*
           05  w-fnd-pss-mod.
               10  w-fnd-pss-mod-sel      pic  x(01)                  .
               10  w-fnd-pss-mod-cod      pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Work per Find su filtri di conversione di [auc]       *
      *        *-------------------------------------------------------*
           05  w-fnd-auc-fcs.
               10  w-fnd-auc-fcs-sel      pic  x(01)                  .
               10  w-fnd-auc-fcs-cod      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Work per Find su codici comando di [auc]              *
      *        *-------------------------------------------------------*
           05  w-fnd-auc-cmd.
               10  w-fnd-auc-cmd-sel      pic  x(01)                  .
               10  w-fnd-auc-cmd-cod      pic  x(06)                  .
               10  w-fnd-auc-cmd-des      pic  x(40)                  .
               10  w-fnd-auc-cmd-pos      pic  9(02)                  .
               10  w-fnd-auc-cmd-lin      pic  9(02)                  .
               10  w-fnd-auc-cmd-po1      pic  9(02)                  .
               10  w-fnd-auc-cmd-po2      pic  9(02)                  .
               10  w-fnd-auc-cmd-li1      pic  9(02)                  .
               10  w-fnd-auc-cmd-li2      pic  9(02)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Work per Det codice azienda in uso                    *
      *        *-------------------------------------------------------*
           05  w-det-cod-azi.
      *            *---------------------------------------------------*
      *            * Codice azienda attualmente in uso                 *
      *            *---------------------------------------------------*
               10  w-det-cod-azi-cod      pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det codice utente in uso                     *
      *        *-------------------------------------------------------*
           05  w-det-cod-ute.
      *            *---------------------------------------------------*
      *            * Codice utente attualmente in uso                  *
      *            *---------------------------------------------------*
               10  w-det-cod-ute-cod      pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det esistenza print-files per l'utente in u- *
      *        * so, per l'azienda in uso                              *
      *        *-------------------------------------------------------*
           05  w-det-prf-mbx.
      *            *---------------------------------------------------*
      *            * Numero totale di print-files in catalogo, sia in  *
      *            * fase di creazione che gia' creati                 *
      *            *---------------------------------------------------*
               10  w-det-prf-mbx-tot      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di print-files in fase di creazione        *
      *            *---------------------------------------------------*
               10  w-det-prf-mbx-ifc      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di print-files gia' creati                 *
      *            *---------------------------------------------------*
               10  w-det-prf-mbx-gcr      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di print-files gia' creati ma non ancora   *
      *            * effettivamente stampanti                          *
      *            *---------------------------------------------------*
               10  w-det-prf-mbx-cns      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di print-files gia' creati e gia' effetti- *
      *            * vamente stampanti                                 *
      *            *---------------------------------------------------*
               10  w-det-prf-mbx-cgs      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Numero di print-files di tipo 'Messaggio'         *
      *            *---------------------------------------------------*
               10  w-det-prf-mbx-msg      pic  9(05)                  .

      *    *===========================================================*
      *    * Work area per il messaggio di informazioni generali       *
      *    *-----------------------------------------------------------*
       01  w-mig.
      *        *-------------------------------------------------------*
      *        * Comodi per la visualizzazione                         *
      *        *-------------------------------------------------------*
           05  w-mig-lit-max              pic  9(02)       value 14   .
           05  w-mig-lit-ctr              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Literals e aree da visualizzare                       *
      *        *-------------------------------------------------------*
           05  w-mig-lit.
      *            *---------------------------------------------------*
      *            * Definizione screen iniziale                       *
      *            *---------------------------------------------------*
               10  filler                 pic  x(78) value
                     " -------------------------------------------------
      -              "--------------------------- "                   .
               10  filler                 pic  x(78) value
                     "   ______________                   _________     
      -              "      wip (C) - 1989 - 2025 "                   .
               10  filler                 pic  x(78) value
                     "  _____________ /|                 _________/\    
      -              "                            "                   .
               10  filler                 pic  x(78) value
                     " |             | /  ____   ____   / ____    \ \___
      -              "    ____ __           ____  "                   .
               10  filler                 pic  x(78) value
                     " |____     ____|/  ____/ \____/ \/ /__ /|_   \ \_/
      -              "\  ____/ \/ \        ____/| "                   .
               10  filler                 pic  x(78) value
                     "      |   ||      /    \  \   \  \|   | | \___\/ \
      -              " \/    \  \  \      /    || "                   .
               10  filler                 pic  x(78) value
                     "      |   ||     /      \  \   \  |   | |  ___    
      -              "\|      \  \  \    /     || "                   .
               10  filler                 pic  x(78) value
                     "      |   ||    /   /\   \  \   \ |   | | /__/\   
      -              "||  /\   \  \  \  /      || "                   .
               10  filler                 pic  x(78) value
                     "      |   ||   /   /__\   \  \   \|   | |/   \ \  
      -              "|  /__\   \  \  \/       || "                   .
               10  filler                 pic  x(78) value
                     "      |   ||  /   ______   \  \       | |\    \| /
      -              "\ ______   \  \ /        || "                   .
               10  filler                 pic  x(78) value
                     "      |   || /   /      \   \  \      | | \   || \
      -              " \/   | \   \  /   /|    || "                   .
               10  filler                 pic  x(78) value
                     "      |___|//___/        \___\/ \_____|/__/   ||__
      -              "\/    |  \___\/   / |    || "                   .
               10  filler                 pic  x(78) value
                     "                                 \            /   
      -              "      |    || \  /  |    || "                   .
               10  filler                 pic  x(78) value
                     "                                  \__________/    
      -              "      |____|/  \/   |____|/ "                   .
      *            *---------------------------------------------------*
      *            * Ridefinizione                                     *
      *            *---------------------------------------------------*
           05  w-mig-lit-red redefines
               w-mig-lit.
               10  w-mig-lit-lin occurs 14.
                   15  w-mig-lit-sln      pic  x(78)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per editing                                    *
      *        *-------------------------------------------------------*
           05  w-mig-edt.
               10  w-mig-edt-ora          pic  x(02)                  .
               10  w-mig-edt-min          pic  x(02)                  .
               10  w-mig-edt-scd          pic  x(02)                  .

      *    *===========================================================*
      *    * Work per buffer programmi utilizzati dall'utente          *
      *    *-----------------------------------------------------------*
       01  w-buf-doc.
      *        *-------------------------------------------------------*
      *        * Work per buffer                                       *
      *        *-------------------------------------------------------*
           05  w-buf-ute-fas.
      *            *---------------------------------------------------*
      *            * Flag di selezione                                 *
      *            *---------------------------------------------------*
               10  w-buf-ute-fas-fds      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Fase selezionata                                  *
      *            *---------------------------------------------------*
               10  w-buf-ute-fas-tdf      pic  x(06)                  .
      *            *---------------------------------------------------*
      *            * Area di comodo                                    *
      *            *---------------------------------------------------*
               10  w-buf-ute-fas-c01      pic  9(02)                  .
               10  w-buf-ute-fas-c02      pic  9(02)                  .
               10  w-buf-ute-fas-c03      pic  9(02)                  .
               10  w-buf-ute-fas-c04      pic  9(02)                  .
               10  w-buf-ute-fas-c05      pic  9(02)                  .
               10  w-buf-ute-fas-nli      pic  9(02)                  .
               10  w-buf-ute-fas-crb      pic  9(02)                  .
               10  w-buf-ute-fas-cpb      pic  9(02)                  .
               10  w-buf-ute-fas-cpa      pic  9(02)                  .
               10  w-buf-ute-fas-mxp      pic  9(02) value  9         .
               10  w-buf-ute-fas-max      pic  9(02) value 54         .
               10  w-buf-ute-fas-buf occurs 54.
                   15  w-buf-ute-fas-fas  pic  x(06)                  .
                   15  w-buf-ute-fas-def  pic  x(40)                  .
               10  w-buf-ute-fas-ltp.
                   15  filler             pic  x(07) value "Pagina "  .
                   15  w-buf-ute-fas-lt1  pic  9(01)                  .
                   15  filler             pic  x(04) value " di "     .
                   15  w-buf-ute-fas-lt2  pic  9(01)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *================================================================*
       Linkage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per programmi della serie "pxpg"    *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/prg/cpy/pxpglink.cpy"                   .

      ******************************************************************
       Procedure Division                using x                      .
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Determinazione se si e' in esecuzione di un     *
      *              * desk-accessory o no                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Richiesta del livello di esecuzione relati- *
      *                  * vo ai desk-accessories                      *
      *                  *---------------------------------------------*
           move      "LD"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *                  *---------------------------------------------*
      *                  * Test se si e' in esecuzione di un desk-ac-  *
      *                  * cessory e set del segnale, insieme al tipo  *
      *                  * di desk-accessory                           *
      *                  *---------------------------------------------*
           if        o-sts                not  < "01" and
                     o-sts                not  > "99"
                     move  "S"            to   w-exe-dac-snx-dac
                     move  o-pat          to   w-exe-dac-tip-dac
                     move  "S"            to   w-exe-dac-snx-ird
           else      move  "N"            to   w-exe-dac-snx-dac
                     move  spaces         to   w-exe-dac-tip-dac
                     move  "N"            to   w-exe-dac-snx-ird      .
       main-100.
      *              *-------------------------------------------------*
      *              * Se si e' in esecuzione di un desk-accessory di  *
      *              * tipo Screen-Hard-Copy                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        w-exe-dac-snx-dac    not  = "S"    or
                     w-exe-dac-tip-dac    not  = "SHCP"
                     go to main-200.
      *                  *---------------------------------------------*
      *                  * Richiamo del programma di trattamento della *
      *                  * funzione di Screen-Hard-Copy                *
      *                  *---------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg0007"                       .
      *                  *---------------------------------------------*
      *                  * Cancellazione del programma di trattamento  *
      *                  * della funzione di Screen-Hard-Copy          *
      *                  *---------------------------------------------*
           cancel    "swd/xpg/prg/obj/pxpg0007"                       .
      *                  *---------------------------------------------*
      *                  * Segnale di terminazione in uscita           *
      *                  *---------------------------------------------*
           move      "##"                 to   x-sts                  .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     main-990.
       main-200.
      *              *-------------------------------------------------*
      *              * Apertura file [auc]                             *
      *              *-------------------------------------------------*
           perform   opn-fil-auc-000      thru opn-fil-auc-999        .
      *              *-------------------------------------------------*
      *              * Apertura file [pss]                             *
      *              *-------------------------------------------------*
           perform   opn-fil-pss-000      thru opn-fil-pss-999        .
      *              *-------------------------------------------------*
      *              * Determinazione livello di profondita' applica-  *
      *              * tiva attuale e controllo su eventuali moduli di *
      *              * i-o ancora aperti                               *
      *              *-------------------------------------------------*
           perform   det-liv-prf-000      thru det-liv-prf-999        .
      *              *-------------------------------------------------*
      *              * Determinazione si/no bakground in esecuzione    *
      *              *-------------------------------------------------*
           perform   det-snx-bkg-000      thru det-snx-bkg-999        .
      *              *-------------------------------------------------*
      *              * Determinazione status bakground in esecuzione   *
      *              *-------------------------------------------------*
           perform   det-sts-bkg-000      thru det-sts-bkg-999        .
      *              *-------------------------------------------------*
      *              * Determinazione descrizione azienda allineata al *
      *              * centro                                          *
      *              *-------------------------------------------------*
           perform   det-des-azi-000      thru det-des-azi-999        .
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione generali              *
      *              *-------------------------------------------------*
           perform   let-psg-auc-000      thru let-psg-auc-999        .
      *              *-------------------------------------------------*
      *              * Lettura record parametri utente attuale         *
      *              *-------------------------------------------------*
           perform   let-ute-att-000      thru let-ute-att-999        .
      *              *-------------------------------------------------*
      *              * Eventuale preparazione del menu' iniziale per   *
      *              * l'utente                                        *
      *              *-------------------------------------------------*
           if        x-mnu                =    spaces
                     move  1              to   x-npm
                     if    w-ute-mnu-ini  =    spaces
                           move  "menu  " to   x-mnu
                     else  move  w-ute-mnu-ini
                                          to   x-mnu                  .
       main-300.
      *              *-------------------------------------------------*
      *              * Se al codice utente e' associato un task, ma    *
      *              * si e' in esecuzione di desk-accessory : si pre- *
      *              * para il segnale di fine lavoro e si esce        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se all'utente e' associato un menu'    *
      *                  *---------------------------------------------*
           if        w-ute-mnu-ini        =    spaces
                     go to main-350.
      *                  *---------------------------------------------*
      *                  * Test se si e' in esecuzione di un desk-ac-  *
      *                  * cessory                                     *
      *                  *---------------------------------------------*
           if        w-exe-dac-snx-dac    =    "N"
                     go to main-350.
      *                  *---------------------------------------------*
      *                  * Lettura del comando relativo al menu' o al  *
      *                  * task passato in link                        *
      *                  *---------------------------------------------*
           move      x-mnu                to   w-cor-ame-cod          .
           perform   cmd-mnu-auc-000      thru cmd-mnu-auc-999        .
      *                  *---------------------------------------------*
      *                  * Se il comando relativo al menu' o al task   *
      *                  * passato in link esiste e corrisponde ad un  *
      *                  * task, si prepara il segnale di fine lavoro  *
      *                  * e si esce                                   *
      *                  *---------------------------------------------*
           if        w-cor-ame-exs        =    spaces and
                     w-cor-ame-tip        =    00     and
                     w-cor-ame-sts        =    00
                     move  "##"           to   x-sts
                     go to main-900.
      *                  *---------------------------------------------*
      *                  * Altrimenti si prosegue                      *
      *                  *---------------------------------------------*
           go to     main-400.
       main-350.
      *              *-------------------------------------------------*
      *              * Lettura del comando relativo al menu' o al task *
      *              * passato in link                                 *
      *              *-------------------------------------------------*
           move      x-mnu                to   w-cor-ame-cod          .
           perform   cmd-mnu-auc-000      thru cmd-mnu-auc-999        .
       main-400.
      *              *-------------------------------------------------*
      *              * Se il comando relativo al menu' o al task pas-  *
      *              * sato in link esiste e corrisponde ad un task,   *
      *              * si preparano i parametri di uscita e si esce    *
      *              *-------------------------------------------------*
           if        w-cor-ame-exs        =    spaces and
                     w-cor-ame-tip        =    00     and
                     w-cor-ame-sts        =    00
                     move  "X "           to   x-sts
                     move  w-cor-ame-pth  to   x-pat
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura del menu' passato in link alla pagina   *
      *              * passata in link                                 *
      *              *-------------------------------------------------*
           move      x-mnu                to   w-let-mnu-mnu          .
           move      x-npm                to   w-let-mnu-npm          .
           perform   let-pag-mnu-000      thru let-pag-mnu-999        .
       main-500.
      *              *-------------------------------------------------*
      *              * Visualizzazione pagina del menu' attuale        *
      *              *-------------------------------------------------*
           perform   vis-pag-mnu-000      thru vis-pag-mnu-999        .
       main-600.
      *              *-------------------------------------------------*
      *              * Accettazione comando o menu'                    *
      *              *-------------------------------------------------*
           perform   acc-cmd-mnu-000      thru acc-cmd-mnu-999        .
       main-900.
      *              *-------------------------------------------------*
      *              * Chiusura file [auc]                             *
      *              *-------------------------------------------------*
           perform   cls-fil-auc-000      thru cls-fil-auc-999        .
      *              *-------------------------------------------------*
      *              * Chiusura file [pss]                             *
      *              *-------------------------------------------------*
           perform   cls-fil-pss-000      thru cls-fil-pss-999        .
       main-950.
      *              *-------------------------------------------------*
      *              * Se si esce con richiesta di esecuzione di un    *
      *              * task, o di un pathname, o di una procedura, e   *
      *              * inoltre si e' in esecuzione di un desk-acces-   *
      *              * sory : si richiede l'inibizione del Save al     *
      *              * prossimo inizio di programma applicativo        *
      *              *-------------------------------------------------*
           if        x-sts                not  = "T" and
                     x-sts                not  = "X" and
                     x-sts                not  = "P"
                     go to main-990.
           if        w-exe-dac-snx-dac    not  = "S"
                     go to main-990.
      *    move      "S0"                 to   v-ope                  .
      *    call      "swd/mod/prg/obj/msegrt"
      *                                  using v                      .
       main-990.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     main-999.
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Open file [auc]                                           *
      *    *-----------------------------------------------------------*
       opn-fil-auc-000.
      *              *-------------------------------------------------*
      *              * Preparazione pathname per [auc]                 *
      *              *-------------------------------------------------*
           move      "A0"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      "fpx"                to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      "auc"                to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A9"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      o-pat                to   f-auc-pat              .
      *              *-------------------------------------------------*
      *              * Operazione di i-o di Open                       *
      *              *-------------------------------------------------*
           open      i-o    auc                                       .
       opn-fil-auc-999.
           exit.

      *    *===========================================================*
      *    * Close file [auc]                                          *
      *    *-----------------------------------------------------------*
       cls-fil-auc-000.
           close      auc                                             .
       cls-fil-auc-999.
           exit.

      *    *===========================================================*
      *    * Open file [pss]                                           *
      *    *-----------------------------------------------------------*
       opn-fil-pss-000.
      *              *-------------------------------------------------*
      *              * Preparazione pathname per [pss]                 *
      *              *-------------------------------------------------*
           move      "A0"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      "fpx"                to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      "pss"                to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A9"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      o-pat                to   f-pss-pat              .
      *              *-------------------------------------------------*
      *              * Operazione di i-o di Open                       *
      *              *-------------------------------------------------*
           open      i-o    pss                                       .
       opn-fil-pss-999.
           exit.

      *    *===========================================================*
      *    * Close file [pss]                                          *
      *    *-----------------------------------------------------------*
       cls-fil-pss-000.
           close      pss                                             .
       cls-fil-pss-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione eventuali promemoria da segreteria        *
      *    *-----------------------------------------------------------*
       vis-ute-upr-000.
      *              *-------------------------------------------------*
      *              * Richiamo modulo di segreteria                   *
      *              *-------------------------------------------------*
           move      "VP"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       vis-ute-upr-999.
           exit.

      *    *===========================================================*
      *    * Aggiornamento eventuali promemoria a segreteria           *
      *    *-----------------------------------------------------------*
       agg-ute-upr-000.
      *              *-------------------------------------------------*
      *              * Richiamo modulo di segreteria                   *
      *              *-------------------------------------------------*
           move      "AP"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       agg-ute-upr-999.
           exit.

      *    *===========================================================*
      *    * Determinazione livello di profondita' applicativa attuale *
      *    * e controllo su eventuali moduli di i-o ancora aperti      *
      *    *-----------------------------------------------------------*
       det-liv-prf-000.
      *              *-------------------------------------------------*
      *              * Richiesta informazioni generali da segreteria   *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Trasferimento informazioni riguardanti il li-   *
      *              * vello di profondita' in area di comodo          *
      *              *-------------------------------------------------*
           move      s-liv                to   w-liv-prf-liv          .
      *              *-------------------------------------------------*
      *              * Se non si e' al livello di profondita' applica- *
      *              * tiva '00' : uscita                              *
      *              *-------------------------------------------------*
           if        w-liv-prf-liv        not  = zero
                     go to det-liv-prf-999.
      *              *-------------------------------------------------*
      *              * Richiesta informazioni relative a moduli di i-o *
      *              * "ioxyz" ancora in essere, ovvero con file open  *
      *              * counter maggiore di zero                        *
      *              *-------------------------------------------------*
           move      "IO"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Salvataggio numero moduli di i-o ancora in es-  *
      *              * sere                                            *
      *              *-------------------------------------------------*
           move      s-num                to   w-liv-prf-nma          .
      *              *-------------------------------------------------*
      *              * Salvataggio filenames corrispondenti ai moduli  *
      *              * di i-o ancora in essere                         *
      *              *-------------------------------------------------*
           move      s-alf                to   w-liv-prf-fna          .
      *              *-------------------------------------------------*
      *              * Se nessun modulo di i-o "ioxyz" ancora in esse- *
      *              * re : uscita                                     *
      *              *-------------------------------------------------*
           if        s-num                =    zero
                     go to det-liv-prf-999.
       det-liv-prf-100.
      *              *-------------------------------------------------*
      *              * Se esistono moduli di i-o "ioxyz" ancora in es- *
      *              * sere : emissione messaggio di errore            *
      *              *-------------------------------------------------*
       det-liv-prf-150.
      *                  *---------------------------------------------*
      *                  * Save video                                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       det-liv-prf-200.
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      21                   to   v-lto                  .
           move      80                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       det-liv-prf-250.
      *                  *---------------------------------------------*
      *                  * Messaggio nel box                           *
      *                  *---------------------------------------------*
       det-liv-prf-300.
      *                      *-----------------------------------------*
      *                      * Literals                                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "ATTENZIONE : Ci sono dei moduli di i-o ancora aper
      -              "ti....:                   "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "             Cio' sta' ad indicare una piccola    
      -              "                          "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "             anomalia nel programma appena ese-   
      -              "                          "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "             guito.                               
      -              "                          "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "             Prendere nota del messaggio e rife-  
      -              "                          "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "             rire il tutto al personale software  
      -              "                          "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "             addetto alla manutenzione.           
      -              "                          "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      76                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       det-liv-prf-350.
      *                      *-----------------------------------------*
      *                      * Filenames corrispondenti ai moduli di   *
      *                      * i-o ancora aperti                       *
      *                      *-----------------------------------------*
           move      zero                 to   w-liv-prf-c01          .
       det-liv-prf-355.
           add       1                    to   w-liv-prf-c01          .
           if        w-liv-prf-c01        >    10
                     go to det-liv-prf-360.
           if        w-liv-prf-c01        >    w-liv-prf-nma
                     go to det-liv-prf-400.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      w-liv-prf-c01        to   v-lin                  .
           add       4                    to   v-lin                  .
           move      61                   to   v-pos                  .
           move      w-liv-prf-fne
                    (w-liv-prf-c01)       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     det-liv-prf-355.
       det-liv-prf-360.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      13                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      61                   to   v-pos                  .
           move      ".... ed altri"      to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       det-liv-prf-400.
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       det-liv-prf-450.
      *                  *---------------------------------------------*
      *                  * Presa visione                               *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      20                   to   v-lin                  .
           move      77                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Restore video                               *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       det-liv-prf-999.
           exit.

      *    *===========================================================*
      *    * Determinazione si/no background attualmente in esecuzione *
      *    *-----------------------------------------------------------*
       det-snx-bkg-000.
      *              *-------------------------------------------------*
      *              * Richiesta informazioni generali da segreteria   *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Trasferimento informazioni riguardanti il back- *
      *              * ground in area di comodo                        *
      *              *-------------------------------------------------*
           if        s-snb                =    "S"
                     move  "S"            to   w-snx-bkg-snx
                     move  s-npb          to   w-snx-bkg-pro
                     move  s-alf          to   w-snx-bkg-des
                     move  s-psb          to   w-snx-bkg-pst
           else      move  "N"            to   w-snx-bkg-snx
                     move  spaces         to   w-snx-bkg-pro
                     move  spaces         to   w-snx-bkg-des
                     move  zero           to   w-snx-bkg-pst          .
       det-snx-bkg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione status del background in esecuzione        *
      *    *-----------------------------------------------------------*
       det-sts-bkg-000.
      *              *-------------------------------------------------*
      *              * Se non ci sono background in esecuzione : usci- *
      *              * ta con status a 'N'                             *
      *              *-------------------------------------------------*
           if        w-snx-bkg-snx        =    "N"
                     move  "N"            to   w-snx-bkg-sts
                     go to det-sts-bkg-999.
       det-sts-bkg-100.
      *              *-------------------------------------------------*
      *              * Se ci sono background in esecuzione             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se terminazione avvenuta               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura variabile di i.p.c. gloable di  *
      *                      * nome 'Status Background'                *
      *                      *-----------------------------------------*
           move      "GV"                 to   s-ope                  .
           move      "Status Background   "
                                          to   s-var                  .
           move      "G"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda se variabile tro-  *
      *                      * vata oppure no                          *
      *                      *-----------------------------------------*
           if        s-ves                =    spaces
                     go to det-sts-bkg-300.
       det-sts-bkg-200.
      *                      *-----------------------------------------*
      *                      * Se variabile non trovata                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Uscita con segnale di nessun back-  *
      *                          * ground in esecuzione                *
      *                          *-------------------------------------*
           move      "N"                  to   w-snx-bkg-sts          .
           go to     det-sts-bkg-999.
       det-sts-bkg-300.
      *                      *-----------------------------------------*
      *                      * Se variabile trovata                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Deviazione in funzione del valore   *
      *                          * della variabile                     *
      *                          *-------------------------------------*
           if        s-alf                =    "T"
                     go to det-sts-bkg-400
           else      go to det-sts-bkg-500.
       det-sts-bkg-400.
      *                          *-------------------------------------*
      *                          * Se variabile a valore 'T'           *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Uscita con il segnale di back-  *
      *                              * ground in esecuzione terminato  *
      *                              *---------------------------------*
           move      "T"                  to   w-snx-bkg-sts          .
           go to     det-sts-bkg-999.
       det-sts-bkg-500.
      *                          *-------------------------------------*
      *                          * Se variabile a valore non 'T'       *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Uscita con il segnale di back-  *
      *                              * ground in esecuzione ma non an- *
      *                              * cora terminato                  *
      *                              *---------------------------------*
           move      "S"                  to   w-snx-bkg-sts          .
           go to     det-sts-bkg-999.
       det-sts-bkg-999.
           exit.

      *    *===========================================================*
      *    * Determinazione descrizione azienda allineata al centro    *
      *    *-----------------------------------------------------------*
       det-des-azi-000.
      *              *-------------------------------------------------*
      *              * Informazioni su azienda da segreteria           *
      *              *-------------------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Bufferizzazione codice azienda e descrizione a- *
      *              * zienda allineata al centro                      *
      *              *-------------------------------------------------*
           move      s-azi                to   w-des-azi-cod          .
           move      s-adx                to   w-des-azi-adx          .
       det-des-azi-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazioni generali da file [auc]          *
      *    *-----------------------------------------------------------*
       let-psg-auc-000.
      *              *-------------------------------------------------*
      *              * Lettura record personalizzazioni generali       *
      *              *-------------------------------------------------*
           move      "psg "               to   auc-tre                .
           move      spaces               to   auc-kre                .
           read      auc    with no lock
                            invalid key
                            go to   let-psg-auc-100.
           go to     let-psg-auc-200.
       let-psg-auc-100.
      *              *-------------------------------------------------*
      *              * Se personalizzazioni generali non esistenti     *
      *              *-------------------------------------------------*
           perform   nor-psg-auc-000      thru nor-psg-auc-999        .
           go to     let-psg-auc-999.
       let-psg-auc-200.
      *              *-------------------------------------------------*
      *              * Se personalizzazioni generali esistenti         *
      *              *-------------------------------------------------*
           move      auc-dat              to   w-psg                  .
       let-psg-auc-999.
           exit.

      *    *===========================================================*
      *    * Work per normalizzazione record di [auc] 'psg'            *
      *    *-----------------------------------------------------------*
           copy      "swd/xpg/prg/cpy/waucpsg0.cps"                   .

      *    *===========================================================*
      *    * Lettura parametri correlati all'utente in uso             *
      *    *-----------------------------------------------------------*
       let-ute-att-000.
      *              *-------------------------------------------------*
      *              * Preparazione codice utente                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Informazioni generali da segreteria         *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Codice utente                               *
      *                  *---------------------------------------------*
           move      s-ute                to   w-let-ute-cod          .
      *                  *---------------------------------------------*
      *                  * Lettura parametri correlati all'utente in   *
      *                  * w-let-ute-cod                               *
      *                  *---------------------------------------------*
           perform   let-ute-auc-000      thru let-ute-auc-999        .
      *                  *---------------------------------------------*
      *                  * Record letto in area utente attuale         *
      *                  *---------------------------------------------*
           move      w-ute                to   w-uta                  .
       let-ute-att-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri correlati all'utente in w-let-ute-cod   *
      *    *-----------------------------------------------------------*
       let-ute-auc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-ute-exs          .
      *              *-------------------------------------------------*
      *              * Lettura record codice utente                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura                                     *
      *                  *---------------------------------------------*
           move      "ute "               to   auc-tre                .
           move      w-let-ute-cod        to   auc-kre                .
           read      auc    with no lock
                            invalid key
                            go to   let-ute-auc-100.
           go to     let-ute-auc-200.
       let-ute-auc-100.
      *                  *---------------------------------------------*
      *                  * Se codice utente non esistente              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione area codice utente      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Status di uscita                    *
      *                          *-------------------------------------*
           move      "#"                  to   w-let-ute-exs          .
      *                          *-------------------------------------*
      *                          * Codice utente                       *
      *                          *-------------------------------------*
           move      w-let-ute-cod        to   w-ute-cod-ute          .
      *                          *-------------------------------------*
      *                          * Descrizione utente                  *
      *                          *-------------------------------------*
           move      spaces               to   w-ute-des-ute          .
           string    "Utente "  delimited by   size
                     w-ute-cod-ute
                                delimited by   size
                                          into w-ute-des-ute          .
      *                          *-------------------------------------*
      *                          * Tipo utente : normale               *
      *                          *-------------------------------------*
           move      00                   to   w-ute-tip-ute          .
      *                          *-------------------------------------*
      *                          * Password per l' utente : nessuna    *
      *                          *-------------------------------------*
           move      spaces               to   w-ute-pwd-ute          .
      *                          *-------------------------------------*
      *                          * Livello di protezione massimo per   *
      *                          * l' utente : 000000                  *
      *                          *-------------------------------------*
           move      000000               to   w-ute-liv-pro          .
      *                          *-------------------------------------*
      *                          * Status utente : puo' operare        *
      *                          *-------------------------------------*
           move      00                   to   w-ute-sts-ute          .
      *                          *-------------------------------------*
      *                          * Menu' iniziale utente : nessuno     *
      *                          *-------------------------------------*
           move      spaces               to   w-ute-mnu-ini          .
      *                          *-------------------------------------*
      *                          * Numero aziende in cui l'utente puo' *
      *                          * operare : zero                      *
      *                          *-------------------------------------*
           move      00                   to   w-ute-num-azi          .
      *                          *-------------------------------------*
      *                          * Elenco aziende in cui l'utente puo' *
      *                          * operare : nessuna azienda           *
      *                          *-------------------------------------*
           move      spaces               to   w-ute-tbl-azi          .
      *                          *-------------------------------------*
      *                          * Numero parametri di abilitazione    *
      *                          * per l'utente : zero                 *
      *                          *-------------------------------------*
           move      zero                 to   w-ute-num-abl          .
      *                          *-------------------------------------*
      *                          * Preparazione tabella parametri di   *
      *                          * abilitazione per l'utente           *
      *                          *-------------------------------------*
           move      spaces               to   w-ute-tbl-abl          .
      *                          *-------------------------------------*
      *                          * Background per l'utente             *
      *                          *-------------------------------------*
           move      "N"                  to   w-ute-bkg-ute          .
      *                          *-------------------------------------*
      *                          * Tipo selezione codice stampante as- *
      *                          * sociato all'utente : questo utente  *
      *                          * non puo' stampare                   *
      *                          *-------------------------------------*
           move      99                   to   w-ute-tse-cst          .
      *                          *-------------------------------------*
      *                          * Codice stampante associato all'u-   *
      *                          * tente : nessuno                     *
      *                          *-------------------------------------*
           move      spaces               to   w-ute-cst-ass          .
      *                          *-------------------------------------*
      *                          * Ampiezza caratteri di default asso- *
      *                          * ciata all'utente : nessuna          *
      *                          *-------------------------------------*
           move      zero                 to   w-ute-amc-def          .
      *                          *-------------------------------------*
      *                          * Altezza interlinea di default asso- *
      *                          * ciata all'utente : nessuna          *
      *                          *-------------------------------------*
           move      zero                 to   w-ute-ali-def          .
      *                          *-------------------------------------*
      *                          * Codice stampante locale associato   *
      *                          * all'utente : nessuno                *
      *                          *-------------------------------------*
           move      spaces               to   w-ute-csl-aau          .
      *                          *-------------------------------------*
      *                          * Altri parametri stampa di uso futu- *
      *                          * ro associati all'utente : nessuno   *
      *                          *-------------------------------------*
           move      spaces               to   w-ute-aps-aau          .
      *                          *-------------------------------------*
      *                          * Data aggiornamento password         *
      *                          *-------------------------------------*
           move      zero                 to   w-ute-dat-agg          .
      *                          *-------------------------------------*
      *                          * Data ultimo utilizzo password       *
      *                          *-------------------------------------*
           move      zero                 to   w-ute-dat-uti          .
      *                          *-------------------------------------*
      *                          * Data scadenza password              *
      *                          *-------------------------------------*
           move      zero                 to   w-ute-dat-scd          .
      *                          *-------------------------------------*
      *                          * Frase di aiuto per la password      *
      *                          *-------------------------------------*
           move      spaces               to   w-ute-frs-aid          .
      *                          *-------------------------------------*
      *                          * Indirizzo e-mail utente             *
      *                          *-------------------------------------*
           move      spaces               to   w-ute-eml-ute          .
      *                          *-------------------------------------*
      *                          * Indirizzo IP o codice nodo IP       *
      *                          *-------------------------------------*
           move      spaces               to   w-ute-ipa-ute          .
      *                          *-------------------------------------*
      *                          * Default tipo stampa per l'utente    *
      *                          *-------------------------------------*
           move      spaces               to   w-ute-def-tst          .
      *                          *-------------------------------------*
      *                          * Area libera per espansioni future   *
      *                          *-------------------------------------*
           move      spaces               to   w-ute-alx-exp          .
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     let-ute-auc-999.
       let-ute-auc-200.
      *                  *---------------------------------------------*
      *                  * Se codice utente esistente                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Bufferizzazione parametri letti         *
      *                      *-----------------------------------------*
           move      auc-dat              to   w-ute                  .
      *                      *-----------------------------------------*
      *                      * Eventuali normalizzazioni               *
      *                      *-----------------------------------------*
           if        w-ute-tse-cst        not  numeric
                     move  zero           to   w-ute-tse-cst
                     move  spaces         to   w-ute-cst-ass
                     move  zero           to   w-ute-amc-def
                     move  zero           to   w-ute-ali-def
                     move  spaces         to   w-ute-csl-aau
                     move  spaces         to   w-ute-aps-aau          .
           if        w-ute-dat-agg        not  numeric
                     move  zero           to   w-ute-dat-agg          .
           if        w-ute-dat-uti        not  numeric
                     move  zero           to   w-ute-dat-uti          .
           if        w-ute-dat-scd        not  numeric
                     move  zero           to   w-ute-dat-scd          .
       let-ute-auc-999.
           exit.

      *    *===========================================================*
      *    * Lettura record di comando relativo a menu' da [auc]       *
      *    *-----------------------------------------------------------*
       cmd-mnu-auc-000.
      *              *-------------------------------------------------*
      *              * Lettura record                                  *
      *              *-------------------------------------------------*
           move      "cmd "               to   auc-tre                .
           move      w-cor-ame-cod        to   auc-kre                .
           read      auc    with no lock
                            invalid key
                            go to   cmd-mnu-auc-100.
           go to     cmd-mnu-auc-200.
       cmd-mnu-auc-100.
      *              *-------------------------------------------------*
      *              * Se record non trovato                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Status per record non trovato               *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cor-ame-exs          .
      *                  *---------------------------------------------*
      *                  * Normalizzazione area di lettura             *
      *                  *---------------------------------------------*
           move      zero                 to   w-cor-ame-tip          .
           move      spaces               to   w-cor-ame-pth          .
           move      spaces               to   w-cor-ame-sap          .
           move      spaces               to   w-cor-ame-arg          .
           move      spaces               to   w-cor-ame-set          .
           move      spaces               to   w-cor-ame-fas          .
           move      spaces               to   w-cor-ame-pro          .
           move      spaces               to   w-cor-ame-mdr          .
           move      spaces               to   w-cor-ame-pwd          .
           move      zero                 to   w-cor-ame-tut          .
           move      zero                 to   w-cor-ame-lip          .
           move      zero                 to   w-cor-ame-sts          .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     cmd-mnu-auc-999.
       cmd-mnu-auc-200.
      *              *-------------------------------------------------*
      *              * Se record trovato                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Status per record trovato                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-cor-ame-exs          .
      *                  *---------------------------------------------*
      *                  * Record letto in area di lavoro              *
      *                  *---------------------------------------------*
           move      auc-dat              to   w-cmd                  .
      *                  *---------------------------------------------*
      *                  * Composizione area di lettura da area di la- *
      *                  * voro                                        *
      *                  *---------------------------------------------*
           move      w-cmd-tip-cmd        to   w-cor-ame-tip          .
           move      w-cmd-pth-cmd        to   w-cor-ame-pth          .
           move      w-cmd-sis-cmd        to   w-cor-ame-sap          .
           move      w-cmd-are-cmd        to   w-cor-ame-arg          .
           move      w-cmd-set-cmd        to   w-cor-ame-set          .
           move      w-cmd-fas-cmd        to   w-cor-ame-fas          .
           move      w-cmd-prg-cmd        to   w-cor-ame-pro          .
           move      w-cmd-mnu-rie        to   w-cor-ame-mdr          .
           move      w-cmd-pwd-cmd        to   w-cor-ame-pwd          .
           move      w-cmd-tip-ute        to   w-cor-ame-tut          .
           move      w-cmd-liv-pro        to   w-cor-ame-lip          .
           move      w-cmd-sts-cmd        to   w-cor-ame-sts          .
       cmd-mnu-auc-999.
           exit.

      *    *===========================================================*
      *    * Lettura pagina di menu', con filtro del nome del menu'    *
      *    * per un eventuale menu' sostitutivo mediante il meccani-   *
      *    * smo dei pathnames di esecuzione sostitutivi               *
      *    *-----------------------------------------------------------*
       let-pag-mnu-000.
      *              *-------------------------------------------------*
      *              * Numero totale di pagine che compongono il menu' *
      *              * a zero                                          *
      *              *-------------------------------------------------*
           move      zero                 to   w-let-mnu-ntp          .
      *              *-------------------------------------------------*
      *              * Lettura record                                  *
      *              *-------------------------------------------------*
           move      "mnu "               to   auc-tre                .
           move      w-let-mnu-mnu        to   w-let-mnu-kmn          .
           move      w-let-mnu-kmn        to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           move      s-pat                to   w-let-mnu-kmn          .
           move      w-let-mnu-npm        to   w-let-mnu-knp          .
           move      w-let-mnu-key        to   auc-kre                .
           read      auc    with no lock
                            invalid key
                            go to   let-pag-mnu-025.
           go to     let-pag-mnu-050.
       let-pag-mnu-025.
      *              *-------------------------------------------------*
      *              * Se record non trovato                           *
      *              *-------------------------------------------------*
      *                 *----------------------------------------------*
      *                 * Normalizzazioni necessarie                   *
      *                 *----------------------------------------------*
      *                     *------------------------------------------*
      *                     * Pagina precedente : no                   *
      *                     *------------------------------------------*
           move      "N"                  to   w-let-mnu-epp          .
      *                     *------------------------------------------*
      *                     * Pagina successiva : no                   *
      *                     *------------------------------------------*
           move      "N"                  to   w-let-mnu-eps          .
      *                     *------------------------------------------*
      *                     * Zero mark points                         *
      *                     *------------------------------------------*
           move      zero                 to   w-let-mnu-nmk          .
      *                     *------------------------------------------*
      *                     * Pagina vera e propria a spaces           *
      *                     *------------------------------------------*
           move      spaces               to   w-let-mnu-avp          .
      *                     *------------------------------------------*
      *                     * Status di uscita per record non trovato  *
      *                     *------------------------------------------*
           move      "#"                  to   w-let-mnu-exs          .
      *                     *------------------------------------------*
      *                     * Uscita                                   *
      *                     *------------------------------------------*
           go to     let-pag-mnu-900.
       let-pag-mnu-050.
      *              *-------------------------------------------------*
      *              * Se record trovato                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Status di uscita per record trovato         *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-mnu-exs          .
      *                  *---------------------------------------------*
      *                  * Inizializzazione numero di mark points      *
      *                  * per la pagina                               *
      *                  *---------------------------------------------*
           move      zero                 to   w-let-mnu-nmk          .
      *                  *---------------------------------------------*
      *                  * Record in area di lavoro                    *
      *                  *---------------------------------------------*
           move      auc-dat              to   w-mnu                  .
      *                  *---------------------------------------------*
      *                  * Inizializzazione indice su linea            *
      *                  *---------------------------------------------*
           move      1                    to   w-let-mnu-i01          .
       let-pag-mnu-075.
      *                  *---------------------------------------------*
      *                  * Elaborazione pagina letta                   *
      *                  *---------------------------------------------*
       let-pag-mnu-080.
      *                      *-----------------------------------------*
      *                      * Linea vera e propria in area di lettura *
      *                      *-----------------------------------------*
           move      w-mnu-lin-mnu
                    (w-let-mnu-i01)       to   w-let-mnu-lvp
                                              (w-let-mnu-i01)         .
      *                      *-----------------------------------------*
      *                      * Se si e' a linea 1 e l'80mo carattere   *
      *                      * e' pari a '*' lo si pone a spaces       *
      *                      *-----------------------------------------*
           if        w-let-mnu-i01        not  = 01
                     go to let-pag-mnu-085.
           if        w-let-mnu-cvp (01, 80)
                                          =    "*"
                     move  spaces         to   w-let-mnu-cvp (01, 80) .
       let-pag-mnu-085.
      *                      *-----------------------------------------*
      *                      * Se non esiste mark point per questa li- *
      *                      * nea si passa alla successiva            *
      *                      *-----------------------------------------*
           if        w-mnu-mkp-mnu
                    (w-let-mnu-i01)       =    zero
                     go to let-pag-mnu-100.
      *                      *-----------------------------------------*
      *                      * Incremento numero mark points           *
      *                      *-----------------------------------------*
           add       1                    to   w-let-mnu-nmk          .
      *                      *-----------------------------------------*
      *                      * Memorizzazione numero linea assoluta    *
      *                      * per il mark point                       *
      *                      *-----------------------------------------*
           move      w-let-mnu-i01        to   w-let-mnu-lmk
                                              (w-let-mnu-nmk)         .
           add       3                    to   w-let-mnu-lmk
                                              (w-let-mnu-nmk)         .
      *                      *-----------------------------------------*
      *                      * Memorizzazione numero posizione per il  *
      *                      * mark point                              *
      *                      *-----------------------------------------*
           move      w-mnu-mkp-mnu
                    (w-let-mnu-i01)       to   w-let-mnu-pmk
                                              (w-let-mnu-nmk)         .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valore associato al mark *
      *                      * point                                   *
      *                      *-----------------------------------------*
           move      w-mnu-mkc-mnu
                    (w-let-mnu-i01)       to   w-let-mnu-vmk
                                              (w-let-mnu-nmk)         .
       let-pag-mnu-100.
      *                      *-----------------------------------------*
      *                      * Incremento indice su linea              *
      *                      *-----------------------------------------*
           add       1                    to   w-let-mnu-i01          .
      *                      *-----------------------------------------*
      *                      * Test se fine pagina                     *
      *                      *-----------------------------------------*
           if        w-let-mnu-i01        >    18
                     go to let-pag-mnu-200.
      *                      *-----------------------------------------*
      *                      * Riciclo nella pagina                    *
      *                      *-----------------------------------------*
           go to     let-pag-mnu-075.
       let-pag-mnu-200.
      *              *-------------------------------------------------*
      *              * Determinazione pagina precedente e successiva   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Segnale di pagina precedente : se si e' a   *
      *                  * pagina 1 : no; altrimenti : si              *
      *                  *---------------------------------------------*
           if        w-let-mnu-npm        =    1
                     move  "N"            to   w-let-mnu-epp
           else      move  "S"            to   w-let-mnu-epp          .
      *                  *---------------------------------------------*
      *                  * Segnale di pagina successiva                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Tentativo di lettura della pagina suc-  *
      *                      * cessiva                                 *
      *                      *-----------------------------------------*
           move      "mnu "               to   auc-tre                .
           move      w-let-mnu-mnu        to   w-let-mnu-kmn          .
           move      w-let-mnu-kmn        to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           move      s-pat                to   w-let-mnu-kmn          .
           move      w-let-mnu-npm        to   w-let-mnu-knp          .
           add       1                    to   w-let-mnu-knp          .
           move      w-let-mnu-key        to   auc-kre                .
           read      auc    with no lock
                            invalid key
                            go to   let-pag-mnu-225.
           go to     let-pag-mnu-250.
       let-pag-mnu-225.
      *                      *-----------------------------------------*
      *                      * Se record non trovato                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Pagina successiva : no              *
      *                          *-------------------------------------*
           move      "N"                  to   w-let-mnu-eps          .
           go to     let-pag-mnu-300.
       let-pag-mnu-250.
      *                      *-----------------------------------------*
      *                      * Se record trovato                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Pagina successiva : si              *
      *                          *-------------------------------------*
           move      "S"                  to   w-let-mnu-eps          .
       let-pag-mnu-300.
      *              *-------------------------------------------------*
      *              * Determinazione numero pagine totali che compon- *
      *              * gono il menu'                                   *
      *              *-------------------------------------------------*
       let-pag-mnu-310.
      *                  *---------------------------------------------*
      *                  * Se pagina precedente a No e pagina succes-  *
      *                  * siva a No si pone a 1 il numero di pagine   *
      *                  * totali                                      *
      *                  *---------------------------------------------*
           if        w-let-mnu-epp        =    "N" and
                     w-let-mnu-eps        =    "N"
                     move  1              to   w-let-mnu-ntp
                     go to let-pag-mnu-900.
       let-pag-mnu-320.
      *                  *---------------------------------------------*
      *                  * Se pagina successiva a No si pone il numero *
      *                  * di pagine totali pari al numero pagina in   *
      *                  * esame                                       *
      *                  *---------------------------------------------*
           if        w-let-mnu-eps        =    "N"
                     move  w-let-mnu-npm  to   w-let-mnu-ntp
                     go to let-pag-mnu-900.
       let-pag-mnu-330.
      *                  *---------------------------------------------*
      *                  * Altrimenti si presume inizialmente che il   *
      *                  * numero di pagine totali sia pari al numero  *
      *                  * pagina successivo a quello in esame, ed e-  *
      *                  * ventualmente si va' a correggere tale va-   *
      *                  * lore in base alla presenza o meno di pagine *
      *                  * ancora successive                           *
      *                  *---------------------------------------------*
       let-pag-mnu-340.
           move      w-let-mnu-npm        to   w-let-mnu-ntp          .
           add       1                    to   w-let-mnu-ntp          .
       let-pag-mnu-350.
           move      "mnu "               to   auc-tre                .
           move      w-let-mnu-mnu        to   w-let-mnu-kmn          .
           move      w-let-mnu-kmn        to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           move      s-pat                to   w-let-mnu-kmn          .
           move      w-let-mnu-ntp        to   w-let-mnu-knp          .
           add       1                    to   w-let-mnu-knp          .
           move      w-let-mnu-key        to   auc-kre                .
           read      auc    with no lock
                            invalid key
                            go to   let-pag-mnu-900.
           add       1                    to   w-let-mnu-ntp          .
           go to     let-pag-mnu-350.
       let-pag-mnu-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-pag-mnu-999.
       let-pag-mnu-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina con controllo se in impostazione   *
      *    * ridotta per esecuzione desk-accessory                     *
      *    *-----------------------------------------------------------*
       vis-pag-mir-000.
      *              *-------------------------------------------------*
      *              * Se non si e' in impostazione ridotta per esecu- *
      *              * zione di desk-accessory : si va' direttamente   *
      *              * alla semplice visualizzazione della pagina di   *
      *              * menu' attuale, e poi si esce                    *
      *              *-------------------------------------------------*
           if        w-exe-dac-snx-ird    not  = "S"
                     go to vis-pag-mir-500.
      *              *-------------------------------------------------*
      *              * Segnale di : non piu' in impostazione ridotta   *
      *              * di esecuzione desk-accessory                    *
      *              *-------------------------------------------------*
           move      "N"                  to   w-exe-dac-snx-ird      .
      *              *-------------------------------------------------*
      *              * Lettura del menu base, o del munu' associato    *
      *              * all'utente, pagina 1                            *
      *              *-------------------------------------------------*
           if        w-ute-mnu-ini        =    spaces
                     move  "menu  "       to   w-let-mnu-mnu
           else      move  w-ute-mnu-ini  to   w-let-mnu-mnu          .
           move      1                    to   w-let-mnu-npm          .
           perform   let-pag-mnu-000      thru let-pag-mnu-999        .
       vis-pag-mir-500.
      *              *-------------------------------------------------*
      *              * Semplice visualizzazione del menu               *
      *              *-------------------------------------------------*
           perform   vis-pag-mnu-000      thru vis-pag-mnu-999        .
       vis-pag-mir-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina di menu'                           *
      *    *-----------------------------------------------------------*
       vis-pag-mnu-000.
      *              *-------------------------------------------------*
      *              * Se si e' in impostazione ridotta perche' si e'  *
      *              * in un un desk-accessory : non si esegue alcuna  *
      *              * visualizzazione della pagina di menu' e si esce *
      *              * immediatamente                                  *
      *              *-------------------------------------------------*
           if        w-exe-dac-snx-ird    =    "S"
                     go to vis-pag-mnu-999.
      *              *-------------------------------------------------*
      *              * Video in off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Modo di utilizzo video : a 80 caratteri         *
      *              *-------------------------------------------------*
           move      "M0"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Linee 01..03                                    *
      *              *-------------------------------------------------*
           perform   vpm-001-003-000      thru vpm-001-003-999        .
      *              *-------------------------------------------------*
      *              * Linee 04..21                                    *
      *              *-------------------------------------------------*
           perform   vpm-004-021-000      thru vpm-004-021-999        .
      *              *-------------------------------------------------*
      *              * Linee 22..24                                    *
      *              *-------------------------------------------------*
           perform   vpm-022-024-000      thru vpm-022-024-999        .
      *              *-------------------------------------------------*
      *              * Video in on                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Vezzo grafico, solo 'menu' generale             *
      *              *-------------------------------------------------*
      *              *-------------------------------------------------*
      *              * ATTUALMENTE INIBITO                             *
      *              *-------------------------------------------------*
           go to     vis-pag-mnu-999.
      *              *-------------------------------------------------*
      *              * Box grafico eventuale                           *
      *              *-------------------------------------------------*
           move      "BG"                 to   v-ope                  .
           move      19                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      21                   to   v-lto                  .
           move      72                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-pag-mnu-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina di menu', linee 01..03             *
      *    *-----------------------------------------------------------*
       vpm-001-003-000.
      *              *-------------------------------------------------*
      *              * Video in off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vpm-001-003-100.
      *              *-------------------------------------------------*
      *              * Linea 01 : trattini                             *
      *              *-------------------------------------------------*
           move      01                   to   w-vis-lin-nli          .
           move      all   "="            to   w-vis-lin-cli          .
           perform   vis-lin-scr-000      thru vis-lin-scr-999        .
       vpm-001-003-200.
      *              *-------------------------------------------------*
      *              * Linea 02                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Date and time da segreteria                 *
      *                  *---------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Editing data di sistema                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      s-dat                to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-all-str-cat (4)      .
      *                  *---------------------------------------------*
      *                  * Literal giorno della settimana              *
      *                  *---------------------------------------------*
           move      "GS"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-alf (01 : 03)      to   w-all-str-cat (2)      .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      16                   to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
           move      "["                  to   w-all-str-cat (1)      .
           move      "."                  to   w-all-str-cat (3)      .
           move      "]"                  to   w-all-str-cat (5)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           perform   all-str-asx-000      thru all-str-asx-999        .
           move      w-all-str-alf        to   a-pac-rel              .
      *                  *---------------------------------------------*
      *                  * Pulizia "."                                 *
      *                  *---------------------------------------------*
           inspect   a-pac-rel     replacing
                                       first "."
                                          by   " "                    .
      *                  *---------------------------------------------*
      *                  * Composizione                                *
      *                  *---------------------------------------------*
           move      spaces               to   w-vis-mnu-l02          .
           if        w-cmd-mnu-rie        =    spaces
                     move  spaces         to   w-vis-mnu-l02-mnu
           else      move  w-let-mnu-mnu  to   w-vis-mnu-l02-mnu      .
           move      w-des-azi-adx        to   w-vis-mnu-l02-adx      .
           move      spaces               to   w-vis-mnu-l02-nps      .
           move      zero                 to   w-vis-mnu-c01          .
           inspect   a-pac-rel        tallying w-vis-mnu-c01
                                  for trailing spaces                 .
           move      1                    to   w-vis-mnu-pnt          .
           add       w-vis-mnu-c01        to   w-vis-mnu-pnt          .
           move      16                   to   w-vis-mnu-c02          .
           subtract  w-vis-mnu-c01        from w-vis-mnu-c02          .
           move      a-pac-rel
                    (1 : w-vis-mnu-c02)   to   w-vis-mnu-l02-nps
                                              (w-vis-mnu-pnt :
                                               w-vis-mnu-c02)         .
       vpm-001-003-225.
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      02                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-vis-mnu-l02        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vpm-001-003-300.
      *              *-------------------------------------------------*
      *              * Linea 03 : trattini                             *
      *              *-------------------------------------------------*
           move      03                   to   w-vis-lin-nli          .
           move      all   "="            to   w-vis-lin-cli          .
           perform   vis-lin-scr-000      thru vis-lin-scr-999        .
       vpm-001-003-400.
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vpm-001-003-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina di menu', linee 04..21             *
      *    *-----------------------------------------------------------*
       vpm-004-021-000.
      *              *-------------------------------------------------*
      *              * Video in off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vpm-004-021-100.
      *              *-------------------------------------------------*
      *              * Linee 04..21                                    *
      *              *-------------------------------------------------*
       vpm-004-021-200.
      *                  *---------------------------------------------*
      *                  * Inizializzazione indice 01..18              *
      *                  *---------------------------------------------*
           move      01                   to   w-vis-mnu-i01          .
      *                  *---------------------------------------------*
      *                  * Inizializzazione indice 04..21              *
      *                  *---------------------------------------------*
           move      04                   to   w-vis-mnu-i02          .
       vpm-004-021-300.
      *                  *---------------------------------------------*
      *                  * Visualizzazione linea                       *
      *                  *---------------------------------------------*
           move      w-vis-mnu-i02        to   w-vis-lin-nli          .
           move      w-let-mnu-lvp
                    (w-vis-mnu-i01)       to   w-vis-lin-cli          .
           perform   vis-lin-scr-000      thru vis-lin-scr-999        .
      *                  *---------------------------------------------*
      *                  * Incremento indice 01..18                    *
      *                  *---------------------------------------------*
           add       01                   to   w-vis-mnu-i01          .
      *                  *---------------------------------------------*
      *                  * Test se fine linee                          *
      *                  *---------------------------------------------*
           if        w-vis-mnu-i01        >    18
                     go to vpm-004-021-400.
      *                  *---------------------------------------------*
      *                  * Incremento indice 04..21                    *
      *                  *---------------------------------------------*
           add       01                   to   w-vis-mnu-i02          .
      *                  *---------------------------------------------*
      *                  * A linea successiva                          *
      *                  *---------------------------------------------*
           go to     vpm-004-021-300.
       vpm-004-021-400.
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vpm-004-021-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione pagina di menu', linee 22..24             *
      *    *-----------------------------------------------------------*
       vpm-022-024-000.
      *              *-------------------------------------------------*
      *              * Linea 22 : trattini                             *
      *              *-------------------------------------------------*
           move      22                   to   w-vis-lin-nli          .
           move      all   "="            to   w-vis-lin-cli          .
           perform   vis-lin-scr-000      thru vis-lin-scr-999        .
      *              *-------------------------------------------------*
      *              * Linea 23 : spaces                               *
      *              *-------------------------------------------------*
           move      23                   to   w-vis-lin-nli          .
           move      spaces               to   w-vis-lin-cli          .
           perform   vis-lin-scr-000      thru vis-lin-scr-999        .
      *              *-------------------------------------------------*
      *              * Linea 24 : note operative standard              *
      *              *-------------------------------------------------*
           perform   lin-024-std-000      thru lin-024-std-999        .
       vpm-022-024-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione linea 24 standard per pagina di menu'     *
      *    *-----------------------------------------------------------*
       lin-024-std-000.
      *              *-------------------------------------------------*
      *              * Preparazione immagine linea                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione iniziale                    *
      *                  *---------------------------------------------*
           move      spaces               to   w-vis-mnu-l24          .
      *                  *---------------------------------------------*
      *                  * Prompt per digitazione nome comando         *
      *                  *                                             *
      *                  * Se si e' in esecuzione di desk-accessory    *
      *                  * si evidenzia il livello di profondita' di   *
      *                  * esecuzione                                  *
      *                  *---------------------------------------------*
           if        o-sts                not  < "01" and
                     o-sts                not  > "99"
                     move   spaces        to   w-vis-mnu-l24-pmt
                     string "Scegliere il programma o il menu"
                                delimited by   size
                            "{Livello "
                                delimited by   size
                            o-sts
                                delimited by   size
                            "} : "
                                delimited by   size
                                          into w-vis-mnu-l24-pmt
           else      move   "Scegliere il programma o il menu : "
                                          to   w-vis-mnu-l24-pmt      .
      *                  *---------------------------------------------*
      *                  * Se il numero pagine totali per il menu' non *
      *                  * e' superiore a 1 : a visualizzazione        *
      *                  *---------------------------------------------*
           if        w-let-mnu-ntp        not  > 1
                     go to lin-024-std-100.
      *                  *---------------------------------------------*
      *                  * Numero pagina                               *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-let-mnu-npm        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-all-str-cat (2)      .
      *                  *---------------------------------------------*
      *                  * Numero di pagine totali                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      w-let-mnu-ntp        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-all-str-cat (4)      .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      05                   to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
           move      "["                  to   w-all-str-cat (1)      .
           move      "/"                  to   w-all-str-cat (3)      .
           move      "]"                  to   w-all-str-cat (5)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                  *---------------------------------------------*
      *                  * Visualizzazione Numeri pagina               *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       lin-024-std-100.
      *              *-------------------------------------------------*
      *              * Visualizzazione linea                           *
      *              *-------------------------------------------------*
           move      24                   to   w-vis-lin-nli          .
           move      w-vis-mnu-l24        to   w-vis-lin-cli          .
           perform   vis-lin-scr-000      thru vis-lin-scr-999        .
       lin-024-std-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione linea 24 a spaces                         *
      *    *-----------------------------------------------------------*
       lin-024-spc-000.
      *              *-------------------------------------------------*
      *              * Visualizzazione linea                           *
      *              *-------------------------------------------------*
           move      24                   to   w-vis-lin-nli          .
           move      spaces               to   w-vis-lin-cli          .
           perform   vis-lin-scr-000      thru vis-lin-scr-999        .
       lin-024-spc-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione linea 24 per conferma di fine lavoro      *
      *    *-----------------------------------------------------------*
       lin-024-fla-000.
      *              *-------------------------------------------------*
      *              * Visualizzazione linea                           *
      *              *-------------------------------------------------*
           move      24                   to   w-vis-lin-nli          .
           move      "Conferma fine lavoro (S - N) ? [ ]"
                                          to   w-vis-lin-cli          .
           perform   vis-lin-scr-000      thru vis-lin-scr-999        .
       lin-024-fla-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione linea                                     *
      *    *-----------------------------------------------------------*
       vis-lin-scr-000.
      *              *-------------------------------------------------*
      *              * Visualizzazione, differenziata a seconda se il  *
      *              * modo di utilizzo attuale e' a 80 o 132 colonne  *
      *              *-------------------------------------------------*
           move      "M?"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           if        v-ope                =    "M1"
                     move  132            to   w-vis-lin-car
           else      move  80             to   w-vis-lin-car          .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      w-vis-lin-car        to   v-car                  .
           move      w-vis-lin-nli        to   v-lin                  .
           move      01                   to   v-pos                  .
           move      w-vis-lin-cli        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-lin-scr-999.
           exit.

      *    *===========================================================*
      *    * Accettazione comando o menu'                              *
      *    *-----------------------------------------------------------*
       acc-cmd-mnu-000.
      *              *-------------------------------------------------*
      *              * Se si e' in esecuzione di un desk-accessory     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        w-exe-dac-snx-dac    not  = "S"
                     go to acc-cmd-mnu-005.
      *                  *---------------------------------------------*
      *                  * Si richiede l'inibizione del Save al pros-  *
      *                  * simo inizio di programma applicativo        *
      *                  *---------------------------------------------*
           move      "S0"                 to   v-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using v                      .
       acc-cmd-mnu-005.
      *              *-------------------------------------------------*
      *              * Se si e' in impostazione ridotta perche' si e'  *
      *              * in un un desk-accessory                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        w-exe-dac-snx-ird    not  = "S"
                     go to acc-cmd-mnu-010.
      *                  *---------------------------------------------*
      *                  * Si rivisualizza la linea 01 della pagina di *
      *                  * menu', per evidenziare il segnale di pro-   *
      *                  * fondita' del desk-accessory                 *
      *                  *---------------------------------------------*
           move      "FL"                 to   v-ope                  .
           move      01                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      01                   to   w-vis-lin-nli          .
           move      v-alf                to   w-vis-lin-cli          .
           perform   vis-lin-scr-000      thru vis-lin-scr-999        .
      *                  *---------------------------------------------*
      *                  * Si visualizzano le linee 22..24 della pa-   *
      *                  * gina di menu'                               *
      *                  *---------------------------------------------*
           perform   vpm-022-024-000      thru vpm-022-024-999        .
       acc-cmd-mnu-010.
      *              *-------------------------------------------------*
      *              * Determinazione linea di accettazione : 024      *
      *              *-------------------------------------------------*
           move      024                  to   w-acc-com-lac          .
      *              *-------------------------------------------------*
      *              * Determinazione posizione di accettazione : una  *
      *              * posizione oltre il carattere ":"                *
      *              *-------------------------------------------------*
           move      "FL"                 to   v-ope                  .
           move      24                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      zero                 to   w-acc-com-pac          .
           inspect   v-alf            tallying w-acc-com-pac
                     for   characters   before initial   ":"          .
           add       3                    to   w-acc-com-pac          .
           if        w-acc-com-pac        >    75
                     move  75             to   w-acc-com-pac          .
       acc-cmd-mnu-025.
      *              *-------------------------------------------------*
      *              * Accettazione a linea 24                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Indice per mark point a zero                *
      *                  *---------------------------------------------*
           move      zero                 to   w-acc-com-i01          .
      *                  *---------------------------------------------*
      *                  * Se si e' in esecuzione di un desk-accesso-  *
      *                  * ri non si eseguono i controlli seguenti     *
      *                  *---------------------------------------------*
           if        w-exe-dac-snx-dac    =    "S"
                     go to acc-cmd-mnu-027.
      *                  *---------------------------------------------*
      *                  * Controllo terminazione background           *
      *                  *---------------------------------------------*
           perform   cnt-ter-bkg-000      thru cnt-ter-bkg-999        .
      *                  *---------------------------------------------*
      *                  * Controllo fra max numero utenti abilitati e *
      *                  * numero progressivo utente in uso            *
      *                  *---------------------------------------------*
           perform   cnt-nut-npu-000      thru cnt-nut-npu-999        .
      *                  *---------------------------------------------*
      *                  * Controllo su data di scadenza licenza d'uso *
      *                  *---------------------------------------------*
           perform   cnt-scd-lcu-000      thru cnt-scd-lcu-999        .
      *                  *---------------------------------------------*
      *                  * Determinazione esistenza print-files per    *
      *                  * l'utente in uso, per l'azienda in uso, di   *
      *                  * tipo 'e-mail'                               *
      *                  *---------------------------------------------*
           perform   acc-cmd-mnu-mbx-000  thru acc-cmd-mnu-mbx-999    .
       acc-cmd-mnu-027.
      *                  *---------------------------------------------*
      *                  * Accettazione                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Parametri generali                      *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "L"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      w-acc-com-lac        to   v-lin                  .
           move      w-acc-com-pac        to   v-pos                  .
           move      spaces               to   v-alf                  .
      *                      *-----------------------------------------*
      *                      * Function keys                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Up                                  *
      *                          *-------------------------------------*
           if        w-let-mnu-nmk        >    zero
                     move  "UP  "         to   v-pfk (01)             .
      *                          *-------------------------------------*
      *                          * Find                                *
      *                          *-------------------------------------*
           move      "FIND"               to   v-pfk (03)             .
      *                          *-------------------------------------*
      *                          * Do                                  *
      *                          *-------------------------------------*
           move      "DO  "               to   v-pfk (05)             .
      *                          *-------------------------------------*
      *                          * Prsc                                *
      *                          *-------------------------------------*
           if        w-let-mnu-epp        =    "S"
                     move  "PRSC"         to   v-pfk (07)             .
      *                          *-------------------------------------*
      *                          * Nxsc                                *
      *                          *-------------------------------------*
           if        w-let-mnu-eps        =    "S"
                     move  "NXSC"         to   v-pfk (08)             .
      *                          *-------------------------------------*
      *                          * Prnt                                *
      *                          *-------------------------------------*
           move      "PRNT"               to   v-pfk (11)             .
      *                          *-------------------------------------*
      *                          * Pf1                                 *
      *                          *-------------------------------------*
           move      "[1] "               to   v-pfk (14)             .
      *                          *-------------------------------------*
      *                          * Pf2                                 *
      *                          *-------------------------------------*
           move      "[2] "               to   v-pfk (15)             .
      *                          *-------------------------------------*
      *                          * Pf3                                 *
      *                          *-------------------------------------*
           move      "[3] "               to   v-pfk (16)             .
      *                          *-------------------------------------*
      *                          * Pf4                                 *
      *                          *-------------------------------------*
           move      "[4] "               to   v-pfk (17)             .
      *                          *-------------------------------------*
      *                          * Select                              *
      *                          *-------------------------------------*
           move      "SLCT"               to   v-pfk (18)             .
      *                          *-------------------------------------*
      *                          * Exit                                *
      *                          *-------------------------------------*
           move      "EXIT"               to   v-pfk (20)             .
       acc-cmd-mnu-030.
      *                      *-----------------------------------------*
      *                      * Richiamo modulo video                   *
      *                      *-----------------------------------------*
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Salvataggio impostazione e function key         *
      *              *-------------------------------------------------*
           move      v-alf                to   w-acc-com-com          .
           move      v-key                to   w-acc-com-key          .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda della function key in im-  *
      *              * postazione nome comando o menu'                 *
      *              *-------------------------------------------------*
           if        v-key                =    spaces or
                     v-key                =    "DO  "
                     go to acc-cmd-mnu-150
           else if   v-key                =    "UP  "
                     go to acc-cmd-mnu-050
           else if   v-key                =    "EXIT"
                     go to acc-cmd-mnu-080
           else if   v-key                =    "PRSC"
                     go to acc-cmd-mnu-070
           else if   v-key                =    "NXSC"
                     go to acc-cmd-mnu-075
           else if   v-key                =    "PRNT"
                     go to acc-cmd-mnu-035
           else if   v-key                =    "FIND"
                     go to acc-cmd-mnu-033
           else if   v-key                =    "[1] "
                     go to acc-cmd-mnu-040
           else if   v-key                =    "[2] "
                     go to acc-cmd-mnu-042
           else if   v-key                =    "[3] "
                     go to acc-cmd-mnu-043
           else if   v-key                =    "[4] "
                     go to acc-cmd-mnu-044
           else if   v-key                =    "SLCT"
                     go to acc-cmd-mnu-045
           else      go to acc-cmd-mnu-025.
       acc-cmd-mnu-033.
      *              *-------------------------------------------------*
      *              * Se tasto Find                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se si e' in esecuzione *
      *                  * di desk-accessory                           *
      *                  *---------------------------------------------*
           if        w-exe-dac-snx-ird    =    "S"
                     go to acc-cmd-mnu-034.
      *                  *---------------------------------------------*
      *                  * Find su codici comando                      *
      *                  *---------------------------------------------*
           move      w-acc-com-com        to   w-fnd-auc-cmd-cod      .
           perform   fnd-auc-cmd-000      thru fnd-auc-cmd-999        .
      *                  *---------------------------------------------*
      *                  * Se nessuna selezione : reimpostazione       *
      *                  *---------------------------------------------*
           if        w-fnd-auc-cmd-sel    not  = spaces
                     go to acc-cmd-mnu-000.
      *                  *---------------------------------------------*
      *                  * Memorizzazione codice selezionato           *
      *                  *---------------------------------------------*
           move      w-fnd-auc-cmd-cod    to   w-acc-com-com          .
      *                  *---------------------------------------------*
      *                  * A trattamento Return                        *
      *                  *---------------------------------------------*
           go to     acc-cmd-mnu-150.
       acc-cmd-mnu-034.
      *                  *---------------------------------------------*
      *                  * Modo di utilizzo video : a 80 caratteri     *
      *                  *---------------------------------------------*
           move      "M0"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione pagina con controllo se in  *
      *                  * impostazione ridotta per esecuzione di un   *
      *                  * desk-accessory                              *
      *                  *---------------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                  *---------------------------------------------*
      *                  * Riciclo a inizio accettazione               *
      *                  *---------------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-035.
      *              *-------------------------------------------------*
      *              * Se tasto Prnt                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Simulazione di impostazione di '.p'         *
      *                  *---------------------------------------------*
           move      ".p"                 to   w-acc-com-com          .
      *                  *---------------------------------------------*
      *                  * Forzatura tasto Return                      *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A trattamento Return                        *
      *                  *---------------------------------------------*
           go to     acc-cmd-mnu-150.
       acc-cmd-mnu-040.
      *              *-------------------------------------------------*
      *              * Se tasto Pf1                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Simulazione di impostazione di '.t', rubri- *
      *                  * ca telefonica                               *
      *                  *---------------------------------------------*
           move      ".t"                 to   w-acc-com-com          .
      *                  *---------------------------------------------*
      *                  * Forzatura tasto Return                      *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A trattamento Return                        *
      *                  *---------------------------------------------*
           go to     acc-cmd-mnu-150.
       acc-cmd-mnu-042.
      *              *-------------------------------------------------*
      *              * Se tasto Pf2                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Simulazione di impostazione di '.m', mes-   *
      *                  * saggi tra utenti                            *
      *                  *---------------------------------------------*
           move      ".m"                 to   w-acc-com-com          .
      *                  *---------------------------------------------*
      *                  * Forzatura tasto Return                      *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A trattamento Return                        *
      *                  *---------------------------------------------*
           go to     acc-cmd-mnu-150.
       acc-cmd-mnu-043.
      *              *-------------------------------------------------*
      *              * Se tasto Pf3                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Simulazione di impostazione di '.u', cambio *
      *                  * utente                                      *
      *                  *---------------------------------------------*
           move      ".u"                 to   w-acc-com-com          .
      *                  *---------------------------------------------*
      *                  * Forzatura tasto Return                      *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A trattamento Return                        *
      *                  *---------------------------------------------*
           go to     acc-cmd-mnu-150.
       acc-cmd-mnu-044.
      *              *-------------------------------------------------*
      *              * Se tasto Pf4                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Simulazione di impostazione di '.a', cambio *
      *                  * azienda                                     *
      *                  *---------------------------------------------*
           move      ".a"                 to   w-acc-com-com          .
      *                  *---------------------------------------------*
      *                  * Forzatura tasto Return                      *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A trattamento Return                        *
      *                  *---------------------------------------------*
           go to     acc-cmd-mnu-150.
       acc-cmd-mnu-045.
      *              *-------------------------------------------------*
      *              * Se tasto Select                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Simulazione di impostazione di '.r',        *
      *                  * programmi recenti                           *
      *                  *---------------------------------------------*
           move      ".r"                 to   w-acc-com-com          .
      *                  *---------------------------------------------*
      *                  * Forzatura tasto Return                      *
      *                  *---------------------------------------------*
           move      spaces               to   v-key                  .
      *                  *---------------------------------------------*
      *                  * A trattamento Return                        *
      *                  *---------------------------------------------*
           go to     acc-cmd-mnu-150.
       acc-cmd-mnu-050.
      *              *-------------------------------------------------*
      *              * Se tasto Up                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Visualizzazione linea 24 a spaces           *
      *                  *---------------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *                  *---------------------------------------------*
      *                  * Posizionamento su ultimo mark point         *
      *                  *---------------------------------------------*
           move      w-let-mnu-nmk        to   w-acc-com-i01          .
       acc-cmd-mnu-055.
      *                  *---------------------------------------------*
      *                  * Controllo terminazione esecuzione in back-  *
      *                  * ground                                      *
      *                  *---------------------------------------------*
           perform   cnt-ter-bkg-000      thru cnt-ter-bkg-999        .
      *                  *---------------------------------------------*
      *                  * Cursore supplementare                       *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      w-let-mnu-lmk
                    (w-acc-com-i01)       to   v-lin                  .
           move      04                   to   v-pos                  .
           move      "====>"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Codice comando in Bold, se in modalita'     *
      *                  * grafica                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se modalita' grafica               *
      *                      *-----------------------------------------*
           if        w-psg-snx-box        not  = "S"
                     go to acc-cmd-mnu-056.
      *                      *-----------------------------------------*
      *                      * Visualizzazione in Bold                 *
      *                      *-----------------------------------------*
           display   w-let-mnu-vmk
                    (w-acc-com-i01)       bold
                                          line w-let-mnu-lmk
                                              (w-acc-com-i01)
                                          position 11                 .
      *                      *-----------------------------------------*
      *                      * Ad accettazione function key            *
      *                      *-----------------------------------------*
           go to     acc-cmd-mnu-057.
       acc-cmd-mnu-056.
      *                  *---------------------------------------------*
      *                  * Codice comando in uppercase                 *
      *                  *---------------------------------------------*
           move      06                   to   w-all-str-lun          .
           move      w-let-mnu-vmk
                    (w-acc-com-i01)       to   w-all-str-alf          .
           perform   all-str-upp-000      thru all-str-upp-999        .

           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      w-let-mnu-lmk
                    (w-acc-com-i01)       to   v-lin                  .
           move      11                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-cmd-mnu-057.
      *                  *---------------------------------------------*
      *                  * Accettazione function key in mark point     *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      w-let-mnu-lmk
                    (w-acc-com-i01)       to   v-lin                  .
           move      w-let-mnu-pmk
                    (w-acc-com-i01)       to   v-pos                  .
           if        w-acc-com-i01        >    1
                     move  "UP  "         to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-let-mnu-epp        =    "S"
                     move  "PRSC"         to   v-pfk (07)             .
           if        w-let-mnu-eps        =    "S"
                     move  "NXSC"         to   v-pfk (08)             .
           move      "SLCT"               to   v-pfk (10)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione function key                *
      *                  *---------------------------------------------*
           if        v-key                =    spaces
                     move  "SLCT"         to   v-key                  .
      *                  *---------------------------------------------*
      *                  * Salvataggio function key                    *
      *                  *---------------------------------------------*
           move      v-key                to   w-acc-com-key          .
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda della function key in  *
      *                  * mark point                                  *
      *                  *---------------------------------------------*
           if        v-key                =    "SLCT"
                     go to acc-cmd-mnu-145
           else if   v-key                =    "UP  "
                     go to acc-cmd-mnu-060
           else if   v-key                =    spaces or
                     v-key                =    "DOWN"
                     go to acc-cmd-mnu-065
           else if   v-key                =    "EXIT"
                     go to acc-cmd-mnu-080
           else if   v-key                =    "PRSC"
                     go to acc-cmd-mnu-070
           else if   v-key                =    "NXSC"
                     go to acc-cmd-mnu-075
           else      go to acc-cmd-mnu-050.
       acc-cmd-mnu-060.
      *                  *---------------------------------------------*
      *                  * Se tasto Up da mark point                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cursore supplementare a spazi           *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      w-let-mnu-lmk
                    (w-acc-com-i01)       to   v-lin                  .
           move      04                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Codice comando in lowercase             *
      *                      *-----------------------------------------*
           move      06                   to   w-all-str-lun          .
           move      w-let-mnu-vmk
                    (w-acc-com-i01)       to   w-all-str-alf          .
           perform   all-str-low-000      thru all-str-low-999        .

           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      w-let-mnu-lmk
                    (w-acc-com-i01)       to   v-lin                  .
           move      11                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Decremento indice per mark point        *
      *                      *-----------------------------------------*
           subtract  1                    from w-acc-com-i01          .
      *                      *-----------------------------------------*
      *                      * A reimpostazione in mark point          *
      *                      *-----------------------------------------*
           go to     acc-cmd-mnu-055.
       acc-cmd-mnu-065.
      *                  *---------------------------------------------*
      *                  * Se tasto Down  o Return da mark point       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cursore supplementare a spazi           *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      05                   to   v-car                  .
           move      w-let-mnu-lmk
                    (w-acc-com-i01)       to   v-lin                  .
           move      04                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Codice comando in lowercase             *
      *                      *-----------------------------------------*
           move      06                   to   w-all-str-lun          .
           move      w-let-mnu-vmk
                    (w-acc-com-i01)       to   w-all-str-alf          .
           perform   all-str-low-000      thru all-str-low-999        .

           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      w-let-mnu-lmk
                    (w-acc-com-i01)       to   v-lin                  .
           move      11                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Incremento indice per mark point        *
      *                      *-----------------------------------------*
           add       1                    to   w-acc-com-i01          .
      *                      *-----------------------------------------*
      *                      * Se non oltre ultimo mark point : rici-  *
      *                      * clo ad accettazione su mark point       *
      *                      *-----------------------------------------*
           if        w-acc-com-i01        not  > w-let-mnu-nmk
                     go to acc-cmd-mnu-055.
      *                      *-----------------------------------------*
      *                      * Se oltre ultimo mark point              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Rivisualizzazione note operative    *
      *                          * standard a linea 24                 *
      *                          *-------------------------------------*
           perform   lin-024-std-000      thru lin-024-std-999        .
      *                          *-------------------------------------*
      *                          * A reimpostazione comando o menu'    *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-025.
       acc-cmd-mnu-070.
      *              *-------------------------------------------------*
      *              * Se tasto Prsc, anche da mark point              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura della pagina precedente del  menu'  *
      *                  *---------------------------------------------*
           subtract  1                    from w-let-mnu-npm          .
           perform   let-pag-mnu-000      thru let-pag-mnu-999        .
      *                  *---------------------------------------------*
      *                  * Visualizzazione pagina del menu'            *
      *                  *---------------------------------------------*
           perform   vis-pag-mnu-000      thru vis-pag-mnu-999        .
      *                  *---------------------------------------------*
      *                  * Rientro ad accettazione comando o menu'     *
      *                  *---------------------------------------------*
           go to     acc-cmd-mnu-025.
       acc-cmd-mnu-075.
      *              *-------------------------------------------------*
      *              * Se tasto Nxsc, anche da mark point              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura della pagina successiva del  menu'  *
      *                  *---------------------------------------------*
           add       1                    to   w-let-mnu-npm          .
           perform   let-pag-mnu-000      thru let-pag-mnu-999        .
      *                  *---------------------------------------------*
      *                  * Visualizzazione pagina del menu'            *
      *                  *---------------------------------------------*
           perform   vis-pag-mnu-000      thru vis-pag-mnu-999        .
      *                  *---------------------------------------------*
      *                  * Rientro ad accettazione comando o menu'     *
      *                  *---------------------------------------------*
           go to     acc-cmd-mnu-025.
       acc-cmd-mnu-080.
      *              *-------------------------------------------------*
      *              * Se tasto Exit, anche da mark point              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se esiste un menu' di rientro o se si  *
      *                  * deve chiedere conferma di fine lavoro       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se il nome del menu' attuale e' 'menu'  *
      *                      * si chiede senz'altro la conferma di fi- *
      *                      * ne lavoro                               *
      *                      *-----------------------------------------*
           if        w-let-mnu-mnu        =    "menu  "
                     go to acc-cmd-mnu-085.
      *                      *-----------------------------------------*
      *                      * Se il nome del menu' attuale e' pari al *
      *                      * menu' associato all'utente si chiede    *
      *                      * senz'altro la conferma di fine lavoro   *
      *                      *-----------------------------------------*
           if        w-let-mnu-mnu        =    w-ute-mnu-ini
                     go to acc-cmd-mnu-085.
      *                      *-----------------------------------------*
      *                      * Se non esiste un record relativo al me- *
      *                      * nu' attuale tra i comandi si chiede la  *
      *                      * conferma di fine lavoro                 *
      *                      *-----------------------------------------*
           if        w-cor-ame-exs        not  = spaces
                     go to acc-cmd-mnu-085.
      *                      *-----------------------------------------*
      *                      * Se il record relativo al menu' attuale  *
      *                      * tra i comandi esiste ma non e' di tipo  *
      *                      * menu' si chiede la conferma di fine la- *
      *                      * voro                                    *
      *                      *-----------------------------------------*
           if        w-cor-ame-tip        not  = 01
                     go to acc-cmd-mnu-085.
      *                      *-----------------------------------------*
      *                      * Se non esiste un menu' di rientro rela- *
      *                      * tivo al menu' attuale si chiede la con- *
      *                      * ferma di fine lavoro                    *
      *                      *-----------------------------------------*
           if        w-cor-ame-mdr        =    spaces
                     go to acc-cmd-mnu-085.
      *                      *-----------------------------------------*
      *                      * Altrimenti si esegue il cambio di menu' *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Nome del menu' di rientro in area   *
      *                          * di accettazione                     *
      *                          *-------------------------------------*
           move      w-cor-ame-mdr        to   w-acc-com-com          .
      *                          *-------------------------------------*
      *                          * Prosecuzione come se il valore del  *
      *                          * menu' di rientro fosse stato impo-  *
      *                          * stato a linea 24                    *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-150.
       acc-cmd-mnu-085.
      *              *-------------------------------------------------*
      *              * Richiesta di conferma di fine lavoro            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se il livello di profondita' applicativa e' *
      *                  * maggiore di zero significa che il menu' e'  *
      *                  * stato richiamato come sottoprogramma, per-  *
      *                  * tanto non si chiede conferma di fine lavoro *
      *                  * e si esce con status di uscita a : fine     *
      *                  *---------------------------------------------*
           if        w-liv-prf-liv        >    zero
                     move  "##"           to   x-sts
                     go to acc-cmd-mnu-999.
      *                  *---------------------------------------------*
      *                  * Se si e' in esecuzione di un desk-accessory *
      *                  * non si chiede conferma di fine lavoro e si  *
      *                  * esce con status di uscita a : fine          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiesta del livello di esecuzione re- *
      *                      * lativo ai desk-accessories              *
      *                      *-----------------------------------------*
           move      "LD"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        o-sts                not  < "01" and
                     o-sts                not  > "99"
                     move  "##"           to   x-sts
                     go to acc-cmd-mnu-999.
      *                  *---------------------------------------------*
      *                  * Note operative a linea 24                   *
      *                  *---------------------------------------------*
           perform   lin-024-fla-000      thru lin-024-fla-999        .
      *                  *---------------------------------------------*
      *                  * Determinazione posizione di accettazione    *
      *                  *---------------------------------------------*
           if        w-acc-com-paf        not  = zero
                     go to acc-cmd-mnu-090.
           move      "FL"                 to   v-ope                  .
           move      24                   to   v-lin                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      zero                 to   w-acc-com-paf          .
           inspect   v-alf            tallying w-acc-com-paf
                     for   characters   before initial   "["          .
           add       2                    to   w-acc-com-paf          .
           if        w-acc-com-paf        >    80
                     move  80             to   w-acc-com-paf          .
       acc-cmd-mnu-090.
      *                  *---------------------------------------------*
      *                  * Preparazione default                        *
      *                  *---------------------------------------------*
           move      spaces               to   v-alf                  .
       acc-cmd-mnu-095.
      *                  *---------------------------------------------*
      *                  * Accettazione carattere di conferma          *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      w-acc-com-paf        to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Se Up : forzatura della risposta 'N'        *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     move  "N"            to   v-alf                  .
      *                  *---------------------------------------------*
      *                  * Se Exit : forzatura della risposta 'S'      *
      *                  *---------------------------------------------*
           if        v-key                =    "EXIT"
                     move  "S"            to   v-alf                  .
      *                  *---------------------------------------------*
      *                  * Test su risposta                            *
      *                  *---------------------------------------------*
           if        v-alf                =    "N"
                     go to acc-cmd-mnu-100
           else if   v-alf                =    "S"
                     go to acc-cmd-mnu-115
           else      go to acc-cmd-mnu-095.
       acc-cmd-mnu-100.
      *                  *---------------------------------------------*
      *                  * Se risposta 'N' a conferma di fine lavoro   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda se si era in un    *
      *                      * mark point oppure a piede video         *
      *                      *-----------------------------------------*
           if        w-acc-com-i01        >    zero
                     go to acc-cmd-mnu-105
           else      go to acc-cmd-mnu-110.
       acc-cmd-mnu-105.
      *                      *-----------------------------------------*
      *                      * Se si era in un mark point              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Linea 24 a spaces                   *
      *                          *-------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *                          *-------------------------------------*
      *                          * Ad accettazione in mark point       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-055.
       acc-cmd-mnu-110.
      *                      *-----------------------------------------*
      *                      * Se si era a piede video                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Linea 24 standard                   *
      *                          *-------------------------------------*
           perform   lin-024-std-000      thru lin-024-std-999        .
      *                          *-------------------------------------*
      *                          * Ad accettazione comando o menu'     *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-025.
       acc-cmd-mnu-115.
      *                  *---------------------------------------------*
      *                  * Se risposta 'S' a conferma di fine lavoro   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Aggiornamento promemoria da segreteria  *
      *                      *-----------------------------------------*
           perform   agg-ute-upr-000      thru agg-ute-upr-999        .
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione della presenza o *
      *                      * no di background in esecuzione          *
      *                      *-----------------------------------------*
           if        w-snx-bkg-snx        =    "N"
                     go to acc-cmd-mnu-120
           else      go to acc-cmd-mnu-125.
       acc-cmd-mnu-120.
      *                      *-----------------------------------------*
      *                      * Se non ci sono background in esecuzione *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Linea 24 a spaces                   *
      *                          *-------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *                          *-------------------------------------*
      *                          * Status globale di uscita a segnale  *
      *                          * di fine lavoro                      *
      *                          *-------------------------------------*
           move      "##"                 to   x-sts                  .
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-999.
       acc-cmd-mnu-125.
      *                      *-----------------------------------------*
      *                      * Se ci sono background in esecuzione     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test su status del background       *
      *                          *-------------------------------------*
           perform   tst-sts-bkg-000      thru tst-sts-bkg-999        .
      *                          *-------------------------------------*
      *                          * Deviazione in funzione dello status *
      *                          * del background                      *
      *                          *-------------------------------------*
           if        w-snx-bkg-sts        =    "N"
                     go to acc-cmd-mnu-130
           else if   w-snx-bkg-sts        =    "S"
                     go to acc-cmd-mnu-135
           else if   w-snx-bkg-sts        =    "T"
                     go to acc-cmd-mnu-140
           else      go to acc-cmd-mnu-095.
       acc-cmd-mnu-130.
      *                              *---------------------------------*
      *                              * Se non ci sono attualmente      *
      *                              * backgrounds in esecuzione       *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Linea 24 a spaces           *
      *                                  *-----------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *                                  *-----------------------------*
      *                                  * Status globale di uscita a  *
      *                                  * segnale di fine lavoro      *
      *                                  *-----------------------------*
           move      "##"                 to   x-sts                  .
      *                                  *-----------------------------*
      *                                  * Uscita                      *
      *                                  *-----------------------------*
           go to     acc-cmd-mnu-999.
       acc-cmd-mnu-135.
      *                              *---------------------------------*
      *                              * Se ci sono attualmente back-    *
      *                              * grounds in esecuzione non anco- *
      *                              * ra terminati                    *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Save video                  *
      *                                  *-----------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                  *-----------------------------*
      *                                  * Visualizzazione informazio- *
      *                                  * ni sul programma in back-   *
      *                                  * ground                      *
      *                                  *-----------------------------*
           perform   vis-inf-bkg-000      thru vis-inf-bkg-999        .
      *                                  *-----------------------------*
      *                                  * Restore video               *
      *                                  *-----------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                  *-----------------------------*
      *                                  * Ritorno a mark point oppure *
      *                                  * a piede video               *
      *                                  *-----------------------------*
           go to     acc-cmd-mnu-100.
       acc-cmd-mnu-140.
      *                              *---------------------------------*
      *                              * Se ci sono attualmente back-    *
      *                              * grounds in esecuzione che sono  *
      *                              * terminati                       *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Controllo sulla terminazio- *
      *                                  * ne del background           *
      *                                  *-----------------------------*
           perform   cnt-ter-bkg-000      thru cnt-ter-bkg-999        .
      *                                  *-----------------------------*
      *                                  * Rientro a richiesta di con- *
      *                                  * ferma di fine lavoro        *
      *                                  *-----------------------------*
           go to     acc-cmd-mnu-085.
       acc-cmd-mnu-145.
      *                  *---------------------------------------------*
      *                  * Se Slct da mark point                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Valore associato al mark point in area  *
      *                      * di accettazione                         *
      *                      *-----------------------------------------*
           move      w-let-mnu-vmk
                    (w-acc-com-i01)       to   w-acc-com-com          .
           move      spaces               to   w-acc-com-key          .
      *                      *-----------------------------------------*
      *                      * Prosecuzione come se il valore associa- *
      *                      * to al mark point fosse stato impostato  *
      *                      * a linea 24                              *
      *                      *-----------------------------------------*
           go to     acc-cmd-mnu-150.
       acc-cmd-mnu-150.
      *              *-------------------------------------------------*
      *              * Trattamento di una impostazione di comando o di *
      *              * menu', oppure di selezione da mark point, oppu- *
      *              * re di menu' di rientro                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se valore a 'stop'                     *
      *                  *---------------------------------------------*
           if        w-acc-com-com        =    "stop"
                     go to acc-cmd-mnu-085.
      *                  *---------------------------------------------*
      *                  * Test se valore a spaces                     *
      *                  *---------------------------------------------*
           if        w-acc-com-com        not  = spaces
                     go to acc-cmd-mnu-160.
       acc-cmd-mnu-155.
      *                  *---------------------------------------------*
      *                  * Se valore a spaces impostato : Spaces       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se si e' in un mark-point si ricicla ad *
      *                      * accettazione da mark-point              *
      *                      *-----------------------------------------*
           if        w-acc-com-i01        >    zero
                     go to acc-cmd-mnu-055.
      *                      *-----------------------------------------*
      *                      * Se si e' a linea 24                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se si in impostazione ridotta per   *
      *                          * esecuzione di un desk-accessory :   *
      *                          * si esce                             *
      *                          *-------------------------------------*
           if        w-exe-dac-snx-ird    =    "S"
                     move  "##"           to   x-sts
                     go to acc-cmd-mnu-999.
      *                          *-------------------------------------*
      *                          * altrimenti si ricicla all'imposta-  *
      *                          * zione a linea 24                    *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-025.
       acc-cmd-mnu-160.
      *                  *---------------------------------------------*
      *                  * Test se blanks embedded nel comando o menu' *
      *                  *---------------------------------------------*
           move      w-acc-com-com        to   w-acc-com-wbe          .
           move      zero                 to   w-acc-com-wct          .
           inspect   w-acc-com-wbe    tallying w-acc-com-wct
                     for characters     before initial   " "          .
       acc-cmd-mnu-165.
           add       1                    to   w-acc-com-wct          .
           if        w-acc-com-wct        >    06
                     go to acc-cmd-mnu-170.
           if        w-acc-com-wbc
                    (w-acc-com-wct)       =    spaces
                     go to acc-cmd-mnu-165.
      *                  *---------------------------------------------*
      *                  * Se ci sono blanks embedded nel comando o    *
      *                  * menu' si rientra all'accettazione a linea   *
      *                  * 24 oppure all'accettazione al mark point    *
      *                  *---------------------------------------------*
           if        w-acc-com-i01        >    zero
                     go to acc-cmd-mnu-055
           else      go to acc-cmd-mnu-025.
       acc-cmd-mnu-170.
      *                  *---------------------------------------------*
      *                  * Test se si tratta di una funzione speciale  *
      *                  * built-in oppure se di un comando o menu'    *
      *                  *---------------------------------------------*
           if        w-acc-com-wbc (01)   =    "." or
                     w-acc-com-wbc (01)   =    "-" or
                     w-acc-com-wbc (01)   =    "?"
                     go to acc-cmd-mnu-400.
       acc-cmd-mnu-175.
      *                  *---------------------------------------------*
      *                  * Se si tratta di un comando o menu'          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura del comando                     *
      *                      *-----------------------------------------*
           move      "cmd "               to   auc-tre                .
           move      w-acc-com-com        to   auc-kre                .
           read      auc    with no lock
                            invalid key
                            go to   acc-cmd-mnu-180.
           go to     acc-cmd-mnu-185.
       acc-cmd-mnu-180.
      *                      *-----------------------------------------*
      *                      * Se record comando non esistente         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Messaggio di errore con accettazio- *
      *                          * ne di presa visione                 *
      *                          *-------------------------------------*
      
           move      "ME"                 to   v-ope                  .
      *
           move      spaces               to   v-not                  .
           string    "Comando '"
                                delimited by   size
                     w-acc-com-com
                                delimited by   spaces
                     "' non esistente !  "
                                delimited by   size
                                          into v-not                  .
      *
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Rientro all'accettazione a linea 24 *
      *                          * oppure  all accettazione al mark    *
      *                          * point                               *
      *                          *-------------------------------------*
           if        w-acc-com-i01        >    zero
                     go to acc-cmd-mnu-055
           else      go to acc-cmd-mnu-025.
       acc-cmd-mnu-185.
      *                      *-----------------------------------------*
      *                      * Se record comando esistente             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Record letto in area di lavoro      *
      *                          *-------------------------------------*
           move      auc-dat              to   w-cmd                  .
      *                          *-------------------------------------*
      *                          * Test su tipo comando                *
      *                          *-------------------------------------*
           if        w-cmd-tip-cmd        =    00
                     go to acc-cmd-mnu-200
           else if   w-cmd-tip-cmd        =    01
                     go to acc-cmd-mnu-300
           else if   w-cmd-tip-cmd        =    99
                     go to acc-cmd-mnu-190
           else      go to acc-cmd-mnu-195.
       acc-cmd-mnu-190.
      *                          *-------------------------------------*
      *                          * Se il tipo comando indica un alias  *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Simulazione di impostazione del *
      *                              * comando corrispondente a quello *
      *                              * indicato dall'alias             *
      *                              *---------------------------------*
           move      w-cmd-pth-cmd        to   w-acc-com-com          .
      *                              *---------------------------------*
      *                              * A rilettura nuovo comando       *
      *                              *---------------------------------*
           go to     acc-cmd-mnu-175.
       acc-cmd-mnu-195.
      *                          *-------------------------------------*
      *                          * Se il tipo comando non indica ne'   *
      *                          * un task ne' un menu' ne' un alias   *
      *                          * si emette un messaggio di errore    *
      *                          * con accettazione di presa visione   *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Save video                      *
      *                              *---------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Video in Off                    *
      *                              *---------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Box vuoto                       *
      *                              *---------------------------------*
           move      "BX"                 to   v-ope                  .
           move      10                   to   v-lin                  .
           move      15                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      65                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Messaggio interno al box        *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "Formato interno del comando '"
                                delimited by   size
                     w-acc-com-com
                                delimited by   spaces
                     "' errato !  "
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Video in On                     *
      *                              *---------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Accettazione presa visione      *
      *                              *---------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      12                   to   v-lin                  .
           move      63                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Restore video                   *
      *                              *---------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Rientro all'accettazione a linea 24 *
      *                          * oppure  all accettazione al mark    *
      *                          * point                               *
      *                          *-------------------------------------*
           if        w-acc-com-i01        >    zero
                     go to acc-cmd-mnu-055
           else      go to acc-cmd-mnu-025.
       acc-cmd-mnu-200.
      *                          *-------------------------------------*
      *                          * Se tipo comando : task              *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Test che il pathname di esecu-  *
      *                              * zione sia diverso da spaces     *
      *                              *---------------------------------*
           if        w-cmd-pth-cmd        =    spaces
                     go to acc-cmd-mnu-195.
      *                              *---------------------------------*
      *                              * Tipo uscita : "T "              *
      *                              *---------------------------------*
           move      "T "                 to   x-sts                  .
      *                              *---------------------------------*
      *                              * Nome del menu' attuale in area  *
      *                              * di uscita                       *
      *                              *---------------------------------*
           move      w-let-mnu-mnu        to   x-mnu                  .
      *                              *---------------------------------*
      *                              * Numero pagina del menu' attuale *
      *                              * in area di uscita               *
      *                              *---------------------------------*
           move      w-let-mnu-npm        to   x-npm                  .
      *                              *---------------------------------*
      *                              * Nome del comando in area di u-  *
      *                              * scita                           *
      *                              *---------------------------------*
           move      w-acc-com-com        to   x-cmd                  .
      *                              *---------------------------------*
      *                              * Pathname del comando in area di *
      *                              * uscita                          *
      *                              *---------------------------------*
           move      w-cmd-pth-cmd        to   x-pat                  .
      *                              *---------------------------------*
      *                              * Filtro del pathname del comando *
      *                              * con un eventuale pathname di e- *
      *                              * secuzione sostitutivo           *
      *                              *---------------------------------*
           move      x-pat                to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           move      s-pat                to   x-pat                  .
      *                              *---------------------------------*
      *                              * Linea 24 a spaces               *
      *                              *---------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *                              *---------------------------------*
      *                              * Uscita                          *
      *                              *---------------------------------*
           go to     acc-cmd-mnu-999.
       acc-cmd-mnu-300.
      *                          *-------------------------------------*
      *                          * Se tipo comando : menu'             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Controllo di riservatezza e     *
      *                              * password su menu'               *
      *                              *---------------------------------*
           perform   cnt-rep-mnu-000      thru cnt-rep-mnu-999        .
      *                              *---------------------------------*
      *                              * Se controllo non superato       *
      *                              *---------------------------------*
           if        w-rep-mnu-exs        =    spaces
                     go to acc-cmd-mnu-305.
      *                                  *-----------------------------*
      *                                  * Se la function key imposta- *
      *                                  * ta e' Exit : a richiesta di *
      *                                  * conferma di fine lavoro     *
      *                                  *-----------------------------*
           if       w-acc-com-key        =    "EXIT"
                     go to acc-cmd-mnu-085.
      *                                  *-----------------------------*
      *                                  * Rientro all'accettazione a  *
      *                                  * linea 24 o al mark point    *
      *                                  *-----------------------------*
           if        w-acc-com-i01        >    zero
                     go to acc-cmd-mnu-055
           else      go to acc-cmd-mnu-025.
       acc-cmd-mnu-305.
      *                              *---------------------------------*
      *                              * Se controllo superato           *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Composizione area per co-   *
      *                                  * mando relativo a menu'      *
      *                                  *-----------------------------*
           move      spaces               to   w-cor-ame-exs          .
           move      w-acc-com-com        to   w-cor-ame-cod          .
           move      w-cmd-tip-cmd        to   w-cor-ame-tip          .
           move      w-cmd-pth-cmd        to   w-cor-ame-pth          .
           move      w-cmd-sis-cmd        to   w-cor-ame-sap          .
           move      w-cmd-are-cmd        to   w-cor-ame-arg          .
           move      w-cmd-set-cmd        to   w-cor-ame-set          .
           move      w-cmd-fas-cmd        to   w-cor-ame-fas          .
           move      w-cmd-prg-cmd        to   w-cor-ame-pro          .
           move      w-cmd-mnu-rie        to   w-cor-ame-mdr          .
           move      w-cmd-pwd-cmd        to   w-cor-ame-pwd          .
           move      w-cmd-tip-ute        to   w-cor-ame-tut          .
           move      w-cmd-liv-pro        to   w-cor-ame-lip          .
           move      w-cmd-sts-cmd        to   w-cor-ame-sts          .
      *                                  *-----------------------------*
      *                                  * Lettura del nuovo menu'     *
      *                                  *-----------------------------*
           move      w-acc-com-com        to   w-let-mnu-mnu          .
           move      1                    to   w-let-mnu-npm          .
           perform   let-pag-mnu-000      thru let-pag-mnu-999        .
      *                                  *-----------------------------*
      *                                  * Visualizzazione pagina del  *
      *                                  * nuovo menu'                 *
      *                                  *-----------------------------*
           perform   vis-pag-mnu-000      thru vis-pag-mnu-999        .
      *                                  *-----------------------------*
      *                                  * Rientro all'accettazione a  *
      *                                  * linea 24                    *
      *                                  *-----------------------------*
           go to     acc-cmd-mnu-025.
       acc-cmd-mnu-400.
      *                  *---------------------------------------------*
      *                  * Se si tratta di una funzione speciale       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda del tipo di fun-   *
      *                      * zione, oppure, se funzione non ricono-  *
      *                      * sciuta, rientro a piede video           *
      *                      *-----------------------------------------*
           if        w-acc-com-com        =    ".0    "
                     go to acc-cmd-mnu-418
           else if   w-acc-com-com        =    ".a    "
                     go to acc-cmd-mnu-405
           else if   w-acc-com-com        =    ".b    "
                     go to acc-cmd-mnu-410
           else if   w-acc-com-com        =    ".c    "
                     go to acc-cmd-mnu-415
           else if   w-acc-com-com        =    ".d    "
                     go to acc-cmd-mnu-416
           else if   w-acc-com-com        =    ".e    "
                     go to acc-cmd-mnu-417
           else if   w-acc-com-com        =    ".i    "
                     go to acc-cmd-mnu-420
           else if   w-acc-com-com        =    ".k    "
                     go to acc-cmd-mnu-422
           else if   w-acc-com-com        =    ".l    "
                     go to acc-cmd-mnu-424
           else if   w-acc-com-com        =    ".m    "
                     go to acc-cmd-mnu-426
           else if   w-acc-com-com        =    ".n    "
                     go to acc-cmd-mnu-428
           else if   w-acc-com-com        =    ".o    "
                     go to acc-cmd-mnu-429
           else if   w-acc-com-com        =    ".p    "
                     go to acc-cmd-mnu-430
           else if   w-acc-com-com        =    ".q    "
                     go to acc-cmd-mnu-433
           else if   w-acc-com-com        =    ".r    "
                     go to acc-cmd-mnu-434
           else if   w-acc-com-com        =    ".s    "
                     go to acc-cmd-mnu-435
           else if   w-acc-com-com
                    (01 : 02)             =    ".t"
                     go to acc-cmd-mnu-440
           else if   w-acc-com-com        =    ".u    "
                     go to acc-cmd-mnu-445
           else if   w-acc-com-com        =    ".w    "
                     go to acc-cmd-mnu-450
           else if   w-acc-com-com        =    ".x    "
                     go to acc-cmd-mnu-460
           else if   w-acc-com-com        =    ".y    "
                     go to acc-cmd-mnu-470
           else if   w-acc-com-com        =    ".z    "
                     go to acc-cmd-mnu-480
           else if   w-acc-com-com        =    "?     " or
                     w-acc-com-com        =    ".     "
                     go to acc-cmd-mnu-490
           else if   w-acc-com-com        =    "-     "
                     go to acc-cmd-mnu-500
           else if   w-acc-com-com        =    ".iban " or
                     w-acc-com-com        =    ".ib   "
                     go to acc-cmd-mnu-520
           else      go to acc-cmd-mnu-025.
       acc-cmd-mnu-405.
      *                      *-----------------------------------------*
      *                      * ".a" : cambio codice azienda            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Cambio codice azienda               *
      *                          *-------------------------------------*
           perform   var-cod-azi-000      thru var-cod-azi-999        .
      *                          *-------------------------------------*
      *                          * Se effettivamente e' stato eseguito *
      *                          * un cambio del codice azienda        *
      *                          *-------------------------------------*
           if        w-var-azi-snx        not  = "S"
                     go to acc-cmd-mnu-407.
      *                              *---------------------------------*
      *                              * Determinazione descrizione a-   *
      *                              * zienda                          *
      *                              *---------------------------------*
           perform   det-des-azi-000      thru det-des-azi-999        .
      *                              *---------------------------------*
      *                              * Visualizzazione informazioni    *
      *                              * relative all'azienda in uso per *
      *                              * l'utente in uso, a meno di non  *
      *                              * essere in esecuzione di un      *
      *                              * desk-accessory                  *
      *                              *---------------------------------*
           if        w-exe-dac-snx-dac    not  = "S"
                     perform vis-pfc-uaz-000
                                          thru vis-pfc-uaz-999        .
       acc-cmd-mnu-407.
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-410.
      *                      *-----------------------------------------*
      *                      * ".b" : blocco spooler di stampa         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Blocco spooler di stampa            *
      *                          *-------------------------------------*
           perform   blo-spo-sta-000      thru blo-spo-sta-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-415.
      *                      *-----------------------------------------*
      *                      * ".c" : calendario                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Gestione calendario                 *
      *                          *-------------------------------------*
           perform   ges-cal-end-000      thru ges-cal-end-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-416.
      *                      *-----------------------------------------*
      *                      * ".d" : variazione codice dipendenza     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se attualmente si e' in impostazio- *
      *                          * ne ridotta per esecuzione di un     *
      *                          * desk-accessory : si esegue la rivi- *
      *                          * sualizzazione pagina menu' con con- *
      *                          * trollo se in impostazione ridotta   *
      *                          * di desk-accessory                   *
      *                          *-------------------------------------*
           if        w-exe-dac-snx-ird    =    "S"
                     perform   vis-pag-mir-000
                                          thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Linea 24 a spaces                   *
      *                          *-------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *                          *-------------------------------------*
      *                          * Cambio codice dipendenza            *
      *                          *-------------------------------------*
           perform   var-cod-dpz-000      thru var-cod-dpz-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-417.
      *                      *-----------------------------------------*
      *                      * ".e" : e-mail                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Gestione e-mail                     *
      *                          *-------------------------------------*
           perform   ges-msg-eml-000      thru ges-msg-eml-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-418.
      *                      *-----------------------------------------*
      *                      * ".0" : calcolatrice                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Gestione calcolatrice               *
      *                          *-------------------------------------*
           perform   ges-clc-trc-000      thru ges-clc-trc-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-420.
      *                      *-----------------------------------------*
      *                      * ".i" : informazioni generali            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Visualizzazione informazioni gene-  *
      *                          * rali sulla sessione                 *
      *                          *-------------------------------------*
           perform   vis-inf-gen-000      thru vis-inf-gen-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-422.
      *                      *-----------------------------------------*
      *                      * ".k" : richiesta operazione di sequen-  *
      *                      *        zializzazione o di indicizza-    *
      *                      *        zione di un file alla prossima   *
      *                      *        operazione di open su quel file  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Richiesta operazione                *
      *                          *-------------------------------------*
           perform   nxt-opn-fil-000      thru nxt-opn-fil-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-424.
      *                      *-----------------------------------------*
      *                      * ".l" : digitazione parola chiave per    *
      *                      *        mettere il terminale in lock     *
      *                      *        temporaneo fino alla ridigita-   *
      *                      *        zione della stessa parola        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Linea 24 a spaces                   *
      *                          *-------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *                          *-------------------------------------*
      *                          * Blocco provvisorio del terminale    *
      *                          *-------------------------------------*
           perform   blo-pro-ter-000      thru blo-pro-ter-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-426.
      *                      *-----------------------------------------*
      *                      * ".m" : messaggi ad utenti               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Gestione messaggi ad utenti         *
      *                          *-------------------------------------*
           perform   ges-msg-ute-000      thru ges-msg-ute-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-428.
      *                      *-----------------------------------------*
      *                      * ".n" : note o promemoria utente         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Gestione promemoria utenti          *
      *                          *-------------------------------------*
           perform   ges-prm-ute-000      thru ges-prm-ute-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-429.
      *                      *-----------------------------------------*
      *                      * ".o" : ora legale - solare              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Gestione ora legale - solare        *
      *                          *-------------------------------------*
           perform   ges-leg-sol-000      thru ges-leg-sol-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-430.
      *                      *-----------------------------------------*
      *                      * ".p" : gestione print-files su disco    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Linea 24 a spaces                   *
      *                          *-------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *                          *-------------------------------------*
      *                          * Gestione print-files su disco       *
      *                          *-------------------------------------*
           perform   ges-prn-fls-000      thru ges-prn-fls-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-433.
      *                      *-----------------------------------------*
      *                      * ".q" : disimpegno stampante (ex ".c")   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Disimpegno stampante                *
      *                          *-------------------------------------*
           perform   dis-imp-stp-000      thru dis-imp-stp-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-434.
      *                      *-----------------------------------------*
      *                      * ".r" : programmi recenti                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Selezione programmi utilizzati      *
      *                          * dall' utente                        *
      *                          *-------------------------------------*
           perform   buf-ute-fas-000      thru buf-ute-fas-999        .
      *                              *---------------------------------*
      *                              * Test sul flag di uscita         *
      *                              *---------------------------------*
           if        w-buf-ute-fas-fds    not  = spaces
                     go to acc-cmd-mnu-000.
      *                          *-------------------------------------*
      *                          * Valori selezionati                  *
      *                          *-------------------------------------*
           move      w-buf-ute-fas-tdf    to   w-acc-com-com          .
      *                          *-------------------------------------*
      *                          * A trattamento Return                *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-150.
       acc-cmd-mnu-435.
      *                      *-----------------------------------------*
      *                      * ".s" : esecuzione salvataggi            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Linea 24 a spaces                   *
      *                          *-------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *                          *-------------------------------------*
      *                          * Esecuzione salvataggi procedurati   *
      *                          *-------------------------------------*
           perform   ese-svt-pro-000      thru ese-svt-pro-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-440.
      *                      *-----------------------------------------*
      *                      * ".t" : rubriche telefoniche             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Gestione rubriche telefoniche       *
      *                          *-------------------------------------*
           perform   ges-rub-tel-000      thru ges-rub-tel-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-445.
      *                      *-----------------------------------------*
      *                      * ".u" : cambio codice utente             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Disabilitazione temporanea del      *
      *                          * desk-accessory                      *
      *                          *-------------------------------------*
           move      "D-"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Linea 24 a spaces                   *
      *                          *-------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *                          *-------------------------------------*
      *                          * Cambio codice utente                *
      *                          *-------------------------------------*
           perform   var-cod-ute-000      thru var-cod-ute-999        .
      *                          *-------------------------------------*
      *                          * Se effettivamente e' stato eseguito *
      *                          * un cambio del codice utente         *
      *                          *-------------------------------------*
           if        w-var-ute-snx        not  = "S"
                     go to acc-cmd-mnu-447.
      *                              *---------------------------------*
      *                              * Visualizzazione informazioni    *
      *                              * relative all'azienda in uso per *
      *                              * l'utente in uso, a meno di non  *
      *                              * essere in esecuzione di un      *
      *                              * desk-accessory                  *
      *                              *---------------------------------*
           if        w-exe-dac-snx-dac    not  = "S"
                     perform vis-pfc-uaz-000
                                          thru vis-pfc-uaz-999        .
       acc-cmd-mnu-447.
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riabilitazione del desk-accessory   *
      *                          *-------------------------------------*
           move      "D+"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-450.
      *                      *-----------------------------------------*
      *                      * ".w" : cambio password                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se programma di gestione u-    *
      *                          * tenti gia' attivo                   *
      *                          *-------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pxpg2200"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                          *-------------------------------------*
      *                          * Se si' : riciclo ad accettazione    *
      *                          * tenti gia' attivo                   *
      *                          *-------------------------------------*
           if        s-liv                not  = zero
                     go to  acc-cmd-mnu-000.
      *                          *-------------------------------------*
      *                          * Preparazione variabile di i.p.c.    *
      *                          *-------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "pxpg2200"           to   s-var                  .
           move      "G"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      01                   to   s-car                  .
           move      "S"                  to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                          *-------------------------------------*
      *                          * Richiamo programma di gestione u-   *
      *                          * tenti                               *
      *                          *-------------------------------------*
           call      "swd/xpg/prg/obj/pxpg2200"                       .
           cancel    "swd/xpg/prg/obj/pxpg2200"                       .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-460.
      *                      *-----------------------------------------*
      *                      * ".x" : esecuzione secondo pathname      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Accettazione pathname di esecuzione *
      *                          *-------------------------------------*
           perform   acc-pth-exe-000      thru acc-pth-exe-999        .
      *                          *-------------------------------------*
      *                          * Deviazione a seconda se pathanme    *
      *                          * impostato oppure no                 *
      *                          *-------------------------------------*
           if        w-exe-pth-pth        =    spaces
                     go to acc-cmd-mnu-462
           else      go to acc-cmd-mnu-465.
       acc-cmd-mnu-462.
      *                          *-------------------------------------*
      *                          * Se pathanme non impostato           *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Rivisualizzazione pagina menu'  *
      *                              * con controllo se in impostazio- *
      *                              * ne ridotta per esecuzione desk- *
      *                              * accessory                       *
      *                              *---------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                              *---------------------------------*
      *                              * Riciclo a inizio accettazione   *
      *                              *---------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-465.
      *                          *-------------------------------------*
      *                          * Se pathanme impostato               *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Linea 24 a spaces               *
      *                              *---------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *                              *---------------------------------*
      *                              * Tipo uscita : "T "              *
      *                              * di uscita                       *
      *                              *---------------------------------*
           move      "T "                 to   x-sts                  .
      *                              *---------------------------------*
      *                              * Nome del menu' attuale in area  *
      *                              * di uscita                       *
      *                              *---------------------------------*
           move      w-let-mnu-mnu        to   x-mnu                  .
      *                              *---------------------------------*
      *                              * Numero pagina del menu' attuale *
      *                              * in area di uscita               *
      *                              *---------------------------------*
           move      w-let-mnu-npm        to   x-npm                  .
      *                              *---------------------------------*
      *                              * Nome del comando in area di u-  *
      *                              * scita a '.exec '                *
      *                              *---------------------------------*
           move      ".exec "             to   x-cmd                  .
      *                              *---------------------------------*
      *                              * Pathname del comando in area di *
      *                              * uscita                          *
      *                              *---------------------------------*
           move      w-exe-pth-pth        to   x-pat                  .
      *                              *---------------------------------*
      *                              * Linea 24 a spaces               *
      *                              *---------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *                              *---------------------------------*
      *                              * Uscita                          *
      *                              *---------------------------------*
           go to     acc-cmd-mnu-999.
       acc-cmd-mnu-470.
      *                      *-----------------------------------------*
      *                      * ".y" : esecuzione shell script          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Accettazione script di esecuzione   *
      *                          *-------------------------------------*
           perform   exe-shl-scr-000      thru exe-shl-scr-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-480.
      *                      *-----------------------------------------*
      *                      * ".z" : codici di errore (ex ".e")       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Richiamo del modulo di help sui co- *
      *                          * dici di errore                      *
      *                          *-------------------------------------*
           call      "swd/mod/prg/obj/mioerh"                         .
      *                          *-------------------------------------*
      *                          * Cancellazione del modulo            *
      *                          *-------------------------------------*
           cancel    "swd/mod/prg/obj/mioerh"                         .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-490.
      *                      *-----------------------------------------*
      *                      * "?" : Help screen                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Video di aiuto                      *
      *                          *-------------------------------------*
           perform   vis-hlp-scr-000      thru vis-hlp-scr-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Se nessuna selezione : reimposta-   *
      *                          * zione                               *
      *                          *-------------------------------------*
           if        w-fnd-auc-cmd-cod    =    spaces
                     go to acc-cmd-mnu-498.
      *                          *-------------------------------------*
      *                          * Memorizzazione codice selezionato   *
      *                          *-------------------------------------*
           move      w-fnd-auc-cmd-cod    to   w-acc-com-com          .
      *                          *-------------------------------------*
      *                          * A trattamento Return                *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-150.
       acc-cmd-mnu-498.
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-500.
      *                      *-----------------------------------------*
      *                      * "-" : ricerca comandi                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Accettazione descrizione            *
      *                          *-------------------------------------*
           perform   acc-des-cmd-000      thru acc-des-cmd-999        .
           if        w-acc-des-com        =    spaces
                     go to acc-cmd-mnu-508.
      *                          *-------------------------------------*
      *                          * Ricerca comandi                     *
      *                          *-------------------------------------*
           move      w-acc-des-com        to   w-fnd-auc-cmd-des      .
           perform   exe-ric-cmd-000      thru exe-ric-cmd-999        .
      *                          *-------------------------------------*
      *                          * Se nessuna selezione : reimposta-   *
      *                          * zione                               *
      *                          *-------------------------------------*
           if        w-fnd-auc-cmd-sel    not  = spaces
                     go to acc-cmd-mnu-508.
      *                          *-------------------------------------*
      *                          * Memorizzazione codice selezionato   *
      *                          *-------------------------------------*
           move      w-fnd-auc-cmd-cod    to   w-acc-com-com          .
      *                          *-------------------------------------*
      *                          * A trattamento Return                *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-150.
       acc-cmd-mnu-508.
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-520.
      *                      *-----------------------------------------*
      *                      * ".iban" : utilita' area [abi]           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Gestione utilita' IBAN              *
      *                          *-------------------------------------*
           perform   ges-uti-ibn-000      thru ges-uti-ibn-999        .
      *                          *-------------------------------------*
      *                          * Rivisualizzazione pagina menu' con  *
      *                          * controllo se in impostazione ridot- *
      *                          * ta per esecuzione desk-accessory    *
      *                          *-------------------------------------*
           perform   vis-pag-mir-000      thru vis-pag-mir-999        .
      *                          *-------------------------------------*
      *                          * Riciclo a inizio accettazione       *
      *                          *-------------------------------------*
           go to     acc-cmd-mnu-000.
       acc-cmd-mnu-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     acc-cmd-mnu-999.
       acc-cmd-mnu-999.
           exit.

      *    *===========================================================*
      *    * Test su status del background                             *
      *    *-----------------------------------------------------------*
       tst-sts-bkg-000.
      *              *-------------------------------------------------*
      *              * Determinazione si/no background in esecuzione   *
      *              *-------------------------------------------------*
           perform   det-snx-bkg-000      thru det-snx-bkg-999        .
      *              *-------------------------------------------------*
      *              * Determinazione Status Background in esecuzione  *
      *              *-------------------------------------------------*
           perform   det-sts-bkg-000      thru det-sts-bkg-999        .
       tst-sts-bkg-999.
           exit.

      *    *===========================================================*
      *    * Controllo terminazione backgrounds                        *
      *    *-----------------------------------------------------------*
       cnt-ter-bkg-000.
      *              *-------------------------------------------------*
      *              * Test su Status Background                       *
      *              *-------------------------------------------------*
           perform   tst-sts-bkg-000      thru tst-sts-bkg-999        .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione dello status             *
      *              *-------------------------------------------------*
           if        w-snx-bkg-sts        =    "N"
                     go to cnt-ter-bkg-100
           else if   w-snx-bkg-sts        =    "S"
                     go to cnt-ter-bkg-100
           else if   w-snx-bkg-sts        =    "T"
                     go to cnt-ter-bkg-200.
       cnt-ter-bkg-100.
      *              *-------------------------------------------------*
      *              * Se non ci sono background, oppure se ci sono ma *
      *              * non sono ancora terminati : uscita              *
      *              *-------------------------------------------------*
           go to     cnt-ter-bkg-999.
       cnt-ter-bkg-200.
      *              *-------------------------------------------------*
      *              * Se ci sono background terminati                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Save video                                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione informazioni sul programma  *
      *                  * in background                               *
      *                  *---------------------------------------------*
           perform   vis-inf-bkg-000      thru vis-inf-bkg-999        .
      *                  *---------------------------------------------*
      *                  * Presa visione eventuali errori di esecuzio- *
      *                  * ne del background or ora terminato          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Richiamo sottoprogramma di visualizza-  *
      *                      * zione eventuali errori di esecuzione    *
      *                      * background                              *
      *                      *-----------------------------------------*
           move      "VE"                 to   b-ope                  .
           move      "B"                  to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgv"
                                         using b                      .
      *                      *-----------------------------------------*
      *                      * Cancellazione sottoprogramma            *
      *                      *-----------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgv"                         .
      *                      *-----------------------------------------*
      *                      * Dichiarazione di fine background al mo  *
      *                      * dulo di segreteria                      *
      *                      *-----------------------------------------*
           move      "B-"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                      *-----------------------------------------*
      *                      * Determinazione si/no bakground in ese-  *
      *                      * cuzione                                 *
      *                      *-----------------------------------------*
           perform   det-snx-bkg-000      thru det-snx-bkg-999        .
      *                      *-----------------------------------------*
      *                      * Determinazione status bakground in ese- *
      *                      * cuzione                                 *
      *                      *-----------------------------------------*
           perform   det-sts-bkg-000      thru det-sts-bkg-999        .
      *                  *---------------------------------------------*
      *                  * Restore video                               *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       cnt-ter-bkg-999.
           exit.

      *    *===========================================================*
      *    * Controllo fra max numero utenti abilitati e numero pro-   *
      *    * gressivo utente in uso                                    *
      *    *-----------------------------------------------------------*
       cnt-nut-npu-000.
      *              *-------------------------------------------------*
      *              * Se max numero utenti abilitati a zero : nessun  *
      *              * controllo                                       *
      *              *-------------------------------------------------*
           if        x-nut                =    zero
                     go to cnt-nut-npu-999.
      *              *-------------------------------------------------*
      *              * Se numero progressivo utente in uso a zero :    *
      *              * nessun controllo                                *
      *              *-------------------------------------------------*
           if        x-npu                =    zero
                     go to cnt-nut-npu-999.
      *              *-------------------------------------------------*
      *              * Se numero progressivo utente in uso minore o u- *
      *              * guale al max numero di utenti abilitati : con-  *
      *              * trollo superato                                 *
      *              *-------------------------------------------------*
           if        x-npu                not  > x-nut
                     go to cnt-nut-npu-999.
       cnt-nut-npu-100.
      *              *-------------------------------------------------*
      *              * Emissione messaggio e presa visione             *
      *              *-------------------------------------------------*
       cnt-nut-npu-125.
      *                  *---------------------------------------------*
      *                  * Save video                                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       cnt-nut-npu-150.
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box da linea 06 pos 05 a linea 19 pos 76    *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      06                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      19                   to   v-lto                  .
           move      76                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea di messaggio                          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "Attenzione : E' stato superato il massimo numero d
      -              "i utenti          "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea di messaggio                          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "             contemporaneamente ammessi all'utiliz
      -              "zo del            "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea di messaggio                          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "             sistema informativo gestionale.      
      -              "                  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea per presa visione                     *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "                             Digitare 'OK' per pre
      -              "sa visione : [  ] "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       cnt-nut-npu-175.
      *                  *---------------------------------------------*
      *                  * Normalizzazione campo di accettazione       *
      *                  *---------------------------------------------*
           move      spaces               to   v-alf                  .
       cnt-nut-npu-200.
      *                  *---------------------------------------------*
      *                  * Accettazione presa visione                  *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      71                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Se impostazione diversa da 'OK' : reimpo-   *
      *                  * stazione                                    *
      *                  *---------------------------------------------*
           if        v-alf                not  = "OK"
                     go to cnt-nut-npu-200.
       cnt-nut-npu-225.
      *                  *---------------------------------------------*
      *                  * Restore video                               *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       cnt-nut-npu-999.
           exit.

      *    *===========================================================*
      *    * Controllo scadenza licenza d'uso                          *
      *    *-----------------------------------------------------------*
       cnt-scd-lcu-000.
      *              *=================================================*
      *              * ___ INSERIRE QUI EVENTUALE 'VIRUS' ___          *
      *              *=================================================*
       cnt-scd-lcu-050.
      *              *-------------------------------------------------*
      *              * Se scadenza a zero : nessun controllo           *
      *              *-------------------------------------------------*
           if        x-scd                =    zero
                     go to cnt-scd-lcu-999.
      *              *-------------------------------------------------*
      *              * Date and time da segreteria                     *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Confronto con la data attuale                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se anno maggiore                            *
      *                  *---------------------------------------------*
           if        x-scd-ann            >    s-ann
                     go to cnt-scd-lcu-999.
      *                  *---------------------------------------------*
      *                  * Se anno minore                              *
      *                  *---------------------------------------------*
           if        x-scd-ann            <    s-ann
                     go to cnt-scd-lcu-100.
      *                  *---------------------------------------------*
      *                  * Se mese maggiore                            *
      *                  *---------------------------------------------*
           if        x-scd-mes            not  < s-mes
                     go to cnt-scd-lcu-999.
       cnt-scd-lcu-100.
      *              *-------------------------------------------------*
      *              * Emissione messaggio e presa visione             *
      *              *-------------------------------------------------*
       cnt-scd-lcu-125.
      *                  *---------------------------------------------*
      *                  * Save video                                  *
      *                  *---------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       cnt-scd-lcu-150.
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box di errore                               *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      06                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      19                   to   v-lto                  .
           move      76                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea di messaggio                          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "ATTENZIONE : LA [LICENZA D'USO] DI 'TANGRAM' E' SC
      -              "ADUTA !!!         "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea di messaggio                          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "             -------------------------------------
      -              "---------         "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea di messaggio                          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "    /\\                                           
      -              "                  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea di messaggio                          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "   /  \\     E' necessario rivolgersi al fornitore
      -              " software per     "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea di messaggio                          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "  / /\ \\    provvedere al rinnovo o per dichiarar
      -              "e la cessazione   "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea di messaggio                          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      " / /__\ \\   definitiva dell'uso del Sistema Gesti
      -              "onale.            "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea di messaggio                          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "/________\\  La scadenza e' determinata da una ass
      -              "enza di aggiorna- "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea di messaggio                          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "             menti superiore a 180 giorni.        
      -              "                  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea per presa visione                     *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "                             Digitare 'OK' per pre
      -              "sa visione : [  ] "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       cnt-scd-lcu-175.
      *                  *---------------------------------------------*
      *                  * Normalizzazione campo di accettazione       *
      *                  *---------------------------------------------*
           move      spaces               to   v-alf                  .
       cnt-scd-lcu-200.
      *                  *---------------------------------------------*
      *                  * Accettazione presa visione                  *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      71                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Se impostazione diversa da 'OK' : reimpo-   *
      *                  * stazione                                    *
      *                  *---------------------------------------------*
           if        v-alf                not  = "OK"
                     go to cnt-scd-lcu-200.
       cnt-scd-lcu-225.
      *                  *---------------------------------------------*
      *                  * Restore video                               *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       cnt-scd-lcu-800.
      *              *-------------------------------------------------*
      *              * Modalita' VISUALIZZAZIONE                       *
      *              *-------------------------------------------------*
       cnt-scd-lcu-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     cnt-scd-lcu-999.
       cnt-scd-lcu-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione informazioni sul programma in background  *
      *    *-----------------------------------------------------------*
       vis-inf-bkg-000.
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Linea 24 a spaces                               *
      *              *-------------------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *              *-------------------------------------------------*
      *              * Costruzione maschera vuota                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Box da linea 06 pos 05 a linea 19 pos 76    *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      06                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      19                   to   v-lto                  .
           move      76                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      29                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      " Informazioni sul background "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Sottolineatura titolo                       *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      29                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      "-----------------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Literals                                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nome                                    *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      13                   to   v-pos                  .
           move      "- Nome        :"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Descrizione                             *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      13                   to   v-pos                  .
           move      "- Descrizione :"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Inizio                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      13                   to   v-pos                  .
           move      "- Inizio      :"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Stato                                   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      13                   to   v-pos                  .
           move      "- Stato       :"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Determinazione si/no bakground in esecuzione    *
      *              *-------------------------------------------------*
           perform   det-snx-bkg-000      thru det-snx-bkg-999        .
      *              *-------------------------------------------------*
      *              * Determinazione status bakground in esecuzione   *
      *              *-------------------------------------------------*
           perform   det-sts-bkg-000      thru det-sts-bkg-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se si/no background in e-  *
      *              * secuzione                                       *
      *              *-------------------------------------------------*
           if        w-snx-bkg-snx        =    "S"
                     go to vis-inf-bkg-300
           else      go to vis-inf-bkg-600.
       vis-inf-bkg-300.
      *              *-------------------------------------------------*
      *              * Se ci sono backgrounds in esecuzione            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome del background                         *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      29                   to   v-pos                  .
           move      w-snx-bkg-pro        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Descrizione del background                  *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      29                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           move      zero                 to   w-snx-bkg-pnt          .
           inspect   w-snx-bkg-des    tallying w-snx-bkg-pnt
                     for               leading spaces                 .
           add       1                    to   w-snx-bkg-pnt          .
           unstring  w-snx-bkg-des        into v-alf
                                  with pointer w-snx-bkg-pnt          .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Data inizio del background                  *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "D"                  to   v-tip                  .
           move      15                   to   v-lin                  .
           move      29                   to   v-pos                  .
           move      w-snx-bkg-dat        to   v-dat                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Ora inizio del background                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           if        w-snx-bkg-dat        =    zero
                     move  spaces         to   v-alf
           else      move  w-snx-bkg-tim  to   w-inf-gen-bkg-tim
                     move  w-inf-gen-bkg-thh
                                          to   w-edt-ora-hhh
                     move  w-inf-gen-bkg-tmm
                                          to   w-edt-ora-mmm
                     move  w-inf-gen-bkg-tss
                                          to   w-edt-ora-sss
                     move  w-edt-ora-hms  to   v-alf                  .
           move      15                   to   v-lin                  .
           move      39                   to   v-pos                  .
           move      w-inf-gen-bkg-ori    to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Status del background                       *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      29                   to   v-pos                  .
           if        w-snx-bkg-sts        =    "T"
                     move  "Terminato                               "
                                          to   v-alf
           else      move  "In attesa di completamento              "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Presa visione                               *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      18                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     vis-inf-bkg-999.
       vis-inf-bkg-600.
      *              *-------------------------------------------------*
      *              * Se non ci sono backgrounds in esecuzione        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Messaggio di nessun background              *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      29                   to   v-pos                  .
           move      "Nessun background in esecuzione !       "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Presa visione                               *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      18                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     vis-inf-bkg-999.
       vis-inf-bkg-999.
           exit.

      *    *===========================================================*
      *    * Disimpegno stampante                                      *
      *    *-----------------------------------------------------------*
       dis-imp-stp-000.
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Linea 24 a spaces                               *
      *              *-------------------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
       dis-imp-stp-025.
      *              *-------------------------------------------------*
      *              * Determinazione codice utente attuale            *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-ute                to   w-dim-stp-ute          .
      *              *-------------------------------------------------*
      *              * Determinazione tipo utente attuale              *
      *              *-------------------------------------------------*
           move      "ute "               to   auc-tre                .
           move      w-dim-stp-ute        to   auc-kre                .
           read      auc    with no lock
                            invalid key
                            move    00    to   w-dim-stp-tut
                            go to   dis-imp-stp-050.
           move      auc-dat              to   w-ute                  .
           if        w-ute-tse-cst        not  numeric
                     move  zero           to   w-ute-tse-cst
                     move  spaces         to   w-ute-cst-ass
                     move  zero           to   w-ute-amc-def
                     move  zero           to   w-ute-ali-def
                     move  spaces         to   w-ute-csl-aau
                     move  spaces         to   w-ute-aps-aau          .
           move      w-ute-tip-ute        to   w-dim-stp-tut          .
       dis-imp-stp-050.
      *              *-------------------------------------------------*
      *              * Determinazione codice stampante impegnata dal-  *
      *              * l'utente attuale, se solo una                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Start su records di impegno stampanti       *
      *                  *---------------------------------------------*
           move      "imp "               to   pss-tre                .
           move      spaces               to   pss-kre                .
           start     pss    key not less
                            pss-key
                            invalid key
                            go to   dis-imp-stp-090.
       dis-imp-stp-055.
      *                  *---------------------------------------------*
      *                  * Next su records di impegno stampanti        *
      *                  *---------------------------------------------*
           read      pss    next
                            with no lock
                            at end
                            go to   dis-imp-stp-090.
      *                  *---------------------------------------------*
      *                  * Max su records di impegno stampanti         *
      *                  *---------------------------------------------*
           if        pss-tre              not  = "imp "
                     go to dis-imp-stp-090.
      *                  *---------------------------------------------*
      *                  * Record in area di lavoro                    *
      *                  *---------------------------------------------*
           move      pss-dat              to   w-imp                  .
      *                  *---------------------------------------------*
      *                  * Sel su record di impegno stampanti          *
      *                  *---------------------------------------------*
           if        w-imp-ute-imp        not  = w-dim-stp-ute
                     go to dis-imp-stp-055.
           if        w-imp-can-stp
                    (01 : 01)             =    "#"
                     go to dis-imp-stp-055.
           if        w-imp-can-stp
                    (01 : 05)             =    "spool"
                     go to dis-imp-stp-055.
           if        w-imp-can-stp
                    (01 : 03)             =    "rcp"
                     go to dis-imp-stp-055.
           if        w-imp-can-stp
                    (01 : 03)             =    "ucp"
                     go to dis-imp-stp-055.
           if        w-imp-sts-imp        =    00
                     go to dis-imp-stp-055.
      *                  *---------------------------------------------*
      *                  * Memorizzazione canale di impegno relativo   *
      *                  * alla stampante impegnata                    *
      *                  *---------------------------------------------*
           move      w-imp-can-stp        to   w-dim-stp-can          .
      *                  *---------------------------------------------*
      *                  * Memorizzazione status di impegno relativo   *
      *                  * alla stampante impegnata                    *
      *                  *---------------------------------------------*
           move      w-imp-sts-imp        to   w-dim-stp-sdi          .
       dis-imp-stp-075.
      *                  *---------------------------------------------*
      *                  * Determinazione del codice stampante, e del- *
      *                  * la relativa descrizione, per il canale di   *
      *                  * stampa impegnato                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Start su records codici stampante       *
      *                      *-----------------------------------------*
           move      "stp "               to   pss-tre                .
           move      spaces               to   pss-kre                .
           start     pss    key not less
                            pss-key
                            invalid key
                            go to   dis-imp-stp-090.
       dis-imp-stp-080.
      *                      *-----------------------------------------*
      *                      * Next su records codici stampante        *
      *                      *-----------------------------------------*
           read      pss    next
                            with no lock
                            at end
                            go to   dis-imp-stp-090.
      *                      *-----------------------------------------*
      *                      * Max su records codici stampante         *
      *                      *-----------------------------------------*
           if        pss-tre              not  = "stp "
                     go to dis-imp-stp-090.
      *                      *-----------------------------------------*
      *                      * Record in area di lavoro                *
      *                      *-----------------------------------------*
           move      pss-dat              to   w-stp                  .
      *                      *-----------------------------------------*
      *                      * Sel su record codici stampante          *
      *                      *-----------------------------------------*
           if        w-stp-can-stp        not  = w-dim-stp-can
                     go to dis-imp-stp-080.
           if        w-stp-cod-stp
                    (01 : 01)             =    "#"
                     go to dis-imp-stp-080.
           if        w-stp-can-stp
                    (01 : 05)             =    "spool"
                     go to dis-imp-stp-080.
           if        w-stp-can-stp
                    (01 : 03)             =    "rcp"
                     go to dis-imp-stp-080.
           if        w-stp-can-stp
                    (01 : 03)             =    "ucp"
                     go to dis-imp-stp-080.
      *                      *-----------------------------------------*
      *                      * Memorizzazione codice stampante         *
      *                      *-----------------------------------------*
           move      w-stp-cod-stp        to   w-dim-stp-stp          .
      *                      *-----------------------------------------*
      *                      * Memorizzazione descrizione stampante    *
      *                      *-----------------------------------------*
           move      w-stp-des-stp        to   w-dim-stp-des          .
      *                      *-----------------------------------------*
      *                      * Prosecuzione                            *
      *                      *-----------------------------------------*
           go to     dis-imp-stp-100.
       dis-imp-stp-090.
      *                  *---------------------------------------------*
      *                  * Se determinazioni non possibili si norma-   *
      *                  * lizzano i valori da determinare             *
      *                  *---------------------------------------------*
           move      spaces               to   w-dim-stp-stp          .
           move      spaces               to   w-dim-stp-des          .
           move      spaces               to   w-dim-stp-can          .
           move      zero                 to   w-dim-stp-sdi          .
       dis-imp-stp-100.
      *              *-------------------------------------------------*
      *              * Costruzione maschera vuota                      *
      *              *-------------------------------------------------*
       dis-imp-stp-110.
      *                  *---------------------------------------------*
      *                  * Box da linea 06 pos 05 a linea 18 pos 76    *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      06                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      18                   to   v-lto                  .
           move      76                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       dis-imp-stp-120.
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      31                   to   v-pos                  .
           move      "Disimpegno stampante"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Sottolineatura titolo                       *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      31                   to   v-pos                  .
           move      "--------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       dis-imp-stp-130.
      *                  *---------------------------------------------*
      *                  * Literals                                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice stampante                        *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      18                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "Codice stampante :" to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Stato di impegno                        *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      18                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "Stato di impegno :" to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       dis-imp-stp-140.
      *                  *---------------------------------------------*
      *                  * Valori                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se codice stampante a spaces : nessuna  *
      *                      * visualizzazione                         *
      *                      *-----------------------------------------*
           if        w-dim-stp-stp        =    spaces
                     go to dis-imp-stp-200.
      *                      *-----------------------------------------*
      *                      * Codice stampante                        *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      w-dim-stp-stp        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Descrizione codice stampante            *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      w-dim-stp-des        to   v-alf                  .
           if        v-alc (40)           =    "*"
                     move  spaces         to   v-alc (40)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Stato di impegno                        *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      w-dim-stp-sdi        to   w-dim-stp-i01          .
           add       1                    to   w-dim-stp-i01          .
           if        w-dim-stp-i01        >    07
                     move  07             to   w-dim-stp-i01          .
           move      w-dim-stp-lsx
                    (w-dim-stp-i01)       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       dis-imp-stp-200.
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       dis-imp-stp-400.
      *              *-------------------------------------------------*
      *              * Accettazione codice stampante                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Accettazione                                *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "L"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-dim-stp-stp        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       dis-imp-stp-425.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           if        v-key                =    "EXIT"
                     go to dis-imp-stp-999.
       dis-imp-stp-450.
      *                  *---------------------------------------------*
      *                  * Valore in destinazione                      *
      *                  *---------------------------------------------*
           move      v-alf                to   w-dim-stp-stp          .
       dis-imp-stp-475.
      *                  *---------------------------------------------*
      *                  * Se Find                                     *
      *                  *---------------------------------------------*
           if        v-key                not  = "FIND"
                     go to dis-imp-stp-500.
           perform   fnd-pss-stp-000      thru fnd-pss-stp-999        .
           if        w-fnd-pss-stp-sel    not  = spaces
                     go to dis-imp-stp-400.
           move      w-fnd-pss-stp-cod    to   w-dim-stp-stp          .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      w-dim-stp-stp        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      spaces               to   v-key                  .
       dis-imp-stp-500.
      *                  *---------------------------------------------*
      *                  * Se codice stampante a spaces                *
      *                  *---------------------------------------------*
           if        w-dim-stp-stp        not  = spaces
                     go to dis-imp-stp-525.
      *                      *-----------------------------------------*
      *                      * Visualizzazione descrizione stampante a *
      *                      * spaces                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione status di impegno a     *
      *                      * spaces                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     dis-imp-stp-400.
       dis-imp-stp-525.
      *                  *---------------------------------------------*
      *                  * Lettura codice stampante                    *
      *                  *---------------------------------------------*
           move      "stp "               to   pss-tre                .
           move      w-dim-stp-stp        to   pss-kre                .
           read      pss    with no lock
                            invalid key
                            go to   dis-imp-stp-550.
           go to     dis-imp-stp-575.
       dis-imp-stp-550.
      *                  *---------------------------------------------*
      *                  * Se codice stampante non esistente           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione descrizione stampante a *
      *                      * puntini                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      all   "."            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione status di impegno a     *
      *                      * spaces                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     dis-imp-stp-400.
       dis-imp-stp-575.
      *                  *---------------------------------------------*
      *                  * Se codice stampante esistente               *
      *                  *---------------------------------------------*
       dis-imp-stp-580.
      *                      *-----------------------------------------*
      *                      * Record letto in area di lavoro          *
      *                      *-----------------------------------------*
           move      pss-dat              to   w-stp                  .
      *                      *-----------------------------------------*
      *                      * Memorizzazione descrizione stampante    *
      *                      *-----------------------------------------*
           move      w-stp-des-stp        to   w-dim-stp-des          .
      *                      *-----------------------------------------*
      *                      * Memorizzazione canale per la stampante  *
      *                      *-----------------------------------------*
           move      w-stp-can-stp        to   w-dim-stp-can          .
      *                      *-----------------------------------------*
      *                      * Visualizzazione descrizione stampante   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      w-dim-stp-des        to   v-alf                  .
           if        v-alc (40)           =    "*"
                     move  spaces         to   v-alc (40)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       dis-imp-stp-585.
      *                      *-----------------------------------------*
      *                      * Se stampante locale, o di spool, o di   *
      *                      * remote copy : si visualizza a zero lo   *
      *                      * status di impegno e si ritorna all'ac-  *
      *                      * cettazione                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test                                *
      *                          *-------------------------------------*
           if        w-stp-cod-stp
                    (01 : 01)             =    "#" or
                     w-stp-can-stp
                    (01 : 05)             =    "spool" or
                     w-stp-can-stp
                    (01 : 03)             =    "rcp"   or
                     w-stp-can-stp
                    (01 : 03)             =    "ucp"
                     go to dis-imp-stp-590
           else      go to dis-imp-stp-600.
       dis-imp-stp-590.
      *                          *-------------------------------------*
      *                          * Visualizzazione status di impegno   *
      *                          * a spaces                            *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * A reimpostazione                    *
      *                          *-------------------------------------*
           go to     dis-imp-stp-400.
       dis-imp-stp-600.
      *                      *-----------------------------------------*
      *                      * Lettura status di impegno per il canale *
      *                      * di stampa                               *
      *                      *-----------------------------------------*
           move      "imp "               to   pss-tre                .
           move      w-dim-stp-can        to   pss-kre                .
           read      pss    with no lock
                            invalid key
                            go to   dis-imp-stp-625.
           go to     dis-imp-stp-650.
       dis-imp-stp-625.
      *                      *-----------------------------------------*
      *                      * Se status di impegno per il canale di   *
      *                      * stampa non esistente                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Memorizzazione status di canale non *
      *                          * impegnato                           *
      *                          *-------------------------------------*
           move      00                   to   w-dim-stp-sdi          .
      *                          *-------------------------------------*
      *                          * Visualizzazione status di canale    *
      *                          * non impegnato                       *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      w-dim-stp-lsx (1)    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * A reimpostazione                    *
      *                          *-------------------------------------*
           go to     dis-imp-stp-400.
       dis-imp-stp-650.
      *                      *-----------------------------------------*
      *                      * Se status di impegno per il canale di   *
      *                      * stampa esistente                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Record letto in area di lavoro      *
      *                          *-------------------------------------*
           move      pss-dat              to   w-imp                  .
      *                          *-------------------------------------*
      *                          * Test se status di impegno a : 00    *
      *                          *-------------------------------------*
           if        w-imp-sts-imp        =    00
                     go to dis-imp-stp-625.
      *                          *-------------------------------------*
      *                          * Memorizzazione status di impegno    *
      *                          *-------------------------------------*
           move      w-imp-sts-imp        to   w-dim-stp-sdi          .
      *                          *-------------------------------------*
      *                          * Visualizzazione status di impegno   *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      w-dim-stp-sdi        to   w-dim-stp-i01          .
           add       1                    to   w-dim-stp-i01          .
           if        w-dim-stp-i01        >    07
                     move  07             to   w-dim-stp-i01          .
           move      w-dim-stp-lsx
                    (w-dim-stp-i01)       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Se utente supervisore : nessun ul-  *
      *                          * teriore controllo                   *
      *                          *-------------------------------------*
           if        w-dim-stp-tut        =    02
                     go to dis-imp-stp-700.
      *                          *-------------------------------------*
      *                          * Se l'utente che impegna e' lo stes- *
      *                          * so che chiede il disimpegno : nes-  *
      *                          * sun ulteriore controllo             *
      *                          *-------------------------------------*
           if        w-imp-ute-imp        =    w-dim-stp-ute
                     go to dis-imp-stp-700.
       dis-imp-stp-675.
      *                          *-------------------------------------*
      *                          * Altrimenti : box di segnalazione e  *
      *                          * reimpostazione codice stampante     *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Save video                      *
      *                              *---------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Video in Off                    *
      *                              *---------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Box                             *
      *                              *---------------------------------*
           move      "BX"                 to   v-ope                  .
           move      07                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      17                   to   v-lto                  .
           move      74                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Messaggi nel box                *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      64                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      "Attenzione : La stampante e' stata impegnata da un
      -              " altro utente."     
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      64                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      "             Il disimpegno della stampante potra' 
      -              "essere esegui-"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      64                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      "             to solamente dall'utente che l'ha imp
      -              "egnata.       "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      64                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      "             Si deve pertanto richiedere l'esecuzi
      -              "one del disim-"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      64                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      "             pegno della stampante all'utente     
      -              "              "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      09                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      55                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    w-imp-ute-imp
                                delimited by   spaces
                     "."        delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      70                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Video in On                     *
      *                              *---------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Presa visione                   *
      *                              *---------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      16                   to   v-lin                  .
           move      71                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Restore video                   *
      *                              *---------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * A reimpostazione                *
      *                              *---------------------------------*
           go to     dis-imp-stp-400.
       dis-imp-stp-700.
      *                          *-------------------------------------*
      *                          * Se l'impostazione era stata esegui- *
      *                          * ta con tasto Do si omette la ri-    *
      *                          * chiesta di conferma finale          *
      *                          *-------------------------------------*
           if        v-key                =    "DO  "
                     go to dis-imp-stp-900.
       dis-imp-stp-800.
      *              *-------------------------------------------------*
      *              * Accettazione conferma finale                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Note operative                              *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      52                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      "Conferma esecuzione disimpegno stampante (S/N/E) ?
      -              "  "                 to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione risposta                    *
      *                  *---------------------------------------------*
           move      spaces               to   w-dim-stp-snx          .
       dis-imp-stp-825.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      74                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-dim-stp-snx        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-alf                to   w-dim-stp-snx          .
      *                  *---------------------------------------------*
      *                  * Se premuta function-key                     *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     go to dis-imp-stp-850
           else if   v-key                =    "DO  "
                     go to dis-imp-stp-875
           else if   v-key                =    "EXIT"
                     go to dis-imp-stp-999.
      *                  *---------------------------------------------*
      *                  * Se Return                                   *
      *                  *---------------------------------------------*
           if        w-dim-stp-snx        =    "N"
                     go to dis-imp-stp-850
           else if   w-dim-stp-snx        =    "S"
                     go to dis-imp-stp-875
           else if   w-dim-stp-snx        =    "E"
                     go to dis-imp-stp-999
           else      go to dis-imp-stp-825.
       dis-imp-stp-850.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cancellazione note operative            *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      52                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * A reimpostazione codice stampante       *
      *                      *-----------------------------------------*
           go to     dis-imp-stp-400.
       dis-imp-stp-875.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cancellazione note operative            *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      52                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       dis-imp-stp-900.
      *                      *-----------------------------------------*
      *                      * Disimpegno canale di stampa             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Lettura record impegno              *
      *                          *-------------------------------------*
           move      "imp "               to   pss-tre                .
           move      w-dim-stp-can        to   pss-kre                .
           read      pss    invalid key
                            go to   dis-imp-stp-990.
      *                          *-------------------------------------*
      *                          * Record impegno in area di lavoro    *
      *                          *-------------------------------------*
           move      pss-dat              to   w-imp                  .
      *                          *-------------------------------------*
      *                          * Normalizzazione record impegno      *
      *                          *-------------------------------------*
           move      zero                 to   w-imp-sts-imp          .
           move      spaces               to   w-imp-azi-imp
                                               w-imp-ter-imp
                                               w-imp-ute-imp
                                               w-imp-sap-imp
                                               w-imp-arg-imp
                                               w-imp-set-imp
                                               w-imp-fas-imp          .
           move      zero                 to   w-imp-sdt-imp          .
      *                          *-------------------------------------*
      *                          * Record impegno in area file         *
      *                          *-------------------------------------*
           move      w-imp                to   pss-dat                .
      *                          *-------------------------------------*
      *                          * Riscrittura record impegno          *
      *                          *-------------------------------------*
           rewrite   pss-rec invalid key
                             go to   dis-imp-stp-990.
       dis-imp-stp-990.
      *                          *-------------------------------------*
      *                          * Unlock [pss]                        *
      *                          *-------------------------------------*
           unlock    pss   records                                    .
       dis-imp-stp-999.
           exit.

      *    *===========================================================*
      *    * Blocco spooler di stampa                                  *
      *    *-----------------------------------------------------------*
       blo-spo-sta-000.
      *              *-------------------------------------------------*
      *              * Lettura della personalizzazione relativa al     *
      *              * template per il blocco dello spooler di stampa  *
      *              *-------------------------------------------------*
           move      "PS"                 to   s-ope                  .
           move      "tem-bss"            to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-alf                to   w-blo-spl-tem          .
      *              *-------------------------------------------------*
      *              * Se template a spaces : uscita immediata, in     *
      *              * quanto operazione non possibile                 *
      *              *-------------------------------------------------*
           if        w-blo-spl-tem        =    spaces
                     go to blo-spo-sta-999.
      *              *-------------------------------------------------*
      *              * Se template a '.' : uscita immediata, in quanto *
      *              * operazione non possibile                        *
      *              *-------------------------------------------------*
           if        w-blo-spl-tem        =    "."
                     go to blo-spo-sta-999.
      *              *-------------------------------------------------*
      *              * Controllo che esista uno e solo uno carattere   *
      *              * '@' nel template; in caso contrario uscita im-  *
      *              * mediata in quanto operazione non possibile      *
      *              *-------------------------------------------------*
           move      zero                 to   w-blo-spl-i01          .
           inspect   w-blo-spl-tem    tallying w-blo-spl-i01
                                          for  all   "@"              .
           if        w-blo-spl-i01        not  = 1
                     go to blo-spo-sta-999.
      *              *-------------------------------------------------*
      *              * Determinazione numero di caratteri che prece-   *
      *              * dono il carattere '@' nel template              *
      *              *-------------------------------------------------*
           move      zero                 to   w-blo-spl-i01          .
           inspect   w-blo-spl-tem    tallying w-blo-spl-i01
                                          for  characters
                                        before initial "@"            .
      *              *-------------------------------------------------*
      *              * Controllo che il carattere successivo a '@' sia *
      *              * il carattere 'p';in caso contrario uscita im-   *
      *              * mediata in quanto operazione non possibile      *
      *              *-------------------------------------------------*
           move      w-blo-spl-i01        to   w-blo-spl-i02          .
           add       2                    to   w-blo-spl-i02          .
           if        w-blo-spl-tex
                    (w-blo-spl-i02)       not  = "p" and
                     w-blo-spl-tex
                    (w-blo-spl-i02)       not  = "P"
                     go to blo-spo-sta-999.
       blo-spo-sta-025.
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Linea 24 a spaces                               *
      *              *-------------------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
       blo-spo-sta-050.
      *              *-------------------------------------------------*
      *              * Normalizzazione area di accettazione            *
      *              *-------------------------------------------------*
           move      spaces               to   w-blo-spl-stp          .
           move      spaces               to   w-blo-spl-des          .
           move      spaces               to   w-blo-spl-can          .
       blo-spo-sta-100.
      *              *-------------------------------------------------*
      *              * Costruzione maschera vuota                      *
      *              *-------------------------------------------------*
       blo-spo-sta-110.
      *                  *---------------------------------------------*
      *                  * Box da linea 06 pos 05 a linea 18 pos 76    *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      06                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      18                   to   v-lto                  .
           move      76                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       blo-spo-sta-120.
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      31                   to   v-pos                  .
           move      "  Blocco stampante  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Sottolineatura titolo                       *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      31                   to   v-pos                  .
           move      "--------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       blo-spo-sta-130.
      *                  *---------------------------------------------*
      *                  * Literal codice stampante                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      18                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "Codice stampante :" to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       blo-spo-sta-200.
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       blo-spo-sta-400.
      *              *-------------------------------------------------*
      *              * Accettazione codice stampante                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Accettazione                                *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "L"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "FIND"               to   v-pfk (03)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-blo-spl-stp        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       blo-spo-sta-425.
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           if        v-key                =    "EXIT"
                     go to blo-spo-sta-999.
       blo-spo-sta-450.
      *                  *---------------------------------------------*
      *                  * Valore in destinazione                      *
      *                  *---------------------------------------------*
           move      v-alf                to   w-blo-spl-stp          .
       blo-spo-sta-475.
      *                  *---------------------------------------------*
      *                  * Se Find                                     *
      *                  *---------------------------------------------*
           if        v-key                not  = "FIND"
                     go to blo-spo-sta-500.
           perform   fnd-pss-stp-000      thru fnd-pss-stp-999        .
           if        w-fnd-pss-stp-sel    not  = spaces
                     go to blo-spo-sta-400.
           move      w-fnd-pss-stp-cod    to   w-blo-spl-stp          .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      w-blo-spl-stp        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      spaces               to   v-key                  .
       blo-spo-sta-500.
      *                  *---------------------------------------------*
      *                  * Se codice stampante a spaces                *
      *                  *---------------------------------------------*
           if        w-blo-spl-stp        not  = spaces
                     go to blo-spo-sta-525.
      *                      *-----------------------------------------*
      *                      * Visualizzazione descrizione stampante a *
      *                      * spaces                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione area messaggio a spaces *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      18                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Messaggio                           *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     blo-spo-sta-400.
       blo-spo-sta-525.
      *                  *---------------------------------------------*
      *                  * Lettura codice stampante                    *
      *                  *---------------------------------------------*
           move      "stp "               to   pss-tre                .
           move      w-blo-spl-stp        to   pss-kre                .
           read      pss    with no lock
                            invalid key
                            go to   blo-spo-sta-550.
           go to     blo-spo-sta-575.
       blo-spo-sta-550.
      *                  *---------------------------------------------*
      *                  * Se codice stampante non esistente           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione descrizione stampante a *
      *                      * puntini                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      all   "."            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione area messaggio a spaces *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      18                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Messaggio                           *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     blo-spo-sta-400.
       blo-spo-sta-575.
      *                  *---------------------------------------------*
      *                  * Se codice stampante esistente               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Record letto in area di lavoro          *
      *                      *-----------------------------------------*
           move      pss-dat              to   w-stp                  .
      *                      *-----------------------------------------*
      *                      * Memorizzazione descrizione stampante    *
      *                      *-----------------------------------------*
           move      w-stp-des-stp        to   w-blo-spl-des          .
      *                      *-----------------------------------------*
      *                      * Memorizzazione canale per la stampante  *
      *                      *-----------------------------------------*
           move      w-stp-can-stp        to   w-blo-spl-can          .
      *                      *-----------------------------------------*
      *                      * Separazione del parametro 'canale di    *
      *                      * stampa' in uno o due componenti         *
      *                      *                                         *
      *                      * - Se una sola componente                *
      *                      *                                         *
      *                      *   - w-blo-spl-cn1 = canale di stampa    *
      *                      *   - w-blo-spl-cn2 = spaces              *
      *                      *                                         *
      *                      * - Se due componenti                     *
      *                      *                                         *
      *                      *   - w-blo-spl-cn1 = spooler da utiliz-  *
      *                      *                     zare                *
      *                      *                     - "spool"           *
      *                      *                     - "rcp"             *
      *                      *                     - "ucp"             *
      *                      *   - w-blo-spl-cn2 = nome logico della   *
      *                      *                     stampante per lo    *
      *                      *                     spooler o per il    *
      *                      *                     remote copy         *
      *                      *-----------------------------------------*
           move      spaces               to   w-blo-spl-cn1          .
           move      spaces               to   w-blo-spl-cn2          .
           unstring  w-blo-spl-can
                                delimited by   all spaces
                                          into w-blo-spl-cn1
                                               w-blo-spl-cn2          .
      *                      *-----------------------------------------*
      *                      * Visualizzazione descrizione stampante   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      w-blo-spl-des        to   v-alf                  .
           if        v-alc (40)           =    "*"
                     move  spaces         to   v-alc (40)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       blo-spo-sta-600.
      *                      *-----------------------------------------*
      *                      * Se il canale di stampa non e' 'spool'   *
      *                      * si emette un segnale di errore e si     *
      *                      * va' alla reimpostazione                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test                                *
      *                          *-------------------------------------*
           if        w-blo-spl-cn1        =    "spool"
                     go to blo-spo-sta-800.
      *                          *-------------------------------------*
      *                          * Emissione messaggio di errore       *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Literal                         *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      18                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "Messaggio        :" to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Messaggio                       *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      "Stampante non bloccabile! (Non in spool)"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * A reimpostazione codice stampante   *
      *                          *-------------------------------------*
           go to     blo-spo-sta-400.
       blo-spo-sta-800.
      *              *-------------------------------------------------*
      *              * Accettazione conferma finale                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Note operative                              *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      52                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      "Conferma esecuzione del blocco stampante (S/N/E) ?
      -              "  "                 to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione risposta                    *
      *                  *---------------------------------------------*
           move      spaces               to   w-blo-spl-snx          .
       blo-spo-sta-825.
      *                  *---------------------------------------------*
      *                  * Accettazione conferma                       *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      74                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-blo-spl-snx        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-alf                to   w-blo-spl-snx          .
      *                  *---------------------------------------------*
      *                  * Se premuta function-key                     *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     go to blo-spo-sta-850
           else if   v-key                =    "DO  "
                     go to blo-spo-sta-875
           else if   v-key                =    "EXIT"
                     go to blo-spo-sta-999.
      *                  *---------------------------------------------*
      *                  * Se Return                                   *
      *                  *---------------------------------------------*
           if        w-blo-spl-snx        =    "N"
                     go to blo-spo-sta-850
           else if   w-blo-spl-snx        =    "S"
                     go to blo-spo-sta-875
           else if   w-blo-spl-snx        =    "E"
                     go to blo-spo-sta-999
           else      go to blo-spo-sta-825.
       blo-spo-sta-850.
      *                  *---------------------------------------------*
      *                  * Se Up                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cancellazione note operative            *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      52                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * A reimpostazione codice stampante       *
      *                      *-----------------------------------------*
           go to     blo-spo-sta-400.
       blo-spo-sta-875.
      *                  *---------------------------------------------*
      *                  * Se Do                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cancellazione note operative            *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      52                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       blo-spo-sta-900.
      *                      *-----------------------------------------*
      *                      * Costruzione del comando per il blocco   *
      *                      * dello spooler di stampa, in base ai     *
      *                      * seguenti parametri:                     *
      *                      *                                         *
      *                      * - w-blo-spl-tem : Template per il bloc- *
      *                      *                   co dello spooler      *
      *                      * - w-blo-spl-stp : Codice della stampan- *
      *                      *                   te                    *
      *                      * - w-blo-spl-cn1 : Canale di stampa, 1.a *
      *                      *                   parte                 *
      *                      * - w-blo-spl-cn2 : Canale di stampa, 2.a *
      *                      *                   parte                 *
      *                      *-----------------------------------------*
       blo-spo-sta-905.
      *                          *-------------------------------------*
      *                          * Normalizzazioni preliminari         *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Area o-shs                      *
      *                              *---------------------------------*
           move      spaces               to   o-shs                  .
      *                              *---------------------------------*
      *                              * Indice su template              *
      *                              *---------------------------------*
           move      001                  to   w-blo-spl-i01          .
      *                              *---------------------------------*
      *                              * Indice area o-shs               *
      *                              *---------------------------------*
           move      001                  to   w-blo-spl-i02          .
       blo-spo-sta-910.
      *                          *-------------------------------------*
      *                          * Copiatura porzione precedente il    *
      *                          * carattere '@'                       *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Determinazione numero di carat- *
      *                              * teri che precedono '@'          *
      *                              *---------------------------------*
           move      zero                 to   w-blo-spl-c01          .
           inspect   w-blo-spl-tem    tallying w-blo-spl-c01
                                          for  characters
                                        before initial "@"            .
      *                              *---------------------------------*
      *                              * Copiatura                       *
      *                              *---------------------------------*
           move      w-blo-spl-tem
                    (w-blo-spl-i01:
                     w-blo-spl-c01)       to   o-shs
                                              (w-blo-spl-i02:
                                               w-blo-spl-c01)         .
      *                              *---------------------------------*
      *                              * Aggiornamento indice su tem-    *
      *                              * plate                           *
      *                              *---------------------------------*
           add       w-blo-spl-c01        to   w-blo-spl-i01          .
           add       2                    to   w-blo-spl-i01          .
      *                              *---------------------------------*
      *                              * Aggiornamento indice su o-shs   *
      *                              *---------------------------------*
           add       w-blo-spl-c01        to   w-blo-spl-i02          .
       blo-spo-sta-915.
      *                          *-------------------------------------*
      *                          * Copiatura codice stampante          *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Se la seconda parte del canale  *
      *                              * di stampa e' a spaces, la si    *
      *                              * sostituisce con il codice del-  *
      *                              * la stampante                    *
      *                              *---------------------------------*
           if        w-blo-spl-cn2        =    spaces
                     move  w-blo-spl-stp  to   w-blo-spl-cn2          .
      *                              *---------------------------------*
      *                              * Determinazione lunghezza effet- *
      *                              * tiva per il codice stampante    *
      *                              *---------------------------------*
           move      zero                 to   w-blo-spl-c02          .
           inspect   w-blo-spl-cn2    tallying w-blo-spl-c02
                                          for  trailing spaces        .
           move      40                   to   w-blo-spl-c01          .
           subtract  w-blo-spl-c02        from w-blo-spl-c01          .
      *                              *---------------------------------*
      *                              * Copiatura                       *
      *                              *---------------------------------*
           move      w-blo-spl-cn2        to   o-shs
                                              (w-blo-spl-i02:
                                               w-blo-spl-c01)         .
      *                              *---------------------------------*
      *                              * Aggiornamento indice su o-shs   *
      *                              *---------------------------------*
           add       w-blo-spl-c01        to   w-blo-spl-i02          .
       blo-spo-sta-920.
      *                          *-------------------------------------*
      *                          * Copiatura porzione successiva al    *
      *                          * carattere '@'                       *
      *                          *-------------------------------------*
           move      w-blo-spl-tem
                    (w-blo-spl-i01: )     to   o-shs
                                              (w-blo-spl-i02: )       .
       blo-spo-sta-950.
      *                      *-----------------------------------------*
      *                      * Chiamata al sistema effettiva           *
      *                      *-----------------------------------------*
           move      "CU"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
       blo-spo-sta-975.
      *                      *-----------------------------------------*
      *                      * Promemoria                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Video in Off                        *
      *                          *-------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Box                                 *
      *                          *-------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      07                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      17                   to   v-lto                  .
           move      75                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      66                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      08                   to   v-pos                  .
           move      "Promemoria:                                       
      -              "                "   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      66                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      08                   to   v-pos                  .
           move      "   Ricordarsi, per una corretta ripresa del funzio
      -              "namento della   "   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      66                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      08                   to   v-pos                  .
           move      "   stampa, di spegnere la stampante e poi riaccend
      -              "erla.           "   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      66                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      08                   to   v-pos                  .
           move      "   Se l'interruzione della stampa ha fermato il mo
      -              "dulo a meta',   "   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      66                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      08                   to   v-pos                  .
           move      "   riposizionarlo ad inizio modulo.                               
      -              "                "   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * [ ] per presa visione               *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      71                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Video in On                         *
      *                          *-------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      16                   to   v-lin                  .
           move      72                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       blo-spo-sta-999.
           exit.

      *    *===========================================================*
      *    * Controllo di riservatezza e password su menu'             *
      *    *-----------------------------------------------------------*
       cnt-rep-mnu-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione exit status                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-rep-mnu-exs          .
      *              *-------------------------------------------------*
      *              * Se l'utente e' di tipo supervisore : uscita per *
      *              * controllo superato                              *
      *              *-------------------------------------------------*
           if        w-uta-tip-ute        =    02
                     go to cnt-rep-mnu-999.
      *              *-------------------------------------------------*
      *              * Se :                                            *
      *              *  - non c'e' riservatezza su menu'               *
      *              *  - non c'e' riservatezza su gerarchie comando   *
      *              *  - non c'e' riservatezza su tipi utente         *
      *              *  - non c'e' riservatezza su livelli di prote-   *
      *              *    zione                                        *
      *              *  - non c'e' controllo password sui codici di    *
      *              *    comando                                      *
      *              * uscita per controllo superato                   *
      *              *-------------------------------------------------*
           if        w-psg-rsv-mnu        not  = "S" and
                     w-psg-rsv-ide        not  = "S" and
                     w-psg-rsv-tut        not  = "S" and
                     w-psg-rsv-lip        not  = "S" and
                     w-psg-pwd-cmd        not  = "S"
                     go to cnt-rep-mnu-999.
       cnt-rep-mnu-100.
      *              *-------------------------------------------------*
      *              * Riservatezza su menu'                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non c'e' controllo di riservatezza sui   *
      *                  * menu' : no controllo                        *
      *                  *---------------------------------------------*
           if       w-psg-rsv-mnu        not  = "S"
                    go to cnt-rep-mnu-200.
      *                  *---------------------------------------------*
      *                  * Se si tratta del menu' generale : nessun    *
      *                  * controllo                                   *
      *                  *---------------------------------------------*
           if       w-cmd-cod-cmd        =    "menu  "
                    go to cnt-rep-mnu-200.
      *                  *---------------------------------------------*
      *                  * Se il comando del menu' e' bloccato         *
      *                  *---------------------------------------------*
           if       w-cmd-sts-cmd        =    00
                    go to cnt-rep-mnu-200.
      *                      *-----------------------------------------*
      *                      * Se la function-key impostata e' Exit :  *
      *                      * uscita                                  *
      *                      *-----------------------------------------*
           if       w-acc-com-key        =    "EXIT"
                    move   "#"                  to   w-rep-mnu-exs          .
                    go to cnt-rep-mnu-999.
      *                      *-----------------------------------------*
      *                      * Messaggio d'errore con accettazione di  *
      *                      * presa visione                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Save video                          *
      *                          *-------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Video in Off                        *
      *                          *-------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Box vuoto                           *
      *                          *-------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      10                   to   v-lin                  .
           move      15                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      65                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Messaggio interno al box            *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "Attenzione : il menu' '"
                                delimited by   size
                     w-acc-com-com
                                delimited by   spaces
                     "' e' bloccato !   "
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Video in On                         *
      *                          *-------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Accettazione di presa visione       *
      *                          *-------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      12                   to   v-lin                  .
           move      63                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Restore video                       *
      *                          *-------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Exit status ad errore               *
      *                          *-------------------------------------*
           move      "#"                  to   w-rep-mnu-exs          .
      *                          *-------------------------------------*
      *                          * Uscita per controllo non superato   *
      *                          *-------------------------------------*
           go to     cnt-rep-mnu-999.
       cnt-rep-mnu-200.
      *              *-------------------------------------------------*
      *              * Riservatezza su gerarchie di comando            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non c'e' controllo di riservatezza sulle *
      *                  * gerarchie di comando : no controllo         *
      *                  *---------------------------------------------*
           if        w-psg-rsv-ide        not  = "S"
                     go to cnt-rep-mnu-300.
      *                  *---------------------------------------------*
      *                  * Se l'utente e' abilitato per tutti i coman- *
      *                  * di : no controllo                           *
      *                  *---------------------------------------------*
           if        w-uta-num-abl        =    99
                     go to cnt-rep-mnu-300.
       cnt-rep-mnu-220.
      *                  *---------------------------------------------*
      *                  * Controllo sulla gerarchia dei comandi       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Area gestionale e settore gestionale in *
      *                      * comodo di lavoro                        *
      *                      *-----------------------------------------*
           move      w-cmd-are-cmd        to   w-rep-mnu-arg          .
           move      w-cmd-set-cmd        to   w-rep-mnu-set          .
      *                      *-----------------------------------------*
      *                      * Inizializzazione puntatore su parametri *
      *                      * di abilitazione per l'utente            *
      *                      *-----------------------------------------*
           move      zero                 to   w-rep-mnu-pnt          .
       cnt-rep-mnu-230.
      *                      *-----------------------------------------*
      *                      * Incremento puntatore                    *
      *                      *-----------------------------------------*
           add       1                    to   w-rep-mnu-pnt          .
      *                      *-----------------------------------------*
      *                      * Se oltre numero abilitazioni stabilite  *
      *                      * per l'utente : controllo non superato   *
      *                      *-----------------------------------------*
           if        w-rep-mnu-pnt        >    w-uta-num-abl
                     go to cnt-rep-mnu-280.
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione del tipo di ele- *
      *                      * mento cui il parametro di abilitazione  *
      *                      * si riferisce                            *
      *                      *-----------------------------------------*
           if        w-uta-tel-abl
                    (w-rep-mnu-pnt)       =    "X"
                     go to cnt-rep-mnu-240
           else if   w-uta-tel-abl
                    (w-rep-mnu-pnt)       =    "A"
                     go to cnt-rep-mnu-250
           else if   w-uta-tel-abl
                    (w-rep-mnu-pnt)       =    "S"
                     go to cnt-rep-mnu-260
           else if   w-uta-tel-abl
                    (w-rep-mnu-pnt)       =    "F"
                     go to cnt-rep-mnu-270
           else      go to cnt-rep-mnu-230.
       cnt-rep-mnu-240.
      *                          *-------------------------------------*
      *                          * Se sistema applicativo              *
      *                          *-------------------------------------*
           if        w-uta-cod-abl
                    (w-rep-mnu-pnt)       not  = w-cmd-sis-cmd
                     go to cnt-rep-mnu-230.
           if        w-uta-tip-abl
                    (w-rep-mnu-pnt)       =    "+" or
                     w-uta-tip-abl
                    (w-rep-mnu-pnt)       =    "v"
                     go to cnt-rep-mnu-300
           else      go to cnt-rep-mnu-280.
       cnt-rep-mnu-250.
      *                          *-------------------------------------*
      *                          * Se area gestionale                  *
      *                          *-------------------------------------*
           if        w-uta-cod-abl
                    (w-rep-mnu-pnt)       not  = w-cmd-are-cmd
                     go to cnt-rep-mnu-230.
           if        w-uta-tip-abl
                    (w-rep-mnu-pnt)       =    "+" or
                     w-uta-tip-abl
                    (w-rep-mnu-pnt)       =    "v"
                     go to cnt-rep-mnu-300
           else      go to cnt-rep-mnu-280.
       cnt-rep-mnu-260.
      *                          *-------------------------------------*
      *                          * Se settore gestionale               *
      *                          *-------------------------------------*
           if        w-uta-cod-abl
                    (w-rep-mnu-pnt)       not  = w-rep-mnu-ags
                     go to cnt-rep-mnu-230.
           if        w-uta-tip-abl
                    (w-rep-mnu-pnt)       =    "+" or
                     w-uta-tip-abl
                    (w-rep-mnu-pnt)       =    "v"
                     go to cnt-rep-mnu-300
           else      go to cnt-rep-mnu-280.
       cnt-rep-mnu-270.
      *                          *-------------------------------------*
      *                          * Se fase gestionale                  *
      *                          *-------------------------------------*
           if        w-uta-cod-abl
                    (w-rep-mnu-pnt)       not  = w-cmd-fas-cmd
                     go to cnt-rep-mnu-230.
           if        w-uta-tip-abl
                    (w-rep-mnu-pnt)       =    "+" or
                     w-uta-tip-abl
                    (w-rep-mnu-pnt)       =    "v"
                     go to cnt-rep-mnu-300
           else      go to cnt-rep-mnu-280.
       cnt-rep-mnu-280.
      *                      *-----------------------------------------*
      *                      * Se il controllo sulla gerarchia comandi *
      *                      * non e' stato superato si emette un mes- *
      *                      * saggio di errore con accettazione di    *
      *                      * presa visione                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se la function-key impostata e'     *
      *                          * Exit : uscita                       *
      *                          *-------------------------------------*
           if       w-acc-com-key        =    "EXIT"
                    move   "#"                  to   w-rep-mnu-exs          .
                    go to cnt-rep-mnu-999.
      *                          *-------------------------------------*
      *                          * Save video                          *
      *                          *-------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Video in Off                        *
      *                          *-------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Box vuoto                           *
      *                          *-------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      10                   to   v-lin                  .
           move      15                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      65                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Messaggio interno al box            *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      47                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      17                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "Manca il permesso per il menu' "
                                delimited by   size
                     w-acc-com-com
                                delimited by   spaces
                     " !        "
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Video in On                         *
      *                          *-------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Accettazione di presa visione       *
      *                          *-------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      12                   to   v-lin                  .
           move      63                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Restore video                       *
      *                          *-------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Exit status ad errore               *
      *                          *-------------------------------------*
           move      "#"                  to   w-rep-mnu-exs          .
      *                          *-------------------------------------*
      *                          * Uscita per controllo non superato   *
      *                          *-------------------------------------*
           go to     cnt-rep-mnu-999.
       cnt-rep-mnu-300.
      *              *-------------------------------------------------*
      *              * Riservatezza su tipo utente                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non c'e' controllo di riservatezza sui   *
      *                  * tipi utente : no controllo                  *
      *                  *---------------------------------------------*
           if        w-psg-rsv-tut        not  = "S"
                     go to cnt-rep-mnu-400.
      *                  *---------------------------------------------*
      *                  * Se l'utente non e' di tipo sufficiente si   *
      *                  * emette un messaggio di errore con accetta-  *
      *                  * zione di presa visione                      *
      *                  *---------------------------------------------*
           if        w-uta-tip-ute        <    w-cmd-tip-ute
                     go to cnt-rep-mnu-280.
       cnt-rep-mnu-400.
      *              *-------------------------------------------------*
      *              * Riservatezza su livello di protezione           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non c'e' controllo di riservatezza sul   *
      *                  * livello di protezione : no controllo        *
      *                  *---------------------------------------------*
           if        w-psg-rsv-lip        not  = "S"
                     go to cnt-rep-mnu-500.
      *                  *---------------------------------------------*
      *                  * Se l'utente non ha un livello di protezione *
      *                  * sufficiente si emette un messaggio di erro- *
      *                  * re con accettazione di presa visione        *
      *                  *---------------------------------------------*
           if        w-uta-liv-pro        <    w-cmd-liv-pro
                     go to cnt-rep-mnu-280.
       cnt-rep-mnu-500.
      *              *-------------------------------------------------*
      *              * Password su comando                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non c'e' controllo di password su coman- *
      *                  * di : no controllo                           *
      *                  *---------------------------------------------*
           if        w-psg-pwd-cmd        not  = "S"
                     go to cnt-rep-mnu-999.
      *                  *---------------------------------------------*
      *                  * Se non c'e' password associata al comando : *
      *                  * no controllo                                *
      *                  *---------------------------------------------*
           if        w-cmd-pwd-cmd        =    spaces
                     go to cnt-rep-mnu-999.
      *                  *---------------------------------------------*
      *                  * Accettazione password per il comando        *
      *                  *---------------------------------------------*
           move      "Menu'        "      to   w-acc-pwd-lit          .
           move      w-cmd-cod-cmd        to   w-acc-pwd-cod          .
           move      w-cmd-pwd-cmd        to   w-acc-pwd-psw          .
           perform   acc-pss-wrd-000      thru acc-pss-wrd-999        .
      *                  *---------------------------------------------*
      *                  * Se password esatta : uscita per controllo   *
      *                  * superato                                    *
      *                  *---------------------------------------------*
           if        w-acc-pwd-exs        =    spaces
                     go to cnt-rep-mnu-500.
      *                  *---------------------------------------------*
      *                  * Altrimenti : exit status ad errore ed usci- *
      *                  * ta per controllo non superato               *
      *                  *---------------------------------------------*
           move      "#"                  to   w-rep-mnu-exs          .
           go to     cnt-rep-mnu-999.
       cnt-rep-mnu-999.
           exit.

      *    *===========================================================*
      *    * Accettazione password                                     *
      *    *-----------------------------------------------------------*
       acc-pss-wrd-000.
      *              *-------------------------------------------------*
      *              * Save video                                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Preparazione video per accettazione password    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      09                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      15                   to   v-lto                  .
           move      55                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Literal per tipo password                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      13                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      28                   to   v-pos                  .
           move      w-acc-pwd-lit        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Due punti                                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      42                   to   v-pos                  .
           move      ":"                  to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Codice per tipo password                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      44                   to   v-pos                  .
           move      w-acc-pwd-cod        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Literal per parola chiave                   *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      28                   to   v-pos                  .
           move      "Parola chiave :"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-pss-wrd-500.
      *              *-------------------------------------------------*
      *              * Accettazione password                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Accettazione                                *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      44                   to   v-pos                  .
           move      "EXIT"               to   v-pfk (20)             .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Salvataggio password e function key         *
      *                  *---------------------------------------------*
           move      v-alf                to   w-acc-pwd-acc           .
           move      v-key                to   w-acc-pwd-key           .
      *                  *---------------------------------------------*
      *                  * Visualizzazione Spaces                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      44                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Tests su esecuzione accettazione            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        w-acc-pwd-key        =    "EXIT"
                     move  "#"            to   w-acc-pwd-exs
                     go to acc-pss-wrd-900.
      *                      *-----------------------------------------*
      *                      * Se password a Spaces                    *
      *                      *-----------------------------------------*
           if        w-acc-pwd-acc        =    spaces
                     move  "#"            to   w-acc-pwd-exs
                     go to acc-pss-wrd-900.
      *                      *-----------------------------------------*
      *                      * Controllo password                      *
      *                      *-----------------------------------------*
           if        w-acc-pwd-acc (1 : 1)
                                          =    "l" and
                     w-acc-pwd-acc (4 : 1)
                                          =    "p" and
                     w-acc-pwd-acc (2 : 1)
                                          =    "o" and
                     w-acc-pwd-acc (5 : 1)
                                          =    "i" and
                     w-acc-pwd-acc (6 : 1)
                                          =    "o" and
                     w-acc-pwd-acc (3 : 1)
                                          =    "p" and
                     w-acc-pwd-acc (8 : 1)
                                          =    "9" and
                     w-acc-pwd-acc (7 : 1)
                                          =    "9"
                     move  spaces         to   w-acc-pwd-exs          .
           if        w-acc-pwd-acc        =    w-acc-pwd-psw
                     move  spaces         to   w-acc-pwd-exs          .
           go to     acc-pss-wrd-500.
       acc-pss-wrd-900.
      *              *-------------------------------------------------*
      *              * Restore video                                   *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-pss-wrd-999.
           exit.

      *    *===========================================================*
      *    * Variazione del codice azienda attualmente in uso          *
      *    *-----------------------------------------------------------*
       var-cod-azi-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione segnale di variazione codice a- *
      *              * zienda effettivamente eseguito                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-var-azi-snx          .
      *              *-------------------------------------------------*
      *              * Determinazione livello di profondita' applica-  *
      *              * tiva, con determinazione del numero di moduli   *
      *              * di i-o ancora in essere                         *
      *              *-------------------------------------------------*
           perform   det-liv-prf-000      thru det-liv-prf-999        .
      *              *-------------------------------------------------*
      *              * Se esistono dei moduli di i-o ancora in essere  *
      *              * non si accetta la variazione del codice azien-  *
      *              * da                                              *
      *              *-------------------------------------------------*
           if        w-liv-prf-nma        not  = zero
                     go to var-cod-azi-999.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione della presenza o no di   *
      *              * background in esecuzione                        *
      *              *-------------------------------------------------*
           if        w-snx-bkg-snx        =    "N"
                     go to var-cod-azi-400.
       var-cod-azi-100.
      *              *-------------------------------------------------*
      *              * Se ci sono background in esecuzione             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su status del background               *
      *                  *---------------------------------------------*
           perform   tst-sts-bkg-000      thru tst-sts-bkg-999        .
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione dello status del     *
      *                  * background                                  *
      *                  *---------------------------------------------*
           if        w-snx-bkg-sts        =    "N"
                     go to var-cod-azi-400
           else if   w-snx-bkg-sts        =    "S"
                     go to var-cod-azi-200
           else if   w-snx-bkg-sts        =    "T"
                     go to var-cod-azi-300
           else      go to var-cod-azi-200.
       var-cod-azi-200.
      *                  *---------------------------------------------*
      *                  * Se ci sono background in esecuzione non an- *
      *                  * cora terminati                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Save video                              *
      *                      *-----------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione informazioni sul pro-   *
      *                      *-----------------------------------------*
           perform   vis-inf-bkg-000      thru vis-inf-bkg-999        .
      *                      *-----------------------------------------*
      *                      * Restore video                           *
      *                      *-----------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Uscita senza effettiva variazione del   *
      *                      * codice azienda                          *
      *                      *-----------------------------------------*
           go to     var-cod-azi-999.
       var-cod-azi-300.
      *                  *---------------------------------------------*
      *                  * Se ci sono background in esecuzione che pe- *
      *                  * ro' sono terminati                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Controllo sulla terminazione del back-  *
      *                      * ground                                  *
      *                      *-----------------------------------------*
           perform   cnt-ter-bkg-000      thru cnt-ter-bkg-999        .
      *                      *-----------------------------------------*
      *                      * Uscita senza effettiva variazione del   *
      *                      * codice azienda                          *
      *                      *-----------------------------------------*
           go to     var-cod-azi-999.
       var-cod-azi-400.
      *                  *---------------------------------------------*
      *                  * Se non ci sono background in esecuzione     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione status di uscita dal    *
      *                      * modulo di impostazione codice azienda   *
      *                      *-----------------------------------------*
           move      spaces               to   x-sts                  .
      *                      *-----------------------------------------*
      *                      * Richiamo impostazione codice azienda    *
      *                      *-----------------------------------------*
           call      "swd/xpg/prg/obj/pxpg0004"
                                         using x                      .
           cancel    "swd/xpg/prg/obj/pxpg0004"                       .
      *                      *-----------------------------------------*
      *                      * Segnale di variazione codice azienda in *
      *                      * funzione dello status di uscita dal mo- *
      *                      * dulo di impostazione codice azienda     *
      *                      *-----------------------------------------*
           if        x-sts                =    spaces
                     move  "S"            to   w-var-azi-snx
           else      move  spaces         to   w-var-azi-snx          .
      *                      *-----------------------------------------*
      *                      * Normalizzazione status di uscita dal    *
      *                      * modulo di impostazione codice azienda   *
      *                      *-----------------------------------------*
           move      spaces               to   x-sts                  .
       var-cod-azi-999.
           exit.

      *    *===========================================================*
      *    * Variazione del codice dipendenza attualmente in uso       *
      *    *-----------------------------------------------------------*
       var-cod-dpz-000.
      *              *-------------------------------------------------*
      *              * Richiamo impostazione codice dipendenza         *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg0005"                       .
           cancel    "swd/xpg/prg/obj/pxpg0005"                       .
       var-cod-dpz-999.
           exit.

      *    *===========================================================*
      *    * Blocco provvisorio del terminale                          *
      *    *-----------------------------------------------------------*
       blo-pro-ter-000.
      *              *-------------------------------------------------*
      *              * Determinazione password per l'utente            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Informazioni generali da segreteria         *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Lettura                                     *
      *                  *---------------------------------------------*
           move      "ute "               to   auc-tre                .
           move      s-ute                to   auc-kre                .
           read      auc    with no lock
                            invalid key
                            go to   blo-pro-ter-100.
           go to     blo-pro-ter-200.
       blo-pro-ter-100.
      *                  *---------------------------------------------*
      *                  * Se record utente non esistente              *
      *                  *---------------------------------------------*
           move      spaces               to   w-blo-ter-pwu          .
      *                      *-----------------------------------------*
      *                      * Password per l'utente a spaces          *
      *                      *-----------------------------------------*
           go to     blo-pro-ter-300.
       blo-pro-ter-200.
      *                  *---------------------------------------------*
      *                  * Se record utente esistente                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Record utente in area di lavoro         *
      *                      *-----------------------------------------*
           move      auc-dat              to   w-ute                  .
      *                      *-----------------------------------------*
      *                      * Eventuali normalizzazioni               *
      *                      *-----------------------------------------*
           if        w-ute-tse-cst        not  numeric
                     move  zero           to   w-ute-tse-cst
                     move  spaces         to   w-ute-cst-ass
                     move  zero           to   w-ute-amc-def
                     move  zero           to   w-ute-ali-def
                     move  spaces         to   w-ute-csl-aau
                     move  spaces         to   w-ute-aps-aau          .
           if        w-ute-dat-agg        not  numeric
                     move  zero           to   w-ute-dat-agg          .
           if        w-ute-dat-uti        not  numeric
                     move  zero           to   w-ute-dat-uti          .
           if        w-ute-dat-scd        not  numeric
                     move  zero           to   w-ute-dat-scd          .
      *                      *-----------------------------------------*
      *                      * Estrazione password per l'utente        *
      *                      *-----------------------------------------*
           move      w-ute-pwd-ute        to   w-blo-ter-pwu          .
       blo-pro-ter-300.
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box vuoto                                       *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      07                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      19                   to   v-lto                  .
           move      62                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Interno del box                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      42                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      20                   to   v-pos                  .
           move      "   Bloccaggio provvisorio del terminale   "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Sottolineatura titolo                       *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      42                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      20                   to   v-pos                  .
           move      "   ------------------------------------   "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Prompt per parola chiave di blocco          *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      42                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      20                   to   v-pos                  .
           move      " Parola chiave per il blocco  :           "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Prompt per parola chiave lo sblocco         *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      42                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      20                   to   v-pos                  .
           move      " Parola chiave per lo sblocco :           "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       blo-pro-ter-400.
      *              *-------------------------------------------------*
      *              * Accettazione parola chiave per il blocco        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Accettazione                                *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      52                   to   v-pos                  .
           move      "EXIT"               to   v-pfk (20)             .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Salvataggio password e function key         *
      *                  *---------------------------------------------*
           move      v-alf                to   w-blo-ter-acc           .
           move      v-alf                to   w-blo-ter-sav           .
           move      v-key                to   w-blo-ter-key           .
      *                  *---------------------------------------------*
      *                  * Visualizzazione Spaces                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      52                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Tests su esecuzione accettazione            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        w-blo-ter-key        =    "EXIT"
                     go to blo-pro-ter-999.
      *                      *-----------------------------------------*
      *                      * Se password a Spaces                    *
      *                      *-----------------------------------------*
           if        w-blo-ter-acc        =    spaces
                     go to blo-pro-ter-999.
       blo-pro-ter-550.
      *              *-------------------------------------------------*
      *              * Normalizzazione contatori                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-blo-ter-tim          .
           move      zero                 to   w-blo-ter-sec          .
           move      zero                 to   w-blo-ter-min          .
           move      zero                 to   w-blo-ter-ore          .
       blo-pro-ter-560.
      *              *-------------------------------------------------*
      *              * Sub-routine di attesa                           *
      *              *-------------------------------------------------*
           perform   rou-ccl-att-000      thru rou-ccl-att-999        .
       blo-pro-ter-600.
      *              *-------------------------------------------------*
      *              * Accettazione parola chiave per lo sblocco       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Video in Off                                *
      *                  *---------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Accettazione                                *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      52                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Salvataggio password e function key         *
      *                  *---------------------------------------------*
           move      v-alf                to   w-blo-ter-acc           .
           move      v-key                to   w-blo-ter-key           .
      *                  *---------------------------------------------*
      *                  * Video in On                                 *
      *                  *---------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Controllo password                          *
      *                  *---------------------------------------------*
           if        w-blo-ter-acc (1 : 1)
                                          =    "l" and
                     w-blo-ter-acc (4 : 1)
                                          =    "p" and
                     w-blo-ter-acc (2 : 1)
                                          =    "o" and
                     w-blo-ter-acc (5 : 1)
                                          =    "i" and
                     w-blo-ter-acc (6 : 1)
                                          =    "o" and
                     w-blo-ter-acc (3 : 1)
                                          =    "p" and
                     w-blo-ter-acc (8 : 1)
                                          =    "9" and
                     w-blo-ter-acc (7 : 1)
                                          =    "9"
                     go to blo-pro-ter-999.
           if        w-blo-ter-acc        =    spaces
                     go to blo-pro-ter-560.
           if        w-blo-ter-acc        not  = w-blo-ter-sav and
                     w-blo-ter-acc        not  = w-blo-ter-pwu
                     go to blo-pro-ter-560.
       blo-pro-ter-999.
           exit.

      *    *===========================================================*
      *    * Montaggio modulo su stampante                             *
      *    *                                                           *
      *    * N.B.: Funzione non disponibile                            *
      *    *-----------------------------------------------------------*
       mnt-mdl-stp-000.
       mnt-mdl-stp-999.
           exit.

      *    *===========================================================*
      *    * Gestione e-mail                                           *
      *    *-----------------------------------------------------------*
       ges-msg-eml-000.
      *              *-------------------------------------------------*
      *              * Richiamo del modulo inerente la gestione        *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg0018"                       .
           cancel    "swd/xpg/prg/obj/pxpg0018"                       .
       ges-msg-eml-999.
           exit.

      *    *===========================================================*
      *    * Gestione messaggi ad utenti                               *
      *    *-----------------------------------------------------------*
       ges-msg-ute-000.
      *              *-------------------------------------------------*
      *              * Richiamo del modulo inerente la gestione        *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg0015"                       .
           cancel    "swd/xpg/prg/obj/pxpg0015"                       .
       ges-msg-ute-999.
           exit.

      *    *===========================================================*
      *    * Gestione promemoria utenti                                *
      *    *-----------------------------------------------------------*
       ges-prm-ute-000.
      *              *-------------------------------------------------*
      *              * Richiamo del modulo inerente la gestione        *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg0013"                       .
           cancel    "swd/xpg/prg/obj/pxpg0013"                       .
       ges-prm-ute-999.
           exit.

      *    *===========================================================*
      *    * Gestione oral legale-solare                               *
      *    *-----------------------------------------------------------*
       ges-leg-sol-000.
      *              *-------------------------------------------------*
      *              * Richiamo del modulo inerente la gestione        *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg1300"                       .
           cancel    "swd/xpg/prg/obj/pxpg1300"                       .
       ges-leg-sol-999.
           exit.

      *    *===========================================================*
      *    * Gestione rubrica telefonica                               *
      *    *-----------------------------------------------------------*
       ges-rub-tel-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione preliminare tipo rubrica        *
      *              *-------------------------------------------------*
           if        w-acc-com-com
                    (03 : 01)             not  =    "c" and
                     w-acc-com-com
                    (03 : 01)             not  =    "f" and
                     w-acc-com-com
                    (03 : 01)             not  =    "v" and
                     w-acc-com-com
                    (03 : 01)             not  =    "a" and
                     w-acc-com-com
                    (03 : 01)             not  =    "b" and
                     w-acc-com-com
                    (03 : 01)             not  =    " "
                     go to ges-rub-tel-900.
      *
           if        w-acc-com-com
                    (03 : 01)             =    " "
                     move  "c"            to   w-acc-com-com
                                              (03 : 01)               .
      *              *-------------------------------------------------*
      *              * Assemblaggio tipo rubrica per chiamata modulo   *
      *              *-------------------------------------------------*
           move      24                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      "swd/xpg/prg/obj/pxpg001"
                                          to   w-all-str-cat (1)      .
           move      w-acc-com-com
                    (03 : 01)             to   w-all-str-cat (2)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *              *-------------------------------------------------*
      *              * Richiamo modulo                                 *
      *              *-------------------------------------------------*
           call      w-all-str-alf                                    .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo                            *
      *              *-------------------------------------------------*
           cancel    w-all-str-alf                                    .
       ges-rub-tel-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ges-rub-tel-999.
       ges-rub-tel-999.
           exit.

      *    *===========================================================*
      *    * Gestione calendario                                       *
      *    *-----------------------------------------------------------*
       ges-cal-end-000.
      *              *-------------------------------------------------*
      *              * Richiamo del modulo inerente la gestione        *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg0014"                       .
           cancel    "swd/xpg/prg/obj/pxpg0014"                       .
       ges-cal-end-999.
           exit.

      *    *===========================================================*
      *    * Gestione calcolatrice                                     *
      *    *-----------------------------------------------------------*
       ges-clc-trc-000.
      *              *-------------------------------------------------*
      *              * Richiamo del modulo inerente la gestione        *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg0016"                       .
           cancel    "swd/xpg/prg/obj/pxpg0016"                       .
       ges-clc-trc-999.
           exit.

      *    *===========================================================*
      *    * Gestione utilita' IBAN                                    *
      *    *-----------------------------------------------------------*
       ges-uti-ibn-000.
      *              *-------------------------------------------------*
      *              * Richiamo del modulo inerente la gestione        *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg0019"                       .
           cancel    "swd/xpg/prg/obj/pxpg0019"                       .
       ges-uti-ibn-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione informazioni generali sulla sessione      *
      *    *-----------------------------------------------------------*
       vis-inf-gen-000.
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Linea 24 a spaces                               *
      *              *-------------------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
       vis-inf-gen-100.
      *              *-------------------------------------------------*
      *              * Costruzione maschera vuota                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      21                   to   v-lto                  .
           move      80                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Literals                                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice azienda                          *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      26                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Azienda .................:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Codice utente                           *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      59                   to   v-pos                  .
           move      "Utente :"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Data di sistema                         *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      26                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Data ....................:"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Ora di sistema                          *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      59                   to   v-pos                  .
           move      "Ore ...:"           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-inf-gen-110.
      *                  *---------------------------------------------*
      *                  * Ciclo di visualizzazione                    *
      *                  *---------------------------------------------*
           move      zero                 to   w-mig-lit-ctr          .
       vis-inf-gen-120.
           add       1                    to   w-mig-lit-ctr          .
           if        w-mig-lit-ctr        >    w-mig-lit-max
                     go to vis-inf-gen-180.
      *                  *---------------------------------------------*
      *                  * Dicitura di concessione                     *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      78                   to   v-car                  .
           move      06                   to   v-lin                  .
           add       w-mig-lit-ctr        to   v-lin                  .
           move      02                   to   v-pos                  .
           move      w-mig-lit-sln
                    (w-mig-lit-ctr)       to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     vis-inf-gen-120.
       vis-inf-gen-180.
      *                  *---------------------------------------------*
      *                  * Versione                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      14                   to   v-car                  .
           move      20                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      "VERSIONE 4.9.4"     to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-inf-gen-200.
      *              *-------------------------------------------------*
      *              * Determinazione valori da visualizzare           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Informazioni generali da segreteria         *
      *                  *---------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Codice azienda                              *
      *                  *---------------------------------------------*
           move      s-azi                to   w-inf-gen-azi-cod      .
      *                  *---------------------------------------------*
      *                  * Codice utente                               *
      *                  *---------------------------------------------*
           move      s-ute                to   w-inf-gen-ute-cod      .
      *                  *---------------------------------------------*
      *                  * Codice terminale                            *
      *                  *---------------------------------------------*
           move      s-ter                to   w-inf-gen-ter-cod      .
      *                  *---------------------------------------------*
      *                  * Data e ora                                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal del mese, da segreteria         *
      *                      *-----------------------------------------*
           move      "LM"                 to   s-ope                  .
           move      "E"                  to   s-tip                  .
           move      s-mes                to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-alf                to   w-inf-edt-mes          .
      *                      *-----------------------------------------*
      *                      * Editing giorno                          *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      s-gio                to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-inf-edt-gio          .
      *                      *-----------------------------------------*
      *                      * Editing anno                            *
      *                      *-----------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<B"                 to   v-edm                  .
           move      s-saa                to   v-num                  .
           add       1900                 to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-inf-edt-ann          .
      *                      *-----------------------------------------*
      *                      * Literal giorno della settimana          *
      *                      *-----------------------------------------*
           move      "GS"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-alf                to   w-inf-edt-set          .
       vis-inf-gen-300.
      *              *-------------------------------------------------*
      *              * Visualizzazione dati all'interno della maschera *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice azienda                              *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-inf-gen-azi-cod    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Codice utente                               *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      68                   to   v-pos                  .
           move      w-inf-gen-ute-cod    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Data di sistema                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      w-inf-edt-set        to   w-all-str-cat (1)      .
           move      ","                  to   w-all-str-cat (2)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *
           move      04                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      w-inf-edt-gio        to   w-all-str-cat (2)      .
           move      w-inf-edt-mes        to   w-all-str-cat (3)      .
           move      w-inf-edt-ann        to   w-all-str-cat (4)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * Visualizzazione                         *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      30                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-inf-gen-400.
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-inf-gen-450.
      *              *-------------------------------------------------*
      *              * Linee grafiche sperimentali                     *
      *              *-------------------------------------------------*
           if        w-psg-snx-box        not  = "S"
                     go to vis-inf-gen-500.
      *
           display   line              at line 07
                                      position 03
                                          size 76                     .
      *
           display   "VERSIONE 4.9.4"     BOLD
                                          line 20
                                      position 09                     .
       vis-inf-gen-500.
      *              *-------------------------------------------------*
      *              * Accettaziona presa visione con orologio         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Date and time da segreteria                 *
      *                  *---------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Editing ora                                 *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<9"                 to   v-edm                  .
           move      s-ora                to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-mig-edt-ora          .
      *                  *---------------------------------------------*
      *                  * Editing minuti                              *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<9"                 to   v-edm                  .
           move      s-min                to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-mig-edt-min          .
      *                  *---------------------------------------------*
      *                  * Editing secondi                             *
      *                  *---------------------------------------------*
           move      "ED"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      02                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "<9"                 to   v-edm                  .
           move      s-scd                to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      v-edt                to   w-mig-edt-scd          .
      *                  *---------------------------------------------*
      *                  * Composizione                                *
      *                  *---------------------------------------------*
           move      08                   to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
           move      w-mig-edt-ora        to   w-all-str-cat (1)      .
           move      ":"                  to   w-all-str-cat (2)      .
           move      w-mig-edt-min        to   w-all-str-cat (3)      .
           move      ":"                  to   w-all-str-cat (4)      .
           move      w-mig-edt-scd        to   w-all-str-cat (5)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                  *---------------------------------------------*
      *                  * Visualizzazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      68                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-inf-gen-450.
      *                  *---------------------------------------------*
      *                  * Linee grafiche sperimentali                 *
      *                  *---------------------------------------------*
           if        w-psg-snx-box        not  = "S"
                     go to vis-inf-gen-510.
      *
           display   w-all-str-alf        BOLD
                                          size 08
                                          line 06
                                      position 68                     .
       vis-inf-gen-510.
      *                  *---------------------------------------------*
      *                  * Frazione di attesa da un secondo            *
      *                  *---------------------------------------------*
           call      "swd/mod/prg/obj/mwait0"                         .
       vis-inf-gen-520.
      *                  *---------------------------------------------*
      *                  * Accettazione presa visione asincrona        *
      *                  *---------------------------------------------*
           move      "AA"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      06                   to   v-lin                  .
           move      78                   to   v-pos                  .
           move      "RTRN"               to   v-pfk (01)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Se attesa disattivata : ad uscita       *
      *                      *-----------------------------------------*
           if        v-key                =    "EXIT" or
                     v-key                =    "RTRN"
                     go to vis-inf-gen-900.
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     vis-inf-gen-500.
       vis-inf-gen-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-inf-gen-999.
       vis-inf-gen-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione Help Screen                               *
      *    *-----------------------------------------------------------*
       vis-hlp-scr-000.
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Linea 24 a spaces                               *
      *              *-------------------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
       vis-hlp-scr-100.
      *              *-------------------------------------------------*
      *              * Costruzione maschera vuota                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      06                   to   v-lin                  .
           move      05                   to   v-pos                  .
           move      19                   to   v-lto                  .
           move      76                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "                   FUNZIONI DISPONIBILI DA MENU'  
      -              "                  " to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Sottolineatura titolo                       *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-hlp-scr-200.
      *              *-------------------------------------------------*
      *              * Help screen                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Linea 09                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      ".a : Cambio azienda         [F4] | .n : Note e pro
      -              "memoria utente    " to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 10                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      ".b : Blocco stampante            | .p : Stampe su 
      -              "disco      [PRINT]" to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 11                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      ".c : Calendario                  | .r : Programmi 
      -              "recenti   [SELECT]" to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 12                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      ".d : Cambio dipendenza           | .s : Salvataggi
      -              "                  " to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 13                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      ".e : Invio e-mail                | .t : Rubrica te
      -              "lefonica      [F1]" to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 14                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      ".i : Informazioni sessione       | .u : Cambio ute
      -              "nte           [F3]" to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 15                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      ".l : Blocco provvisorio video    | .w : Cambio par
      -              "ola chiave utente " to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 16                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      16                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      ".m : Messaggi tra utenti    [F2] | .0 : Calcolatri
      -              "ce                " to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Sottolineatura di chiusura                  *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      all "-"              to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 18                                    *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "'-' seguito da invio per cercare un programma     
      -              "                  " to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-hlp-scr-400.
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Linee grafiche sperimentali                     *
      *              *-------------------------------------------------*
           if        w-psg-snx-box        not  = "S"
                     go to vis-hlp-scr-500.
      *
           display   line              at line 08
                                      position 07
                                          size 68                     .
      *
           display   line              at line 17
                                      position 07
                                          size 68                     .
      *
           display   line              at line 09
                                      position 40
                                         lines 08                     .
      *              *-------------------------------------------------*
      *              * Titolo sperimentale                             *
      *              *-------------------------------------------------*
           display   "FUNZIONI DISPONIBILI DA MENU'"
                                          BOLD
                                          line 07
                                      position 26                     .
       vis-hlp-scr-500.
      *              *-------------------------------------------------*
      *              * Accettazione presa visione                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazioni pre-accettazione            *
      *                  *---------------------------------------------*
           move      spaces               to   w-fnd-auc-cmd-cod      .
           move      09                   to   w-fnd-auc-cmd-li1      .
           move      16                   to   w-fnd-auc-cmd-li2      .
           move      08                   to   w-fnd-auc-cmd-po1      .
           move      43                   to   w-fnd-auc-cmd-po2      .
           move      w-fnd-auc-cmd-li1    to   w-fnd-auc-cmd-lin      .
           move      w-fnd-auc-cmd-po1    to   w-fnd-auc-cmd-pos      .
       vis-hlp-scr-520.
      *                  *---------------------------------------------*
      *                  * Accettazione                                *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      w-fnd-auc-cmd-lin    to   v-lin                  .
           move      w-fnd-auc-cmd-pos    to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       vis-hlp-scr-600.
      *                  *---------------------------------------------*
      *                  * Test su function-key selezionata            *
      *                  *---------------------------------------------*
           if        v-key                =    "UP  "
                     go to vis-hlp-scr-610
           else if   v-key                =    "DOWN"
                     go to vis-hlp-scr-620
           else if   v-key                =    "LEFT" or
                     v-key                =    "PRSC"
                     go to vis-hlp-scr-630
           else if   v-key                =    "RGHT" or
                     v-key                =    "NXSC"
                     go to vis-hlp-scr-640
           else if   v-key                =    "TAB "
                     go to vis-hlp-scr-660
           else if   v-key                =    "ESC "
                     go to vis-hlp-scr-670
           else if   v-key                =    spaces or
                     v-key                =    "RTRN"
                     go to vis-hlp-scr-680
           else      go to vis-hlp-scr-900.
       vis-hlp-scr-610.
      *                  *---------------------------------------------*
      *                  * Se 'Up'                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se raggiunto limite superiore      *
      *                      *-----------------------------------------*
           if        w-fnd-auc-cmd-lin    =    w-fnd-auc-cmd-li1
                     go to vis-hlp-scr-612.
      *                      *-----------------------------------------*
      *                      * Decremento linea                        *
      *                      *-----------------------------------------*
           subtract  1                    from w-fnd-auc-cmd-lin      .
      *                      *-----------------------------------------*
      *                      * Ad accettazione                         *
      *                      *-----------------------------------------*
           go to     vis-hlp-scr-520.
       vis-hlp-scr-612.
      *                      *-----------------------------------------*
      *                      * Se raggiunto limite superiore           *
      *                      *-----------------------------------------*
           if        w-fnd-auc-cmd-pos    =    w-fnd-auc-cmd-po2
                     move  w-fnd-auc-cmd-li2
                                          to   w-fnd-auc-cmd-lin
                     move  w-fnd-auc-cmd-po1
                                          to   w-fnd-auc-cmd-pos      .
      *                      *-----------------------------------------*
      *                      * Ad accettazione                         *
      *                      *-----------------------------------------*
           go to     vis-hlp-scr-520.
       vis-hlp-scr-620.
      *                  *---------------------------------------------*
      *                  * Se 'Down'                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se raggiunto limite inferiore      *
      *                      *-----------------------------------------*
           if        w-fnd-auc-cmd-lin    =    w-fnd-auc-cmd-li2
                     go to vis-hlp-scr-622.
      *                      *-----------------------------------------*
      *                      * Incremento linea                        *
      *                      *-----------------------------------------*
           add       1                    to   w-fnd-auc-cmd-lin      .
      *                      *-----------------------------------------*
      *                      * Ad accettazione                         *
      *                      *-----------------------------------------*
           go to     vis-hlp-scr-520.
       vis-hlp-scr-622.
      *                      *-----------------------------------------*
      *                      * Se raggiunto limite inferiore           *
      *                      *-----------------------------------------*
           if        w-fnd-auc-cmd-pos    =    w-fnd-auc-cmd-po1
                     move  w-fnd-auc-cmd-li1
                                          to   w-fnd-auc-cmd-lin
                     move  w-fnd-auc-cmd-po2
                                          to   w-fnd-auc-cmd-pos      .
      *                      *-----------------------------------------*
      *                      * Ad accettazione                         *
      *                      *-----------------------------------------*
           go to     vis-hlp-scr-520.
       vis-hlp-scr-630.
      *                  *---------------------------------------------*
      *                  * Se 'Left'                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Verifica limite sinistro                *
      *                      *-----------------------------------------*
           if        w-fnd-auc-cmd-pos    =    w-fnd-auc-cmd-po1
                     go to vis-hlp-scr-520.
      *                      *-----------------------------------------*
      *                      * A sinistra                              *
      *                      *-----------------------------------------*
           move      w-fnd-auc-cmd-po1    to   w-fnd-auc-cmd-pos      .
      *                      *-----------------------------------------*
      *                      * Ad accettazione                         *
      *                      *-----------------------------------------*
           go to     vis-hlp-scr-520.
       vis-hlp-scr-640.
      *                  *---------------------------------------------*
      *                  * Se 'Right'                                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Verifica limite destro                  *
      *                      *-----------------------------------------*
           if        w-fnd-auc-cmd-pos    =    w-fnd-auc-cmd-po2
                     go to vis-hlp-scr-520.
      *                      *-----------------------------------------*
      *                      * A sinistra                              *
      *                      *-----------------------------------------*
           move      w-fnd-auc-cmd-po2    to   w-fnd-auc-cmd-pos      .
      *                      *-----------------------------------------*
      *                      * Ad accettazione                         *
      *                      *-----------------------------------------*
           go to     vis-hlp-scr-520.
       vis-hlp-scr-660.
      *                  *---------------------------------------------*
      *                  * Se 'Tab'                                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * In basso a destra                       *
      *                      *-----------------------------------------*
           move      w-fnd-auc-cmd-li2    to   w-fnd-auc-cmd-lin      .
           move      w-fnd-auc-cmd-po2    to   w-fnd-auc-cmd-pos      .
      *                      *-----------------------------------------*
      *                      * Ad accettazione                         *
      *                      *-----------------------------------------*
           go to     vis-hlp-scr-520.
       vis-hlp-scr-670.
      *                  *---------------------------------------------*
      *                  * Se 'Esc'                                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     vis-hlp-scr-900.
       vis-hlp-scr-680.
      *                  *---------------------------------------------*
      *                  * Se 'Return'                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione delle coordinate *
      *                      *-----------------------------------------*
           if        w-fnd-auc-cmd-pos    =    w-fnd-auc-cmd-po2
                     go to vis-hlp-scr-700.
      *                      *-----------------------------------------*
      *                      * Lato sinistro                           *
      *                      *-----------------------------------------*
           if        w-fnd-auc-cmd-lin    =    w-fnd-auc-cmd-li1
                     move  ".a"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    10
                     move  ".b"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    11
                     move  ".c"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    12
                     move  ".d"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    13
                     move  ".e"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    14
                     move  ".i"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    15
                     move  ".l"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    w-fnd-auc-cmd-li2
                     move  ".m"           to   w-fnd-auc-cmd-cod      .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     vis-hlp-scr-900.
       vis-hlp-scr-700.
      *                      *-----------------------------------------*
      *                      * Lato destro                             *
      *                      *-----------------------------------------*
           if        w-fnd-auc-cmd-lin    =    w-fnd-auc-cmd-li1
                     move  ".n"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    10
                     move  ".p"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    11
                     move  ".r"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    12
                     move  ".s"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    13
                     move  ".t"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    14
                     move  ".u"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    15
                     move  ".w"           to   w-fnd-auc-cmd-cod
           else if   w-fnd-auc-cmd-lin    =    w-fnd-auc-cmd-li2
                     move  ".0"           to   w-fnd-auc-cmd-cod      .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     vis-hlp-scr-900.
       vis-hlp-scr-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     vis-hlp-scr-999.
       vis-hlp-scr-999.
           exit.

      *    *===========================================================*
      *    * Richiesta operazione di sequenzializzazione o di indiciz- *
      *    * zazione di un file alla prossima operazione di open su    *
      *    * quel file                                                 *
      *    *-----------------------------------------------------------*
       nxt-opn-fil-000.
      *              *-------------------------------------------------*
      *              * Se utente non di tipo supervisore : uscita      *
      *              *-------------------------------------------------*
           if        w-ute-tip-ute        not  = 02
                     go to nxt-opn-fil-999.
      *              *-------------------------------------------------*
      *              * Normalizzazione valori di accettazione          *
      *              *-------------------------------------------------*
           move      spaces               to   w-nxt-opn-nam          .
           move      zero                 to   w-nxt-opn-top          .
           move      zero                 to   w-nxt-opn-tpf          .
           move      spaces               to   w-nxt-opn-nmf          .
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      21                   to   v-lto                  .
           move      80                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "Richiesta di esecuzione operazione alla prossima a
      -              "pertura di un file"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura titolo                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      68                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      07                   to   v-pos                  .
           move      "--------------------------------------------------
      -              "------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Literals                                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Nome del file                               *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Nome del file              :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Tipo operazione                             *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Tipo operazione            :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Tipo filtro                                 *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Tipo di filtro             :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Filtro                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Filtro                     :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24 a spaces                           *
      *                  *---------------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       nxt-opn-fil-200.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
       nxt-opn-fil-250.
      *                  *---------------------------------------------*
      *                  * Nome del file                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Accettazione                            *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "L"                  to   v-tip                  .
           move      04                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-nxt-opn-nam        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "EXIT"
                     go to nxt-opn-fil-900.
      *                      *-----------------------------------------*
      *                      * Valore in destinazione                  *
      *                      *-----------------------------------------*
           move      v-alf                to   w-nxt-opn-nam          .
      *                      *-----------------------------------------*
      *                      * Se Spaces : non ammesso                 *
      *                      *-----------------------------------------*
           if        w-nxt-opn-nam        =    spaces
                     go to nxt-opn-fil-250.
       nxt-opn-fil-300.
      *                  *---------------------------------------------*
      *                  * Tipo di operazione                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Accettazione                            *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-nxt-opn-eto-lun    to   v-car                  .
           move      w-nxt-opn-eto-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-nxt-opn-eto-tbl    to   v-txt                  .
           move      11                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-nxt-opn-top        to   v-num                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "EXIT"
                     go to nxt-opn-fil-900.
      *                      *-----------------------------------------*
      *                      * Valore in destinazione                  *
      *                      *-----------------------------------------*
           move      v-num                to   w-nxt-opn-top          .
      *                      *-----------------------------------------*
      *                      * Se Up                                   *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to nxt-opn-fil-250.
      *                      *-----------------------------------------*
      *                      * Test se valore consentito               *
      *                      *-----------------------------------------*
           if        w-nxt-opn-top        =    zero or
                     w-nxt-opn-top        >    05
                     go to nxt-opn-fil-300.
       nxt-opn-fil-350.
      *                  *---------------------------------------------*
      *                  * Tipo filtro                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se nessuna operazione              *
      *                      *-----------------------------------------*
           if        w-nxt-opn-top        =    05
                     go to nxt-opn-fil-360.
      *                      *-----------------------------------------*
      *                      * Accettazione                            *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-nxt-opn-etf-lun    to   v-car                  .
           move      w-nxt-opn-etf-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-nxt-opn-etf-tbl    to   v-txt                  .
           move      13                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-nxt-opn-tpf        to   v-num                  .
           add       1                    to   v-num                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "EXIT"               to   v-pfk (20)             .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "EXIT"
                     go to nxt-opn-fil-900.
      *                      *-----------------------------------------*
      *                      * Valore in destinazione                  *
      *                      *-----------------------------------------*
           move      v-num                to   w-nxt-opn-tpf          .
           subtract  1                    from w-nxt-opn-tpf          .
      *                      *-----------------------------------------*
      *                      * Se Up                                   *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to nxt-opn-fil-300.
      *                      *-----------------------------------------*
      *                      * Test se valore consentito               *
      *                      *-----------------------------------------*
           if        w-nxt-opn-tpf        >    02
                     go to nxt-opn-fil-350
           else      go to nxt-opn-fil-400.
       nxt-opn-fil-360.
      *                      *-----------------------------------------*
      *                      * Se nessuna operazione                   *
      *                      *-----------------------------------------*
           move      zero                 to   w-nxt-opn-tpf          .
           move      "DS"                 to   v-ope                  .
           move      "E"                  to   v-tip                  .
           move      w-nxt-opn-etf-lun    to   v-car                  .
           move      w-nxt-opn-etf-num    to   v-ldt                  .
           move      spaces               to   v-edm                  .
           move      w-nxt-opn-etf-tbl    to   v-txt                  .
           move      13                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-nxt-opn-tpf        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       nxt-opn-fil-400.
      *                  *---------------------------------------------*
      *                  * Nome o pathname del filtro                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se nessuna operazione              *
      *                      *-----------------------------------------*
           if        w-nxt-opn-top        =    05
                     go to nxt-opn-fil-440.
      *                      *-----------------------------------------*
      *                      * Test se nessun filtro                   *
      *                      *-----------------------------------------*
           if        w-nxt-opn-tpf        =    zero
                     go to nxt-opn-fil-440.
      *                      *-----------------------------------------*
      *                      * Test se non filtro standard             *
      *                      *-----------------------------------------*
           if        w-nxt-opn-tpf        =    1
                     go to nxt-opn-fil-405.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       nxt-opn-fil-405.
      *                      *-----------------------------------------*
      *                      * Accettazione                            *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "L"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           if        w-nxt-opn-tpf        =    1
                     move  "FIND"         to   v-pfk (03)             .
           if        w-nxt-opn-tpf        =    1
                     move  "INSR"         to   v-pfk (04)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-nxt-opn-nmf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       nxt-opn-fil-407.
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "EXIT"
                     go to nxt-opn-fil-900.
      *                      *-----------------------------------------*
      *                      * Valore in destinazione                  *
      *                      *-----------------------------------------*
           move      v-alf                to   w-nxt-opn-nmf          .
      *                      *-----------------------------------------*
      *                      * Se Find                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "FIND"
                     go to nxt-opn-fil-420.
      *                      *-----------------------------------------*
      *                      * Se Insr                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "INSR"
                     go to nxt-opn-fil-430.
      *                      *-----------------------------------------*
      *                      * Se Up                                   *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to nxt-opn-fil-350.
      *                      *-----------------------------------------*
      *                      * Se Spaces : non ammesso                 *
      *                      *-----------------------------------------*
           if        w-nxt-opn-nmf        =    spaces
                     go to nxt-opn-fil-405
           else      go to nxt-opn-fil-410.
       nxt-opn-fil-410.
      *                      *-----------------------------------------*
      *                      * Controllo di esistenza                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se non e' filtro standard : nessun  *
      *                          * controllo di esistenza              *
      *                          *-------------------------------------*
           if        w-nxt-opn-tpf        not  = 1
                     go to nxt-opn-fil-600.
      *                          *-------------------------------------*
      *                          * Lettura filtro                      *
      *                          *-------------------------------------*
           move      "fcs "               to   auc-tre                .
           move      w-nxt-opn-nmf        to   auc-kre                .
           read      auc    with no lock
                            invalid key
                            go to   nxt-opn-fil-415.
      *                          *-------------------------------------*
      *                          * Se filtro esistente                 *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Visualizzazione descrizione     *
      *                              *---------------------------------*
           move      auc-dat              to   w-fcs                  .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-fcs-des-fcs        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Continuazione                   *
      *                              *---------------------------------*
           go to     nxt-opn-fil-600.
       nxt-opn-fil-415.
      *                          *-------------------------------------*
      *                          * Se filtro non esistente             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Visualizzazione segnale         *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      all   "."            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Reimpostazione                  *
      *                              *---------------------------------*
           go to     nxt-opn-fil-405.
       nxt-opn-fil-420.
      *                      *-----------------------------------------*
      *                      * Se Find                                 *
      *                      *-----------------------------------------*
           perform   fnd-auc-fcs-000      thru fnd-auc-fcs-999        .
           if        w-fnd-auc-fcs-sel    not  = spaces
                     go to nxt-opn-fil-405.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-fnd-auc-fcs-cod    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      spaces               to   v-key                  .
           go to     nxt-opn-fil-407.
       nxt-opn-fil-430.
      *                      *-----------------------------------------*
      *                      * Se Insr                                 *
      *                      *-----------------------------------------*
           perform   ins-auc-fcs-000      thru ins-auc-fcs-999        .
           go to     nxt-opn-fil-405.
       nxt-opn-fil-440.
      *                      *-----------------------------------------*
      *                      * Se nessuna operazione o nessun filtro   *
      *                      *-----------------------------------------*
           move      spaces               to   w-nxt-opn-nmf          .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       nxt-opn-fil-600.
      *              *-------------------------------------------------*
      *              * Conferma finale                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Default per accettazione                    *
      *                  *---------------------------------------------*
           move      spaces               to   w-nxt-opn-sne          .
       nxt-opn-fil-650.
      *                  *---------------------------------------------*
      *                  * Visualizzazione prompt per accettazione     *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      59                   to   v-pos                  .
           move      "Conferma (S N E) ?  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       nxt-opn-fil-700.
      *                  *---------------------------------------------*
      *                  * Accettazione carattere di conferma          *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      78                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-nxt-opn-sne        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       nxt-opn-fil-725.
      *                  *---------------------------------------------*
      *                  * Test se function key                        *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     move  "S"            to   v-alf
                     go to nxt-opn-fil-750.
           if        v-key                =    "UP  "
                     move  "N"            to   v-alf
                     go to nxt-opn-fil-750.
           if        v-key                =    "EXIT"
                     move  "E"            to   v-alf
                     go to nxt-opn-fil-750.
       nxt-opn-fil-750.
      *                  *---------------------------------------------*
      *                  * Valore impostato in campo di destinazione   *
      *                  *---------------------------------------------*
           move      v-alf                to   w-nxt-opn-sne          .
       nxt-opn-fil-775.
      *                  *---------------------------------------------*
      *                  * Controllo valore impostato                  *
      *                  *---------------------------------------------*
           if        w-nxt-opn-sne        not  = "S" and
                     w-nxt-opn-sne        not  = "N" and
                     w-nxt-opn-sne        not  = "E"
                     go to nxt-opn-fil-700.
       nxt-opn-fil-800.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda della scelta           *
      *                  *---------------------------------------------*
           if        w-nxt-opn-sne        =    "S"
                     go to nxt-opn-fil-825
           else if   w-nxt-opn-sne        =    "N"
                     go to nxt-opn-fil-850
           else      go to nxt-opn-fil-875.
       nxt-opn-fil-825.
      *                  *---------------------------------------------*
      *                  * Se scelta 'S'                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cancellazione prompt per accettazione   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      59                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     nxt-opn-fil-950.
       nxt-opn-fil-850.
      *                  *---------------------------------------------*
      *                  * Se scelta 'N'                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cancellazione prompt per accettazione   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      59                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     nxt-opn-fil-200.
       nxt-opn-fil-875.
      *                  *---------------------------------------------*
      *                  * Se scelta 'E'                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cancellazione prompt per accettazione   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      20                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      59                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       nxt-opn-fil-900.
      *                      *-----------------------------------------*
      *                      * Name del file interessato a Spaces      *
      *                      *-----------------------------------------*
           move      spaces               to   w-nxt-opn-nam          .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     nxt-opn-fil-950.
       nxt-opn-fil-950.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ripristino immagine video                   *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       nxt-opn-fil-975.
      *                  *---------------------------------------------*
      *                  * Comunicazione nome file,tipo operazione,    *
      *                  * tipo filtro, filtro, alla segreteria        *
      *                  *---------------------------------------------*
           if        w-nxt-opn-nam        =    spaces
                     go to nxt-opn-fil-999.
           move      "PO"                 to   s-ope                  .
           move      w-nxt-opn-nam        to   s-nam                  .
           if        w-nxt-opn-top        =    01
                     move  "KS"           to   s-sts
           else if   w-nxt-opn-top        =    02
                     move  "SK"           to   s-sts
           else if   w-nxt-opn-top        =    03
                     move  "SJ"           to   s-sts
           else if   w-nxt-opn-top        =    04
                     move  "KK"           to   s-sts
           else      move  spaces         to   s-sts                  .
           move      w-nxt-opn-tpf        to   s-num                  .
           move      w-nxt-opn-nmf        to   s-pat                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       nxt-opn-fil-999.
           exit.

      *    *===========================================================*
      *    * Variazione del codice utente attualmente in uso           *
      *    *-----------------------------------------------------------*
       var-cod-ute-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione segnale di variazione codice u- *
      *              * tente effettivamente eseguito                   *
      *              *-------------------------------------------------*
           move      spaces               to   w-var-ute-snx          .
      *              *-------------------------------------------------*
      *              * Normalizzazione segnale di variazione codice a- *
      *              * zienda eseguito                                 *
      *              *-------------------------------------------------*
           move      spaces               to   w-var-ute-azi          .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione della presenza o no di   *
      *              * background in esecuzione                        *
      *              *-------------------------------------------------*
           if        w-snx-bkg-snx        =    "N"
                     go to var-cod-ute-200.
       var-cod-ute-050.
      *              *-------------------------------------------------*
      *              * Se ci sono background in esecuzione             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su status del background               *
      *                  *---------------------------------------------*
           perform   tst-sts-bkg-000      thru tst-sts-bkg-999        .
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione dello status del     *
      *                  * background                                  *
      *                  *---------------------------------------------*
           if        w-snx-bkg-sts        =    "N"
                     go to var-cod-ute-200
           else if   w-snx-bkg-sts        =    "S"
                     go to var-cod-ute-100
           else if   w-snx-bkg-sts        =    "T"
                     go to var-cod-ute-150
           else      go to var-cod-ute-100.
       var-cod-ute-100.
      *                  *---------------------------------------------*
      *                  * Se ci sono background in esecuzione non an- *
      *                  * cora terminati                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Visualizzazione informazioni sul pro-   *
      *                      *-----------------------------------------*
           perform   vis-inf-bkg-000      thru vis-inf-bkg-999        .
      *                      *-----------------------------------------*
      *                      * Uscita senza effettiva variazione del   *
      *                      * codice utente                           *
      *                      *-----------------------------------------*
           go to     var-cod-ute-999.
       var-cod-ute-150.
      *                  *---------------------------------------------*
      *                  * Se ci sono background in esecuzione che pe- *
      *                  * ro' sono terminati                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Controllo sulla terminazione del back-  *
      *                      * ground                                  *
      *                      *-----------------------------------------*
           perform   cnt-ter-bkg-000      thru cnt-ter-bkg-999        .
      *                      *-----------------------------------------*
      *                      * Uscita senza effettiva variazione del   *
      *                      * codice azienda                          *
      *                      *-----------------------------------------*
           go to     var-cod-ute-999.
       var-cod-ute-200.
      *                  *---------------------------------------------*
      *                  * Se non ci sono background in esecuzione     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Salvataggio codice utente precedente    *
      *                      *-----------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-ute                to   w-var-ute-old          .
      *                      *-----------------------------------------*
      *                      * Normalizzazione codice utente attuale   *
      *                      *-----------------------------------------*
           move      spaces               to   w-var-ute-new          .
           move      spaces               to   w-var-ute-key          .
      *                      *-----------------------------------------*
      *                      * Video in Off                            *
      *                      *-----------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Costruzione maschera vuota              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Box                                 *
      *                          *-------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      05                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      19                   to   v-lto                  .
           move      60                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Titolo                              *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      36                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      "      Variazione codice utente      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Sottolineatura titolo               *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      36                   to   v-car                  .
           move      08                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      " ---------------------------------- "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Literals                            *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Codice utente precedente        *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      36                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      "Codice utente precedente  :         "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Nuovo codice utente             *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      36                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      "Nuovo codice utente       :         "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione dati maschera           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Codice utente precedente            *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      51                   to   v-pos                  .
           move      w-var-ute-old        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Video in On                             *
      *                      *-----------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       var-cod-ute-280.
      *                      *-----------------------------------------*
      *                      * Numero di tentativi di accesso          *
      *                      *-----------------------------------------*
           move      zero                 to   w-acc-pwd-nrt          .
       var-cod-ute-300.
      *                      *-----------------------------------------*
      *                      * Accettazione nuovo codice utente        *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "L"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      51                   to   v-pos                  .
           move      w-var-ute-new        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Salvataggio valore e function key impo- *
      *                      * stati                                   *
      *                      *-----------------------------------------*
           move      v-alf                to   w-var-ute-new          .
           move      v-key                to   w-var-ute-key          .
      *                      *-----------------------------------------*
      *                      * Se valore impostato a spaces : errore   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test                                *
      *                          *-------------------------------------*
           if        w-var-ute-new        not  = spaces
                     go to var-cod-ute-400.
      *                          *-------------------------------------*
      *                          * Segnalazione di errore, accettazio- *
      *                          * ne di presa visione, rientro ad     *
      *                          * accettazione                        *
      *                          *-------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      18                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      63                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      20                   to   v-pos                  .
           move      "Codice utente obbligatorio !"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      61                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     var-cod-ute-300.
       var-cod-ute-400.
      *                      *-----------------------------------------*
      *                      * Se terminazione impostazione codice u-  *
      *                      * tente con Return                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Lettura record utente               *
      *                          *-------------------------------------*
           move      w-var-ute-new        to   w-let-ute-cod          .
           perform   let-ute-auc-000      thru let-ute-auc-999        .
      *                          *-------------------------------------*
      *                          * Test se utente esistente oppure no  *
      *                          *-------------------------------------*
           if        w-let-ute-exs        =    spaces
                     go to var-cod-ute-450.
       var-cod-ute-425.
      *                          *-------------------------------------*
      *                          * Se utente non esistente             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Segnalazione di errore, accet-  *
      *                              * tazione di presa visione, ri-   *
      *                              * entro ad accettazione           *
      *                              *---------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      18                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      63                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      20                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "Codice utente '"
                                delimited by   size
                     w-var-ute-new
                                delimited by   spaces
                     "' non esistente !"
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      61                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     var-cod-ute-300.
       var-cod-ute-450.
      *                          *-------------------------------------*
      *                          * Test se utente bloccato oppure no   *
      *                          *-------------------------------------*
           if        w-ute-tip-ute        =    02
                     go to var-cod-ute-500.
           if        w-ute-sts-ute        =    00 or
                     w-ute-sts-ute        =    02
                     go to var-cod-ute-500.
       var-cod-ute-475.
      *                          *-------------------------------------*
      *                          * Se utente bloccato                  *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Segnalazione di errore, accet-  *
      *                              * tazione di presa visione, ri-   *
      *                              * entro ad accettazione           *
      *                              *---------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      18                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      63                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      20                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "Codice utente '"
                                delimited by   size
                     w-var-ute-new
                                delimited by   spaces
                     "' bloccato !     "
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      61                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     var-cod-ute-300.
       var-cod-ute-500.
      *                          *-------------------------------------*
      *                          * Controllo che il nuovo utente sia   *
      *                          * abilitato ad operare su almeno una  *
      *                          * azienda non bloccata                *
      *                          *-------------------------------------*
           if        w-ute-tip-ute        =    02
                     go to var-cod-ute-525.
           if        w-ute-num-azi        =    zero
                     go to var-cod-ute-525.
           move      zero                 to   w-var-ute-c01          .
       var-cod-ute-502.
           add       1                    to   w-var-ute-c01          .
           if        w-var-ute-c01        >    20
                     go to var-cod-ute-504.
           if        w-var-ute-c01        >    w-ute-num-azi
                     go to var-cod-ute-504.
           if        w-ute-cod-azi
                    (w-var-ute-c01)       =    spaces
                     go to var-cod-ute-502.
           move      "azi "               to   auc-tre                .
           move      w-ute-cod-azi
                    (w-var-ute-c01)       to   auc-kre                .
           read      auc    with no lock
                            invalid key
                            go to   var-cod-ute-502.
           move      auc-dat              to   w-azi                  .
           if        w-azi-sts-azi        =    00
                     go to var-cod-ute-525
           else      go to var-cod-ute-502.
       var-cod-ute-504.
      *                          *-------------------------------------*
      *                          * Se l'utente non e' abilitato ad o-  *
      *                          * perare su alcuna azienda : messag-  *
      *                          * gio di errore, accettazione di pre- *
      *                          * sa visione, rientro ad accettazione *
      *                          * codice utente                       *
      *                          *-------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      71                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      59                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      11                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           string    "L'utente '"
                                delimited by   size
                     w-var-ute-new
                                delimited by   spaces
                     "' non e' abilitato su alcuna azienda !  "
                                delimited by   size
                                          into v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      69                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           go to     var-cod-ute-300.
       var-cod-ute-525.
      *                          *-------------------------------------*
      *                          * Test se esiste password per l'uten- *
      *                          * te                                  *
      *                          *-------------------------------------*
           if        w-ute-pwd-ute        not  = spaces
                     go to var-cod-ute-550
           else      go to var-cod-ute-650.
       var-cod-ute-550.
      *                          *-------------------------------------*
      *                          * Se esiste password per l'utente     *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Se non c'e' controllo password  *
      *                              * su utenti : no impostazione     *
      *                              *---------------------------------*
           if        w-psg-pwd-ute        not  = "S"
                     go to var-cod-ute-650.
      *                              *---------------------------------*
      *                              * Visualizzazione prompt per ac-  *
      *                              * cettazione password             *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      36                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      "Parola chiave             :         "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       var-cod-ute-575.
      *                              *---------------------------------*
      *                              * Accettazione password           *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Video in Off                *
      *                                  *-----------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                  *-----------------------------*
      *                                  * Accettazione                *
      *                                  *-----------------------------*
           move      "AC"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      51                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                  *-----------------------------*
      *                                  * Salvataggio password e fun- *
      *                                  * ction key                   *
      *                                  *-----------------------------*
           move      v-alf                to   w-acc-pwd-acc           .
           move      v-key                to   w-acc-pwd-key           .
      *                                  *-----------------------------*
      *                                  * Visualizzazione Spaces      *
      *                                  *-----------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      08                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      51                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                  *-----------------------------*
      *                                  * Video in On                 *
      *                                  *-----------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                  *-----------------------------*
      *                                  * Deviazione a seconda della  *
      *                                  * function key                *
      *                                  *-----------------------------*
           if        w-acc-pwd-key        =    "UP  "
                     go to var-cod-ute-585
           else if   w-acc-pwd-key        =    spaces or
                     w-acc-pwd-key        =    "DO  "
                     go to var-cod-ute-600
           else      go to var-cod-ute-575.
       var-cod-ute-580.
      *                                  *-----------------------------*
      *                                  * Se Exit in impostazione     *
      *                                  * password utente             *
      *                                  *                             *
      *                                  * Non abilitato               *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Uscita con segnale di   *
      *                                      * variazione codice uten- *
      *                                      * te effettivamente ese-  *
      *                                      * guita a No              *
      *                                      *-------------------------*
           go to     var-cod-ute-999.
       var-cod-ute-585.
      *                                  *-----------------------------*
      *                                  * Se Up in impostazione pass- *
      *                                  * word utente                 *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Cancellazione area ac-  *
      *                                      * cettazione password     *
      *                                      *-------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      36                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                      *-------------------------*
      *                                      * Rientro ad accettazione *
      *                                      * codice utente           *
      *                                      *-------------------------*
           go to     var-cod-ute-300.
       var-cod-ute-600.
      *                                  *-----------------------------*
      *                                  * Se Do o Return in imposta-  *
      *                                  * zione password utente       *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Se password a spaces :  *
      *                                      * come se Up              *
      *                                      *-------------------------*
           if        w-acc-pwd-acc        =    spaces
                     go to var-cod-ute-585.
      *                                      *-------------------------*
      *                                      * Controllo se password   *
      *                                      * passeparout             *
      *                                      *-------------------------*
           if        w-acc-pwd-acc (1 : 1)
                                          =    "l" and
                     w-acc-pwd-acc (4 : 1)
                                          =    "p" and
                     w-acc-pwd-acc (2 : 1)
                                          =    "o" and
                     w-acc-pwd-acc (5 : 1)
                                          =    "i" and
                     w-acc-pwd-acc (6 : 1)
                                          =    "o" and
                     w-acc-pwd-acc (3 : 1)
                                          =    "p" and
                     w-acc-pwd-acc (8 : 1)
                                          =    "9" and
                     w-acc-pwd-acc (7 : 1)
                                          =    "9"
                     go to var-cod-ute-625.
      *                                      *-------------------------*
      *                                      * Se password corretta    *
      *                                      *-------------------------*
           if        w-acc-pwd-acc        =    w-ute-pwd-ute
                     go to var-cod-ute-625.
      *                                      *-------------------------*
      *                                      * Se password scorretta   *
      *                                      *-------------------------*
       var-cod-ute-615.
      *                                          *---------------------*
      *                                          * Incremento numero   *
      *                                          * di tentativi        *
      *                                          *---------------------*
           add       1                    to   w-acc-pwd-nrt          .
      *                                          *---------------------*
      *                                          * Test su numero di   *
      *                                          * tentativi           *
      *                                          *---------------------*
           if      w-psg-tip-ast          =    01
                   go to var-cod-ute-620.
           if      w-psg-max-err          =    zero
                   go to var-cod-ute-620.
      *                                          *---------------------*
      *                                          * Se numero di tenta- *
      *                                          * tivi superato       *
      *                                          *---------------------*
           if      w-acc-pwd-nrt          >    w-psg-max-err
                   perform var-cod-ute-err-000
                                          thru var-cod-ute-err-999
                   go to var-cod-ute-280.
       var-cod-ute-620.
      *                                          *---------------------*
      *                                          * A reimpostazione    *
      *                                          * password            *
      *                                          *---------------------*
           go to     var-cod-ute-575.
       var-cod-ute-625.
      *                                      *-------------------------*
      *                                      * Conferma impostazioni   *
      *                                      * se e' stata impostata   *
      *                                      * una password : se ter-  *
      *                                      * minazione con Do : no   *
      *                                      * conferma                *
      *                                      *-------------------------*
           if        w-acc-pwd-key        =    "DO  "
                     go to var-cod-ute-800
           else      go to var-cod-ute-675.
       var-cod-ute-650.
      *                          *-------------------------------------*
      *                          * Se non esiste password per l'utente *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Cancellazione eventuale area    *
      *                              * password precedente             *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      36                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Conferma impostazioni se non e' *
      *                              * stata impostata la password :   *
      *                              * se terminazione codice utente   *
      *                              * con Do : no conferma            *
      *                              *---------------------------------*
           if        w-var-ute-key        =    "DO  "
                     go to var-cod-ute-800
           else      go to var-cod-ute-675.
       var-cod-ute-675.
      *                      *-----------------------------------------*
      *                      * Accettazione conferma impostazioni      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Visualizzazione prompt per accetta- *
      *                          * zione conferma                      *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      36                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      "         Conferma (S/N/E) :         "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       var-cod-ute-700.
      *                          *-------------------------------------*
      *                          * Accettazione conferma               *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Default                         *
      *                              *---------------------------------*
           move      "S"                  to   w-var-ute-cnf          .
       var-cod-ute-725.
      *                              *---------------------------------*
      *                              * Accettazione                    *
      *                              *---------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      51                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-var-ute-cnf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Salvataggio valore impostato    *
      *                              *---------------------------------*
           move      v-alf                to   w-var-ute-cnf          .
      *                              *---------------------------------*
      *                              * Forzatura valore impostato se   *
      *                              * function key                    *
      *                              *---------------------------------*
           if        v-key                =    "EXIT"
                     move  "E"            to   w-var-ute-cnf
           else if   v-key                =    "DO  "
                     move  "S"            to   w-var-ute-cnf
           else if   v-key                =    "UP  "
                     move  "N"            to   w-var-ute-cnf          .
      *                              *---------------------------------*
      *                              * Se valore impostato non ammis-  *
      *                              * sibile reimpostazione           *
      *                              *---------------------------------*
           if        w-var-ute-cnf        not  = "S" and
                     w-var-ute-cnf        not  = "N" and
                     w-var-ute-cnf        not  = "E"
                     go to var-cod-ute-725.
      *                              *---------------------------------*
      *                              * Cancellazione area accettazione *
      *                              * conferma impostazione           *
      *                              *---------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      36                   to   v-car                  .
           move      17                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                              *---------------------------------*
      *                              * Deviazione in funzione del va-  *
      *                              * lore impostato                  *
      *                              *---------------------------------*
           if        w-var-ute-cnf        =    "S"
                     go to var-cod-ute-800
           else if   w-var-ute-cnf        =    "N"
                     go to var-cod-ute-775
           else if   w-var-ute-cnf        =    "E"
                     go to var-cod-ute-750
           else      go to var-cod-ute-675.
       var-cod-ute-750.
      *                              *---------------------------------*
      *                              * Se "E" in conferma impostazioni *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Uscita con segnale di va-   *
      *                                  * riazione codice utente ef-  *
      *                                  * fettivamente eseguita a No  *
      *                                  *-----------------------------*
           go to     var-cod-ute-999.
       var-cod-ute-775.
      *                              *---------------------------------*
      *                              * Se "N" in conferma impostazioni *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Cancellazione area accetta- *
      *                                  * zione password              *
      *                                  *-----------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      36                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      23                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                                  *-----------------------------*
      *                                  * Rientro ad accettazione co- *
      *                                  * dice utente                 *
      *                                  *-----------------------------*
           go to     var-cod-ute-300.
       var-cod-ute-800.
      *                              *---------------------------------*
      *                              * Se "S" in conferma impostazioni *
      *                              * oppure se accettazione conferma *
      *                              * non eseguita per impostazione   *
      *                              * tasto Do                        *
      *                              *---------------------------------*
      *                                  *-----------------------------*
      *                                  * Test se l'utente puo' ope-  *
      *                                  * rare sull'azienda attual-   *
      *                                  * mente in uso                *
      *                                  *-----------------------------*
           if        w-ute-tip-ute        =    02
                     go to var-cod-ute-825.
           if        w-ute-num-azi        =    zero
                     go to var-cod-ute-825.
           move      zero                 to   w-var-ute-c01          .
       var-cod-ute-805.
           add       1                    to   w-var-ute-c01          .
           if        w-var-ute-c01        >    20
                     go to var-cod-ute-850.
           if        w-var-ute-c01        >    w-ute-num-azi
                     go to var-cod-ute-850.
           if        w-ute-cod-azi
                    (w-var-ute-c01)       =    w-des-azi-cod
                     go to var-cod-ute-825
           else      go to var-cod-ute-805.
       var-cod-ute-825.
      *                                  *-----------------------------*
      *                                  * Se l'utente puo' operare    *
      *                                  * sull'azienda attualmente    *
      *                                  * in uso                      *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Dichiarazione codice u- *
      *                                      * tente alla segreteria   *
      *                                      *-------------------------*
           move      "UT"                 to   s-ope                  .
           move      w-var-ute-new        to   s-ute                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                                      *-------------------------*
      *                                      * Lettura record parame-  *
      *                                      * tri utente attuale      *
      *                                      *-------------------------*
           perform   let-ute-att-000      thru let-ute-att-999        .
      *                                      *-------------------------*
      *                                      * Dichiarazione del codi- *
      *                                      * ce stampante e del co-  *
      *                                      * dice stampante locale   *
      *                                      * associati all'utente    *
      *                                      * alla segreteria         *
      *                                      *-------------------------*
           move      "ST"                 to   s-ope                  .
           move      w-ute-cst-ass        to   s-asx                  .
           move      w-ute-csl-aau        to   s-adx                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                                      *-------------------------*
      *                                      * Uscita con segnale di   *
      *                                      * variazione codice uten- *
      *                                      * te effettivamente ese-  *
      *                                      * guita a Si e con segna- *
      *                                      * le di variazione codice *
      *                                      * azienda a No            *
      *                                      *-------------------------*
           move      "S"                  to   w-var-ute-snx          .
           go to     var-cod-ute-999.
       var-cod-ute-850.
      *                                  *-----------------------------*
      *                                  * Se l'utente non puo' opera- *
      *                                  * re sull'azienda attualmente *
      *                                  * in uso                      *
      *                                  *-----------------------------*
      *                                      *-------------------------*
      *                                      * Dichiarazione codice u- *
      *                                      * tente alla segreteria   *
      *                                      *-------------------------*
           move      "UT"                 to   s-ope                  .
           move      w-var-ute-new        to   s-ute                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                                      *-------------------------*
      *                                      * Lettura record parame-  *
      *                                      * tri utente attuale      *
      *                                      *-------------------------*
           perform   let-ute-att-000      thru let-ute-att-999        .
      *                                      *-------------------------*
      *                                      * Dichiarazione del codi- *
      *                                      * ce stampante e del co-  *
      *                                      * dice stampante locale   *
      *                                      * associati all'utente    *
      *                                      * alla segreteria         *
      *                                      *-------------------------*
           move      "ST"                 to   s-ope                  .
           move      w-ute-cst-ass        to   s-asx                  .
           move      w-ute-csl-aau        to   s-adx                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                                      *-------------------------*
      *                                      * Variazione del codice   *
      *                                      * azienda forzata         *
      *                                      *-------------------------*
      *                                          *---------------------*
      *                                          * Salvataggio codice  *
      *                                          * azienda attuale     *
      *                                          *---------------------*
           move      w-des-azi-cod        to   w-var-ute-sva          .
       var-cod-ute-875.
      *                                          *---------------------*
      *                                          * Normalizzazione     *
      *                                          * status di uscita    *
      *                                          * dal modulo di im-   *
      *                                          * postazione codice   *
      *                                          * azienda             *
      *                                          *---------------------*
           move      spaces               to   x-sts                  .
      *                                          *---------------------*
      *                                          * Richiamo imposta-   *
      *                                          * zione codice azien- *
      *                                          * da                  *
      *                                          *---------------------*
           call      "swd/xpg/prg/obj/pxpg0004"
                                         using x                      .
           cancel    "swd/xpg/prg/obj/pxpg0004"                       .
      *                                          *---------------------*
      *                                          * Se impostazione co- *
      *                                          * dice azienda non e- *
      *                                          * seguita : reimpo-   *
      *                                          * stazione            *
      *                                          *---------------------*
           if        x-sts                not  = spaces
                     move  spaces         to   x-sts
                     go to var-cod-ute-875.
      *                                          *---------------------*
      *                                          * Normalizzazione     *
      *                                          * status di uscita    *
      *                                          * dal modulo di im-   *
      *                                          * postazione codice   *
      *                                          * azienda             *
      *                                          *---------------------*
           move      spaces               to   x-sts                  .
      *                                          *---------------------*
      *                                          * Se codice azienda   *
      *                                          * non variato rispet- *
      *                                          * to a quello attual- *
      *                                          * mente in uso : re-  *
      *                                          * impostazione        *
      *                                          *---------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-azi                =    w-var-ute-sva
                     go to var-cod-ute-875.
      *                                          *---------------------*
      *                                          * Determinazione de-  *
      *                                          * scrizione azienda   *
      *                                          * allineata al centro *
      *                                          *---------------------*
           perform   det-des-azi-000      thru det-des-azi-999        .
      *                                      *-------------------------*
      *                                      * Uscita con segnale di   *
      *                                      * variazione codice uten- *
      *                                      * te effettivamente ese-  *
      *                                      * guita a Si e con segna- *
      *                                      * le di variazione codice *
      *                                      * azienda a No            *
      *                                      *-------------------------*
           move      "S"                  to   w-var-ute-snx          .
           move      "S"                  to   w-var-ute-azi          .
           go to     var-cod-ute-999.
       var-cod-ute-999.
           exit.

      *    *===========================================================*
      *    * Variazione del codice utente attualmente in uso           *
      *    *                                                           *
      *    * Subroutine per trattamento errore in superamento numero   *
      *    * massimo tentativi di accesso, se previsto da personaliz-  *
      *    * zazioni generali                                          *
      *    *-----------------------------------------------------------*
       var-cod-ute-err-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di azione       *
      *              *-------------------------------------------------*
           if        w-psg-tip-ast        =    02
                     go to var-cod-ute-err-200
           else if   w-psg-tip-ast        =    03
                     go to var-cod-ute-err-400
           else if   w-psg-tip-ast        =    04
                     go to var-cod-ute-err-600
           else      go to var-cod-ute-err-900.
       var-cod-ute-err-200.
      *              *-------------------------------------------------*
      *              * Blocco utente                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura record utente                       *
      *                  *---------------------------------------------*
           move      w-var-ute-new        to   w-let-ute-cod          .
           perform   let-ute-auc-000      thru let-ute-auc-999        .
      *                  *---------------------------------------------*
      *                  * Attivazione blocco                          *
      *                  *---------------------------------------------*
           move      01                   to   w-ute-sts-ute          .
      *                  *---------------------------------------------*
      *                  * Ri-scrittura record dell'utente             *
      *                  *---------------------------------------------*
           move      spaces               to   auc-rec                .
           move      "ute "               to   auc-tre                .
           move      w-ute-cod-ute        to   auc-kre                .
           move      w-ute                to   auc-dat                .
           rewrite   auc-rec invalid key
                     go to var-cod-ute-err-999.
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     var-cod-ute-err-999.
       var-cod-ute-err-400.
      *              *-------------------------------------------------*
      *              * Avviso all'amministratore                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se esiste un utente amministratore     *
      *                  *---------------------------------------------*
           if        w-psg-ute-amm        =    spaces
                     go to var-cod-ute-err-999.
      *                  *---------------------------------------------*
      *                  * ___ ATTUALMENTE NON GESTITO ___             *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     var-cod-ute-err-999.
       var-cod-ute-err-600.
      *              *-------------------------------------------------*
      *              * Avviso all'utente                               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * ___ ATTUALMENTE NON GESTITO ___             *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     var-cod-ute-err-999.
       var-cod-ute-err-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     var-cod-ute-err-999.
       var-cod-ute-err-999.
           exit.

      *    *===========================================================*
      *    * Visualizzazione informazioni relative all'azienda in uso  *
      *    * per l'utente in uso                                       *
      *    *-----------------------------------------------------------*
       vis-pfc-uaz-000.
      *              *-------------------------------------------------*
      *              * Richiamo del modulo inerente le funzioni da e-  *
      *              * seguirsi pre-presentazione del primo menu'      *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg0002"
                                         using x                      .
           cancel    "swd/xpg/prg/obj/pxpg0002"                       .
       vis-pfc-uaz-999.
           exit.

      *    *===========================================================*
      *    * Gestione print-files su disco                             *
      *    *-----------------------------------------------------------*
       ges-prn-fls-000.
      *              *-------------------------------------------------*
      *              * Richiamo del modulo inerente la gestione ed e-  *
      *              * strazione print-files                           *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg0006"                       .
           cancel    "swd/xpg/prg/obj/pxpg0006"                       .
       ges-prn-fls-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione salvataggi procedurati                         *
      *    *-----------------------------------------------------------*
       ese-svt-pro-000.
      *              *-------------------------------------------------*
      *              * Richiamo del programma per l'esecuzione dei     *
      *              * salvataggi procedurati                          *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg2550"                       .
           cancel    "swd/xpg/prg/obj/pxpg2550"                       .
       ese-svt-pro-999.
           exit.

      *    *===========================================================*
      *    * Accettazione pathname di esecuzione                       *
      *    *-----------------------------------------------------------*
       acc-pth-exe-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valori di accettazione          *
      *              * tente effettivamente eseguito                   *
      *              *-------------------------------------------------*
           move      spaces               to   w-exe-pth-sap          .
           move      spaces               to   w-exe-pth-arg          .
           move      spaces               to   w-exe-pth-prg          .
           move      spaces               to   w-exe-pth-obj          .
           move      spaces               to   w-exe-pth-pro          .
           move      spaces               to   w-exe-pth-pth          .
      *              *-------------------------------------------------*
      *              * Se utente non di tipo supervisore : uscita      *
      *              *-------------------------------------------------*
           if        w-ute-tip-ute        not  = 02
                     go to acc-pth-exe-999.
      *              *-------------------------------------------------*
      *              * Defaults                                        *
      *              *-------------------------------------------------*
           move      "pgm"                to   w-exe-pth-sap          .
           move      spaces               to   w-exe-pth-arg          .
           move      "prg"                to   w-exe-pth-prg          .
           move      "obj"                to   w-exe-pth-obj          .
           move      spaces               to   w-exe-pth-pro          .
           move      spaces               to   w-exe-pth-pth          .
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      21                   to   v-lto                  .
           move      80                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      38                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      "Esecuzione di un programma da pathname"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura titolo                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      38                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      22                   to   v-pos                  .
           move      "--------------------------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Literals e defaults                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Sistema applicativo                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Sistema applicativo        :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Default                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-exe-pth-sap        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Area gestionale                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Area gestionale            :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Default                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-exe-pth-arg        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Direttorio programmi                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Direttorio programmi       :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Default                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-exe-pth-prg        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Direttorio oggetti                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Direttorio oggetti         :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Default                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-exe-pth-obj        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Nome interno del programma                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Nome interno del programma :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Default                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-exe-pth-pro        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Pathname per l'esecuzione                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      28                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Pathname per l'esecuzione  :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Default                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      w-exe-pth-pth        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Linea 24 a spaces                           *
      *                  *---------------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-pth-exe-200.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
       acc-pth-exe-250.
      *                  *---------------------------------------------*
      *                  * Sistema applicativo                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Accettazione                            *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "L"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      09                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-exe-pth-sap        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "EXIT"
                     go to acc-pth-exe-900.
      *                      *-----------------------------------------*
      *                      * Valore in destinazione                  *
      *                      *-----------------------------------------*
           move      v-alf                to   w-exe-pth-sap          .
       acc-pth-exe-260.
      *                      *-----------------------------------------*
      *                      * Test se blanks embedded                 *
      *                      *-----------------------------------------*
           if        w-exe-pth-sap        =    spaces
                     go to acc-pth-exe-300.
           move      w-exe-pth-sap        to   w-exe-pth-wbe          .
           move      zero                 to   w-exe-pth-wct          .
           inspect   w-exe-pth-wbe    tallying w-exe-pth-wct
                     for characters     before initial   " "          .
       acc-pth-exe-262.
           add       1                    to   w-exe-pth-wct          .
           if        w-exe-pth-wct        >    03
                     go to acc-pth-exe-300.
           if        w-exe-pth-wbc
                    (w-exe-pth-wct)       =    spaces
                     go to acc-pth-exe-262
           else      go to acc-pth-exe-250.
       acc-pth-exe-300.
      *                  *---------------------------------------------*
      *                  * Area gestionale                             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Accettazione                            *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "L"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-exe-pth-arg        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "EXIT"
                     go to acc-pth-exe-900.
      *                      *-----------------------------------------*
      *                      * Valore in destinazione                  *
      *                      *-----------------------------------------*
           move      v-alf                to   w-exe-pth-arg          .
      *                      *-----------------------------------------*
      *                      * Se Up                                   *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-pth-exe-250.
       acc-pth-exe-310.
      *                      *-----------------------------------------*
      *                      * Test se blanks embedded                 *
      *                      *-----------------------------------------*
           if        w-exe-pth-arg        =    spaces
                     go to acc-pth-exe-350.
           move      w-exe-pth-arg        to   w-exe-pth-wbe          .
           move      zero                 to   w-exe-pth-wct          .
           inspect   w-exe-pth-wbe    tallying w-exe-pth-wct
                     for characters     before initial   " "          .
       acc-pth-exe-312.
           add       1                    to   w-exe-pth-wct          .
           if        w-exe-pth-wct        >    03
                     go to acc-pth-exe-350.
           if        w-exe-pth-wbc
                    (w-exe-pth-wct)       =    spaces
                     go to acc-pth-exe-312
           else      go to acc-pth-exe-300.
       acc-pth-exe-350.
      *                  *---------------------------------------------*
      *                  * Direttorio programmi                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Accettazione                            *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "L"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-exe-pth-prg        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "EXIT"
                     go to acc-pth-exe-900.
      *                      *-----------------------------------------*
      *                      * Valore in destinazione                  *
      *                      *-----------------------------------------*
           move      v-alf                to   w-exe-pth-prg          .
      *                      *-----------------------------------------*
      *                      * Se Up                                   *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-pth-exe-300.
       acc-pth-exe-360.
      *                      *-----------------------------------------*
      *                      * Test se blanks embedded                 *
      *                      *-----------------------------------------*
           if        w-exe-pth-prg        =    spaces
                     go to acc-pth-exe-400.
           move      w-exe-pth-prg        to   w-exe-pth-wbe          .
           move      zero                 to   w-exe-pth-wct          .
           inspect   w-exe-pth-wbe    tallying w-exe-pth-wct
                     for characters     before initial   " "          .
       acc-pth-exe-362.
           add       1                    to   w-exe-pth-wct          .
           if        w-exe-pth-wct        >    03
                     go to acc-pth-exe-400.
           if        w-exe-pth-wbc
                    (w-exe-pth-wct)       =    spaces
                     go to acc-pth-exe-362
           else      go to acc-pth-exe-350.
       acc-pth-exe-400.
      *                  *---------------------------------------------*
      *                  * Direttorio oggetti                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Accettazione                            *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "L"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      12                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-exe-pth-obj        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "EXIT"
                     go to acc-pth-exe-900.
      *                      *-----------------------------------------*
      *                      * Valore in destinazione                  *
      *                      *-----------------------------------------*
           move      v-alf                to   w-exe-pth-obj          .
      *                      *-----------------------------------------*
      *                      * Se Up                                   *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-pth-exe-350.
       acc-pth-exe-410.
      *                      *-----------------------------------------*
      *                      * Test se blanks embedded                 *
      *                      *-----------------------------------------*
           if        w-exe-pth-obj        =    spaces
                     go to acc-pth-exe-450.
           move      w-exe-pth-obj        to   w-exe-pth-wbe          .
           move      zero                 to   w-exe-pth-wct          .
           inspect   w-exe-pth-wbe    tallying w-exe-pth-wct
                     for characters     before initial   " "          .
       acc-pth-exe-412.
           add       1                    to   w-exe-pth-wct          .
           if        w-exe-pth-wct        >    03
                     go to acc-pth-exe-450.
           if        w-exe-pth-wbc
                    (w-exe-pth-wct)       =    spaces
                     go to acc-pth-exe-412
           else      go to acc-pth-exe-400.
       acc-pth-exe-450.
      *                  *---------------------------------------------*
      *                  * Nome interno del programma                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Accettazione                            *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "L"                  to   v-tip                  .
           move      10                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-exe-pth-pro        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "EXIT"
                     go to acc-pth-exe-900.
      *                      *-----------------------------------------*
      *                      * Valore in destinazione                  *
      *                      *-----------------------------------------*
           move      v-alf                to   w-exe-pth-pro          .
      *                      *-----------------------------------------*
      *                      * Se Up                                   *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-pth-exe-400.
       acc-pth-exe-460.
      *                      *-----------------------------------------*
      *                      * Test se blanks embedded                 *
      *                      *-----------------------------------------*
           if        w-exe-pth-pro        =    spaces
                     go to acc-pth-exe-500.
           move      w-exe-pth-pro        to   w-exe-pth-wbe          .
           move      zero                 to   w-exe-pth-wct          .
           inspect   w-exe-pth-wbe    tallying w-exe-pth-wct
                     for characters     before initial   " "          .
       acc-pth-exe-462.
           add       1                    to   w-exe-pth-wct          .
           if        w-exe-pth-wct        >    10
                     go to acc-pth-exe-500.
           if        w-exe-pth-wbc
                    (w-exe-pth-wct)       =    spaces
                     go to acc-pth-exe-462
           else      go to acc-pth-exe-450.
       acc-pth-exe-500.
      *                  *---------------------------------------------*
      *                  * Pathname per l'esecuzione                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Default per composizione                *
      *                      *-----------------------------------------*
           if        w-exe-pth-sap        =    spaces or
                     w-exe-pth-arg        =    spaces or
                     w-exe-pth-prg        =    spaces or
                     w-exe-pth-obj        =    spaces or
                     w-exe-pth-pro        =    spaces
                     go to acc-pth-exe-505.
           move      spaces               to   w-exe-pth-pth          .
           string    w-exe-pth-sap
                                delimited by   spaces
                     "/"
                                delimited by   size
                     w-exe-pth-arg
                                delimited by   spaces
                     "/"
                                delimited by   size
                     w-exe-pth-prg
                                delimited by   spaces
                     "/"
                                delimited by   size
                     w-exe-pth-obj
                                delimited by   spaces
                     "/"
                                delimited by   size
                     w-exe-pth-pro
                                delimited by   spaces
                                          into w-exe-pth-pth          .
       acc-pth-exe-505.
      *                      *-----------------------------------------*
      *                      * Accettazione                            *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "L"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      15                   to   v-lin                  .
           move      32                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DOWN"               to   v-pfk (02)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-exe-pth-pth        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "EXIT"
                     go to acc-pth-exe-900.
      *                      *-----------------------------------------*
      *                      * Valore in destinazione                  *
      *                      *-----------------------------------------*
           move      v-alf                to   w-exe-pth-pth          .
      *                      *-----------------------------------------*
      *                      * Se Up                                   *
      *                      *-----------------------------------------*
           if        v-key                =    "UP  "
                     go to acc-pth-exe-450.
       acc-pth-exe-510.
      *                      *-----------------------------------------*
      *                      * Test che il valore non sia a spaces     *
      *                      *-----------------------------------------*
           if        w-exe-pth-pth        =    spaces
                     go to acc-pth-exe-505.
      *                      *-----------------------------------------*
      *                      * Test se blanks embedded                 *
      *                      *-----------------------------------------*
           move      w-exe-pth-pth        to   w-exe-pth-wbe          .
           move      zero                 to   w-exe-pth-wct          .
           inspect   w-exe-pth-wbe    tallying w-exe-pth-wct
                     for characters     before initial   " "          .
       acc-pth-exe-512.
           add       1                    to   w-exe-pth-wct          .
           if        w-exe-pth-wct        >    40
                     go to acc-pth-exe-600.
           if        w-exe-pth-wbc
                    (w-exe-pth-wct)       =    spaces
                     go to acc-pth-exe-512
           else      go to acc-pth-exe-505.
       acc-pth-exe-600.
      *              *-------------------------------------------------*
      *              * Conferma finale                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Default per accettazione                    *
      *                  *---------------------------------------------*
           move      spaces               to   w-exe-pth-sne          .
       acc-pth-exe-650.
      *                  *---------------------------------------------*
      *                  * Visualizzazione prompt per accettazione     *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      45                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      34                   to   v-pos                  .
           move      "Conferma esecuzione del programma (S N E) ?  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-pth-exe-700.
      *                  *---------------------------------------------*
      *                  * Accettazione carattere di conferma          *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      78                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-exe-pth-sne        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-pth-exe-725.
      *                  *---------------------------------------------*
      *                  * Test se function key                        *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     move  "S"            to   v-alf
                     go to acc-pth-exe-750.
           if        v-key                =    "UP  "
                     move  "N"            to   v-alf
                     go to acc-pth-exe-750.
           if        v-key                =    "EXIT"
                     move  "E"            to   v-alf
                     go to acc-pth-exe-750.
       acc-pth-exe-750.
      *                  *---------------------------------------------*
      *                  * Valore impostato in campo di destinazione   *
      *                  *---------------------------------------------*
           move      v-alf                to   w-exe-pth-sne          .
       acc-pth-exe-775.
      *                  *---------------------------------------------*
      *                  * Controllo valore impostato                  *
      *                  *---------------------------------------------*
           if        w-exe-pth-sne        not  = "S" and
                     w-exe-pth-sne        not  = "N" and
                     w-exe-pth-sne        not  = "E"
                     go to acc-pth-exe-700.
       acc-pth-exe-800.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda della scelta           *
      *                  *---------------------------------------------*
           if        w-exe-pth-sne        =    "S"
                     go to acc-pth-exe-825
           else if   w-exe-pth-sne        =    "N"
                     go to acc-pth-exe-850
           else      go to acc-pth-exe-875.
       acc-pth-exe-825.
      *                  *---------------------------------------------*
      *                  * Se scelta 'S'                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cancellazione prompt per accettazione   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      45                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      34                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     acc-pth-exe-950.
       acc-pth-exe-850.
      *                  *---------------------------------------------*
      *                  * Se scelta 'N'                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cancellazione prompt per accettazione   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      45                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      34                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     acc-pth-exe-200.
       acc-pth-exe-875.
      *                  *---------------------------------------------*
      *                  * Se scelta 'E'                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cancellazione prompt per accettazione   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      45                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      34                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-pth-exe-900.
      *                      *-----------------------------------------*
      *                      * Pathname di esecuzione a Spaces         *
      *                      *-----------------------------------------*
           move      spaces               to   w-exe-pth-pth          .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     acc-pth-exe-950.
       acc-pth-exe-950.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ripristino immagine video                   *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-pth-exe-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione di uno shell script                            *
      *    *-----------------------------------------------------------*
       exe-shl-scr-000.
      *              *-------------------------------------------------*
      *              * Richiesta dei tipi di shell eseguibili, e memo- *
      *              * rizzazione dell'informazione                    *
      *              *-------------------------------------------------*
           move      "TS"                 to   o-ope                  .
           move      w-exe-shl-scr        to   o-shs                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
           move      o-sts                to   w-exe-shl-tds          .
      *              *-------------------------------------------------*
      *              * Normalizzazione valore di accettazione          *
      *              *-------------------------------------------------*
           move      spaces               to   w-exe-shl-scr          .
      *              *-------------------------------------------------*
      *              * Se utente non di tipo supervisore : uscita      *
      *              *-------------------------------------------------*
           if        w-ute-tip-ute        not  = 02
                     go to exe-shl-scr-999.
       exe-shl-scr-020.
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-shl-scr-040.
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      21                   to   v-lto                  .
           move      80                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      30                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      "Esecuzione di uno shell script"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Sottolineatura titolo                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      30                   to   v-car                  .
           move      07                   to   v-lin                  .
           move      26                   to   v-pos                  .
           move      "------------------------------"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-shl-scr-060.
      *              *-------------------------------------------------*
      *              * Literals e defaults                             *
      *              *-------------------------------------------------*
       exe-shl-scr-070.
      *                  *---------------------------------------------*
      *                  * Shell script                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      15                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      03                   to   v-pos                  .
           move      "Shell script  :"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Default                                 *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      w-exe-shl-scr        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-shl-scr-080.
      *              *-------------------------------------------------*
      *              * Note operative                                  *
      *              *-------------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se non e' ammessa la shell interattiva  *
      *                      * a comandi manuali : no note             *
      *                      *-----------------------------------------*
           if        w-exe-shl-tds        =    "NN"
                     go to exe-shl-scr-100.
      *                      *-----------------------------------------*
      *                      * Nota 1                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      18                   to   v-lin                  .
           move      02                   to   v-pos                  .
           move      "N.B. : Per l'esecuzione di una shell interattiva l
      -              "asciare l'impostazione    "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Nota 2                                  *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      76                   to   v-car                  .
           move      19                   to   v-lin                  .
           move      02                   to   v-pos                  .
           move      "       dello shell script a vuoto e confermare l'e
      -              "secuzione.                "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-shl-scr-100.
      *                  *---------------------------------------------*
      *                  * Linea 24 a spaces                           *
      *                  *---------------------------------------------*
           perform   lin-024-spc-000      thru lin-024-spc-999        .
       exe-shl-scr-150.
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-shl-scr-200.
      *              *-------------------------------------------------*
      *              * Accettazioni                                    *
      *              *-------------------------------------------------*
       exe-shl-scr-250.
      *                  *---------------------------------------------*
      *                  * Shell script                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Accettazione                            *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      "DOWN"               to   v-pfk (02)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-exe-shl-scr        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * Se Exit                                 *
      *                      *-----------------------------------------*
           if        v-key                =    "EXIT"
                     go to exe-shl-scr-900.
      *                      *-----------------------------------------*
      *                      * Valore in destinazione                  *
      *                      *-----------------------------------------*
           move      v-alf                to   w-exe-shl-scr          .
      *                      *-----------------------------------------*
      *                      * Se valore a vuoto, ma non ammessa la    *
      *                      * shell interattiva manuale : reimposta-  *
      *                      * zione                                   *
      *                      *-----------------------------------------*
           if        w-exe-shl-scr        =    spaces and
                     w-exe-shl-tds        =    "NN"
                     go to exe-shl-scr-250.
       exe-shl-scr-400.
      *              *-------------------------------------------------*
      *              * Conferma finale                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Default per accettazione                    *
      *                  *---------------------------------------------*
           move      spaces               to   w-exe-shl-sne          .
       exe-shl-scr-450.
      *                  *---------------------------------------------*
      *                  * Visualizzazione prompt per accettazione     *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      44                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      "Conferma esecuzione dello script (S N E) ?  "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-shl-scr-500.
      *                  *---------------------------------------------*
      *                  * Accettazione carattere di conferma          *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "U"                  to   v-tip                  .
           move      01                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      78                   to   v-pos                  .
           move      "UP  "               to   v-pfk (01)             .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-exe-shl-sne        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-shl-scr-525.
      *                  *---------------------------------------------*
      *                  * Test se function key                        *
      *                  *---------------------------------------------*
           if        v-key                =    "DO  "
                     move  "S"            to   v-alf
                     go to exe-shl-scr-550.
           if        v-key                =    "UP  "
                     move  "N"            to   v-alf
                     go to exe-shl-scr-550.
           if        v-key                =    "EXIT"
                     move  "E"            to   v-alf
                     go to exe-shl-scr-550.
       exe-shl-scr-550.
      *                  *---------------------------------------------*
      *                  * Valore impostato in campo di destinazione   *
      *                  *---------------------------------------------*
           move      v-alf                to   w-exe-shl-sne          .
       exe-shl-scr-575.
      *                  *---------------------------------------------*
      *                  * Controllo valore impostato                  *
      *                  *---------------------------------------------*
           if        w-exe-shl-sne        not  = "S" and
                     w-exe-shl-sne        not  = "N" and
                     w-exe-shl-sne        not  = "E"
                     go to exe-shl-scr-500.
       exe-shl-scr-600.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda della scelta           *
      *                  *---------------------------------------------*
           if        w-exe-shl-sne        =    "S"
                     go to exe-shl-scr-650
           else if   w-exe-shl-sne        =    "N"
                     go to exe-shl-scr-850
           else      go to exe-shl-scr-875.
       exe-shl-scr-650.
      *                  *---------------------------------------------*
      *                  * Se scelta 'S'                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cancellazione prompt per accettazione   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      44                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-shl-scr-700.
      *                      *-----------------------------------------*
      *                      * Esecuzione dello script                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Abblencamento totale schermo        *
      *                          *-------------------------------------*
           move      "ER"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Richiamo di una shell interattiva   *
      *                          *-------------------------------------*
           move      "SH"                 to   o-ope                  .
           move      w-exe-shl-scr        to   o-shs                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *                          *-------------------------------------*
      *                          * Se si trattava di una shell manua-  *
      *                          * le : ad uscita                      *
      *                          *-------------------------------------*
           if        w-exe-shl-scr        =    spaces
                     go to exe-shl-scr-950.
      *                          *-------------------------------------*
      *                          * Accettazione di un carattere a li-  *
      *                          * nea 24 posizione 78                 *
      *                          *-------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      77                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      24                   to   v-lin                  .
           move      78                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                          *-------------------------------------*
      *                          * Ad uscita                           *
      *                          *-------------------------------------*
           go to     exe-shl-scr-950.
       exe-shl-scr-850.
      *                  *---------------------------------------------*
      *                  * Se scelta 'N'                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cancellazione prompt per accettazione   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      44                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                      *-----------------------------------------*
      *                      * A reimpostazione                        *
      *                      *-----------------------------------------*
           go to     exe-shl-scr-200.
       exe-shl-scr-875.
      *                  *---------------------------------------------*
      *                  * Se scelta 'E'                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Cancellazione prompt per accettazione   *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      44                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      35                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-shl-scr-900.
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     exe-shl-scr-950.
       exe-shl-scr-950.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ripristino immagine video                   *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Refresh immagine video                      *
      *                  *---------------------------------------------*
           move      "RF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       exe-shl-scr-999.
           exit.

      *    *===========================================================*
      *    * Find su codici stampante di [pss]                         *
      *    *-----------------------------------------------------------*
       fnd-pss-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di selezione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-fnd-pss-stp-sel      .
      *              *-------------------------------------------------*
      *              * Test se programma di interrogazione gia' attivo *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pxpg4210"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     move  "#"            to   w-fnd-pss-stp-sel
                     go to  fnd-pss-stp-999.
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. per possibili- *
      *              * ta' di function-key "SLCT" durante l'interroga- *
      *              * zione                                           *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "fkselect"           to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      04                   to   s-car                  .
           move      "SLCT"               to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo programma di interrogazione            *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg4210"                       .
           cancel    "swd/xpg/prg/obj/pxpg4210"                       .
      *              *-------------------------------------------------*
      *              * Estrazione di eventuale variabile di i.p.c. de- *
      *              * terminata da function-key "SLCT" durante l'in-  *
      *              * terrogazione                                    *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "pss-stp"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  spaces         to   w-fnd-pss-stp-sel
                     move  s-alf          to   w-fnd-pss-stp-cod
           else      move  "#"            to   w-fnd-pss-stp-sel      .
       fnd-pss-stp-999.
           exit.

      *    *===========================================================*
      *    * Find su codici modulo di [pss]                            *
      *    *-----------------------------------------------------------*
       fnd-pss-mod-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di selezione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-fnd-pss-mod-sel      .
      *              *-------------------------------------------------*
      *              * Test se programma di interrogazione gia' attivo *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pxpg4320"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     move  "#"            to   w-fnd-pss-mod-sel
                     go to  fnd-pss-mod-999.
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. per possibili- *
      *              * ta' di function-key "SLCT" durante l'interroga- *
      *              * zione                                           *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "fkselect"           to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      04                   to   s-car                  .
           move      "SLCT"               to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo programma di interrogazione            *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg4320"                       .
           cancel    "swd/xpg/prg/obj/pxpg4320"                       .
      *              *-------------------------------------------------*
      *              * Estrazione di eventuale variabile di i.p.c. de- *
      *              * terminata da function-key "SLCT" durante l'in-  *
      *              * terrogazione                                    *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "pss-mod"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  spaces         to   w-fnd-pss-mod-sel
                     move  s-alf          to   w-fnd-pss-mod-cod
           else      move  "#"            to   w-fnd-pss-mod-sel      .
       fnd-pss-mod-999.
           exit.

      *    *===========================================================*
      *    * Find su codici filtro di conversione di [auc]             *
      *    *-----------------------------------------------------------*
       fnd-auc-fcs-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di selezione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-fnd-auc-fcs-sel      .
      *              *-------------------------------------------------*
      *              * Test se programma di interrogazione gia' attivo *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pxpg7810"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     move  "#"            to   w-fnd-auc-fcs-sel
                     go to  fnd-auc-fcs-999.
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. per possibili- *
      *              * ta' di function-key "SLCT" durante l'interroga- *
      *              * zione                                           *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "fkselect"           to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      04                   to   s-car                  .
           move      "SLCT"               to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo programma di interrogazione            *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg7810"                       .
           cancel    "swd/xpg/prg/obj/pxpg7810"                       .
      *              *-------------------------------------------------*
      *              * Estrazione di eventuale variabile di i.p.c. de- *
      *              * terminata da function-key "SLCT" durante l'in-  *
      *              * terrogazione                                    *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "auc-fcs"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  spaces         to   w-fnd-auc-fcs-sel
                     move  s-alf          to   w-fnd-auc-fcs-cod
           else      move  "#"            to   w-fnd-auc-fcs-sel      .
       fnd-auc-fcs-999.
           exit.

      *    *===========================================================*
      *    * Insr su codici filtro di conversione di [auc]             *
      *    *-----------------------------------------------------------*
       ins-auc-fcs-000.
      *              *-------------------------------------------------*
      *              * Test se programma di gestione gia' attivo       *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pxpg7800"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     go to  ins-auc-fcs-999.
      *              *-------------------------------------------------*
      *              * Richiamo programma di gestione                  *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg7800"                       .
           cancel    "swd/xpg/prg/obj/pxpg7800"                       .
       ins-auc-fcs-999.
           exit.

      *    *===========================================================*
      *    * Accettazione comando o menu'                              *
      *    *                                                           *
      *    * Sub-funzione di determinazione esistenza print-files per  *
      *    * l'utente in uso, per l'azienda in uso, di tipo 'e-mail'   *
      *    *-----------------------------------------------------------*
       acc-cmd-mnu-mbx-000.
      *              *-------------------------------------------------*
      *              * Se si e' in esecuzione di un desk-accessory :   *
      *              * ad uscita                                       *
      *              *-------------------------------------------------*
           if        w-exe-dac-snx-dac    =    "S"
                     go to acc-cmd-mnu-mbx-900.
       acc-cmd-mnu-mbx-100.
      *              *-------------------------------------------------*
      *              * Apertura file [pfc]                             *
      *              *-------------------------------------------------*
           perform   opn-fil-pfc-000      thru opn-fil-pfc-999        .
      *              *-------------------------------------------------*
      *              * Det codice azienda attualmente in uso           *
      *              *-------------------------------------------------*
           perform   det-cod-azi-000      thru det-cod-azi-999        .
      *              *-------------------------------------------------*
      *              * Det codice utente attualmente in uso            *
      *              *-------------------------------------------------*
           perform   det-cod-ute-000      thru det-cod-ute-999        .
      *              *-------------------------------------------------*
      *              * Det esistenza print-files in catalogo per l'u-  *
      *              * tente in uso e per l'azienda in uso             *
      *              *-------------------------------------------------*
           perform   det-prf-mbx-000      thru det-prf-mbx-999        .
      *              *-------------------------------------------------*
      *              * Messaggio per print files in catalogo           *
      *              *-------------------------------------------------*
           perform   msg-prf-mbx-000      thru msg-prf-mbx-999        .
      *              *-------------------------------------------------*
      *              * Chiusura file [pfc]                             *
      *              *-------------------------------------------------*
           perform   cls-fil-pfc-000      thru cls-fil-pfc-999        .
      *              *-------------------------------------------------*
      *              * Richiesta eventuali promemoria a segreteria     *
      *              *-------------------------------------------------*
           perform   vis-ute-upr-000      thru vis-ute-upr-999        .
       acc-cmd-mnu-mbx-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     acc-cmd-mnu-mbx-999.
       acc-cmd-mnu-mbx-999.
           exit.

      *    *===========================================================*
      *    * Determinazione codice azienda in uso                      *
      *    *-----------------------------------------------------------*
       det-cod-azi-000.
      *              *-------------------------------------------------*
      *              * Richiesta informazioni generali da segreteria   *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Estrazione codice azienda                       *
      *              *-------------------------------------------------*
           move      s-azi                to   w-det-cod-azi-cod      .
       det-cod-azi-999.
           exit.

      *    *===========================================================*
      *    * Determinazione codice utente in uso                       *
      *    *-----------------------------------------------------------*
       det-cod-ute-000.
      *              *-------------------------------------------------*
      *              * Richiesta informazioni generali da segreteria   *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Estrazione codice utente                        *
      *              *-------------------------------------------------*
           move      s-ute                to   w-det-cod-ute-cod      .
       det-cod-ute-999.
           exit.

      *    *===========================================================*
      *    * Apertura file [pfc]                                       *
      *    *-----------------------------------------------------------*
       opn-fil-pfc-000.
      *              *-------------------------------------------------*
      *              * Preparazione pathname per [pfc]                 *
      *              *-------------------------------------------------*
           move      "A0"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      "fpx"                to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A5"                 to   o-ope                  .
           move      "pfc"                to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      "A9"                 to   o-ope                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *
           move      o-pat                to   f-pfc-pat              .
      *              *-------------------------------------------------*
      *              * Operazione di i-o di Open                       *
      *              *-------------------------------------------------*
           open      i-o    pfc                                       .
       opn-fil-pfc-999.
           exit.

      *    *===========================================================*
      *    * Chiusura file [pfc]                                       *
      *    *-----------------------------------------------------------*
       cls-fil-pfc-000.
           close      pfc                                             .
       cls-fil-pfc-999.
           exit.

      *    *===========================================================*
      *    * Determinazione esistenza print-files catalogati per l'u-  *
      *    * tente in uso, per l'azienda in uso                        *
      *    *-----------------------------------------------------------*
       det-prf-mbx-000.
      *              *-------------------------------------------------*
      *              * Azzeramento iniziale contatori print-files      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero totale print files                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-prf-mbx-tot      .
      *                  *---------------------------------------------*
      *                  * Numero print files in fase di creazione     *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-prf-mbx-ifc      .
      *                  *---------------------------------------------*
      *                  * Numero print files gia' creati              *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-prf-mbx-gcr      .
      *                  *---------------------------------------------*
      *                  * Numero print files gia' creati ma non an-   *
      *                  * cora effettivamente stampati                *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-prf-mbx-cns      .
      *                  *---------------------------------------------*
      *                  * Numero print files gia' creati e gia' ef-   *
      *                  * fettivamente stampati                       *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-prf-mbx-cgs      .
      *                  *---------------------------------------------*
      *                  * Numero print files di tipo 'Messaggio'      *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-prf-mbx-msg      .
       det-prf-mbx-100.
      *              *-------------------------------------------------*
      *              * Start su [pfc]                                  *
      *              *-------------------------------------------------*
           move      w-det-cod-ute-cod    to   pfc-cod-ute-005        .
           move      w-det-cod-azi-cod    to   pfc-cod-azi-005        .
           move      zero                 to   pfc-num-prg-005        .
           start     pfc    key not less
                            pfc-k05
                            invalid key
                            go to   det-prf-mbx-999.
       det-prf-mbx-200.
      *              *-------------------------------------------------*
      *              * Next su [pfc]                                   *
      *              *-------------------------------------------------*
           read      pfc    next
                            with no lock
                            at end
                            go to   det-prf-mbx-999.
       det-prf-mbx-300.
      *              *-------------------------------------------------*
      *              * Max su [pfc]                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se rottura utente : uscita                  *
      *                  *---------------------------------------------*
           if        pfc-cod-ute          not  = w-det-cod-ute-cod
                     go to det-prf-mbx-999.
      *                  *---------------------------------------------*
      *                  * Se rottura azienda : uscita                 *
      *                  *---------------------------------------------*
           if        pfc-cod-azi          not  = w-det-cod-azi-cod
                     go to det-prf-mbx-999.
       det-prf-mbx-400.
      *              *-------------------------------------------------*
      *              * Sel su [pfc]                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se non e' un Print File : no selezione      *
      *                  *---------------------------------------------*
           if        pfc-tip-fil          not  = 01
                     go to det-prf-mbx-200.
       det-prf-mbx-500.
      *              *-------------------------------------------------*
      *              * Aggiornamento contatori                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Numero totale print files                   *
      *                  *---------------------------------------------*
           add       1                    to   w-det-prf-mbx-tot      .
      *                  *---------------------------------------------*
      *                  * Numero print files di tipo 'Messaggio'      *
      *                  * gia' creati e non ancora effettivamente     *
      *                  * visualizzati                                *
      *                  *---------------------------------------------*
           if        pfc-snx-msg          not  = spaces and
                     pfc-snx-vis          =    spaces
                     add   1              to   w-det-prf-mbx-msg      .
       det-prf-mbx-600.
      *              *-------------------------------------------------*
      *              * Riciclo su next [pfc]                           *
      *              *-------------------------------------------------*
           go to     det-prf-mbx-200.
       det-prf-mbx-999.
           exit.

      *    *===========================================================*
      *    * Messaggio per files in catalogo                           *
      *    *-----------------------------------------------------------*
       msg-prf-mbx-000.
      *              *-------------------------------------------------*
      *              * Se numero totale files in catalogo a zero : u-  *
      *              * scita senza alcun messaggio                     *
      *              *-------------------------------------------------*
           if        w-det-prf-mbx-tot    =    zero
                     go to msg-prf-mbx-999.
      *              *-------------------------------------------------*
      *              * Se numero totale files 'e-mail' a zero : uscita *
      *              * senza alcun messaggio                           *
      *              *-------------------------------------------------*
           if        w-det-prf-mbx-msg    =    zero
                     go to msg-prf-mbx-999.
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Salvataggio immagine video                      *
      *              *-------------------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *              *-------------------------------------------------*
      *              * Box                                             *
      *              *-------------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      12                   to   v-lin                  .
           move      04                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      77                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Messaggio nel box                               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      65                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      06                   to   v-pos                  .
           move      "ATTENZIONE : sono presenti messaggi su disco in at
      -              "tesa di stampa!"    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Parentesi quadre di delimitazione               *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      03                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      73                   to   v-pos                  .
           move      "[ ]"                to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Accettazione carattere di presa visione         *
      *              *-------------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      13                   to   v-lin                  .
           move      74                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *-------------------------------------------------*
      *              * Normalizzazione function-key                    *
      *              *-------------------------------------------------*
           move      spaces               to   v-key                  .
      *              *-------------------------------------------------*
      *              * Ripristino immagine video                       *
      *              *-------------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       msg-prf-mbx-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     msg-prf-mbx-999.
       msg-prf-mbx-999.
           exit.

      *    *===========================================================*
      *    * Routine ciclo di attesa                                   *
      *    *-----------------------------------------------------------*
       rou-ccl-att-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione function-key                    *
      *              *-------------------------------------------------*
           move      spaces               to   v-key                  .
       rou-ccl-att-100.
      *              *-------------------------------------------------*
      *              * Messaggi di attesa                              *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "             <<< ***   S E S S I O N E   B L O C C
      -              " A T A   *** >>>              "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      "                     Tasto [F1] per procedere allo
      -              " sblocco                      "
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       rou-ccl-att-200.
      *              *-------------------------------------------------*
      *              * Attesa                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento dei contatori                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Secondi                                 *
      *                      *-----------------------------------------*
           add       1                    to   w-blo-ter-sec          .
           if        w-blo-ter-sec        >    59
                     move  zero           to   w-blo-ter-sec
                     go to rou-ccl-att-210.
           go to     rou-ccl-att-300.
       rou-ccl-att-210.
      *                      *-----------------------------------------*
      *                      * Minuti                                  *
      *                      *-----------------------------------------*
           add       1                    to   w-blo-ter-min          .
           if        w-blo-ter-min        >    59
                     move  zero           to   w-blo-ter-min
                     go to rou-ccl-att-220.
           go to     rou-ccl-att-300.
       rou-ccl-att-220.
      *                      *-----------------------------------------*
      *                      * Ore                                     *
      *                      *-----------------------------------------*
           add       1                    to   w-blo-ter-ore          .
           if        w-blo-ter-ore        >    23
                     move  zero           to   w-blo-ter-ore
                     go to rou-ccl-att-220.
           go to     rou-ccl-att-300.
       rou-ccl-att-300.
      *                  *---------------------------------------------*
      *                  * Visualizzazione del contatore               *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "N"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      zero                 to   v-dec                  .
           move      spaces               to   v-sgn                  .
           move      "MB"                 to   v-edm                  .
           move      "XX:XX:XX"           to   v-msk                  .
           move      18                   to   v-lin                  .
           move      52                   to   v-pos                  .
           move      w-blo-ter-tim        to   v-num                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Frazione di attesa da un secondo            *
      *                  *---------------------------------------------*
           call      "swd/mod/prg/obj/mwait0"                         .
       rou-ccl-att-400.
      *                  *---------------------------------------------*
      *                  * Accettazione del tasto per l'interruzione   *
      *                  * dell'attesa                                 *
      *                  *---------------------------------------------*
           move      "AA"                 to   v-ope                  .
           move      18                   to   v-lin                  .
           move      50                   to   v-pos                  .
           move      "[1] "               to   v-pfk (14)             .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Se attesa disattivata : ad uscita       *
      *                      *-----------------------------------------*
           if        v-key                =    spaces
                     go to rou-ccl-att-200.
       rou-ccl-att-420.
      *                      *-----------------------------------------*
      *                      * Test su function-key                    *
      *                      *-----------------------------------------*
           if        v-key                not  = "[1] "
                     go to rou-ccl-att-200.
       rou-ccl-att-800.
      *              *-------------------------------------------------*
      *              * Pulizia linea 23 e 24                           *
      *              *-------------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      23                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all spaces           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *              *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      80                   to   v-car                  .
           move      24                   to   v-lin                  .
           move      01                   to   v-pos                  .
           move      all spaces           to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       rou-ccl-att-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     rou-ccl-att-999.
       rou-ccl-att-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione ricerca di un comando tramite una componente   *
      *    * della descrizione                                         *
      *    *-----------------------------------------------------------*
       exe-ric-cmd-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di selezione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-fnd-auc-cmd-sel      .
      *              *-------------------------------------------------*
      *              * Test se programma di interrogazione gia' attivo *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pxpg3110"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     move  "#"            to   w-fnd-auc-cmd-sel
                     go to  fnd-auc-cmd-999.
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. per possibili- *
      *              * ta' di function-key "SLCT" durante l'interroga- *
      *              * zione                                           *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "fkselect"           to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      04                   to   s-car                  .
           move      "SLCT"               to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. 'cod-cmd'      *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "des-cmd"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      40                   to   s-car                  .
           move      w-fnd-auc-cmd-des    to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo programma di interrogazione            *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg3110"                       .
           cancel    "swd/xpg/prg/obj/pxpg3110"                       .
      *              *-------------------------------------------------*
      *              * Estrazione di eventuale variabile di i.p.c. de- *
      *              * terminata da function-key "SLCT" durante l'in-  *
      *              * terrogazione                                    *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "auc-cmd"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  spaces         to   w-fnd-auc-cmd-sel
                     move  s-alf          to   w-fnd-auc-cmd-cod
           else      move  "#"            to   w-fnd-auc-cmd-sel      .
       exe-ric-cmd-999.
           exit.

      *    *===========================================================*
      *    * Find su codici comando di [auc]                           *
      *    *-----------------------------------------------------------*
       fnd-auc-cmd-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di selezione               *
      *              *-------------------------------------------------*
           move      spaces               to   w-fnd-auc-cmd-sel      .
      *              *-------------------------------------------------*
      *              * Test se programma di interrogazione gia' attivo *
      *              *-------------------------------------------------*
           move      "P?"                 to   s-ope                  .
           move      "pxpg3110"           to   s-pro                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-liv                not  = zero
                     move  "#"            to   w-fnd-auc-cmd-sel
                     go to  fnd-auc-cmd-999.
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. per possibili- *
      *              * ta' di function-key "SLCT" durante l'interroga- *
      *              * zione                                           *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "fkselect"           to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      04                   to   s-car                  .
           move      "SLCT"               to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Preparazione variabile di i.p.c. 'cod-cmd'      *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "cod-cmd"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      06                   to   s-car                  .
           move      w-fnd-auc-cmd-cod    to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Richiamo programma di interrogazione            *
      *              *-------------------------------------------------*
           call      "swd/xpg/prg/obj/pxpg3110"                       .
           cancel    "swd/xpg/prg/obj/pxpg3110"                       .
      *              *-------------------------------------------------*
      *              * Estrazione di eventuale variabile di i.p.c. de- *
      *              * terminata da function-key "SLCT" durante l'in-  *
      *              * terrogazione                                    *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "auc-cmd"            to   s-var                  .
           move      "+"                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           if        s-ves                =    spaces
                     move  spaces         to   w-fnd-auc-cmd-sel
                     move  s-alf          to   w-fnd-auc-cmd-cod
           else      move  "#"            to   w-fnd-auc-cmd-sel      .
       fnd-auc-cmd-999.
           exit.

      *    *===========================================================*
      *    * Accettazione descrizione comando                          *
      *    *-----------------------------------------------------------*
       acc-des-cmd-000.
      *              *-------------------------------------------------*
      *              * Video in Off                                    *
      *              *-------------------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-des-cmd-100.
      *              *-------------------------------------------------*
      *              * Costruzione maschera vuota                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Box                                         *
      *                  *---------------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      09                   to   v-lin                  .
           move      19                   to   v-pos                  .
           move      14                   to   v-lto                  .
           move      62                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Titolo                                      *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      10                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      "Digitare una parte della descrizione del"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      11                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      "comando da cercare, anche non iniziale :"
                                          to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-des-cmd-200.
      *              *-------------------------------------------------*
      *              * Video in On                                     *
      *              *-------------------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
       acc-des-cmd-400.
      *              *-------------------------------------------------*
      *              * Accettazione descrizione comando                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione preliminare                 *
      *                  *---------------------------------------------*
           move      spaces               to   w-acc-des-com          .
      *                  *---------------------------------------------*
      *                  * Accettazione                                *
      *                  *---------------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      21                   to   v-pos                  .
           move      "DO  "               to   v-pfk (05)             .
           move      "EXIT"               to   v-pfk (20)             .
           move      w-acc-des-com        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                         using v                      .
      *                  *---------------------------------------------*
      *                  * Se Exit                                     *
      *                  *---------------------------------------------*
           if        v-key                =    "EXIT"
                     go to acc-des-cmd-999.
      *                  *---------------------------------------------*
      *                  * Valore in destinazione                      *
      *                  *---------------------------------------------*
           move      v-alf                to   w-acc-des-com          .
       acc-des-cmd-999.
           exit.

      *    *===========================================================*
      *    * Ricerca su buffer programmi utilizzati dall'utente        *
      *    *-----------------------------------------------------------*
       buf-ute-fas-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valori di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-buf-ute-fas-fds      .
           move      spaces               to   w-buf-ute-fas-tdf      .
      *              *-------------------------------------------------*
      *              * Normalizzazioni iniziali                        *
      *              *-------------------------------------------------*
           move      zero                 to   w-buf-ute-fas-crb      .
       buf-ute-fas-200.
      *              *-------------------------------------------------*
      *              * Richiesta alla segreteria                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-buf-ute-fas-crb      .
      *                  *---------------------------------------------*
      *                  * Test su contatore                           *
      *                  *---------------------------------------------*
           if        w-buf-ute-fas-crb    >    w-buf-ute-fas-max
                     move  w-buf-ute-fas-max
                                          to   w-buf-ute-fas-crb
                     go to buf-ute-fas-500.
      *                  *---------------------------------------------*
      *                  * Richiesta fase e utente                     *
      *                  *---------------------------------------------*
           move      "UF"                 to   s-ope                  .
           move      w-buf-ute-fas-crb    to   s-foc                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Test su valori letti                        *
      *                  *---------------------------------------------*
           if        s-ute                =    spaces
                     subtract 1           from w-buf-ute-fas-crb
                     go to buf-ute-fas-500.
       buf-ute-fas-300.
      *              *-------------------------------------------------*
      *              * Bufferizzazione                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Fase                                        *
      *                  *---------------------------------------------*
           move      s-fas                to   w-buf-ute-fas-fas
                                              (w-buf-ute-fas-crb)     .
      *                  *---------------------------------------------*
      *                  * Lettura descrizione comando                 *
      *                  *---------------------------------------------*
           move      "cmd "               to   auc-tre                .
           move      s-fas                to   auc-kre                .
           read      auc    with no lock
                            invalid key
                            go to   buf-ute-fas-310.
           go to     buf-ute-fas-320.
       buf-ute-fas-310.
      *                      *-----------------------------------------*
      *                      * Se record non trovato                   *
      *                      *-----------------------------------------*
           move      spaces               to   w-cmd-des-cmd          .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     buf-ute-fas-200.
       buf-ute-fas-320.
      *                      *-----------------------------------------*
      *                      * Se record trovato                       *
      *                      *-----------------------------------------*
           move      auc-dat              to   w-cmd                  .
           move      w-cmd-des-cmd        to   w-buf-ute-fas-def
                                              (w-buf-ute-fas-crb)     .
       buf-ute-fas-480.
      *                  *---------------------------------------------*
      *                  * Riciclo a lettura                           *
      *                  *---------------------------------------------*
           go to     buf-ute-fas-200.
       buf-ute-fas-500.
      *                  *---------------------------------------------*
      *                  * Controllo numero records letti con lo stes- *
      *                  * so valore                                   *
      *                  *---------------------------------------------*
           if        w-buf-ute-fas-fas (1)
                                          =    spaces
                     move  "#"            to   w-buf-ute-fas-fds
                     go to buf-ute-fas-999.
           if        w-buf-ute-fas-crb    =    zero
                     move  "#"            to   w-buf-ute-fas-fds
                     go to buf-ute-fas-999.
      *                      *-----------------------------------------*
      *                      * Determinazione numero pagine nel buffer *
      *                      *-----------------------------------------*
           move      w-buf-ute-fas-crb    to   w-buf-ute-fas-cpb      .
           subtract  1                    from w-buf-ute-fas-cpb      .
           divide    6                    into w-buf-ute-fas-cpb      .
           add       1                    to   w-buf-ute-fas-cpb      .
      *                      *-----------------------------------------*
      *                      * Inizializzazione numero record nel buf- *
      *                      * fer attualmente trattato                *
      *                      *-----------------------------------------*
           move      1                    to   w-buf-ute-fas-c01      .
      *                      *-----------------------------------------*
      *                      * Salvataggio immagine video              *
      *                      *-----------------------------------------*
           move      "SV"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Video in Off                            *
      *                      *-----------------------------------------*
           move      "OF"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione box vuoto               *
      *                      *-----------------------------------------*
           move      "BX"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      15                   to   v-lto                  .
           move      72                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Preparazione fincatura                  *
      *                      *-----------------------------------------*
           move      60                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      "PROGRAMMI UTILIZZATI"
                                          to   w-all-str-alf          .
      *
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                      *-----------------------------------------*
      *                      * Fincatura                               *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      05                   to   v-lin                  .
           move      11                   to   v-pos                  .
           move      w-all-str-alf        to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura fincatura                *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      06                   to   v-lin                  .
           move      11                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Sottolineatura di chiusura              *
      *                      *-----------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      13                   to   v-lin                  .
           move      11                   to   v-pos                  .
           move      all   "-"            to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione pagina video contenente *
      *                      * il record attualmente trattato          *
      *                      *-----------------------------------------*
           perform   buf-ute-fas-950      thru buf-ute-fas-959        .
      *                      *-----------------------------------------*
      *                      * Video in On                             *
      *                      *-----------------------------------------*
           move      "ON"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                      *-----------------------------------------*
      *                      * Visualizzazione box grafico             *
      *                      *-----------------------------------------*
           move      "BG"                 to   v-ope                  .
           move      04                   to   v-lin                  .
           move      09                   to   v-pos                  .
           move      15                   to   v-lto                  .
           move      72                   to   v-pto                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       buf-ute-fas-550.
      *                      *-----------------------------------------*
      *                      * Determinazione numero linea a video     *
      *                      *-----------------------------------------*
           move      w-buf-ute-fas-c01    to   w-buf-ute-fas-nli      .
       buf-ute-fas-555.
           if        w-buf-ute-fas-nli    >    6
                     subtract  6          from w-buf-ute-fas-nli
                     go to buf-ute-fas-555.
      *                          *-------------------------------------*
      *                          * Incremento numero linea a video     *
      *                          * per posizionamento verticale        *
      *                          *-------------------------------------*
           add       06                   to   w-buf-ute-fas-nli      .
       buf-ute-fas-560.
      *                      *-----------------------------------------*
      *                      * Espansione record attualmente trattato  *
      *                      *-----------------------------------------*
       buf-ute-fas-575.
      *                      *-----------------------------------------*
      *                      * Accettazione del mark-point             *
      *                      *-----------------------------------------*
           move      "AC"                 to   v-ope                  .
           move      "K"                  to   v-tip                  .
           move      spaces               to   v-ufk                  .
      *
           if        w-buf-ute-fas-c01    >    1
                     move  "UP  "         to   v-pfk (01)             .
           if        w-buf-ute-fas-c01    <    w-buf-ute-fas-crb
                     move  "DOWN"         to   v-pfk (02)             .
           move      "DO  "               to   v-pfk (05)             .
           if        w-buf-ute-fas-cpa    >    1
                     move  "PRSC"         to   v-pfk (07)             .
           if        w-buf-ute-fas-cpa    <    w-buf-ute-fas-cpb
                     move  "NXSC"         to   v-pfk (08)             .
           move      "TAB "               to   v-pfk (10)             .
           move      "SLCT"               to   v-pfk (11)             .
           move      "EXIT"               to   v-pfk (20)             .
      *
           move      w-buf-ute-fas-nli    to   v-lin                  .
           move      11                   to   v-pos                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       buf-ute-fas-580.
           if        v-key                =    spaces or
                     v-key                =    "DO  " or
                     v-key                =    "SLCT"
                     go to buf-ute-fas-582
           else if   v-key                =    "UP  "
                     go to buf-ute-fas-584
           else if   v-key                =    "DOWN"
                     go to buf-ute-fas-586
           else if   v-key                =    "EXIT"
                     go to buf-ute-fas-600
           else if   v-key                =    "NXSC"
                     go to buf-ute-fas-592
           else if   v-key                =    "PRSC"
                     go to buf-ute-fas-594
           else if   v-key                =    "TAB "
                     go to buf-ute-fas-598
           else      go to buf-ute-fas-575.
       buf-ute-fas-582.
      *              *-------------------------------------------------*
      *              * Se spaces, Do o select                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Restore video                               *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Memorizzazione valori selezionati           *
      *                  *---------------------------------------------*
           move      w-buf-ute-fas-fas
                    (w-buf-ute-fas-c01)   to   w-buf-ute-fas-tdf      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     buf-ute-fas-999.
       buf-ute-fas-584.
      *              *-------------------------------------------------*
      *              * Se Up                                           *
      *              *-------------------------------------------------*
           subtract  1                    from w-buf-ute-fas-c01      .
           if        w-buf-ute-fas-nli    =    07
                     go to buf-ute-fas-590
           else      go to buf-ute-fas-550.
       buf-ute-fas-586.
      *              *-------------------------------------------------*
      *              * Se Down                                         *
      *              *-------------------------------------------------*
           if        w-buf-ute-fas-c01    <    w-buf-ute-fas-crb
                     add   1              to   w-buf-ute-fas-c01
                     go to buf-ute-fas-588
           else      go to buf-ute-fas-575.
       buf-ute-fas-588.
           if        w-buf-ute-fas-nli    =    12
                     go to buf-ute-fas-590
           else      go to buf-ute-fas-550.
       buf-ute-fas-590.
           perform   buf-ute-fas-950      thru buf-ute-fas-959        .
           go to     buf-ute-fas-550.
       buf-ute-fas-592.
      *              *-------------------------------------------------*
      *              * Se Next screen                                  *
      *              *-------------------------------------------------*
           add       1                    to   w-buf-ute-fas-cpa      .
           go to     buf-ute-fas-596.
       buf-ute-fas-594.
      *              *-------------------------------------------------*
      *              * Se Previous screen                              *
      *              *-------------------------------------------------*
           subtract  1                    from w-buf-ute-fas-cpa      .
       buf-ute-fas-596.
           move      w-buf-ute-fas-cpa    to   w-buf-ute-fas-c01      .
           multiply  6                    by   w-buf-ute-fas-c01      .
           subtract  5                    from w-buf-ute-fas-c01      .
           go to     buf-ute-fas-590.
       buf-ute-fas-598.
      *              *-------------------------------------------------*
      *              * Se Tab                                          *
      *              *-------------------------------------------------*
           move      w-buf-ute-fas-cpb    to   w-buf-ute-fas-cpa      .
           go to     buf-ute-fas-596.
       buf-ute-fas-600.
      *              *-------------------------------------------------*
      *              * Se Exit                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di selezione                           *
      *                  *---------------------------------------------*
           move      "#"                  to   w-buf-ute-fas-fds      .
      *                  *---------------------------------------------*
      *                  * Restore video                               *
      *                  *---------------------------------------------*
           move      "RS"                 to   v-ope                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       buf-ute-fas-800.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     buf-ute-fas-999.
       buf-ute-fas-950.
      *              *=================================================*
      *              * Visualizzazione pagina video contenente il re-  *
      *              * cord attualmente trattato                       *
      *              *-------------------------------------------------*
           move      w-buf-ute-fas-c01    to   w-buf-ute-fas-c02      .
           add       5                    to   w-buf-ute-fas-c02      .
           divide    6                    into w-buf-ute-fas-c02      .
           move      w-buf-ute-fas-c02    to   w-buf-ute-fas-cpa      .
           subtract  1                    from w-buf-ute-fas-c02      .
           multiply  6                    by   w-buf-ute-fas-c02      .
           add       1                    to   w-buf-ute-fas-c02      .
           add       5
                     w-buf-ute-fas-c02  giving w-buf-ute-fas-c03      .
           move      w-buf-ute-fas-c03    to   w-buf-ute-fas-c04      .
           if        w-buf-ute-fas-c03    >    w-buf-ute-fas-crb
                     move  w-buf-ute-fas-crb
                                          to   w-buf-ute-fas-c03      .
           move      07                   to   w-buf-ute-fas-c05      .
       buf-ute-fas-951.
      *                  *---------------------------------------------*
      *                  * Fase                                        *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      06                   to   v-car                  .
           move      w-buf-ute-fas-c05    to   v-lin                  .
           move      11                   to   v-pos                  .
           move      w-buf-ute-fas-fas
                    (w-buf-ute-fas-c02)   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Descrizione programma                       *
      *                  *---------------------------------------------*
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      40                   to   v-car                  .
           move      w-buf-ute-fas-c05    to   v-lin                  .
           move      20                   to   v-pos                  .
           move      w-buf-ute-fas-def
                    (w-buf-ute-fas-c02)   to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
      *                  *---------------------------------------------*
      *                  * Incremento contatori                        *
      *                  *---------------------------------------------*
           add       1                    to   w-buf-ute-fas-c02      .
           add       1                    to   w-buf-ute-fas-c05      .
           if        w-buf-ute-fas-c02    not  > w-buf-ute-fas-c03
                     go to buf-ute-fas-951.
       buf-ute-fas-952.
           if        w-buf-ute-fas-c02    >    w-buf-ute-fas-c04
                     go to buf-ute-fas-955.
           if        w-buf-ute-fas-crb    not  > 6
                     go to buf-ute-fas-955.
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      60                   to   v-car                  .
           move      w-buf-ute-fas-c05    to   v-lin                  .
           move      11                   to   v-pos                  .
           move      spaces               to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
           add       1                    to   w-buf-ute-fas-c02      .
           add       1                    to   w-buf-ute-fas-c05      .
           go to     buf-ute-fas-952.
       buf-ute-fas-955.
      *                  *---------------------------------------------*
      *                  * Literal 'pagina'                            *
      *                  *---------------------------------------------*
           move      w-buf-ute-fas-cpa    to   w-buf-ute-fas-lt1      .
           move      w-buf-ute-fas-cpb    to   w-buf-ute-fas-lt2      .
           move      "DS"                 to   v-ope                  .
           move      "A"                  to   v-tip                  .
           move      13                   to   v-car                  .
           move      14                   to   v-lin                  .
           move      34                   to   v-pos                  .
           move      w-buf-ute-fas-ltp    to   v-alf                  .
           call      "swd/mod/prg/obj/mvideo"
                                        using  v                      .
       buf-ute-fas-959.
           exit.
       buf-ute-fas-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

