      *    *===========================================================*
      *    * Area per parametri di 'chaining' dal chiamante            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * Variabile di environment V_WIP_HOME                   *
      *        *-------------------------------------------------------*
       77  w-env-v-dkb-home               pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Variabile di environment V_WIP_USER                   *
      *        *-------------------------------------------------------*
       77  w-env-v-dkb-user               pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Variabile di environment V_WIP_TTYC                   *
      *        *-------------------------------------------------------*
       77  w-env-v-dkb-ttyc               pic  x(23)                  .
      *        *-------------------------------------------------------*
      *        * Variabile di environment V_WIP_TERM                   *
      *        *-------------------------------------------------------*
       77  w-env-v-dkb-term               pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Variabile di environment V_WIP_RUNT                   *
      *        *-------------------------------------------------------*
       77  w-env-v-dkb-runt               pic  x(02)                  .
      *        *-------------------------------------------------------*
      *        * Variabile di environment V_WIP_GETP                   *
      *        *-------------------------------------------------------*
       77  w-env-v-dkb-getp               pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Variabile di environment V_WIP_SUBT                   *
      *        *-------------------------------------------------------*
       77  w-env-v-dkb-subt               pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Variabile di environment V_WIP_AZIE                   *
      *        *-------------------------------------------------------*
       77  w-env-v-dkb-azie               pic  x(04)                  .
      *        *-------------------------------------------------------*
      *        * Variabile di environment V_WIP_UTEN                   *
      *        *-------------------------------------------------------*
       77  w-env-v-dkb-uten               pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Variabile di environment V_WIP_PRMS                   *
      *        *-------------------------------------------------------*
       77  w-env-v-dkb-prms               pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Variabile di environment V_WIP_POST                   *
      *        *                                                       *
      *        * ___ aumentare per consentire il passaggio di dati     *
      *        * ___ maggiore. Almeno a 220 caratteri (o-shs).         *
      *        *                                                       *
      *        *-------------------------------------------------------*
       77  w-env-v-dkb-post               pic  x(512)                 .

