       Identification Division.
       Program-Id.                                 porf300s           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    orf                 *
      *                                Settore:    mov                 *
      *                                   Fase:    orf300              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 15/07/92    *
      *                       Ultima revisione:    NdK del 03/12/15    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Modulo di stampa   : ordine a fornitore     *
      *                                                                *
      *                    VERSIONE SU MISURA PER ELETTRA              *
      *                                                                *
      *                    - Stampa numero posizione                   *
      *                                                                *
      *                    - EDI                                       *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     d-K-b-Snc-PD .
       Object-Computer.     d-K-b-Snc-PD .

       Special-Names.       Decimal-Point is comma .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "msegrt" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mpslct" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/r"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area di identificazione del programma chiamante           *
      *    *-----------------------------------------------------------*
       01  w-ide.
      *        *-------------------------------------------------------*
      *        * Tipo selezione stampante                              *
      *        *-------------------------------------------------------*
           05  w-ide-pgc-sel              pic  x(01) value spaces     .
      *        *-------------------------------------------------------*
      *        * Codice azienda                                        *
      *        *-------------------------------------------------------*
           05  w-ide-pgc-azi              pic  x(04) value spaces     .
      *        *-------------------------------------------------------*
      *        * Codice terminale                                      *
      *        *-------------------------------------------------------*
           05  w-ide-pgc-ter              pic  x(08) value spaces     .
      *        *-------------------------------------------------------*
      *        * Codice utente                                         *
      *        *-------------------------------------------------------*
           05  w-ide-pgc-ute              pic  x(08) value spaces     .
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  w-ide-pgc-sap              pic  x(03) value spaces     .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  w-ide-pgc-arg              pic  x(03) value spaces     .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  w-ide-pgc-set              pic  x(03) value spaces     .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  w-ide-pgc-fas              pic  x(06) value spaces     .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  w-ide-pgc-dep              pic  x(40) value spaces     .
      *        *-------------------------------------------------------*
      *        * Data e ora di sistema                                 *
      *        *-------------------------------------------------------*
           05  w-ide-pgc-sdt              pic  9(15) value zero       .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo su status generali del programma   *
      *        *-------------------------------------------------------*
           05  w-cnt-sts.
      *            *---------------------------------------------------*
      *            * Flag di selezione stampante                       *
      *            * - Spaces : Non selezionata                        *
      *            * - S      : Selezionata                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-flg-sst      pic  x(01) value spaces     .
      *            *---------------------------------------------------*
      *            * Flag di files necessari per la stampa aperti      *
      *            * - Spaces : Non aperti                             *
      *            * - S      : Aperti                                 *
      *            *---------------------------------------------------*
               10  w-cnt-sts-flg-opn      pic  x(01) value spaces     .
      *            *---------------------------------------------------*
      *            * Flag di Begin eseguito                            *
      *            *---------------------------------------------------*
               10  w-cnt-sts-flg-bgn      pic  x(01) value spaces     .
      *        *-------------------------------------------------------*
      *        * Area per preparazione parametri selezione stampa      *
      *        *-------------------------------------------------------*
           05  w-cnt-stp.
      *            *---------------------------------------------------*
      *            * Parametri di stampa specifici del programma       *
      *            *---------------------------------------------------*
               10  w-cnt-stp-tip-sel      pic  x(10)                  .
               10  w-cnt-stp-cod-stp      pic  x(08)                  .
               10  w-cnt-stp-tip-sta      pic  x(01)                  .
               10  w-cnt-stp-cod-mod      pic  x(08)                  .
               10  w-cnt-stp-tip-mod      pic  x(01)                  .
               10  w-cnt-stp-amp-lin      pic  9(03)                  .
               10  w-cnt-stp-top-lin      pic  9(04)                  .
               10  w-cnt-stp-lin-min      pic  9(02)                  .
               10  w-cnt-stp-bot-lin      pic  9(04)                  .
               10  w-cnt-stp-amp-car      pic  9(02)v9(02)            .
               10  w-cnt-stp-alt-int      pic  9(02)v9(02)            .
               10  w-cnt-stp-esp-fut      pic  x(99)                  .
               10  w-cnt-stp-fnz-spc      pic  x(99)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per numerazione pagine in reintestazione         *
      *        *-------------------------------------------------------*
           05  w-cnt-npr.
               10  w-cnt-npr-num-pag      pic  9(05)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [oft]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orf/fls/rec/rfoft"                          .
      *        *-------------------------------------------------------*
      *        * [ofr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orf/fls/rec/rfofr"                          .
      *        *-------------------------------------------------------*
      *        * [ofx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orf/fls/rec/rfofx"                          .
      *        *-------------------------------------------------------*
      *        * [yof]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orf/fls/rec/rfyof"                          .
      *        *-------------------------------------------------------*
      *        * [yca]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orf/fls/rec/rfyca"                          .
      *        *-------------------------------------------------------*
      *        * [yro]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/orf/fls/rec/rfyro"                          .
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [yfp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfyfp"                          .
      *        *-------------------------------------------------------*
      *        * [yfx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfyfx"                          .
      *        *-------------------------------------------------------*
      *        * [ydf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfydf"                          .
      *        *-------------------------------------------------------*
      *        * [yvf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfyvf"                          .
      *        *-------------------------------------------------------*
      *        * [ysf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfysf"                          .
      *        *-------------------------------------------------------*
      *        * [aaq]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfaaq"                          .
      *        *-------------------------------------------------------*
      *        * [pdt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfpdt"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [pdx]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfpdx"                          .
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [axs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxs"                          .
      *        *-------------------------------------------------------*
      *        * [axi]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/abi/fls/rec/rfaxi"                          .
      *        *-------------------------------------------------------*
      *        * [cbp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/gep/fls/rec/rfcbp"                          .
      *        *-------------------------------------------------------*
      *        * [ada]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/azi/fls/rec/rfada"                          .

      *    *===========================================================*
      *    * Area comune per programmi di stampa della serie porf300s  *
      *    *                                                           *
      *    * La link-area comprende :                                  *
      *    *                                                           *
      *    *  - 'w-inp-mst' : Work-area per la ridefinizione della     *
      *    *                  variabile di i.p.c. in input "inp-mst"   *
      *    *                                                           *
      *    *  - 'w-out-mst' : Work-area per la ridefinizione della     *
      *    *                  variabile di i.p.c. in output "out-mst"  *
      *    *-----------------------------------------------------------*
           copy      "pgm/orf/prg/cpy/porf300s.pgl"                   .

      *    *===========================================================*
      *    * Work-area personalizzazioni                               *
      *    *-----------------------------------------------------------*
       01  w-prs.
      *        *-------------------------------------------------------*
      *        * Personalizzazione per modulo stampa conferme d'ordine *
      *        * fornitore                                             *
      *        *-------------------------------------------------------*
      *            *---------------------------------------------------*
      *            * Comodo per ridefinizione della personalizzazione  *
      *            *---------------------------------------------------*
           05  w-prs-sof-str              pic  x(30)                  .
           05  w-prs-sof-str-r            redefines
               w-prs-sof-str.
      *            *---------------------------------------------------*
      *            * Tipo modulo                                       *
      *            *                                                   *
      *            *  - 01 : Modulo senza esposizione codice articolo  *
      *            *  - 51 : Modulo con esposizione codice articolo    *
      *            *---------------------------------------------------*
               10  w-prs-sof-tmd          pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Tipo stampato                                     *
      *            *                                                   *
      *            *  - 'T' : Tipografico                              *
      *            *  - 'L' : Libero                                   *
      *            *---------------------------------------------------*
               10  w-prs-sof-tst          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Tipo intestazione foglio                          *
      *            *                                                   *
      *            *  - 'N' : Nessuna intestazione                     *
      *            *  - 'R' : Intestazione come da referenza           *
      *            *          "pgm/orc/mov/orc300s[int-orc]"           *
      *            *  - 'P' : Intestazione standard da eseguirsi dal   *
      *            *          programma                                *
      *            *---------------------------------------------------*
               10  w-prs-sof-tin          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/no stampa voce descrittiva per 6 voci          *
      *            *---------------------------------------------------*
               10  w-prs-sof-snv occurs 06
                                          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Codice da stampare in colonna codice prodotto,    *
      *            * opzione valida solo se tipo modulo 51.            *
      *            *                                                   *
      *            *  - 'F' : Codice del fornitore                     *
      *            *  - 'P' : Codice del produttore                    *
      *            *  - 'M' : Codice nostro                            *
      *            *  - 'N' : Nessuno dei tre                          *
      *            *---------------------------------------------------*
               10  w-prs-sof-cod          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No riga aggiuntiva per stampa codice prodotto, *
      *            * opzione valida per tutti i tipi modulo.           *
      *            *                                                   *
      *            *  - 'N' : Nessuna riga aggiuntiva                  *
      *            *  - 'F' : Una riga aggiuntiva con il codice del    *
      *            *          fornitore                                *
      *            *  - 'P' : Una riga aggiuntiva con il codice del    *
      *            *          produttore                               *
      *            *  - 'M' : Una riga aggiuntiva con il codice nostro *
      *            *  - 'E' : Due righe aggiuntive, la prima con il    *
      *            *          codice del fornitore, la seconda con il  *
      *            *          nostro codice                            *
      *            *  - 'U' : Due righe aggiuntive, la prima con il    *
      *            *          codice del fornitore, la seconda con il  *
      *            *          codice EAN                               *
      *            *---------------------------------------------------*
               10  w-prs-sof-rac          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/no stampa numero di Fax del fornitore          *
      *            *---------------------------------------------------*
               10  w-prs-sof-snf          pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/no stampa delle quantita' editate a destra     *
      *            *---------------------------------------------------*
               10  w-prs-sof-snq          pic  x(01)                  .
               10  filler                 pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/no stampa laser o PCL                          *
      *            *                                                   *
      *            *  - 'N' = No                                       *
      *            *  - 'S' = Si, laser                                *
      *            *  - 'P' = PCL                                      *
      *            *---------------------------------------------------*
               10  w-prs-sof-snl          pic  x(01)                  .
               10  filler                 pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/no stampa del responsabile ordine              *
      *            *---------------------------------------------------*
               10  w-prs-sof-snr          pic  x(01)                  .
               10  filler                 pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/no stampa del codice casa produttrice a rot-   *
      *            * tura su codice prodotto                           *
      *            *---------------------------------------------------*
               10  w-prs-sof-snp          pic  x(01)                  .
               10  filler                 pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/no stampa spesa di fatturazione in ordine      *
      *            * fornitore per 6 voci                              *
      *            *---------------------------------------------------*
               10  w-prs-sof-sns occurs 06
                                          pic  x(01)                  .
               10  filler                 pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Contatore di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-prs-sof-ctr              pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area referenze                                       *
      *    *-----------------------------------------------------------*
       01  w-ref.
      *        *-------------------------------------------------------*
      *        * Descrizioni per stampa intestazione documento         *
      *        *-------------------------------------------------------*
           05  w-ref-stp-int.
               10  w-ref-stp-int-des occurs 8
                                          pic  x(50)                  .
               10  w-ref-stp-int-ctr      pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per routine rou-opn-fls-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-rou-opn-fls.
           05  w-rou-opn-fls-wac          pic  9(07)v9(02)            .
           05  w-rou-opn-fls-wre          pic  9(07)v9(02)            .

      *    *===========================================================*
      *    * Work-area per coordinate di posizionamento campi testata  *
      *    *-----------------------------------------------------------*
       01  w-lpt.
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Tipo documento                  *
      *        *-------------------------------------------------------*
           05  w-lpt-tmo-orf-lin          pic  9(03)                  .
           05  w-lpt-tmo-orf-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Numero documento                *
      *        *-------------------------------------------------------*
           05  w-lpt-num-doc-lin          pic  9(03)                  .
           05  w-lpt-num-doc-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Data documento                  *
      *        *-------------------------------------------------------*
           05  w-lpt-dat-doc-lin          pic  9(03)                  .
           05  w-lpt-dat-doc-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Codice fiscale cliente          *
      *        *-------------------------------------------------------*
           05  w-lpt-cod-fis-lin          pic  9(03)                  .
           05  w-lpt-cod-fis-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Partita iva fornitore           *
      *        *-------------------------------------------------------*
           05  w-lpt-prt-iva-lin          pic  9(03)                  .
           05  w-lpt-prt-iva-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linee e posizioni per indirizzo di spedizione         *
      *        *-------------------------------------------------------*
           05  w-lpt-ids.
      *            *---------------------------------------------------*
      *            * Ragione sociale                                   *
      *            *---------------------------------------------------*
               10  w-lpt-ids-rag-lin      pic  9(03)                  .
               10  w-lpt-ids-rag-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Indirizzo                                         *
      *            *---------------------------------------------------*
               10  w-lpt-ids-via-lin      pic  9(03)                  .
               10  w-lpt-ids-via-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Localita'                                         *
      *            *---------------------------------------------------*
               10  w-lpt-ids-loc-lin      pic  9(03)                  .
               10  w-lpt-ids-loc-pos      pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linee e posizioni per inoltro documento               *
      *        *-------------------------------------------------------*
           05  w-lpt-inl.
      *            *---------------------------------------------------*
      *            * Ragione sociale, 1a parte                         *
      *            *---------------------------------------------------*
               10  w-lpt-inl-rs1-lin      pic  9(03)                  .
               10  w-lpt-inl-rs1-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale, eventuale 2a parte               *
      *            *---------------------------------------------------*
               10  w-lpt-inl-rs2-lin      pic  9(03)                  .
               10  w-lpt-inl-rs2-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Indirizzo                                         *
      *            *---------------------------------------------------*
               10  w-lpt-inl-via-lin      pic  9(03)                  .
               10  w-lpt-inl-via-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Localita'                                         *
      *            *---------------------------------------------------*
               10  w-lpt-inl-loc-lin      pic  9(03)                  .
               10  w-lpt-inl-loc-pos      pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Tipo evasione richiesta         *
      *        *-------------------------------------------------------*
           05  w-lpt-tip-eva-lin          pic  9(03)                  .
           05  w-lpt-tip-eva-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Rif. conferma ordine            *
      *        *-------------------------------------------------------*
           05  w-lpt-rif-cof-lin          pic  9(03)                  .
           05  w-lpt-rif-cof-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per Ns. dipendenza                  *
      *        *-------------------------------------------------------*
           05  w-lpt-des-dpz-lin          pic  9(03)                  .
           05  w-lpt-des-dpz-pos          pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per coordinate di posizionamento campi corpo    *
      *    *-----------------------------------------------------------*
       01  w-lpc.
      *        *-------------------------------------------------------*
      *        * Linea per prima riga corpo                            *
      *        *-------------------------------------------------------*
           05  w-lpc-pri-rig-lin          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea per ultima riga corpo                           *
      *        *-------------------------------------------------------*
           05  w-lpc-ult-rig-lin          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per ultima riga corpo                          *
      *        *-------------------------------------------------------*
           05  w-lpc-ult-rig-wrk          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizione per codice prodotto                         *
      *        *-------------------------------------------------------*
           05  w-lpc-cod-pro-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizione per descrizione prodotto                    *
      *        *-------------------------------------------------------*
           05  w-lpc-des-pro-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizione per quantita' ordinata                      *
      *        *-------------------------------------------------------*
           05  w-lpc-qta-ord-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizione per unita' di misura                        *
      *        *-------------------------------------------------------*
           05  w-lpc-umi-acq-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizione per prezzo di acquisto                      *
      *        *-------------------------------------------------------*
           05  w-lpc-prz-acq-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizione per percentuali di sconto in riga           *
      *        *-------------------------------------------------------*
           05  w-lpc-per-scr-pos occurs 05
                                          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizione per data consegna                           *
      *        *-------------------------------------------------------*
           05  w-lpc-dat-cns-pos          pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per coordinate di posizionamento campi piede    *
      *    *-----------------------------------------------------------*
       01  w-lpp.
      *        *-------------------------------------------------------*
      *        * Linea e posizione per voci descrittive                *
      *        *-------------------------------------------------------*
           05  w-lpp-voc-des-lin          pic  9(03)                  .
           05  w-lpp-voc-des-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per descr. condizioni di acquisto   *
      *        *-------------------------------------------------------*
           05  w-lpp-cda-des-lin          pic  9(03)                  .
           05  w-lpp-cda-des-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per forma di pagamento              *
      *        *-------------------------------------------------------*
           05  w-lpp-des-fop-lin          pic  9(03)                  .
           05  w-lpp-des-fop-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per ABI                             *
      *        *-------------------------------------------------------*
           05  w-lpp-des-abi-lin          pic  9(03)                  .
           05  w-lpp-des-abi-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linee e posizioni per CAB                             *
      *        *-------------------------------------------------------*
           05  w-lpp-des-cab-lin          pic  9(03)                  .
           05  w-lpp-des-cab-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linee e posizioni per c/c di appoggio                 *
      *        *-------------------------------------------------------*
           05  w-lpp-ccc-app-lin          pic  9(03)                  .
           05  w-lpp-ccc-app-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per literal 'Segue'                 *
      *        *-------------------------------------------------------*
           05  w-lpp-lit-seg-lin          pic  9(03)                  .
           05  w-lpp-lit-seg-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Linea e posizione per numero fax                      *
      *        *-------------------------------------------------------*
           05  w-lpp-num-fax-lin          pic  9(03)                  .
           05  w-lpp-num-fax-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Responsabile ordine                                   *
      *        *-------------------------------------------------------*
           05  w-lpp-rsp-ord-lin          pic  9(03)                  .
           05  w-lpp-rsp-ord-pos          pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per coordinate di posizionamento intestazione   *
      *    * documento                                                 *
      *    *-----------------------------------------------------------*
       01  w-lpi.
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione azienda               *
      *        *-------------------------------------------------------*
           05  w-lpi-int-azi-lin          pic  9(03)                  .
           05  w-lpi-int-azi-pos          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Tipo documento      *
      *        *-------------------------------------------------------*
           05  w-lpi-tip-doc-lin          pic  9(03)                  .
           05  w-lpi-tip-doc-pin          pic  9(03)                  .
           05  w-lpi-tip-doc-lfi          pic  9(03)                  .
           05  w-lpi-tip-doc-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Numero documento    *
      *        *-------------------------------------------------------*
           05  w-lpi-num-doc-lin          pic  9(03)                  .
           05  w-lpi-num-doc-pin          pic  9(03)                  .
           05  w-lpi-num-doc-lfi          pic  9(03)                  .
           05  w-lpi-num-doc-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Data documento      *
      *        *-------------------------------------------------------*
           05  w-lpi-dat-doc-lin          pic  9(03)                  .
           05  w-lpi-dat-doc-pin          pic  9(03)                  .
           05  w-lpi-dat-doc-lfi          pic  9(03)                  .
           05  w-lpi-dat-doc-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Codice fiscale      *
      *        *-------------------------------------------------------*
           05  w-lpi-cod-fis-lin          pic  9(03)                  .
           05  w-lpi-cod-fis-pin          pic  9(03)                  .
           05  w-lpi-cod-fis-lfi          pic  9(03)                  .
           05  w-lpi-cod-fis-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Partita iva         *
      *        *-------------------------------------------------------*
           05  w-lpi-prt-iva-lin          pic  9(03)                  .
           05  w-lpi-prt-iva-pin          pic  9(03)                  .
           05  w-lpi-prt-iva-lfi          pic  9(03)                  .
           05  w-lpi-prt-iva-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Spettabile          *
      *        *-------------------------------------------------------*
           05  w-lpi-fin-spt-lin          pic  9(03)                  .
           05  w-lpi-fin-spt-pin          pic  9(03)                  .
           05  w-lpi-fin-spt-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Indirizzo di sped.  *
      *        *-------------------------------------------------------*
           05  w-lpi-ind-spe-lin          pic  9(03)                  .
           05  w-lpi-ind-spe-pin          pic  9(03)                  .
           05  w-lpi-ind-spe-lfi          pic  9(03)                  .
           05  w-lpi-ind-spe-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Riferimenti ordine  *
      *        *-------------------------------------------------------*
           05  w-lpi-rif-orf-lin          pic  9(03)                  .
           05  w-lpi-rif-orf-pin          pic  9(03)                  .
           05  w-lpi-rif-orf-lfi          pic  9(03)                  .
           05  w-lpi-rif-orf-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Box fincatura       *
      *        *-------------------------------------------------------*
           05  w-lpi-fin.
      *            *---------------------------------------------------*
      *            * Codice prodotto                                   *
      *            *---------------------------------------------------*
               10  w-lpi-fin-cod-lin      pic  9(03)                  .
               10  w-lpi-fin-cod-pin      pic  9(03)                  .
               10  w-lpi-fin-cod-lfi      pic  9(03)                  .
               10  w-lpi-fin-cod-pfi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Descrizione prodotto                              *
      *            *---------------------------------------------------*
               10  w-lpi-fin-des-lin      pic  9(03)                  .
               10  w-lpi-fin-des-pin      pic  9(03)                  .
               10  w-lpi-fin-des-lfi      pic  9(03)                  .
               10  w-lpi-fin-des-pfi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Quantita'                                         *
      *            *---------------------------------------------------*
               10  w-lpi-fin-qta-lin      pic  9(03)                  .
               10  w-lpi-fin-qta-pin      pic  9(03)                  .
               10  w-lpi-fin-qta-lfi      pic  9(03)                  .
               10  w-lpi-fin-qta-pfi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Unita' di misura                                  *
      *            *---------------------------------------------------*
               10  w-lpi-fin-udm-lin      pic  9(03)                  .
               10  w-lpi-fin-udm-pin      pic  9(03)                  .
               10  w-lpi-fin-udm-lfi      pic  9(03)                  .
               10  w-lpi-fin-udm-pfi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Prezzo                                            *
      *            *---------------------------------------------------*
               10  w-lpi-fin-prz-lin      pic  9(03)                  .
               10  w-lpi-fin-prz-pin      pic  9(03)                  .
               10  w-lpi-fin-prz-lfi      pic  9(03)                  .
               10  w-lpi-fin-prz-pfi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Sconti                                            *
      *            *---------------------------------------------------*
               10  w-lpi-fin-sco-lin      pic  9(03)                  .
               10  w-lpi-fin-sco-pin      pic  9(03)                  .
               10  w-lpi-fin-sco-lfi      pic  9(03)                  .
               10  w-lpi-fin-sco-pfi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Data consegna                                     *
      *            *---------------------------------------------------*
               10  w-lpi-fin-dcn-lin      pic  9(03)                  .
               10  w-lpi-fin-dcn-pin      pic  9(03)                  .
               10  w-lpi-fin-dcn-lfi      pic  9(03)                  .
               10  w-lpi-fin-dcn-pfi      pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Corpo documento     *
      *        *-------------------------------------------------------*
           05  w-lpi-cor.
      *            *---------------------------------------------------*
      *            * Codice prodotto                                   *
      *            *---------------------------------------------------*
               10  w-lpi-cor-cod-lin      pic  9(03)                  .
               10  w-lpi-cor-cod-pin      pic  9(03)                  .
               10  w-lpi-cor-cod-lfi      pic  9(03)                  .
               10  w-lpi-cor-cod-pfi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Descrizione prodotto                              *
      *            *---------------------------------------------------*
               10  w-lpi-cor-des-lin      pic  9(03)                  .
               10  w-lpi-cor-des-pin      pic  9(03)                  .
               10  w-lpi-cor-des-lfi      pic  9(03)                  .
               10  w-lpi-cor-des-pfi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Quantita'                                         *
      *            *---------------------------------------------------*
               10  w-lpi-cor-qta-lin      pic  9(03)                  .
               10  w-lpi-cor-qta-pin      pic  9(03)                  .
               10  w-lpi-cor-qta-lfi      pic  9(03)                  .
               10  w-lpi-cor-qta-pfi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Unita' di misura                                  *
      *            *---------------------------------------------------*
               10  w-lpi-cor-udm-lin      pic  9(03)                  .
               10  w-lpi-cor-udm-pin      pic  9(03)                  .
               10  w-lpi-cor-udm-lfi      pic  9(03)                  .
               10  w-lpi-cor-udm-pfi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Prezzo                                            *
      *            *---------------------------------------------------*
               10  w-lpi-cor-prz-lin      pic  9(03)                  .
               10  w-lpi-cor-prz-pin      pic  9(03)                  .
               10  w-lpi-cor-prz-lfi      pic  9(03)                  .
               10  w-lpi-cor-prz-pfi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Sconti                                            *
      *            *---------------------------------------------------*
               10  w-lpi-cor-sco-lin      pic  9(03)                  .
               10  w-lpi-cor-sco-pin      pic  9(03)                  .
               10  w-lpi-cor-sco-lfi      pic  9(03)                  .
               10  w-lpi-cor-sco-pfi      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Data consegna                                     *
      *            *---------------------------------------------------*
               10  w-lpi-cor-dcn-lin      pic  9(03)                  .
               10  w-lpi-cor-dcn-pin      pic  9(03)                  .
               10  w-lpi-cor-dcn-lfi      pic  9(03)                  .
               10  w-lpi-cor-dcn-pfi      pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Condizioni di for-  *
      *        *                                   nitura              *
      *        *-------------------------------------------------------*
           05  w-lpi-cdz-frn-lin          pic  9(03)                  .
           05  w-lpi-cdz-frn-pin          pic  9(03)                  .
           05  w-lpi-cdz-frn-lfi          pic  9(03)                  .
           05  w-lpi-cdz-frn-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Condizioni di paga- *
      *        *                                   mento               *
      *        *-------------------------------------------------------*
           05  w-lpi-cdz-pag-lin          pic  9(03)                  .
           05  w-lpi-cdz-pag-pin          pic  9(03)                  .
           05  w-lpi-cdz-pag-lfi          pic  9(03)                  .
           05  w-lpi-cdz-pag-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Annotazioni per la  *
      *        *                                   fornitura           *
      *        *-------------------------------------------------------*
           05  w-lpi-ann-frn-lin          pic  9(03)                  .
           05  w-lpi-ann-frn-pin          pic  9(03)                  .
           05  w-lpi-ann-frn-lfi          pic  9(03)                  .
           05  w-lpi-ann-frn-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Nostri riferimenti  *
      *        *-------------------------------------------------------*
           05  w-lpi-nsx-rif-lin          pic  9(03)                  .
           05  w-lpi-nsx-rif-pin          pic  9(03)                  .
           05  w-lpi-nsx-rif-lfi          pic  9(03)                  .
           05  w-lpi-nsx-rif-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Spazio libero       *
      *        *-------------------------------------------------------*
           05  w-lpi-spz-lib-lin          pic  9(03)                  .
           05  w-lpi-spz-lib-pin          pic  9(03)                  .
           05  w-lpi-spz-lib-lfi          pic  9(03)                  .
           05  w-lpi-spz-lib-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Posizionamenti per intestazione : Literals            *
      *        *-------------------------------------------------------*
           05  w-lpi-lit.
      *            *---------------------------------------------------*
      *            * Numero documento                                  *
      *            *---------------------------------------------------*
               10  w-lpi-lit-num-lin      pic  9(03)                  .
               10  w-lpi-lit-num-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Data documento                                    *
      *            *---------------------------------------------------*
               10  w-lpi-lit-dat-lin      pic  9(03)                  .
               10  w-lpi-lit-dat-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Codice fiscale                                    *
      *            *---------------------------------------------------*
               10  w-lpi-lit-cfi-lin      pic  9(03)                  .
               10  w-lpi-lit-cfi-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Partita iva                                       *
      *            *---------------------------------------------------*
               10  w-lpi-lit-piv-lin      pic  9(03)                  .
               10  w-lpi-lit-piv-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Spettabile                                        *
      *            *---------------------------------------------------*
               10  w-lpi-lit-spt-lin      pic  9(03)                  .
               10  w-lpi-lit-spt-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Indirizzo di spedizione                           *
      *            *---------------------------------------------------*
               10  w-lpi-lit-ids-lin      pic  9(03)                  .
               10  w-lpi-lit-ids-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Riferimenti                                       *
      *            *---------------------------------------------------*
               10  w-lpi-lit-rif-lin      pic  9(03)                  .
               10  w-lpi-lit-rif-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Condizioni di fornitura                           *
      *            *---------------------------------------------------*
               10  w-lpi-lit-cdf-lin      pic  9(03)                  .
               10  w-lpi-lit-cdf-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Condizioni di pagamento                           *
      *            *---------------------------------------------------*
               10  w-lpi-lit-cdp-lin      pic  9(03)                  .
               10  w-lpi-lit-cdp-pos      pic  9(03)                  .
      *            *---------------------------------------------------*
      *            * Annotazioni per la fornitura                      *
      *            *---------------------------------------------------*
               10  w-lpi-lit-apf-lin      pic  9(03)                  .
               10  w-lpi-lit-apf-pos      pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per displacement                                *
      *    *-----------------------------------------------------------*
       01  w-dsp.
      *        *-------------------------------------------------------*
      *        * Top Margin in linee                                   *
      *        *-------------------------------------------------------*
           05  w-dsp-top-mrg              pic  9(02) value   02       .
      *        *-------------------------------------------------------*
      *        * Bottom Margin in linee                                *
      *        *-------------------------------------------------------*
           05  w-dsp-bot-mrg              pic  9(02) value   00       .
      *        *-------------------------------------------------------*
      *        * Displacement orizzontale                              *
      *        *-------------------------------------------------------*
           05  w-dsp-dsp-hor              pic s9(03) value  000       .
      *        *-------------------------------------------------------*
      *        * Displacement verticale                                *
      *        *                                                       *
      *        * N.B.: Il valore di questo campo sara' posto pari al   *
      *        *       valore del 'Top Margin' moltiplicato per -1 in  *
      *        *       det-pos-stp-000/999                             *
      *        *                                                       *
      *        *-------------------------------------------------------*
           05  w-dsp-dsp-vrt              pic s9(03) value  000       .

      *    *===========================================================*
      *    * Work-area per dati sulla dipendenza                       *
      *    *-----------------------------------------------------------*
       01  w-ana-dpz.
           05  w-ana-dpz-let              pic  9(02)       value zero .
           05  w-ana-dpz-cod              pic  9(02)       value zero .
           05  w-ana-dpz-den              pic  x(20)                  .
           05  w-ana-dpz-rag              pic  x(40)                  .
           05  w-ana-dpz-via              pic  x(30)                  .
           05  w-ana-dpz-loc              pic  x(30)                  .

      *    *===========================================================*
      *    * Work-area per estensioni al record di testata             *
      *    *-----------------------------------------------------------*
       01  w-ext.
           05  w-ext-rag-ids              pic  x(40)                  .
           05  w-ext-via-ids              pic  x(40)                  .
           05  w-ext-loc-ids              pic  x(40)                  .
           05  w-ext-des-cda.
               10  w-ext-rig-cda occurs 3 pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per trattamento data consegna                   *
      *    *-----------------------------------------------------------*
       01  w-dat-cns.
           05  w-dat-cns-edt              pic  x(08)                  .
           05  w-dat-cns-ann              pic  x(04)                  .
           05  w-dat-cns-set              pic  x(02)                  .

      *    *===========================================================*
      *    * Work-area per stampa testata documento                    *
      *    *-----------------------------------------------------------*
       01  w-stp-tes.
      *        *-------------------------------------------------------*
      *        * Contatore di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-stp-tes-ctr              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per lunghezza tipo documento                   *
      *        *-------------------------------------------------------*
           05  w-stp-tes-wsz              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per descrizione documento                        *
      *        *-------------------------------------------------------*
           05  w-stp-tes-des.
               10  w-stp-tes-chd occurs 25
                                          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per literals                                   *
      *        *-------------------------------------------------------*
           05  w-stp-cof-tbl.
               10  w-stp-cof-ele occurs 20.
                   15  w-stp-cof-des      pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per stampa corpo documento                      *
      *    *-----------------------------------------------------------*
       01  w-stp-cor-doc.
      *        *-------------------------------------------------------*
      *        * Indicatori di stampa da eseguire                      *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-idc.
      *            *---------------------------------------------------*
      *            * Indicatore per codice prodotto                    *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-i10      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Indicatore per righe di descrizione               *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-i20      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Indicatore per quantita'                          *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-i30      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Indicatore per unita' di misura                   *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-i40      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Indicatore per prezzo                             *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-i50      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Indicatore per importo                            *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-i60      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Indicatori per percentuali di sconto              *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-i70
                               occurs 05  pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Indicatore per data di consegna                   *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-i80      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di stampa eseguita                              *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-flg.
      *            *---------------------------------------------------*
      *            * Flag per codice prodotto                          *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-f10      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flags per righe di descrizione                    *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-f20
                               occurs 13  pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag per quantita'                                *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-f30      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag per unita' di misura                         *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-f40      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag per prezzo                                   *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-f50      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag per importo                                  *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-f60      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flags per percentuali di sconto                   *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-f70
                               occurs 05  pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag per data di consegna                         *
      *            *---------------------------------------------------*
               10  w-stp-cor-doc-f80      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Contatori di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-ctr          pic  9(03)                  .
           05  w-stp-cor-doc-c01          pic  9(03)                  .
           05  w-stp-cor-doc-c02          pic  9(03)                  .
           05  w-stp-cor-doc-nrg          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per codice prodotto                            *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-cod          pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per quantita' da stampare                      *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-qta          pic s9(06)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Comodo per numero decimali quantita' da stampare      *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-dcq          pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per unita' di misura da stampare               *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-umi          pic  x(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per descrizione                                *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-der.
               10  w-stp-cor-doc-rgd occurs 13
                                          pic  x(40)                  .
               10  w-stp-cor-doc-ccc occurs 13
                                          pic  x(40)                  .
           05  w-stp-cor-doc-nrd          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per descrizione spesa in fattura               *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-spf          pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per data di consegna editata                   *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-dce.
               10  w-stp-cor-doc-dcm      pic  x(03)                  .
               10  filler                 pic  x(01)                  .
               10  w-stp-cor-doc-dca      pic  9(04)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per sconto incondizionato                      *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-sin          pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per sconto pagamento                           *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-spa          pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per composizione stringa di 40 caratteri       *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-x40          pic  x(40)                  .
           05  w-stp-cor-doc-pnt          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per totale volume in riga                      *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-tvr          pic  9(08)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Comodo per prompt codice prodotto per il fornitore    *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-pcf          pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per numero posizione                           *
      *        *                                                       *
      *        * ELETTRA                                               *
      *        *-------------------------------------------------------*
           05  w-stp-cor-doc-wnp          pic  9(04)                  .

      *    *===========================================================*
      *    * Work-area per stampa piede documento                      *
      *    *-----------------------------------------------------------*
       01  w-stp-pie.
      *        *-------------------------------------------------------*
      *        * Contatori di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-stp-pie-c01              pic  9(03)                  .
           05  w-stp-pie-c02              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per prompt voce descrittiva                    *
      *        *-------------------------------------------------------*
           05  w-stp-pie-pvd              pic  x(12)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per valore voce descrittiva                    *
      *        *-------------------------------------------------------*
           05  w-stp-pie-vvd              pic  x(25)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per prompt e valore voce descrittiva           *
      *        *-------------------------------------------------------*
           05  w-stp-pie-vde              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per condizioni di acquisto                     *
      *        *-------------------------------------------------------*
           05  w-stp-pie-cda.
               10  w-stp-pie-cda-001      pic  x(40)                  .
               10  w-stp-pie-cda-002      pic  x(40)                  .
               10  w-stp-pie-cda-003      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per forma di pagamento                         *
      *        *-------------------------------------------------------*
           05  w-stp-pie-fop              pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per codice ABI da stampare                     *
      *        *-------------------------------------------------------*
           05  w-stp-pie-abi              pic  9(05)                  .
           05  w-stp-pie-abi-des          pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per codice CAB da stampare                     *
      *        *-------------------------------------------------------*
           05  w-stp-pie-cab              pic  9(05)                  .
           05  w-stp-pie-cab-des          pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per codice C/C bancario da stampare            *
      *        *-------------------------------------------------------*
           05  w-stp-pie-ccb              pic  x(12)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per totale volume                              *
      *        *-------------------------------------------------------*
           05  w-stp-pie-tvo              pic  9(11)v9(05)            .

      *    *===========================================================*
      *    * Work area per tabella prompts campi conferma ordini a     *
      *    * fornitori                                                 *
      *    *-----------------------------------------------------------*
       01  w-pmt.
           05  w-pmt-cof.
               10  w-pmt-cof-max          pic  9(02)       value 20   .
               10  w-pmt-cof-lun          pic  9(02)       value 48   .
               10  w-pmt-cof-ele          pic  9(02)                  .
               10  w-pmt-cof-ctr          pic  9(02)                  .
               10  w-pmt-cof-tbl.
                   15  filler             pic  x(48) value
                    "901 025 Conferma d'ordine                       ".
                   15  filler             pic  x(48) value
                    "902 016 Numero                                  ".
                   15  filler             pic  x(48) value
                    "903 012 Data                                    ".
                   15  filler             pic  x(48) value
                    "904 016 Codice fiscale                          ".
                   15  filler             pic  x(48) value
                    "905 012 Partita Iva                             ".
                   15  filler             pic  x(48) value
                    "906 040 INDIRIZZO DI SPEDIZIONE MERCE           ".
                   15  filler             pic  x(48) value
                    "907 040 Spettabile                              ".
                   15  filler             pic  x(48) value
                    "908 040 RIFERIMENTI                             ".
                   15  filler             pic  x(48) value
                    "930 014 Codice                                  ".
                   15  filler             pic  x(48) value
                    "931 040 Descrizione                             ".
                   15  filler             pic  x(48) value
                    "932 011 Quantita'                               ".
                   15  filler             pic  x(48) value
                    "933 003 Udm                                     ".
                   15  filler             pic  x(48) value
                    "934 011 Prezzo                                  ".
                   15  filler             pic  x(48) value
                    "935 009 Sconti                                  ".
      *            * ELETTRA                                           *
                   15  filler             pic  x(48) value
                    "936 012 Consegna                                ".
                   15  filler             pic  x(48) value
                    "950 040 CONDIZIONI DI FORNITURA                 ".
                   15  filler             pic  x(48) value
                    "951 040 CONDIZIONI DI PAGAMENTO                 ".
                   15  filler             pic  x(48) value
                    "952 040 ANNOTAZIONI PER LA FORNITURA            ".
                   15  filler             pic  x(48) value
                    "960 015 Totale ordine                           ".
                   15  filler             pic  x(48) value
                    "980 040 Sconto incondizionato                   ".
               10  w-pmt-cof-tbr redefines
                   w-pmt-cof-tbl.
                   15  w-pmt-cof-ele occurs 20.
                       20  w-pmt-cof-cod  pic  9(03)                  .
                       20  filler         pic  x(01)                  .
                       20  w-pmt-cof-car  pic  9(03)                  .
                       20  filler         pic  x(01)                  .
                       20  w-pmt-cof-des  pic  x(40)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *    *===========================================================*
      *    * Work per Let su archivio [yfp] e [yfx]                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/ldcfyfx0.ltw"                   .

      *    *===========================================================*
      *    * Work-area per numero documento                            *
      *    *-----------------------------------------------------------*
       01  w-num-doc.
      *        *-------------------------------------------------------*
      *        * Work per ridefinizione                                *
      *        *-------------------------------------------------------*
           05  w-num-doc-num              pic  9(11)                  .
           05  w-num-doc-num-r redefines
               w-num-doc-num.
               10  w-num-doc-saa          pic  9(03)                  .
               10  w-num-doc-dpz          pic  9(02)                  .
               10  w-num-doc-prg          pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione stringa                        *
      *        *-------------------------------------------------------*
           05  w-num-doc-str              pic  x(07)                  .
           05  w-num-doc-pnt              pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per dati di intestazione documento              *
      *    *-----------------------------------------------------------*
       01  w-int-doc.
           05  w-int-doc-rag              pic  x(40)                  .
           05  w-int-doc-via              pic  x(40)                  .
           05  w-int-doc-loc              pic  x(40)                  .
           05  w-int-doc-d01.
               10  w-int-doc-cfi          pic  x(16)                  .
           05  w-int-doc-d02.
               10  w-int-doc-piv          pic  9(11)                  .
           05  w-int-doc-fax              pic  x(20)                  .
           05  w-int-doc-tel              pic  x(20)                  .

      *    *===========================================================*
      *    * Work-area per dati di inoltro documento                   *
      *    *-----------------------------------------------------------*
       01  w-inl-dcm.
           05  w-inl-dcm-rs1              pic  x(40)                  .
           05  w-inl-dcm-rs2              pic  x(40)                  .
           05  w-inl-dcm-via              pic  x(40)                  .
           05  w-inl-dcm-loc              pic  x(40)                  .
           05  w-inl-dcm-fax              pic  x(20)                  .
           05  w-inl-dcm-tel              pic  x(20)                  .

      *    *===========================================================*
      *    * Work per tabelle                                          *
      *    *-----------------------------------------------------------*
       01  w-tbl.
      *        *-------------------------------------------------------*
      *        * Tabella mesi                                          *
      *        *-------------------------------------------------------*
           05  w-tbl-mes.
               10  w-tbl-mes-001.
                   15  filler             pic  x(03) value "GEN"      .
                   15  filler             pic  x(03) value "FEB"      .
                   15  filler             pic  x(03) value "MAR"      .
                   15  filler             pic  x(03) value "APR"      .
                   15  filler             pic  x(03) value "MAG"      .
                   15  filler             pic  x(03) value "GIU"      .
                   15  filler             pic  x(03) value "LUG"      .
                   15  filler             pic  x(03) value "AGO"      .
                   15  filler             pic  x(03) value "SET"      .
                   15  filler             pic  x(03) value "OTT"      .
                   15  filler             pic  x(03) value "NOV"      .
                   15  filler             pic  x(03) value "DIC"      .
               10  w-tbl-mes-002 redefines
                   w-tbl-mes-001.
                   15  w-tbl-mes-des occurs 12
                                          pic  x(03)                  .

      *    *===========================================================*
      *    * Work per tipo riga                                        *
      *    *-----------------------------------------------------------*
       01  w-tip-rig.
           05  w-tip-rig-tpr              pic  x(01)                  .
           05  w-tip-rig-tfu              pic  x(01)                  .
           05  w-tip-rig-ast              pic  x(01)                  .

      *    *===========================================================*
      *    * Work-area per rottura casa Produttrice                    *
      *    *-----------------------------------------------------------*
       01  w-rot.
           05  w-rot-cod-pdt              pic  9(07)                  .

      *    *===========================================================*
      *    * Work per subroutines di Det                               *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Posizionamenti di stampa                              *
      *        *-------------------------------------------------------*
           05  w-det-pos-stp.
               10  w-det-pos-stp-coe      pic  9(02)v9(07)            .
      *        *-------------------------------------------------------*
      *        * Descrizione per spese in fattura e sconto in chiusura *
      *        * e sconto pagamento                                    *
      *        *-------------------------------------------------------*
           05  w-det-des-ysf.
               10  w-det-des-ysf-cod      pic  9(03)                  .
               10  w-det-des-ysf-lng      pic  x(03)                  .
               10  w-det-des-ysf-des      pic  x(40)                  .

      *    *===========================================================*
      *    * Work per routine int-pag-sta-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-int-pag-sta.
           05  w-int-pag-sta-ctr          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per routine box-int-pag-000/999                      *
      *    *-----------------------------------------------------------*
       01  w-box-int-pag.
      *        *-------------------------------------------------------*
      *        * Parametri in input                                    *
      *        *-------------------------------------------------------*
           05  w-box-int-pag-lin          pic  9(03)                  .
           05  w-box-int-pag-pin          pic  9(03)                  .
           05  w-box-int-pag-lfi          pic  9(03)                  .
           05  w-box-int-pag-pfi          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Campi di lavoro                                       *
      *        *-------------------------------------------------------*
           05  w-box-int-pag-wln          pic  9(03)                  .
           05  w-box-int-pag-wps          pic  9(03)                  .
           05  w-box-int-pag-wsz          pic  9(03)                  .
           05  w-box-int-pag-wtr.
               10  filler            occurs 132
                                          pic  x(01) value all "-"    .
           05  w-box-int-pag-wst.
               10  w-box-int-pag-wch occurs 132
                                          pic  x(01)                  .
           05  w-box-int-pag-ctr          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutines di Ctl                               *
      *    *-----------------------------------------------------------*
       01  w-ctl.
      *        *-------------------------------------------------------*
      *        * Work per Ctl su tipo riga                             *
      *        *-------------------------------------------------------*
           05  w-ctl-tip-rig.
               10  w-ctl-tip-rig-flg      pic  x(01)                  .
               10  w-ctl-tip-rig-tri      pic  x(05)                  .
               10  w-ctl-tip-rig-tri-r redefines
                   w-ctl-tip-rig-tri.
                   15  w-ctl-tip-rig-chr occurs 5
                                          pic  x(01)                  .
               10  w-ctl-tip-rig-cod      pic  9(03)                  .
               10  w-ctl-tip-rig-cod-r redefines
                   w-ctl-tip-rig-cod.
                   15  w-ctl-tip-rig-num occurs 3
                                          pic  x(01)                  .
               10  w-ctl-tip-rig-c01      pic  9(02)                  .
               10  w-ctl-tip-rig-c02      pic  9(02)                  .

      *    *===========================================================*
      *    * Work per Parametri per l'esecuzione di stampe speciali    *
      *    *-----------------------------------------------------------*
       01  w-prm.
      *        *-------------------------------------------------------*
      *        * Parametri passati dal chiamante (richieste)           *
      *        *-------------------------------------------------------*
           05  w-prm-pst-chm.
      *            *---------------------------------------------------*
      *            * Numero documento, saa.dd.nnnnnn                   *
      *            *---------------------------------------------------*
               10  w-prm-pst-chm-ndo      pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Tipo documento                                    *
      *            *---------------------------------------------------*
               10  w-prm-pst-chm-tdo      pic  x(05)                  .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione contatti         *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/dconarc0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione emissione sequenziale EDI - GEPC    *
      *    *                                                           *
      *    * ELETTRA                                                   *
      *    *-----------------------------------------------------------*
           copy      "ele/orf/prg/cpy/dseqedi0.dtl"                   .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Lettura della variabile di i.p.c. dello stesso  *
      *              * livello "inp-mst"                               *
      *              *-------------------------------------------------*
           perform   rea-inp-mst-000      thru rea-inp-mst-999        .
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo operazione      *
      *              *-------------------------------------------------*
           if        w-inp-mst-ope        =    "OP"
                     go to main-200
           else if   w-inp-mst-ope        =    "ST"
                     go to main-400
           else if   w-inp-mst-ope        =    "CL"
                     go to main-600
           else      go to main-999.
       main-200.
      *              *-------------------------------------------------*
      *              * Se funzione OP : Open                           *
      *              *-------------------------------------------------*
           perform   exe-fun-opn-000      thru exe-fun-opn-999        .
           go to     main-999.
       main-400.
      *              *-------------------------------------------------*
      *              * Se funzione ST : Stampa                         *
      *              *-------------------------------------------------*
           perform   exe-fun-stp-000      thru exe-fun-stp-999        .
           go to     main-999.
       main-600.
      *              *-------------------------------------------------*
      *              * Se funzione CL : Close                          *
      *              *-------------------------------------------------*
           perform   exe-fun-cls-000      thru exe-fun-cls-999        .
           go to     main-999.
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Lettura della variabile di i.p.c. dello stesso livello di *
      *    * nome "inp-mst" per parametri su funzione da eseguire      *
      *    *-----------------------------------------------------------*
       rea-inp-mst-000.
      *              *-------------------------------------------------*
      *              * Lettura della variabile                         *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "inp-mst"            to   s-var                  .
           move      "="                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Test su esito lettura                           *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     go to rea-inp-mst-600.
       rea-inp-mst-300.
      *              *-------------------------------------------------*
      *              * Se variabile non trovata o non corretta         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione area di ridefinizione della *
      *                  * variabile                                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-inp-mst              .
      *                  *---------------------------------------------*
      *                  * Cancellazione della variabile in uscita     *
      *                  *---------------------------------------------*
           perform   del-out-mst-000      thru del-out-mst-999        .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     rea-inp-mst-999.
       rea-inp-mst-600.
      *              *-------------------------------------------------*
      *              * Se variabile trovata                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su formato della variabile             *
      *                  *---------------------------------------------*
           if        s-tip                not  = "A"
                     go to rea-inp-mst-300.
           if        s-car                not  = 80
                     go to rea-inp-mst-300.
      *                  *---------------------------------------------*
      *                  * Se formato variabile corretto               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Spostamento del valore della variabile  *
      *                      * in area di ridefinizione                *
      *                      *-----------------------------------------*
           move      s-alf                to   w-inp-mst              .
       rea-inp-mst-999.
           exit.

      *    *===========================================================*
      *    * Cancellazione della variabile di i.p.c. dello stesso li-  *
      *    * vello di nome "out-mst"                                   *
      *    *-----------------------------------------------------------*
       del-out-mst-000.
      *              *-------------------------------------------------*
      *              * Cancellazione della variabile                   *
      *              *-------------------------------------------------*
           move      "CV"                 to   s-ope                  .
           move      "out-mst"            to   s-var                  .
           move      "="                  to   s-dop                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       del-out-mst-999.
           exit.

      *    *===========================================================*
      *    * Scrittura della variabile di i.p.c. dello stesso livello  *
      *    * di nome "out-mst"                                         *
      *    *-----------------------------------------------------------*
       wrt-out-mst-000.
      *              *-------------------------------------------------*
      *              * Scrittura della variabile                       *
      *              *-------------------------------------------------*
           move      "PV"                 to   s-ope                  .
           move      "out-mst"            to   s-var                  .
           move      "="                  to   s-dop                  .
           move      "A"                  to   s-tip                  .
           move      80                   to   s-car                  .
           move      w-out-mst            to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       wrt-out-mst-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione funzione OP : Open                             *
      *    *-----------------------------------------------------------*
       exe-fun-opn-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazioni relative alla stampa  *
      *              * ordine fornitore                                *
      *              *-------------------------------------------------*
           perform   prs-stp-orf-000      thru prs-stp-orf-999        .
      *              *-------------------------------------------------*
      *              * Lettura referenze relative alla stampa intesta- *
      *              * zione documento                                 *
      *              *-------------------------------------------------*
           perform   ref-stp-int-000      thru ref-stp-int-999        .
      *              *-------------------------------------------------*
      *              * Eventuale correzione del top margin in caso di  *
      *              * stampa su laser                                 *
      *              *-------------------------------------------------*
           if        w-prs-sof-snl        =    "S"
                     move  zero           to   w-dsp-top-mrg          .
      *              *-------------------------------------------------*
      *              * Eventuale correzione top e bottom margin in ca- *
      *              * so di stampa su PCL5                            *
      *              *-------------------------------------------------*
           if        w-prs-sof-snl        =    "P"
                     move  03             to   w-dsp-top-mrg
                     move  01             to   w-dsp-bot-mrg          .
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori passati dal chiamante    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo selezione stampante                    *
      *                  *---------------------------------------------*
           move      w-inp-mst-sel        to   w-ide-pgc-sel          .
      *                  *---------------------------------------------*
      *                  * Codice azienda                              *
      *                  *---------------------------------------------*
           move      w-inp-mst-azi        to   w-ide-pgc-azi          .
      *                  *---------------------------------------------*
      *                  * Codice terminale                            *
      *                  *---------------------------------------------*
           move      w-inp-mst-ter        to   w-ide-pgc-ter          .
      *                  *---------------------------------------------*
      *                  * Codice utente                               *
      *                  *---------------------------------------------*
           move      w-inp-mst-ute        to   w-ide-pgc-ute          .
      *                  *---------------------------------------------*
      *                  * Sigla sistema applicativo                   *
      *                  *---------------------------------------------*
           move      w-inp-mst-sap        to   w-ide-pgc-sap          .
      *                  *---------------------------------------------*
      *                  * Sigla area gestionale                       *
      *                  *---------------------------------------------*
           move      w-inp-mst-arg        to   w-ide-pgc-arg          .
      *                  *---------------------------------------------*
      *                  * Sigla settore gestionale                    *
      *                  *---------------------------------------------*
           move      w-inp-mst-set        to   w-ide-pgc-set          .
      *                  *---------------------------------------------*
      *                  * Sigla fase gestionale                       *
      *                  *---------------------------------------------*
           move      w-inp-mst-fas        to   w-ide-pgc-fas          .
      *                  *---------------------------------------------*
      *                  * Descrizione del programma                   *
      *                  *---------------------------------------------*
           move      w-inp-mst-dep        to   w-ide-pgc-dep          .
       exe-fun-opn-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione data e ora di sistema           *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-sdt                to   w-ide-pgc-sdt          .
       exe-fun-opn-400.
      *              *-------------------------------------------------*
      *              * Selezione della stampante                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione parametri per selezione della  *
      *                  * stampante specifici per il programma        *
      *                  *---------------------------------------------*
           perform   pre-prm-stp-000      thru pre-prm-stp-999        .
      *                  *---------------------------------------------*
      *                  * Selezione stampante                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Parametri per modulo "mpslct"           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Codice azienda                      *
      *                          *-------------------------------------*
           move      w-ide-pgc-azi        to   r-env-cod-azi          .
      *                          *-------------------------------------*
      *                          * Codice terminale                    *
      *                          *-------------------------------------*
           move      w-ide-pgc-ter        to   r-env-cod-ter          .
      *                          *-------------------------------------*
      *                          * Codice utente                       *
      *                          *-------------------------------------*
           move      w-ide-pgc-ute        to   r-env-cod-ute          .
      *                          *-------------------------------------*
      *                          * System date and time                *
      *                          *-------------------------------------*
           move      w-ide-pgc-sdt        to   r-env-dat-tim          .
      *                          *-------------------------------------*
      *                          * Sistema applicativo                 *
      *                          *-------------------------------------*
           move      w-ide-pgc-sap        to   r-ide-sis-app          .
      *                          *-------------------------------------*
      *                          * Area gestionale                     *
      *                          *-------------------------------------*
           move      w-ide-pgc-arg        to   r-ide-are-ges          .
      *                          *-------------------------------------*
      *                          * Settore gestionale                  *
      *                          *-------------------------------------*
           move      w-ide-pgc-set        to   r-ide-set-ges          .
      *                          *-------------------------------------*
      *                          * Fase gestionale                     *
      *                          *-------------------------------------*
           move      w-ide-pgc-fas        to   r-ide-fas-ges          .
      *                          *-------------------------------------*
      *                          * Flags di tipo selezione             *
      *                          *-------------------------------------*
           move      w-cnt-stp-tip-sel    to   r-fix-tip-sel          .
      *                          *-------------------------------------*
      *                          * Codice stampante                    *
      *                          *-------------------------------------*
           move      w-cnt-stp-cod-stp    to   r-fix-cod-stp          .
      *                          *-------------------------------------*
      *                          * Tipo di stampa                      *
      *                          *-------------------------------------*
           move      w-cnt-stp-tip-sta    to   r-fix-tip-sta          .
      *                          *-------------------------------------*
      *                          * Codice modulo                       *
      *                          *-------------------------------------*
           move      w-cnt-stp-cod-mod    to   r-fix-cod-mod          .
      *                          *-------------------------------------*
      *                          * Tipo modulo                         *
      *                          *-------------------------------------*
           move      w-cnt-stp-tip-mod    to   r-fix-tip-mod          .
      *                          *-------------------------------------*
      *                          * Ampiezza linea stampa in caratteri  *
      *                          *-------------------------------------*
           move      w-cnt-stp-amp-lin    to   r-fix-amp-lin          .
      *                          *-------------------------------------*
      *                          * Top margin in linee                 *
      *                          *-------------------------------------*
           move      w-cnt-stp-top-lin    to   r-fix-top-lin          .
      *                          *-------------------------------------*
      *                          * Numero linee di stampa minimo       *
      *                          *-------------------------------------*
           move      w-cnt-stp-lin-min    to   r-fix-lin-min          .
      *                          *-------------------------------------*
      *                          * Bottom margin in linee              *
      *                          *-------------------------------------*
           move      w-cnt-stp-bot-lin    to   r-fix-bot-lin          .
      *                          *-------------------------------------*
      *                          * Ampiezza caratteri                  *
      *                          *-------------------------------------*
           move      w-cnt-stp-amp-car    to   r-fix-amp-car          .
      *                          *-------------------------------------*
      *                          * Altezza interlinea                  *
      *                          *-------------------------------------*
           move      w-cnt-stp-alt-int    to   r-fix-alt-int          .
      *                          *-------------------------------------*
      *                          * Area riservata espansioni future    *
      *                          *-------------------------------------*
           move      w-cnt-stp-esp-fut    to   r-fix-esp-fut          .
      *                          *-------------------------------------*
      *                          * Area riservata funzioni speciali    *
      *                          *-------------------------------------*
           move      w-cnt-stp-fnz-spc    to   r-fix-fnz-spc          .
      *                      *-----------------------------------------*
      *                      * Richiamo modulo "mpslct"                *
      *                      *-----------------------------------------*
           call      "swd/mod/prg/obj/mpslct"
                                         using r                      .
           cancel    "swd/mod/prg/obj/mpslct"                         .
      *                  *---------------------------------------------*
      *                  * Test su esito selezione stampante           *
      *                  *---------------------------------------------*
           if        r-rsc                =    spaces
                     go to exe-fun-opn-600.
       exe-fun-opn-425.
      *                  *---------------------------------------------*
      *                  * Se selezione stampante non eseguita         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su tipo selezione stampante        *
      *                      *-----------------------------------------*
           if        w-ide-pgc-sel        =    "O"
                     go to exe-fun-opn-475.
       exe-fun-opn-450.
      *                          *-------------------------------------*
      *                          * Se tipo selezione stampante facol-  *
      *                          * tativo                              *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Apertura files necessari alla   *
      *                              * stampa                          *
      *                              *---------------------------------*
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
      *                              *---------------------------------*
      *                              * Flag di files aperti            *
      *                              *---------------------------------*
           move      "S"                  to   w-cnt-sts-flg-opn      .
      *                              *---------------------------------*
      *                              * Flag di selezione stampante non *
      *                              * effettuata                      *
      *                              *---------------------------------*
           move      spaces               to   w-cnt-sts-flg-sst      .
      *                              *---------------------------------*
      *                              * Flag di Begin non eseguito      *
      *                              *---------------------------------*
           move      spaces               to   w-cnt-sts-flg-bgn      .
      *                              *---------------------------------*
      *                              * Uscita con status a "N"         *
      *                              *---------------------------------*
           move      spaces               to   w-out-mst              .
           move      "N"                  to   w-out-mst-opn          .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     exe-fun-opn-999.
       exe-fun-opn-475.
      *                          *-------------------------------------*
      *                          * Se tipo selezione stampante obbli-  *
      *                          * gatorio                             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Flag di files non aperti        *
      *                              *---------------------------------*
           move      spaces               to   w-cnt-sts-flg-opn      .
      *                              *---------------------------------*
      *                              * Flag di selezione stampante non *
      *                              * effettuata                      *
      *                              *---------------------------------*
           move      spaces               to   w-cnt-sts-flg-sst      .
      *                              *---------------------------------*
      *                              * Flag di Begin non eseguito      *
      *                              *---------------------------------*
           move      spaces               to   w-cnt-sts-flg-bgn      .
      *                              *---------------------------------*
      *                              * Uscita con status a "X"         *
      *                              *---------------------------------*
           move      spaces               to   w-out-mst              .
           move      "X"                  to   w-out-mst-opn          .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     exe-fun-opn-999.
       exe-fun-opn-600.
      *                  *---------------------------------------------*
      *                  * Se selezione stampante eseguita             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura parametri di selezione stampa   *
      *                      * da segreteria                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Inizializzazione area parametri di  *
      *                          * stampa                              *
      *                          *-------------------------------------*
           move      spaces               to   p-sel                  .
      *                          *-------------------------------------*
      *                          * Inizializzazione numero progressivo *
      *                          * segmento                            *
      *                          *-------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       exe-fun-opn-650.
      *                          *-------------------------------------*
      *                          * Incremento numero progressivo seg-  *
      *                          * mento                               *
      *                          *-------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *                          *-------------------------------------*
      *                          * Richiamo del modulo di segreteria   *
      *                          * per l'estrazione del segmento di    *
      *                          * parametri stampa                    *
      *                          *-------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                          *-------------------------------------*
      *                          * Concatenazione del segmento in area *
      *                          * parametri di stampa selezionati     *
      *                          *-------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *                          *-------------------------------------*
      *                          * Riciclo su segmento successivo, a   *
      *                          * meno che non si sia sull'ultimo     *
      *                          *-------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to exe-fun-opn-650.
       exe-fun-opn-700.
      *                      *-----------------------------------------*
      *                      * Preparazioni per uscita                 *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Flag di selezione stampante effet-  *
      *                          * tuata                               *
      *                          *-------------------------------------*
           move      "S"                  to   w-cnt-sts-flg-sst      .
      *                          *-------------------------------------*
      *                          * Flag di Begin non eseguito          *
      *                          *-------------------------------------*
           move      spaces               to   w-cnt-sts-flg-bgn      .
      *                          *-------------------------------------*
      *                          * Apertura files necessari alla stam- *
      *                          * pa                                  *
      *                          *-------------------------------------*
           perform   rou-opn-fls-000      thru rou-opn-fls-999        .
      *                          *-------------------------------------*
      *                          * Flag di files aperti                *
      *                          *-------------------------------------*
           move      "S"                  to   w-cnt-sts-flg-opn      .
      *                          *-------------------------------------*
      *                          * Uscita con status a Spaces          *
      *                          *-------------------------------------*
           move      spaces               to   w-out-mst              .
           move      spaces               to   w-out-mst-opn          .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     exe-fun-opn-999.
       exe-fun-opn-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione funzione ST : Stampa                           *
      *    *-----------------------------------------------------------*
       exe-fun-stp-000.
      *              *-------------------------------------------------*
      *              * Se files non aperti : uscita                    *
      *              *-------------------------------------------------*
           if        w-cnt-sts-flg-opn    not  = "S"
                     go to exe-fun-stp-999.
      *              *-------------------------------------------------*
      *              * Se selezione stampante non effettuata : uscita  *
      *              *-------------------------------------------------*
           if        w-cnt-sts-flg-sst    not  = "S"
                     go to exe-fun-stp-999.
      *              *-------------------------------------------------*
      *              * Se Begin non eseguito                           *
      *              *-------------------------------------------------*
           if        w-cnt-sts-flg-bgn    =    "S"
                     go to exe-fun-stp-500.
      *                  *---------------------------------------------*
      *                  * Esecuzione Begin                            *
      *                  *---------------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Flag di Begin eseguito                      *
      *                  *---------------------------------------------*
           move      "S"                  to   w-cnt-sts-flg-bgn      .
       exe-fun-stp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Esecuzione routine di stampa                    *
      *              *-------------------------------------------------*
           perform   rou-stp-doc-000      thru rou-stp-doc-999        .
       exe-fun-stp-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione funzione CL : Close                            *
      *    *-----------------------------------------------------------*
       exe-fun-cls-000.
      *              *-------------------------------------------------*
      *              * Se files aperti                                 *
      *              *-------------------------------------------------*
           if        w-cnt-sts-flg-opn    not  = "S"
                     go to exe-fun-cls-100.
      *                  *---------------------------------------------*
      *                  * Chiusura files necessari alla stampa        *
      *                  *---------------------------------------------*
           perform   rou-cls-fls-000      thru rou-cls-fls-999        .
       exe-fun-cls-100.
      *              *-------------------------------------------------*
      *              * Se selezione stampante effettuata               *
      *              *-------------------------------------------------*
           if        w-cnt-sts-flg-sst    not  = "S"
                     go to exe-fun-cls-900.
      *                  *---------------------------------------------*
      *                  * Esecuzione End                              *
      *                  *---------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo stampa    "mprint"     *
      *                  *---------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       exe-fun-cls-900.
      *              *-------------------------------------------------*
      *              * Flag di files non aperti                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-flg-opn      .
      *              *-------------------------------------------------*
      *              * Flag di selezione stampante non effettuata      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-flg-sst      .
      *              *-------------------------------------------------*
      *              * Flag di Begin non eseguito                      *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-sts-flg-bgn      .
       exe-fun-cls-999.
           exit.

      *    *===========================================================*
      *    * Preparazione parametri per selezione stampante            *
      *    *-----------------------------------------------------------*
       pre-prm-stp-000.
      *              *-------------------------------------------------*
      *              * Flags di tipo selezione                         *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-tip-sel      .
      *              *-------------------------------------------------*
      *              * Codice stampante                                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-cod-stp      .
      *              *-------------------------------------------------*
      *              * Tipo di stampa                                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-tip-sta      .
      *              *-------------------------------------------------*
      *              * Codice modulo                                   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-cod-mod      .
      *              *-------------------------------------------------*
      *              * Tipo modulo                                     *
      *              *   - L : Libero                                  *
      *              *-------------------------------------------------*
           move      "L"                  to   w-cnt-stp-tip-mod      .
      *              *-------------------------------------------------*
      *              * Ampiezza linea di stampa in caratteri           *
      *              *                                                 *
      *              * Se personalizzazione relativa al tipo modulo    *
      *              * per stampa ordine a fornitore  :                *
      *              *   01 - ampiezza linea  96 caratteri             *
      *              *   51 - ampiezza linea 120 caratteri             *
      *              *-------------------------------------------------*
           if        w-prs-sof-tmd        =    01
                     move  096            to   w-cnt-stp-amp-lin
           else      move  120            to   w-cnt-stp-amp-lin      .
      *              *-------------------------------------------------*
      *              * Top margin in linee                             *
      *              *-------------------------------------------------*
           move      w-dsp-top-mrg        to   w-cnt-stp-top-lin      .
      *              *-------------------------------------------------*
      *              * Numero linee di stampa minimo                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stp-lin-min      .
      *              *-------------------------------------------------*
      *              * Bottom margin in linee                          *
      *              *-------------------------------------------------*
           move      w-dsp-bot-mrg        to   w-cnt-stp-bot-lin      .
      *              *-------------------------------------------------*
      *              * Ampiezza caratteri                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stp-amp-car      .
      *              *-------------------------------------------------*
      *              * Altezza interlinea                              *
      *              *-------------------------------------------------*
           move      06                   to   w-cnt-stp-alt-int      .
      *              *-------------------------------------------------*
      *              * Area riservata per espansioni future            *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-esp-fut      .
      *                  *---------------------------------------------*
      *                  * Flag destinato al controllo del Tipo Stampa *
      *                  * per inibire la possibilita' della stampa a  *
      *                  * Video                                       *
      *                  *---------------------------------------------*
           move      "#"                  to   w-cnt-stp-esp-fut
                                              (98 : 1)                .
      *                  *---------------------------------------------*
      *                  * Flag destinato al controllo del Top Margin  *
      *                  *---------------------------------------------*
           move      "*"                  to   w-cnt-stp-esp-fut
                                              (99 : 1)                .
      *              *-------------------------------------------------*
      *              * Area riservata per espansioni speciali          *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-stp-fnz-spc      .
       pre-prm-stp-999.
           exit.

      *    *===========================================================*
      *    * Lettura personalizzazione : Stampa ordine fornitore       *
      *    *-----------------------------------------------------------*
       prs-stp-orf-000.
      *              *-------------------------------------------------*
      *              * Lettura personalizzazione                       *
      *              *-------------------------------------------------*
           move      "P:"                 to   s-ope                  .
           move      "pgm/orf/mov/orf300s[stp-orf]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Se personalizzazione non esistente              *
      *              *-------------------------------------------------*
           if        s-ves                =    spaces
                     go to prs-stp-orf-050.
      *                  *---------------------------------------------*
      *                  * Normalizzazione al valore di default        *
      *                  *---------------------------------------------*
           move      01                   to   w-prs-sof-tmd          .
           move      "L"                  to   w-prs-sof-tst          .
           move      "P"                  to   w-prs-sof-tin          .
           move      "S"                  to   w-prs-sof-snv (1)      .
           move      "S"                  to   w-prs-sof-snv (2)      .
           move      "S"                  to   w-prs-sof-snv (3)      .
           move      "S"                  to   w-prs-sof-snv (4)      .
           move      "S"                  to   w-prs-sof-snv (5)      .
           move      "S"                  to   w-prs-sof-snv (6)      .
           move      "N"                  to   w-prs-sof-cod          .
           move      "N"                  to   w-prs-sof-rac          .
           move      "N"                  to   w-prs-sof-snf          .
           move      "N"                  to   w-prs-sof-snq          .
           move      "N"                  to   w-prs-sof-snl          .
           move      "N"                  to   w-prs-sof-snr          .
           move      "N"                  to   w-prs-sof-snp          .
           move      "S"                  to   w-prs-sof-sns (1)      .
           move      "S"                  to   w-prs-sof-sns (2)      .
           move      "S"                  to   w-prs-sof-sns (3)      .
           move      "S"                  to   w-prs-sof-sns (4)      .
           move      "S"                  to   w-prs-sof-sns (5)      .
           move      "S"                  to   w-prs-sof-sns (6)      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prs-stp-orf-999.
       prs-stp-orf-050.
      *              *-------------------------------------------------*
      *              * Valore letto in work personalizzazioni          *
      *              *-------------------------------------------------*
           move      s-alf                to   w-prs-sof-str          .
      *              *-------------------------------------------------*
      *              * Controllo valori letti                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo modulo                                 *
      *                  *---------------------------------------------*
           if        w-prs-sof-tmd        not  numeric
                     move  01             to   w-prs-sof-tmd
                     go to prs-stp-orf-100.
           if        w-prs-sof-tmd        not  = 01 and
                     w-prs-sof-tmd        not  = 51
                     move  01             to   w-prs-sof-tmd          .
       prs-stp-orf-100.
      *                  *---------------------------------------------*
      *                  * Tipo stampato                               *
      *                  *---------------------------------------------*
           if        w-prs-sof-tst        not  = "T" and
                     w-prs-sof-tst        not  = "L"
                     move  "L"            to   w-prs-sof-tst          .
      *                  *---------------------------------------------*
      *                  * Tipo intestazione stampato                  *
      *                  *---------------------------------------------*
           if        w-prs-sof-tin        not  = "N" and
                     w-prs-sof-tin        not  = "R" and
                     w-prs-sof-tin        not  = "P" and
                     w-prs-sof-tin        not  = "F"
                     move  "P"            to   w-prs-sof-tin          .
           if        w-prs-sof-tin        =    "F"
                     go to prs-stp-orf-105.
           if        w-prs-sof-tst        =    "T"
                     move  "N"            to   w-prs-sof-tin          .
       prs-stp-orf-105.
      *                  *---------------------------------------------*
      *                  * Si/no stampa voci descrittive               *
      *                  *---------------------------------------------*
           move      zero                 to   w-prs-sof-ctr          .
       prs-stp-orf-110.
           add       1                    to   w-prs-sof-ctr          .
           if        w-prs-sof-ctr        >    6
                     go to prs-stp-orf-200.
           if        w-prs-sof-snv
                    (w-prs-sof-ctr)       not  = "S" and
                     w-prs-sof-snv
                    (w-prs-sof-ctr)       not  = "N"
                     move  "N"            to   w-prs-sof-snv
                                              (w-prs-sof-ctr)         .
           go to     prs-stp-orf-110.
       prs-stp-orf-200.
      *                  *---------------------------------------------*
      *                  * Cosa stampare in colonna codice             *
      *                  *---------------------------------------------*
           if        w-prs-sof-tmd        not  = 51
                     move  "N"            to   w-prs-sof-cod
                     go to prs-stp-orf-300.
           if        w-prs-sof-cod        not  = "N" and
                     w-prs-sof-cod        not  = "F" and
                     w-prs-sof-cod        not  = "P" and
                     w-prs-sof-cod        not  = "M"
                     move  "N"            to   w-prs-sof-cod          .
       prs-stp-orf-300.
      *                  *---------------------------------------------*
      *                  * Righe aggiuntive per codice prodotto        *
      *                  *---------------------------------------------*
           if        w-prs-sof-rac        not  = "N" and
                     w-prs-sof-rac        not  = "F" and
                     w-prs-sof-rac        not  = "M" and
                     w-prs-sof-rac        not  = "P" and
                     w-prs-sof-rac        not  = "E" and
                     w-prs-sof-rac        not  = "U"
                     move  "N"            to   w-prs-sof-rac          .
       prs-stp-orf-400.
      *                  *---------------------------------------------*
      *                  * Si/No stampa del numero fax                 *
      *                  *---------------------------------------------*
           if        w-prs-sof-snf        not  = "S" and
                     w-prs-sof-snf        not  = "N" and
                     w-prs-sof-snf        not  = "T"
                     move  "N"            to   w-prs-sof-snf          .
       prs-stp-orf-500.
      *                  *---------------------------------------------*
      *                  * Si/No stampa quantita' editata a destra     *
      *                  *---------------------------------------------*
           if        w-prs-sof-snq        not  = "S" and
                     w-prs-sof-snq        not  = "N"
                     move  "N"            to   w-prs-sof-snq          .
       prs-stp-orf-600.
      *                  *---------------------------------------------*
      *                  * Si/No stampa in laser o PCL5                *
      *                  *---------------------------------------------*
           if        w-prs-sof-snl        not  = "S" and
                     w-prs-sof-snl        not  = "N" and
                     w-prs-sof-snl        not  = "P"
                     move  "N"            to   w-prs-sof-snl          .
       prs-stp-orf-620.
      *                  *---------------------------------------------*
      *                  * Si/No stampa responsabile ordine            *
      *                  *---------------------------------------------*
           if        w-prs-sof-snr        not  = "S" and
                     w-prs-sof-snr        not  = "N"
                     move  "N"            to   w-prs-sof-snr          .
       prs-stp-orf-640.
      *                  *---------------------------------------------*
      *                  * Si/No stampa casa produttrice a rottura su  *
      *                  * articoli                                    *
      *                  *---------------------------------------------*
           if        w-prs-sof-snp        not  = "S" and
                     w-prs-sof-snp        not  = "N"
                     move  "N"            to   w-prs-sof-snp          .
       prs-stp-orf-700.
      *                  *---------------------------------------------*
      *                  * Si/no stampa spese in fattura               *
      *                  *---------------------------------------------*
           move      zero                 to   w-prs-sof-ctr          .
       prs-stp-orf-720.
           add       1                    to   w-prs-sof-ctr          .
           if        w-prs-sof-ctr        >    6
                     go to prs-stp-orf-800.
           if        w-prs-sof-sns
                    (w-prs-sof-ctr)       not  = "S" and
                     w-prs-sof-sns
                    (w-prs-sof-ctr)       not  = "N"
                     move  "S"            to   w-prs-sof-sns
                                              (w-prs-sof-ctr)         .
           go to     prs-stp-orf-720.
       prs-stp-orf-800.
       prs-stp-orf-999.
           exit.

      *    *===========================================================*
      *    * Lettura delle referenze relative alle righe descrizione   *
      *    * per intestazione documento                                *
      *    *-----------------------------------------------------------*
       ref-stp-int-000.
      *              *-------------------------------------------------*
      *              * Test se lettura necessaria                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo stampato personalizzato        *
      *                  *---------------------------------------------*
           if        w-prs-sof-tst        not  = "L"
                     go to ref-stp-int-999.
      *                  *---------------------------------------------*
      *                  * Test su tipo intestazione personalizzata    *
      *                  *---------------------------------------------*
           if        w-prs-sof-tin        not  = "R"
                     go to ref-stp-int-999.
      *              *-------------------------------------------------*
      *              * Ciclo per 6 referenze                           *
      *              *-------------------------------------------------*
           move      zero                 to   w-ref-stp-int-ctr      .
       ref-stp-int-500.
           add       1                    to   w-ref-stp-int-ctr      .
           if        w-ref-stp-int-ctr    >    8
                     go to ref-stp-int-999.
      *                  *---------------------------------------------*
      *                  * Lettura referenza multipla                  *
      *                  *---------------------------------------------*
           move      "R:"                 to   s-ope                  .
           move      w-ref-stp-int-ctr    to   s-num                  .
           move      "pgm/orf/mov/orf300s[int-orf]"
                                          to   s-alf                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                  *---------------------------------------------*
      *                  * Test su esito operazione                    *
      *                  *---------------------------------------------*
           if        s-ves                =    spaces
                     move  s-alf          to   w-ref-stp-int-des
                                              (w-ref-stp-int-ctr)
           else      move  spaces         to   w-ref-stp-int-des
                                              (w-ref-stp-int-ctr)     .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     ref-stp-int-500.
       ref-stp-int-999.
           exit.

      *    *===========================================================*
      *    * Open files necessari alla stampa                          *
      *    *-----------------------------------------------------------*
       rou-opn-fls-000.
      *              *-------------------------------------------------*
      *              * Eventuale correzione ampiezza linea di stampa   *
      *              * in base all'ampiezza caratteri selezionata      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se l'ampiezza caratteri selezionata e' a    *
      *                  * zero, vuol dire che e' stata selezionata    *
      *                  * una stampante PostScript o HP-GL, quindi    *
      *                  * non si effettuano correzioni                *
      *                  *---------------------------------------------*
           if        p-sel-amc-sel        =    zero
                     go to rou-opn-fls-200.
      *                  *---------------------------------------------*
      *                  * Se l'ampiezza caratteri selezionata e'      *
      *                  * quella prestabilita a seconda del tipo mo-  *
      *                  * dulo, non si effettuano correzioni          *
      *                  *---------------------------------------------*
           if       (w-prs-sof-tmd        =    01    and
                     p-sel-amc-sel        =    12,00   ) or
                    (w-prs-sof-tmd        =    51    and
                     p-sel-amc-sel        =    15,00   )
                     go to rou-opn-fls-200.
       rou-opn-fls-100.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo modulo perso- *
      *                  * nalizzato                                   *
      *                  *---------------------------------------------*
           if        w-prs-sof-tmd        =    01
                     go to rou-opn-fls-110
           else if   w-prs-sof-tmd        =    51
                     go to rou-opn-fls-120
           else      go to rou-opn-fls-200.
       rou-opn-fls-110.
      *                  *---------------------------------------------*
      *                  * Tipo modulo : 01 - Senza codice prodotto    *
      *                  *---------------------------------------------*
           multiply  p-sel-als-sel        by   p-sel-amc-sel
                                        giving w-rou-opn-fls-wac      .
           divide    12,00                into w-rou-opn-fls-wac
                                     remainder w-rou-opn-fls-wre      .
           if        w-rou-opn-fls-wre    >    zero
                     add  1               to   w-rou-opn-fls-wac      .
           go to     rou-opn-fls-150.
       rou-opn-fls-120.
      *                  *---------------------------------------------*
      *                  * Tipo modulo : 51 - Con codice prodotto      *
      *                  *---------------------------------------------*
           multiply  p-sel-als-sel        by   p-sel-amc-sel
                                        giving w-rou-opn-fls-wac      .
           divide    15,00                into w-rou-opn-fls-wac
                                     remainder w-rou-opn-fls-wre      .
           if        w-rou-opn-fls-wre    >    zero
                     add  1               to   w-rou-opn-fls-wac      .
           go to     rou-opn-fls-150.
       rou-opn-fls-150.
      *                  *---------------------------------------------*
      *                  * Correzione ampiezza linea selezionata       *
      *                  *---------------------------------------------*
           move      w-rou-opn-fls-wac    to   p-sel-als-sel          .
       rou-opn-fls-200.
      *              *-------------------------------------------------*
      *              * Determinazione posizionamenti stampa            *
      *              *-------------------------------------------------*
           perform   det-pos-stp-000      thru det-pos-stp-999        .
      *              *-------------------------------------------------*
      *              * Apertura files area 'orf'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [oft]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *                  *---------------------------------------------*
      *                  * [ofr]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * [ofx]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofx                 .
      *                  *---------------------------------------------*
      *                  * [yof]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofyof"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yof                 .
      *                  *---------------------------------------------*
      *                  * [yca]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofyca"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yca                 .
      *                  *---------------------------------------------*
      *                  * [yro]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofyro"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yro                 .
      *              *-------------------------------------------------*
      *              * Apertura files area 'dcf'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [dcf]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                  *---------------------------------------------*
      *                  * [yfp]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
      *                  *---------------------------------------------*
      *                  * [yfx]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyfx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfx                 .
      *                  *---------------------------------------------*
      *                  * [ydf]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofydf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ydf                 .
      *                  *---------------------------------------------*
      *                  * [yvf]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyvf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yvf                 .
      *                  *---------------------------------------------*
      *                  * [ysf]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofysf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ysf                 .
      *                  *---------------------------------------------*
      *                  * [aaq]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                  *---------------------------------------------*
      *                  * [pdt]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofpdt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdt                 .
      *              *-------------------------------------------------*
      *              * Apertura files area 'dcp'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [dcp]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * [pdx]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *              *-------------------------------------------------*
      *              * Apertura files area 'cge'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [fnt]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * Apertura files area 'abi'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [axs]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
      *                  *---------------------------------------------*
      *                  * [axi]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
      *              *-------------------------------------------------*
      *              * Apertura files area 'gep'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [cbp]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofcbp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cbp                 .
      *              *-------------------------------------------------*
      *              * Apertura files area 'azi'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [ada]                                       *
      *                  *---------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                  *---------------------------------------------*
      *                  * Open modulo di determinazione contatti      *
      *                  *---------------------------------------------*
           move      "OP"                 to   d-con-arc-tip-ope      .
           move      "pgm/azi/prg/obj/dconarc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-con-arc              .
       rou-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files necessari alla stampa                         *
      *    *-----------------------------------------------------------*
       rou-cls-fls-000.
      *              *-------------------------------------------------*
      *              * Chiusura files area 'bol'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [oft]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
      *                  *---------------------------------------------*
      *                  * [ofr]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * [ofx]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofx                 .
      *                  *---------------------------------------------*
      *                  * [yof]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofyof"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yof                 .
      *                  *---------------------------------------------*
      *                  * [yca]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofyca"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yca                 .
      *                  *---------------------------------------------*
      *                  * [yro]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofyro"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yro                 .
      *              *-------------------------------------------------*
      *              * Chiusura files area 'dcf'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [dcf]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                  *---------------------------------------------*
      *                  * [yfp]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyfp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfp                 .
      *                  *---------------------------------------------*
      *                  * [yfx]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyfx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yfx                 .
      *                  *---------------------------------------------*
      *                  * [ydf]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofydf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ydf                 .
      *                  *---------------------------------------------*
      *                  * [yvf]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyvf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yvf                 .
      *                  *---------------------------------------------*
      *                  * [ysf]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofysf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ysf                 .
      *                  *---------------------------------------------*
      *                  * [aaq]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                  *---------------------------------------------*
      *                  * [pdt]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofpdt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdt                 .
      *              *-------------------------------------------------*
      *              * Chiusura files area 'dcp'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [dcp]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * [pdx]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *              *-------------------------------------------------*
      *              * Chiusura files area 'cge'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [fnt]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * Chiusura files area 'abi'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [axs]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
      *                  *---------------------------------------------*
      *                  * [axi]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
      *              *-------------------------------------------------*
      *              * Chiusura files area 'gep'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [cbp]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/gep/fls/ioc/obj/iofcbp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cbp                 .
      *              *-------------------------------------------------*
      *              * Chiusura files area 'azi'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * [ada]                                       *
      *                  *---------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione contatti         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura modulo                             *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-con-arc-tip-ope      .
           move      "pgm/azi/prg/obj/dconarc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-con-arc              .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-con-arc-tip-ope      .
           move      "pgm/azi/prg/obj/dconarc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-con-arc              .
           if        d-con-arc-exi-sts    not  = spaces
                     go to rou-cls-fls-900.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "pgm/azi/prg/obj/dconarc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           cancel    s-pat                                            .
       rou-cls-fls-900.
      *              *-------------------------------------------------*
      *              * Chiusura archivio per EDI                       *
      *              *                                                 *
      *              * ELETTRA                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura modulo                             *
      *                  *---------------------------------------------*
           move      "CL"                 to   d-seq-edi-tip-ope      .
           move      "ele/orf/prg/obj/dseqedi0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-seq-edi
                                               rf-oft
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * Test se cancellabile                        *
      *                  *---------------------------------------------*
           move      "C?"                 to   d-seq-edi-tip-ope      .
           move      "ele/orf/prg/obj/dseqedi0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-seq-edi
                                               rf-oft
                                               rf-ofr                 .
           if        d-seq-edi-exi-sts    not  = spaces
                     go to rou-cls-fls-999.
      *                  *---------------------------------------------*
      *                  * Cancellazione modulo                        *
      *                  *---------------------------------------------*
           move      "ele/orf/prg/obj/dseqedi0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-seq-edi
                                               rf-oft
                                               rf-ofr                 .
       rou-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Stampa documento                                          *
      *    *-----------------------------------------------------------*
       rou-stp-doc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Normalizzazione numero pagina                   *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-npr-num-pag      .
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Lettura record testata da stampare              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-inp-mst-prt        to   rf-oft-num-prt         .
           move      "pgm/orf/fls/ioc/obj/iofoft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-oft                 .
           if        f-sts                =    e-not-err
                     go to rou-stp-doc-100.
      *                  *---------------------------------------------*
      *                  * Se record non trovato uscita con status al  *
      *                  * valore "N"                                  *
      *                  *---------------------------------------------*
           move      spaces               to   w-out-mst              .
           move      "N"                  to   w-out-mst-stp          .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     rou-stp-doc-999.
       rou-stp-doc-100.
      *              *-------------------------------------------------*
      *              * Preparazione parametri per il driver di stampa  *
      *              *-------------------------------------------------*
           move      rf-oft-num-doc       to   w-prm-pst-chm-ndo      .
           move      rf-oft-tmo-orf       to   w-prm-pst-chm-tdo      .
           move      w-prm-pst-chm        to   p-sel-spc-sel          .
      *              *-------------------------------------------------*
      *              * Incremento numero pagina                        *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-npr-num-pag      .
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  rou-stp-doc-999.
       rou-stp-doc-200.
      *              *-------------------------------------------------*
      *              * Preparazione preliminare dei literal per la     *
      *              * stampa dei box                                  *
      *              *-------------------------------------------------*
           perform   rou-stp-doc-lsb-000  thru rou-stp-doc-lsb-999    .
       rou-stp-doc-240.
      *              *-------------------------------------------------*
      *              * Apertura archivio per EDI                       *
      *              *                                                 *
      *              * ELETTRA                                         *
      *              *-------------------------------------------------*
           move      "OP"                 to   d-seq-edi-tip-ope      .
           move      "ele/orf/prg/obj/dseqedi0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-seq-edi
                                               rf-oft
                                               rf-ofr                 .
       rou-stp-doc-260.
      *              *-------------------------------------------------*
      *              * Eventuale stampa intestazione pagina            *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Tentativo di lettura record [ofx] di appoggio   *
      *              * ai valori di testata                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [ofx]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofx                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [ofx]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      rf-oft-num-prt       to   rf-ofx-num-prt         .
           move      zero                 to   rf-ofx-num-prg         .
           move      01                   to   rf-ofx-tip-rec         .
           move      "pgm/orf/fls/ioc/obj/iofofx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofx                 .
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valori di estensione al re- *
      *                  * cord di testata                             *
      *                  *---------------------------------------------*
           move      rf-ofx-rag-ids       to   w-ext-rag-ids          .
           move      rf-ofx-via-ids       to   w-ext-via-ids          .
           move      rf-ofx-loc-ids       to   w-ext-loc-ids          .
           move      rf-ofx-des-cda       to   w-ext-des-cda          .
      *              *-------------------------------------------------*
      *              * Stampa testata documento                        *
      *              *-------------------------------------------------*
           perform   stp-tes-doc-000      thru stp-tes-doc-999        .
      *                  *---------------------------------------------*
      *                  * Test su status di uscita                    *
      *                  *---------------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to rou-stp-doc-300.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     rou-stp-doc-999.
       rou-stp-doc-300.
      *              *-------------------------------------------------*
      *              * Stampa corpo documento                          *
      *              *-------------------------------------------------*
           perform   stp-cor-doc-000      thru stp-cor-doc-999        .
      *                  *---------------------------------------------*
      *                  * Test su status di uscita                    *
      *                  *---------------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to rou-stp-doc-400.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     rou-stp-doc-999.
       rou-stp-doc-400.
      *              *-------------------------------------------------*
      *              * Stampa piede documento                          *
      *              *-------------------------------------------------*
           perform   stp-pie-doc-000      thru stp-pie-doc-999        .
      *                  *---------------------------------------------*
      *                  * Test su status di uscita                    *
      *                  *---------------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to rou-stp-doc-800.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     rou-stp-doc-999.
       rou-stp-doc-800.
      *              *-------------------------------------------------*
      *              * Page eject                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da eseguire                         *
      *                  *---------------------------------------------*
           if        w-inp-mst-ejc        =    "N"
                     go to rou-stp-doc-850.
      *                  *---------------------------------------------*
      *                  * Esecuzione                                  *
      *                  *---------------------------------------------*
           move      "EJ"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       rou-stp-doc-850.
      *              *-------------------------------------------------*
      *              * Chiusura del file in output                     *
      *              *                                                 *
      *              * ELETTRA                                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da eseguire                         *
      *                  * ___                                         *
      *                  *---------------------------------------------*
           if        rf-oft-cod-arc       not  = 0000001
                     go to rou-stp-doc-900.
       rou-stp-doc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     rou-stp-doc-999.
       rou-stp-doc-999.
           exit.

      *    *===========================================================*
      *    * Stampa documento                                          *
      *    *                                                           *
      *    * Subroutine di preparazione literal per la stampa dei box  *
      *    *-----------------------------------------------------------*
       rou-stp-doc-lsb-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione preliminare                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-cof-tbl          .
      *              *-------------------------------------------------*
      *              * Se il tipo stampato non e' libero : uscita      *
      *              *-------------------------------------------------*
           if        w-prs-sof-tst        not  = "L" and
                     w-prs-sof-tin        not  = "F"
                     go to rou-stp-doc-lsb-900.
       rou-stp-doc-lsb-100.
      *              *-------------------------------------------------*
      *              * Ciclo di caricamento                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione contatore                   *
      *                  *---------------------------------------------*
           move      zero                 to   w-pmt-cof-ctr          .
       rou-stp-doc-lsb-200.
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-pmt-cof-ctr          .
           if        w-pmt-cof-ctr        >    w-pmt-cof-max
                     go to rou-stp-doc-lsb-900.
      *                  *---------------------------------------------*
      *                  * Lettura file [yvf] per eventuale nome in    *
      *                  * lingua                                      *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODVDF    "         to   f-key                  .
           move      w-pmt-cof-cod
                    (w-pmt-cof-ctr)       to   rf-yvf-num-def         .
           move      spaces               to   rf-yvf-cod-def         .
           move      rf-oft-cod-lng       to   rf-yvf-cod-lng         .
           move      "pgm/dcf/fls/ioc/obj/iofyvf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yvf                 .
      *                      *-----------------------------------------*
      *                      * Test su esito lettura                   *
      *                      *-----------------------------------------*
           if        f-sts                =    e-not-err
                     go to rou-stp-doc-lsb-400.
       rou-stp-doc-lsb-300.
      *                      *-----------------------------------------*
      *                      * Se record [yvf] non trovato             *
      *                      *-----------------------------------------*
           move      w-pmt-cof-des
                    (w-pmt-cof-ctr)       to   w-stp-cof-des
                                              (w-pmt-cof-ctr)         .
      *                          *-------------------------------------*
      *                          * A riciclo                           *
      *                          *-------------------------------------*
           go to     rou-stp-doc-lsb-600.
       rou-stp-doc-lsb-400.
      *                      *-----------------------------------------*
      *                      * Se record [yvf] trovato                 *
      *                      *-----------------------------------------*
           move      rf-yvf-des-stp       to   w-stp-cof-des
                                              (w-pmt-cof-ctr)         .
      *                          *-------------------------------------*
      *                          * A riciclo                           *
      *                          *-------------------------------------*
           go to     rou-stp-doc-lsb-600.
       rou-stp-doc-lsb-600.
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     rou-stp-doc-lsb-200.
       rou-stp-doc-lsb-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     rou-stp-doc-lsb-999.
       rou-stp-doc-lsb-999.
           exit.

      *    *===========================================================*
      *    * Routine di stampa testata documento                       *
      *    *-----------------------------------------------------------*
       stp-tes-doc-000.
      *              *-------------------------------------------------*
      *              * Scrittura testata archivio per EDI              *
      *              *                                                 *
      *              * ELETTRA                                         *
      *              *-------------------------------------------------*
           move      "WT"                 to   d-seq-edi-tip-ope      .
           move      "ele/orf/prg/obj/dseqedi0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-seq-edi
                                               rf-oft
                                               rf-ofr                 .
       stp-tes-doc-010.
      *              *-------------------------------------------------*
      *              * Tipo documento                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura record [yof]                        *
      *                  *                                             *
      *                  * N.B.: La lettura deve comunque essere fatta *
      *                  *       in quanto il record [yof] contiene    *
      *                  *       alcuni indicatori di 'si/no' stampa   *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODTOF    "         to   f-key                  .
           move      rf-oft-tmo-orf       to   rf-yof-cod-tof         .
           move      "pgm/orf/fls/ioc/obj/iofyof"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yof                 .
      *                  *---------------------------------------------*
      *                  * Test su esito lettura                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     move  spaces         to   rf-yof-des-stp         .
      *                  *---------------------------------------------*
      *                  * Test su codice lingua                       *
      *                  *---------------------------------------------*
           if        rf-oft-cod-lng       =    "I  "
                     go to stp-tes-doc-040.
      *                  *---------------------------------------------*
      *                  * Eventuale dicitura in lingua straniera      *
      *                  *---------------------------------------------*
           if        w-stp-cof-des (01)   not  = spaces
                     move  w-stp-cof-des (01)
                                          to   rf-yof-des-stp         .
       stp-tes-doc-040.
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se posizionamento esistente        *
      *                      *-----------------------------------------*
           if        w-lpt-tmo-orf-lin    =   zero or
                     w-lpt-tmo-orf-pos    =   zero
                     go to stp-tes-doc-050.
      *                      *-----------------------------------------*
      *                      * Nel caso di documento in lingua, si     *
      *                      * sostituisce la descrizione timo movi-   *
      *                      * mento per la stampa con quello in lin-  *
      *                      * gua                                     *
      *                      *-----------------------------------------*
           if        rf-oft-cod-lng       not  = "I  " and
                     w-stp-cof-des (01)   not  = spaces
                     move  w-stp-cof-des (01)
                                          to   rf-yof-des-stp         .
      *                      *-----------------------------------------*
      *                      * Determinazione lunghezza stringa        *
      *                      *-----------------------------------------*
           move      zero                 to   w-stp-tes-ctr          .
           inspect   rf-yof-des-stp   tallying w-stp-tes-ctr
                                  for trailing spaces                 .
           subtract  w-stp-tes-ctr        from 25
                                        giving w-stp-tes-wsz          .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-stp-tes-wsz        to   p-car                  .
           move      w-lpt-tmo-orf-lin    to   p-lin                  .
           divide    2                    into w-stp-tes-ctr
                                        giving p-pos                  .
           add       w-lpt-tmo-orf-pos    to   p-pos                  .
           move      rf-yof-des-stp       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tes-doc-050.
      *              *-------------------------------------------------*
      *              * Numero documento                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se posizionamento esistente            *
      *                  *---------------------------------------------*
           if        w-lpt-num-doc-lin    =   zero or
                     w-lpt-num-doc-pos    =   zero
                     go to stp-tes-doc-100.
      *                  *---------------------------------------------*
      *                  * Numero documento in work ridefinito         *
      *                  *---------------------------------------------*
           move      rf-oft-num-doc       to   w-num-doc-num          .
      *                  *---------------------------------------------*
      *                  * Stampa numero progressivo                   *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      spaces               to   p-edm                  .
           move      w-lpt-num-doc-lin    to   p-lin                  .
           move      w-lpt-num-doc-pos    to   p-pos                  .
           move      w-num-doc-prg        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Composizione stringa per dipendenza e sigla *
      *                  * numerazione                                 *
      *                  *---------------------------------------------*
           move      spaces               to   w-num-doc-str          .
           move      1                    to   w-num-doc-pnt          .
      *                      *-----------------------------------------*
      *                      * Codice dipendenza                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da stampare                 *
      *                          *-------------------------------------*
           if        w-num-doc-dpz        =    01
                     go to stp-tes-doc-052.
      *                          *-------------------------------------*
      *                          * String                              *
      *                          *-------------------------------------*
           string    "."
                                delimited by   size
                     w-num-doc-dpz
                                delimited by   size
                                          into w-num-doc-str
                                  with pointer w-num-doc-pnt          .
       stp-tes-doc-052.
      *                      *-----------------------------------------*
      *                      * Sigla numerazione                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da stampare                 *
      *                          *-------------------------------------*
           if        rf-oft-sgl-num       =    spaces
                     go to stp-tes-doc-054.
      *                          *-------------------------------------*
      *                          * String                              *
      *                          *-------------------------------------*
           string    "-"
                                delimited by   size
                     rf-oft-sgl-num
                                delimited by   size
                                          into w-num-doc-str
                                  with pointer w-num-doc-pnt          .
       stp-tes-doc-054.
      *                  *---------------------------------------------*
      *                  * Determinazione lunghezza stringa            *
      *                  *---------------------------------------------*
           move      zero                 to   w-num-doc-pnt          .
           inspect   w-num-doc-str
                                      tallying w-num-doc-pnt
                                  for trailing spaces                 .
      *                  *---------------------------------------------*
      *                  * Stampa stringa composta                     *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      07                   to   p-car                  .
           subtract  w-num-doc-pnt        from p-car                  .
           move      w-lpt-num-doc-lin    to   p-lin                  .
           move      w-lpt-num-doc-pos    to   p-pos                  .
           add       06                   to   p-pos                  .
           move      w-num-doc-str        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tes-doc-100.
      *              *-------------------------------------------------*
      *              * Data documento                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se posizionamento esistente            *
      *                  *---------------------------------------------*
           if        w-lpt-dat-doc-lin    =   zero or
                     w-lpt-dat-doc-pos    =   zero
                     go to stp-tes-doc-150.
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      "S"                  to   p-edm                  .
           move      w-lpt-dat-doc-lin    to   p-lin                  .
           move      w-lpt-dat-doc-pos    to   p-pos                  .
           move      rf-oft-dat-doc       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tes-doc-150.
      *              *-------------------------------------------------*
      *              * Lettura dati anagrafici archivio                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo archivio    *
      *                  *---------------------------------------------*
           if        rf-oft-tip-arc       =    "F"
                     go to stp-tes-doc-160
           else      go to stp-tes-doc-200.
       stp-tes-doc-160.
      *                  *---------------------------------------------*
      *                  * Tipo archivio : Fornitori                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [fnt]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [fnt]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      rf-oft-cod-arc       to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *                      *-----------------------------------------*
      *                      * Memorizzazione valori                   *
      *                      *-----------------------------------------*
           move      rf-fnt-rag-soc       to   w-int-doc-rag          .
           move      rf-fnt-via-fnt       to   w-int-doc-via          .
           move      rf-fnt-loc-fnt       to   w-int-doc-loc          .
           move      rf-fnt-cod-fis       to   w-int-doc-cfi          .
           move      rf-fnt-prt-iva       to   w-int-doc-piv          .
      *                          *-------------------------------------*
      *                          * Determinazione Fax                  *
      *                          *-------------------------------------*
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      11                   to   d-con-arc-tip-arc      .
           move      rf-fnt-cod-fnt       to   d-con-arc-cod-arc      .
           move      spaces               to   d-con-arc-dpz-arc      .
           move      "FAX"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           move      "pgm/azi/prg/obj/dconarc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-con-arc              .
           move      d-con-arc-num-con (1)
                                          to   w-int-doc-fax          .
      *                          *-------------------------------------*
      *                          * Determinazione Telefono             *
      *                          *-------------------------------------*
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      11                   to   d-con-arc-tip-arc      .
           move      rf-fnt-cod-fnt       to   d-con-arc-cod-arc      .
           move      spaces               to   d-con-arc-dpz-arc      .
           move      "TEL"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           move      "pgm/azi/prg/obj/dconarc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-con-arc              .
           move      d-con-arc-num-con (1)
                                          to   w-int-doc-tel          .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     stp-tes-doc-200.
       stp-tes-doc-190.
      *                  *---------------------------------------------*
      *                  * Tipo archivio : Nessuno                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione valori                  *
      *                      *-----------------------------------------*
           move      spaces               to   w-int-doc-rag          .
           move      spaces               to   w-int-doc-via          .
           move      spaces               to   w-int-doc-loc          .
           move      spaces               to   w-int-doc-cfi          .
           move      zero                 to   w-int-doc-piv          .
           move      spaces               to   w-int-doc-fax          .
           move      spaces               to   w-int-doc-tel          .
      *                      *-----------------------------------------*
      *                      * Oltre                                   *
      *                      *-----------------------------------------*
           go to     stp-tes-doc-200.
       stp-tes-doc-200.
      *              *-------------------------------------------------*
      *              * Codice fiscale del fornitore                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se posizionamento esistente            *
      *                  *---------------------------------------------*
           if        w-lpt-cod-fis-lin    =   zero or
                     w-lpt-cod-fis-pos    =   zero
                     go to stp-tes-doc-250.
      *                  *---------------------------------------------*
      *                  * Test se codice fiscale pari alla partita    *
      *                  * iva                                         *
      *                  *                                             *
      *                  * Soppresso                                   *
      *                  *---------------------------------------------*
______*    if        w-int-doc-d01        =    w-int-doc-d02
______*              go to stp-tes-doc-250.
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      16                   to   p-car                  .
           move      w-lpt-cod-fis-lin    to   p-lin                  .
           move      w-lpt-cod-fis-pos    to   p-pos                  .
           move      w-int-doc-cfi        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tes-doc-250.
      *              *-------------------------------------------------*
      *              * Partita iva fornitore                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se posizionamento esistente            *
      *                  *---------------------------------------------*
           if        w-lpt-prt-iva-lin    =   zero or
                     w-lpt-prt-iva-pos    =   zero
                     go to stp-tes-doc-300.
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9B"                 to   p-edm                  .
           move      w-lpt-prt-iva-lin    to   p-lin                  .
           move      w-lpt-prt-iva-pos    to   p-pos                  .
           move      w-int-doc-piv        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tes-doc-300.
      *              *-------------------------------------------------*
      *              * Indirizzo di spedizione merce                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se posizionamento esistente            *
      *                  *---------------------------------------------*
           if       (w-lpt-ids-rag-lin    =   zero or
                     w-lpt-ids-rag-pos    =   zero  ) or
                    (w-lpt-ids-via-lin    =   zero or
                     w-lpt-ids-via-pos    =   zero  ) or
                    (w-lpt-ids-loc-lin    =   zero or
                     w-lpt-ids-loc-pos    =   zero  )
                     go to stp-tes-doc-400.
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo di spedi-   *
      *                  * zione merce :                               *
      *                  * - 01 : Alla nostra dipendenza di emissione  *
      *                  * - 02 : Manuale                              *
      *                  * - 03 : Ad un'altra dipendenza               *
      *                  *---------------------------------------------*
           go to     stp-tes-doc-310
                     stp-tes-doc-320
                     stp-tes-doc-320
                                depending on   rf-oft-tip-ids         .
       stp-tes-doc-310.
      *                  *---------------------------------------------*
      *                  * Indirizzo di spedizione : alla nostra di-   *
      *                  * pendenza di emissione                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura codice dipendenza               *
      *                      *-----------------------------------------*
           move      rf-oft-cod-dpz       to   w-ana-dpz-let          .
           perform   let-ana-dpz-000      thru let-ana-dpz-999        .
      *                      *-----------------------------------------*
      *                      * Ragione sociale                         *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      w-lpt-ids-rag-lin    to   p-lin                  .
           move      w-lpt-ids-rag-pos    to   p-pos                  .
           move      w-ana-dpz-rag        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Indirizzo                               *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      w-lpt-ids-via-lin    to   p-lin                  .
           move      w-lpt-ids-via-pos    to   p-pos                  .
           move      w-ana-dpz-via        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Localita'                               *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      w-lpt-ids-loc-lin    to   p-lin                  .
           move      w-lpt-ids-loc-pos    to   p-pos                  .
           move      w-ana-dpz-loc        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     stp-tes-doc-400.
       stp-tes-doc-320.
      *                  *---------------------------------------------*
      *                  * Indirizzo di spedizione : manuale           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ragione sociale                         *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      w-lpt-ids-rag-lin    to   p-lin                  .
           move      w-lpt-ids-rag-pos    to   p-pos                  .
           move      w-ext-rag-ids        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Indirizzo                               *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      w-lpt-ids-via-lin    to   p-lin                  .
           move      w-lpt-ids-via-pos    to   p-pos                  .
           move      w-ext-via-ids        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Localita'                               *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      w-lpt-ids-loc-lin    to   p-lin                  .
           move      w-lpt-ids-loc-pos    to   p-pos                  .
           move      w-ext-loc-ids        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     stp-tes-doc-400.
       stp-tes-doc-400.
      *              *-------------------------------------------------*
      *              * Indirizzo di inoltro documento                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se posizionamento esistente            *
      *                  *---------------------------------------------*
           if       (w-lpt-inl-rs1-lin    =   zero or
                     w-lpt-inl-rs1-pos    =   zero  ) or
                    (w-lpt-inl-via-lin    =   zero or
                     w-lpt-inl-via-pos    =   zero  ) or
                    (w-lpt-inl-loc-lin    =   zero or
                     w-lpt-inl-loc-pos    =   zero  )
                     go to stp-tes-doc-500.
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo di inoltro  *
      *                  * documento :                                 *
      *                  * - 01 : alla sede                            *
      *                  * - 02 : alla sede legale                     *
      *                  * - 03 : alla dipendenza                      *
      *                  *---------------------------------------------*
           go to     stp-tes-doc-410
                     stp-tes-doc-420
                     stp-tes-doc-430
                                depending on   rf-oft-inl-dcm         .
       stp-tes-doc-410.
      *                  *---------------------------------------------*
      *                  * Indirizzo di inoltro : alla sede            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [dcf]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [dcf]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      rf-oft-cod-arc       to   rf-dcf-cod-fnt         .
           move      spaces               to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione valori                  *
      *                      *-----------------------------------------*
           move      rf-dcf-rs1-doc       to   w-inl-dcm-rs1          .
           move      rf-dcf-rs2-doc       to   w-inl-dcm-rs2          .
           move      rf-dcf-via-dcf       to   w-inl-dcm-via          .
           move      rf-dcf-loc-dcf       to   w-inl-dcm-loc          .
      *                          *-------------------------------------*
      *                          * Determinazione Fax                  *
      *                          *-------------------------------------*
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      12                   to   d-con-arc-tip-arc      .
           move      rf-dcf-cod-fnt       to   d-con-arc-cod-arc      .
           move      rf-dcf-dpz-fnt       to   d-con-arc-dpz-arc      .
           move      "FAX"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           move      "pgm/azi/prg/obj/dconarc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-con-arc              .
           move      d-con-arc-num-con (1)
                                          to   w-inl-dcm-fax          .
      *                          *-------------------------------------*
      *                          * Determinazione Telefono             *
      *                          *-------------------------------------*
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      12                   to   d-con-arc-tip-arc      .
           move      rf-dcf-cod-fnt       to   d-con-arc-cod-arc      .
           move      rf-dcf-dpz-fnt       to   d-con-arc-dpz-arc      .
           move      "TEL"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           move      "pgm/azi/prg/obj/dconarc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-con-arc              .
           move      d-con-arc-num-con (1)
                                          to   w-inl-dcm-tel          .
      *                      *-----------------------------------------*
      *                      * A stampa indirizzo di inoltro           *
      *                      *-----------------------------------------*
           go to     stp-tes-doc-450.
       stp-tes-doc-420.
      *                  *---------------------------------------------*
      *                  * Indirizzo di inoltro : alla sede legale     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Memorizzazione dati da intestazione do- *
      *                      * cumento                                 *
      *                      *-----------------------------------------*
           move      w-int-doc-rag        to   w-inl-dcm-rs1          .
           move      spaces               to   w-inl-dcm-rs2          .
           move      w-int-doc-via        to   w-inl-dcm-via          .
           move      w-int-doc-loc        to   w-inl-dcm-loc          .
           move      w-int-doc-fax        to   w-inl-dcm-fax          .
           move      w-int-doc-tel        to   w-inl-dcm-tel          .
      *                      *-----------------------------------------*
      *                      * A stampa indirizzo di inoltro           *
      *                      *-----------------------------------------*
           go to     stp-tes-doc-450.
       stp-tes-doc-430.
      *                  *---------------------------------------------*
      *                  * Indirizzo di inoltro : alla dipendenza      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [dcf]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [dcf]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      rf-oft-cod-arc       to   rf-dcf-cod-fnt         .
           move      rf-oft-dpz-arc       to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione valori                  *
      *                      *-----------------------------------------*
           move      rf-dcf-rs1-doc       to   w-inl-dcm-rs1          .
           move      rf-dcf-rs2-doc       to   w-inl-dcm-rs2          .
           move      rf-dcf-via-dcf       to   w-inl-dcm-via          .
           move      rf-dcf-loc-dcf       to   w-inl-dcm-loc          .
      *                          *-------------------------------------*
      *                          * Determinazione Fax                  *
      *                          *-------------------------------------*
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      12                   to   d-con-arc-tip-arc      .
           move      rf-dcf-cod-fnt       to   d-con-arc-cod-arc      .
           move      rf-dcf-dpz-fnt       to   d-con-arc-dpz-arc      .
           move      "FAX"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           move      "pgm/azi/prg/obj/dconarc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-con-arc              .
           move      d-con-arc-num-con (1)
                                          to   w-inl-dcm-fax          .
      *                          *-------------------------------------*
      *                          * Determinazione Telefono             *
      *                          *-------------------------------------*
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      12                   to   d-con-arc-tip-arc      .
           move      rf-dcf-cod-fnt       to   d-con-arc-cod-arc      .
           move      rf-dcf-dpz-fnt       to   d-con-arc-dpz-arc      .
           move      "TEL"                to   d-con-arc-tip-sel      .
           move      01                   to   d-con-arc-num-edr      .
           move      "pgm/azi/prg/obj/dconarc0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-con-arc              .
           move      d-con-arc-num-con (1)
                                          to   w-inl-dcm-tel          .
      *                      *-----------------------------------------*
      *                      * A stampa indirizzo di inoltro           *
      *                      *-----------------------------------------*
           go to     stp-tes-doc-450.
       stp-tes-doc-450.
      *                  *---------------------------------------------*
      *                  * Stampa indirizzo di inoltro                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ragione sociale 1a parte                *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      w-lpt-inl-rs1-lin    to   p-lin                  .
           move      w-lpt-inl-rs1-pos    to   p-pos                  .
           move      w-inl-dcm-rs1        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Ragione sociale 2a parte                *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      w-lpt-inl-rs2-lin    to   p-lin                  .
           move      w-lpt-inl-rs1-pos    to   p-pos                  .
           move      w-inl-dcm-rs2        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tes-doc-460.
      *                      *-----------------------------------------*
      *                      * Indirizzo e localita'                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test sul numero di pagina           *
      *                          *-------------------------------------*
           if        w-cnt-npr-num-pag    >    1
                     go to stp-tes-doc-480.
       stp-tes-doc-470.
      *                          *-------------------------------------*
      *                          * Se pagina 1                         *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Indirizzo                       *
      *                              *---------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      w-lpt-inl-via-lin    to   p-lin                  .
           move      w-lpt-inl-via-pos    to   p-pos                  .
           move      w-inl-dcm-via        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * Localita'                       *
      *                              *---------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      w-lpt-inl-loc-lin    to   p-lin                  .
           move      w-lpt-inl-loc-pos    to   p-pos                  .
           move      w-inl-dcm-loc        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * A decrizione agente             *
      *                              *---------------------------------*
           go to     stp-tes-doc-500.
       stp-tes-doc-480.
      *                          *-------------------------------------*
      *                          * Se pagine a seguire                 *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Stampa del literal              *
      *                              *---------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      w-lpt-inl-loc-lin    to   p-lin                  .
           move      w-lpt-inl-loc-pos    to   p-pos                  .
           move      "Pagina nr. "        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * Editing numero di pagina        *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-cnt-npr-num-pag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * Stampa del numero pagina        *
      *                              *---------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      w-lpt-inl-loc-lin    to   p-lin                  .
           move      w-lpt-inl-loc-pos    to   p-pos                  .
           add       11                   to   p-pos                  .
           move      p-edt                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * A decrizione agente                 *
      *                          *-------------------------------------*
           go to     stp-tes-doc-500.
       stp-tes-doc-500.
      *              *-------------------------------------------------*
      *              * Tipo evasione richiesta                         *
      *              *                                                 *
      *              * N.B.: Questo campo e' stato inibito (mod. NdK   *
      *              *       del 04/05/98) perche' poco utilizzato ed  *
      *              *       e' stato sostituito dai riferimenti alla  *
      *              *       conferma ordine a fornitore               *
      *              *-------------------------------------------------*
           go to     stp-tes-doc-550.
       stp-tes-doc-505.
      *                  *---------------------------------------------*
      *                  * Test se posizionamento esistente            *
      *                  *---------------------------------------------*
           if        w-lpt-tip-eva-lin    =   zero or
                     w-lpt-tip-eva-pos    =   zero
                     go to stp-tes-doc-550.
       stp-tes-doc-510.
      *                  *---------------------------------------------*
      *                  * Prompt                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      w-lpt-tip-eva-lin    to   p-lin                  .
           move      w-lpt-tip-eva-pos    to   p-pos                  .
           move      "Evasione richiesta: "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      w-lpt-tip-eva-lin    to   p-lin                  .
           move      w-lpt-tip-eva-pos    to   p-pos                  .
           add       20                   to   p-pos                  .
           if        rf-oft-tip-eva       =    01
                     move  "Per il totale ordine"
                                          to   p-alf
           else if   rf-oft-tip-eva       =    02
                     move  "Per il totale riga  "
                                          to   p-alf
           else if   rf-oft-tip-eva       =    03
                     move  "Anche parziale riga "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tes-doc-550.
      *              *-------------------------------------------------*
      *              * Riferimenti conferma ordine fornitore           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se posizionamento esistente            *
      *                  *---------------------------------------------*
           if        w-lpt-rif-cof-lin    =   zero or
                     w-lpt-rif-cof-pos    =   zero
                     go to stp-tes-doc-600.
      *                  *---------------------------------------------*
      *                  * Test se valori esistenti                    *
      *                  *---------------------------------------------*
           if        rf-oft-cof-dat       =   zero and
                     rf-oft-cof-num       =   spaces
                     go to stp-tes-doc-580.
       stp-tes-doc-560.
      *                  *---------------------------------------------*
      *                  * Editing data conferma ordine                *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      rf-oft-cof-dat       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      "Vs. conferma"       to   w-all-str-cat (1)      .
           move      rf-oft-cof-num       to   w-all-str-cat (2)      .
           if        rf-oft-cof-dat       =    zero
                     move  spaces         to   w-all-str-cat (3)
                     move  spaces         to   w-all-str-cat (4)
           else      move  "del"          to   w-all-str-cat (3)
                     move  p-edt          to   w-all-str-cat (4)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      w-lpt-rif-cof-lin    to   p-lin                  .
           move      w-lpt-rif-cof-pos    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tes-doc-580.
      *                  *---------------------------------------------*
      *                  * Stampa riferimenti liberi                   *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      w-lpt-rif-cof-lin    to   p-lin                  .
           add       1                    to   p-lin                  .
           move      w-lpt-rif-cof-pos    to   p-pos                  .
           move      rf-oft-cof-rif       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tes-doc-600.
      *              *-------------------------------------------------*
      *              * Nostra dipendenza                               *
      *              *-------------------------------------------------*
       stp-tes-doc-605.
      *                  *---------------------------------------------*
      *                  * Test se posizionamento esistente            *
      *                  *---------------------------------------------*
           if        w-lpt-des-dpz-lin    =   zero or
                     w-lpt-des-dpz-pos    =   zero
                     go to stp-tes-doc-800.
       stp-tes-doc-610.
      *                  *---------------------------------------------*
      *                  * Lettura codice dipendenza                   *
      *                  *---------------------------------------------*
           move      rf-oft-cod-dpz       to   w-ana-dpz-let          .
           perform   let-ana-dpz-000      thru let-ana-dpz-999        .
      *                  *---------------------------------------------*
      *                  * Stampa denominazione dipendenza             *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      w-lpt-des-dpz-lin    to   p-lin                  .
           move      w-lpt-des-dpz-pos    to   p-pos                  .
           move      rf-ada-cod-mne       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tes-doc-625.
      *                  *---------------------------------------------*
      *                  * Stampa codice fornitore e suo codice dipen- *
      *                  * denza                                       *
      *                  *---------------------------------------------*
       stp-tes-doc-630.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda della presenza o   *
      *                      * meno del codice e della dipendenza      *
      *                      *-----------------------------------------*
           if        rf-oft-cod-arc       =    zero
                     go to stp-tes-doc-635.
           if        rf-oft-dpz-arc       =    spaces
                     go to stp-tes-doc-640
           else      go to stp-tes-doc-645.
       stp-tes-doc-635.
      *                      *-----------------------------------------*
      *                      * Se codice a zero                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Nessuna stampa, continuazione       *
      *                          *-------------------------------------*
           go to     stp-tes-doc-800.
       stp-tes-doc-640.
      *                      *-----------------------------------------*
      *                      * Se solo codice, senza dipendenza        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Stampa codice                       *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      w-lpt-des-dpz-lin    to   p-lin                  .
           move      w-lpt-des-dpz-pos    to   p-pos                  .
           add       33                   to   p-pos                  .
           move      rf-oft-cod-arc       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Continuazione                       *
      *                          *-------------------------------------*
           go to     stp-tes-doc-800.
       stp-tes-doc-645.
      *                      *-----------------------------------------*
      *                      * Se sia codice che dipendenza            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Stampa codice                       *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      w-lpt-des-dpz-lin    to   p-lin                  .
           move      w-lpt-des-dpz-pos    to   p-pos                  .
           add       28                   to   p-pos                  .
           move      rf-oft-cod-arc       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Trattino di congiunzione            *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      w-lpt-des-dpz-lin    to   p-lin                  .
           move      w-lpt-des-dpz-pos    to   p-pos                  .
           add       35                   to   p-pos                  .
           move      "-"                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Dipendenza                          *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      w-lpt-des-dpz-lin    to   p-lin                  .
           move      w-lpt-des-dpz-pos    to   p-pos                  .
           add       36                   to   p-pos                  .
           move      rf-oft-dpz-arc       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Continuazione                       *
      *                          *-------------------------------------*
           go to     stp-tes-doc-800.
       stp-tes-doc-800.
      *              *-------------------------------------------------*
      *              * Vertical position alla prima riga corpo         *
      *              *-------------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-lpc-pri-rig-lin    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tes-doc-999.
           exit.

      *    *===========================================================*
      *    * Lettura anagrafica dipendenza                             *
      *    *-----------------------------------------------------------*
       let-ana-dpz-000.
      *              *-------------------------------------------------*
      *              * Se codice da leggere a zero : normalizzazione e *
      *              * uscita                                          *
      *              *-------------------------------------------------*
           if        w-ana-dpz-let        =    zero
                     move  zero           to   w-ana-dpz-cod
                     move  spaces         to   w-ana-dpz-den
                     move  spaces         to   w-ana-dpz-rag
                     move  spaces         to   w-ana-dpz-via
                     move  spaces         to   w-ana-dpz-loc
                     go to let-ana-dpz-999.
       let-ana-dpz-100.
      *              *-------------------------------------------------*
      *              * Se codice da leggere pari a quello attualmente  *
      *              * memorizzato : uscita                            *
      *              *-------------------------------------------------*
           if        w-ana-dpz-let        =    w-ana-dpz-cod
                     go to let-ana-dpz-999.
       let-ana-dpz-200.
      *              *-------------------------------------------------*
      *              * Codice da leggere su codice attualmente memo-   *
      *              * rizzato                                         *
      *              *-------------------------------------------------*
           move      w-ana-dpz-let        to   w-ana-dpz-cod          .
       let-ana-dpz-300.
      *              *-------------------------------------------------*
      *              * Lettura e memorizzazione dati sulla dipendenza  *
      *              *-------------------------------------------------*
       let-ana-dpz-310.
      *                  *---------------------------------------------*
      *                  * Normalizzazione [ada]                       *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                  *---------------------------------------------*
      *                  * Lettura [ada] dati anagrafici Dipendenza    *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODDPZ    "         to   f-key                  .
           move      w-ana-dpz-cod        to   rf-ada-cod-dpz         .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                  *---------------------------------------------*
      *                  * Deviazione secondo l'esito della lettura    *
      *                  *---------------------------------------------*
           if        f-sts                =    e-not-err
                     go to let-ana-dpz-320
           else      go to let-ana-dpz-330.
       let-ana-dpz-320.
      *                  *---------------------------------------------*
      *                  * Se record [ada] esistente                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Memorizzazione dati                     *
      *                      *-----------------------------------------*
           move      rf-ada-cod-mne       to   w-ana-dpz-den          .
           move      rf-ada-rag-soc       to   w-ana-dpz-rag          .
           move      rf-ada-via-azi       to   w-ana-dpz-via          .
           move      rf-ada-loc-azi       to   w-ana-dpz-loc          .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-ana-dpz-999.
       let-ana-dpz-330.
      *                  *---------------------------------------------*
      *                  * Se record [ada] non esistente               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione dati                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-ana-dpz-den          .
           move      spaces               to   w-ana-dpz-rag          .
           move      spaces               to   w-ana-dpz-via          .
           move      spaces               to   w-ana-dpz-loc          .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     let-ana-dpz-999.
       let-ana-dpz-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *-----------------------------------------------------------*
       stp-cor-doc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione work per numero posizione       *
      *              *                                                 *
      *              * ELETTRA                                         *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-cor-doc-wnp      .
      *              *-------------------------------------------------*
      *              * Normalizzazione area rottura casa Produttrice   *
      *              *-------------------------------------------------*
           move      zero                 to   w-rot-cod-pdt          .
      *              *-------------------------------------------------*
      *              * Normalizzazione comodo per totale volume        *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-pie-tvo          .
       stp-cor-doc-020.
      *              *-------------------------------------------------*
      *              * Start su righe documento [ofr]                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-inp-mst-prt        to   rf-ofr-num-prt         .
           move      zero                 to   rf-ofr-num-prg         .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
           if        f-sts                =    e-not-err
                     go to stp-cor-doc-100.
      *                      *-----------------------------------------*
      *                      * Se Start non ottenuta uscita con status *
      *                      * al valore "N"                           *
      *                      *-----------------------------------------*
           move      spaces               to   w-out-mst              .
           move      "N"                  to   w-out-mst-stp          .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     stp-cor-doc-999.
       stp-cor-doc-100.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [ofr]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofofr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofr                 .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : a trattamento fine corpo      *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-cor-doc-700.
      *              *-------------------------------------------------*
      *              * Test max, se non superato : a trattamento fine  *
      *              * corpo                                           *
      *              *-------------------------------------------------*
           if        rf-ofr-num-prt       not  = w-inp-mst-prt
                     go to stp-cor-doc-700.
       stp-cor-doc-110.
      *              *-------------------------------------------------*
      *              * Stampa casa Produttrice                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se posizionamento esistente            *
      *                  *---------------------------------------------*
           if        w-lpc-des-pro-pos    =    zero
                     go to stp-cor-doc-200.
      *                  *---------------------------------------------*
      *                  * Test su personalizzazione                   *
      *                  *---------------------------------------------*
           if        w-prs-sof-snp        not  = "S"
                     go to stp-cor-doc-200.
      *                  *---------------------------------------------*
      *                  * Determinazione codice casa produttrice      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [aaq]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [aaq]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      rf-ofr-tip-mag       to   rf-aaq-tip-mag         .
           move      rf-ofr-num-mag       to   rf-aaq-num-pro         .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                      *-----------------------------------------*
      *                      * Test su codice letto                    *
      *                      *-----------------------------------------*
           if        rf-aaq-cdp-pdt       =    zero
                     go to stp-cor-doc-200.
      *                  *---------------------------------------------*
      *                  * Test se rottura riferimento                 *
      *                  *---------------------------------------------*
           if        rf-aaq-cod-pdt       =    w-rot-cod-pdt
                     go to stp-cor-doc-200.
      *                  *---------------------------------------------*
      *                  * Aggiornamento area rottura                  *
      *                  *---------------------------------------------*
           move      rf-aaq-cod-pdt       to   w-rot-cod-pdt          .
      *                  *---------------------------------------------*
      *                  * Test su righe corpo residue                 *
      *                  *---------------------------------------------*
           if        p-lnr                <    w-lpc-ult-rig-lin
                     go to stp-cor-doc-120.
      *                      *-----------------------------------------*
      *                      * Reintestazione documento                *
      *                      *-----------------------------------------*
           perform   rei-mod-tes-000      thru rei-mod-tes-999        .
      *                      *-----------------------------------------*
      *                      * Test su status di uscita                *
      *                      *-----------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to stp-cor-doc-120.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     stp-cor-doc-999.
       stp-cor-doc-120.
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [pdt]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofpdt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdt                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [pdt]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODPDT    "         to   f-key                  .
           move      rf-aaq-cod-pdt       to   rf-pdt-cod-pdt         .
           move      "pgm/dcf/fls/ioc/obj/iofpdt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdt                 .
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-des-pro-pos    to   p-pos                  .
           move      rf-pdt-rag-soc       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-200.
      *              *-------------------------------------------------*
      *              * Stampa prima linea per riga corpo               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su righe corpo residue                 *
      *                  *---------------------------------------------*
           if        p-lnr                <    w-lpc-ult-rig-lin
                     go to stp-cor-doc-220.
      *                  *---------------------------------------------*
      *                  * Reintestazione documento                    *
      *                  *---------------------------------------------*
           perform   rei-mod-tes-000      thru rei-mod-tes-999        .
      *                  *---------------------------------------------*
      *                  * Test su status di uscita                    *
      *                  *---------------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to stp-cor-doc-220.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     stp-cor-doc-999.
       stp-cor-doc-220.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-240.
      *                  *---------------------------------------------*
      *                  * Indicatori di stampa da eseguire : tutti a  *
      *                  * spaces                                      *
      *                  *---------------------------------------------*
           move      spaces               to   w-stp-cor-doc-idc      .
       stp-cor-doc-260.
      *                  *---------------------------------------------*
      *                  * Determinazioni indicatori di stampa da ese- *
      *                  * guire                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice prodotto                         *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-ico-000  thru stp-cor-doc-ico-999    .
      *                      *-----------------------------------------*
      *                      * Prezzo                                  *
      *                      *                                         *
      *                      * Nota : E' importante che venga eseguita *
      *                      *        prima della determinazione rela- *
      *                      *        tiva alla descrizione, in quanto *
      *                      *        una riga aggiuntiva di descri-   *
      *                      *        zione, precisamente quella di    *
      *                      *        indicazione che il prezzo viene  *
      *                      *        inteso come riferito ad una uni- *
      *                      *        ta' di misura diversa da quella  *
      *                      *        indicato, appare o no in fun-    *
      *                      *        zione del fatto che il prezzo    *
      *                      *        sia evidenziato in stampa oppure *
      *                      *        no.                              *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-ipz-000  thru stp-cor-doc-ipz-999    .
      *                      *-----------------------------------------*
      *                      * Descrizione                             *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-ide-000  thru stp-cor-doc-ide-999    .
      *                      *-----------------------------------------*
      *                      * Quantita'                               *
      *                      *                                         *
      *                      * Viene inoltre determinata quale sia la  *
      *                      * quantita' da stampare ed il relativo    *
      *                      * numero decimali                         *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-iqt-000  thru stp-cor-doc-iqt-999    .
      *                      *-----------------------------------------*
      *                      * Unita' di misura                        *
      *                      *                                         *
      *                      * Viene inoltre determinata quale sia la  *
      *                      * unita' di misura da stampare            *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-ium-000  thru stp-cor-doc-ium-999    .
      *                      *-----------------------------------------*
      *                      * Importo                                 *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-iim-000  thru stp-cor-doc-iim-999    .
      *                      *-----------------------------------------*
      *                      * % sconto 1                              *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-is1-000  thru stp-cor-doc-is1-999    .
      *                      *-----------------------------------------*
      *                      * % sconto 2                              *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-is2-000  thru stp-cor-doc-is2-999    .
      *                      *-----------------------------------------*
      *                      * % sconto 3                              *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-is3-000  thru stp-cor-doc-is3-999    .
      *                      *-----------------------------------------*
      *                      * % sconto 4                              *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-is4-000  thru stp-cor-doc-is4-999    .
      *                      *-----------------------------------------*
      *                      * % sconto 5                              *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-is5-000  thru stp-cor-doc-is5-999    .
      *                      *-----------------------------------------*
      *                      * Data di consegna                        *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-idc-000  thru stp-cor-doc-idc-999    .
       stp-cor-doc-280.
      *                  *---------------------------------------------*
      *                  * Flags di stampa eseguita : tutti a spaces   *
      *                  *---------------------------------------------*
           move      spaces               to   w-stp-cor-doc-flg      .
      *                  *---------------------------------------------*
      *                  * Determinazione del volume in riga           *
      *                  *---------------------------------------------*
           perform   stp-cor-doc-dvr-000  thru stp-cor-doc-dvr-999    .
       stp-cor-doc-300.
      *                  *---------------------------------------------*
      *                  * Stampa campi prima riga corpo               *
      *                  *---------------------------------------------*
       stp-cor-doc-305.
      *                      *-----------------------------------------*
      *                      * Numero posizione                        *
      *                      *                                         *
      *                      * ELETTRA                                 *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-npo-000  thru stp-cor-doc-npo-999    .
       stp-cor-doc-310.
      *                      *-----------------------------------------*
      *                      * Codice prodotto                         *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-cod-000  thru stp-cor-doc-cod-999    .
       stp-cor-doc-320.
      *                      *-----------------------------------------*
      *                      * Prima riga di descrizione               *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-d01-000  thru stp-cor-doc-d01-999    .
       stp-cor-doc-330.
      *                      *-----------------------------------------*
      *                      * Quantita'                               *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-qta-000  thru stp-cor-doc-qta-999    .
       stp-cor-doc-340.
      *                      *-----------------------------------------*
      *                      * Unita' di misura                        *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-umi-000  thru stp-cor-doc-umi-999    .
       stp-cor-doc-350.
      *                      *-----------------------------------------*
      *                      * Prezzo                                  *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-prz-000  thru stp-cor-doc-prz-999    .
       stp-cor-doc-360.
      *                      *-----------------------------------------*
      *                      * Importo                                 *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-imp-000  thru stp-cor-doc-imp-999    .
       stp-cor-doc-370.
      *                      *-----------------------------------------*
      *                      * Percentuale di sconto 1                 *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-sc1-000  thru stp-cor-doc-sc1-999    .
       stp-cor-doc-380.
      *                      *-----------------------------------------*
      *                      * Percentuale di sconto 2                 *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-sc2-000  thru stp-cor-doc-sc2-999    .
       stp-cor-doc-390.
      *                      *-----------------------------------------*
      *                      * Data di consegna                        *
      *                      *-----------------------------------------*
           perform   stp-cor-doc-dtc-000  thru stp-cor-doc-dtc-999    .
      *                      *-----------------------------------------*
      *                      * Scrittura riga archivio per EDI         *
      *                      *                                         *
      *                      * ELETTRA                                 *
      *                      *-----------------------------------------*
           move      "WR"                 to   d-seq-edi-tip-ope      .
           move      "ele/orf/prg/obj/dseqedi0"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using d-seq-edi
                                               rf-oft
                                               rf-ofr                 .
       stp-cor-doc-400.
      *              *-------------------------------------------------*
      *              * Stampa righe di descrizione residue oppure per- *
      *              * centuali di sconto 3,4,5                        *
      *              *-------------------------------------------------*
       stp-cor-doc-450.
      *                  *---------------------------------------------*
      *                  * Determinazione del numero di righe di ag-   *
      *                  * giuntive da stampare, tenendo conto del     *
      *                  * numero di righe di descrizione e degli      *
      *                  * sconti                                      *
      *                  *---------------------------------------------*
       stp-cor-doc-455.
      *                      *-----------------------------------------*
      *                      * Si pone inizialmente il numero di righe *
      *                      * da stampare pari al numero di righe di  *
      *                      * descrizione                             *
      *                      *-----------------------------------------*
           move      w-stp-cor-doc-ctr    to   w-stp-cor-doc-nrd      .
       stp-cor-doc-460.
      *                      *-----------------------------------------*
      *                      * Se il numero di righe da stampare e'    *
      *                      * gia' maggiore di uno : si omette la     *
      *                      * determinazione per gli sconti 3 e 4,    *
      *                      * in quanto la riga sarebbe presa in      *
      *                      * ogni caso in considerazione             *
      *                      *-----------------------------------------*
           if        w-stp-cor-doc-nrd    not  < 2
                     go to stp-cor-doc-465.
      *                      *-----------------------------------------*
      *                      * Se bisogna stampare lo sconto 3 o 4 si  *
      *                      * forza il numero di righe da stampare a  *
      *                      * 2                                       *
      *                      *-----------------------------------------*
           if        w-stp-cor-doc-i70 (3)
                                          =    "S"    and
                     rf-ofr-per-scr (3)   not  = zero
                     move  2              to   w-stp-cor-doc-nrd
                     go to stp-cor-doc-465.
           if        w-stp-cor-doc-i70 (4)
                                          =    "S"    and
                     rf-ofr-per-scr (4)   not  = zero
                     move  2              to   w-stp-cor-doc-nrd
                     go to stp-cor-doc-465.
       stp-cor-doc-465.
      *                      *-----------------------------------------*
      *                      * Se il numero di righe da stampare e'    *
      *                      * gia' maggiore di due : si omette la     *
      *                      * determinazione per lo sconto 5, in      *
      *                      * quanto la riga sarebbe presa in ogni    *
      *                      * caso in considerazione                  *
      *                      *-----------------------------------------*
           if        w-stp-cor-doc-nrd    not  < 3
                     go to stp-cor-doc-500.
      *                      *-----------------------------------------*
      *                      * Se bisogna stampare lo sconto 5 si for- *
      *                      * za il numero di righe da stampare a 3   *
      *                      *-----------------------------------------*
           if        w-stp-cor-doc-i70 (5)
                                          =    "S"    and
                     rf-ofr-per-scr (5)   not  = zero
                     move  3              to   w-stp-cor-doc-nrd
                     go to stp-cor-doc-500.
       stp-cor-doc-500.
      *                  *---------------------------------------------*
      *                  * Ciclo per stampa righe aggiuntive           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Inizializzazione contatore su righe     *
      *                      *-----------------------------------------*
           move      1                    to   w-stp-cor-doc-nrg      .
       stp-cor-doc-520.
      *                      *-----------------------------------------*
      *                      * Incremento contatore su righe           *
      *                      *-----------------------------------------*
           add       1                    to   w-stp-cor-doc-nrg      .
      *                      *-----------------------------------------*
      *                      * Se oltre il numero righe da stampare :  *
      *                      * a riciclo su riga ordine successiva     *
      *                      *-----------------------------------------*
           if        w-stp-cor-doc-nrg    >    w-stp-cor-doc-nrd
                     go to stp-cor-doc-580.
      *                      *-----------------------------------------*
      *                      * Test su righe corpo residue             *
      *                      *-----------------------------------------*
           if        p-lnr                <    w-lpc-ult-rig-lin
                     go to stp-cor-doc-530.
      *                      *-----------------------------------------*
      *                      * Reintestazione documento                *
      *                      *-----------------------------------------*
           perform   rei-mod-tes-000      thru rei-mod-tes-999        .
      *                      *-----------------------------------------*
      *                      * Test su status di uscita                *
      *                      *-----------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to stp-cor-doc-530.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     stp-cor-doc-999.
       stp-cor-doc-530.
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa riga di descrizione, se indica-  *
      *                      * tore di stampa lo consente, e se de-    *
      *                      * scrizione diversa da spaces             *
      *                      *-----------------------------------------*
           if        w-stp-cor-doc-i20    not  = "S"
                     go to stp-cor-doc-540.
           if        w-stp-cor-doc-rgd
                    (w-stp-cor-doc-nrg)   =    spaces
                     go to stp-cor-doc-540.
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-des-pro-pos    to   p-pos                  .
           move      w-stp-cor-doc-rgd
                    (w-stp-cor-doc-nrg)   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-540.
      *                      *-----------------------------------------*
      *                      * Stampa sconto in riga 3, solo se in ri- *
      *                      * ga numero 2, e se indicatore di stampa  *
      *                      * lo consente, e se percentuale diversa   *
      *                      * da zero                                 *
      *                      *-----------------------------------------*
           if        w-stp-cor-doc-nrg    not  = 2
                     go to stp-cor-doc-550.
           if        w-stp-cor-doc-i70 (3)
                                          not  = "S"
                     go to stp-cor-doc-550.
           if        rf-ofr-per-scr (3)   =    zero
                     go to stp-cor-doc-550.
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "BD"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-per-scr-pos (3)
                                          to   p-pos                  .
           move      rf-ofr-per-scr (3)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-550.
      *                      *-----------------------------------------*
      *                      * Stampa sconto in riga 4, solo se in ri- *
      *                      * ga numero 2, e se indicatore di stampa  *
      *                      * lo consente, e se percentuale diversa   *
      *                      * da zero                                 *
      *                      *-----------------------------------------*
           if        w-stp-cor-doc-nrg    not  = 2
                     go to stp-cor-doc-560.
           if        w-stp-cor-doc-i70 (4)
                                          not  = "S"
                     go to stp-cor-doc-560.
           if        rf-ofr-per-scr (4)   =    zero
                     go to stp-cor-doc-560.
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "BD"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-per-scr-pos (4)
                                          to   p-pos                  .
           move      rf-ofr-per-scr (4)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-560.
      *                      *-----------------------------------------*
      *                      * Stampa sconto in riga 5, solo se in ri- *
      *                      * ga numero 3, e se indicatore di stampa  *
      *                      * lo consente, e se percentuale diversa   *
      *                      * da zero                                 *
      *                      *-----------------------------------------*
           if        w-stp-cor-doc-nrg    not  = 3
                     go to stp-cor-doc-570.
           if        w-stp-cor-doc-i70 (4)
                                          not  = "S"
                     go to stp-cor-doc-570.
           if        rf-ofr-per-scr (5)   =    zero
                     go to stp-cor-doc-570.
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "BD"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-per-scr-pos (5)
                                          to   p-pos                  .
           move      rf-ofr-per-scr (5)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-570.
      *                      *-----------------------------------------*
      *                      * Riciclo su riga aggiuntiva successiva   *
      *                      *-----------------------------------------*
           go to     stp-cor-doc-520.
       stp-cor-doc-580.
      *              *-------------------------------------------------*
      *              * Stampa legame valutario                         *
      *              *-------------------------------------------------*
           perform   stp-cor-doc-lvl-000  thru stp-cor-doc-lvl-999    .
       stp-cor-doc-600.
      *              *-------------------------------------------------*
      *              * Riciclo su lettura sequenziale file [ofr]       *
      *              *-------------------------------------------------*
           go to     stp-cor-doc-100.
       stp-cor-doc-700.
      *              *-------------------------------------------------*
      *              * Trattamento sconto in chiusura                  *
      *              *-------------------------------------------------*
       stp-cor-doc-702.
      *                  *---------------------------------------------*
      *                  * Se non esiste il posizionamento per la de-  *
      *                  * scrizione : nessuna azione                  *
      *                  *---------------------------------------------*
           if        w-lpc-des-pro-pos    =    zero
                     go to stp-cor-doc-750.
       stp-cor-doc-704.
      *                  *---------------------------------------------*
      *                  * Se sia la percentuale che il valore sono a  *
      *                  * zero : nessuna azione                       *
      *                  *---------------------------------------------*
           if        rf-oft-per-scc       =    zero and
                     rf-oft-tot-scc       =    zero
                     go to stp-cor-doc-750.
       stp-cor-doc-706.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se esiste o no la per- *
      *                  * centuale                                    *
      *                  *---------------------------------------------*
           if        rf-oft-per-scc       =    zero
                     go to stp-cor-doc-730.
       stp-cor-doc-710.
      *                  *---------------------------------------------*
      *                  * Se percentuale diversa da zero              *
      *                  *---------------------------------------------*
       stp-cor-doc-714.
      *                      *-----------------------------------------*
      *                      * Test su righe corpo residue             *
      *                      *-----------------------------------------*
           if        p-lnr                <    w-lpc-ult-rig-lin
                     go to stp-cor-doc-716.
      *                      *-----------------------------------------*
      *                      * Reintestazione documento                *
      *                      *-----------------------------------------*
           perform   rei-mod-tes-000      thru rei-mod-tes-999        .
      *                      *-----------------------------------------*
      *                      * Test su status di uscita                *
      *                      *-----------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to stp-cor-doc-716.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     stp-cor-doc-999.
       stp-cor-doc-716.
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-718.
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<D"                 to   p-edm                  .
           move      rf-oft-per-scc       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
      *
           if        rf-oft-cod-lng       not  = "I  " and
                     w-stp-cof-des (20)   not  = spaces
                     move  w-stp-cof-des (20)
                                          to   w-all-str-cat (1)
           else      move  "Sconto incondizionato"
                                          to   w-all-str-cat (1)      .
      *
           move      ":"                  to   w-all-str-cat (2)      .
           move      p-edt                to   w-all-str-cat (3)      .
           move      "%"                  to   w-all-str-cat (4)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-stp-cor-doc-sin      .
       stp-cor-doc-720.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-des-pro-pos    to   p-pos                  .
           move      w-stp-cor-doc-sin    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-722.
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     stp-cor-doc-750.
       stp-cor-doc-730.
      *                  *---------------------------------------------*
      *                  * Se percentuale pari a zero, ma importo di-  *
      *                  * verso da zero                               *
      *                  *---------------------------------------------*
       stp-cor-doc-732.
      *                      *-----------------------------------------*
      *                      * Se non esiste un posizionamento per il  *
      *                      * prezzo : nessuna azione                 *
      *                      *-----------------------------------------*
           if        w-lpc-prz-acq-pos    =    zero
                     go to stp-cor-doc-750.
      *                      *-----------------------------------------*
      *                      * Se importo oltre i limiti di stampa :   *
      *                      * nessuna azione                          *
      *                      *-----------------------------------------*
           if        rf-oft-tot-scc       >    999999999 or
                     rf-oft-tot-scc       <   -999999999
                     go to stp-cor-doc-750.
       stp-cor-doc-734.
      *                      *-----------------------------------------*
      *                      * Test su righe corpo residue             *
      *                      *-----------------------------------------*
           if        p-lnr                <    w-lpc-ult-rig-lin
                     go to stp-cor-doc-736.
      *                      *-----------------------------------------*
      *                      * Reintestazione documento                *
      *                      *-----------------------------------------*
           perform   rei-mod-tes-000      thru rei-mod-tes-999        .
      *                      *-----------------------------------------*
      *                      * Test su status di uscita                *
      *                      *-----------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to stp-cor-doc-736.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     stp-cor-doc-999.
       stp-cor-doc-736.
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-738.
      *                      *-----------------------------------------*
      *                      * Stampa descrizione                      *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-des-pro-pos    to   p-pos                  .
      *
           if        rf-oft-cod-lng       not  = "I  " and
                     w-stp-cof-des (20)   not  = spaces
                     move  w-stp-cof-des (20)
                                          to   p-alf
           else      move  "Sconto incondizionato"
                                          to   p-alf                  .
      *
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-740.
      *                      *-----------------------------------------*
      *                      * Stampa importo                          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Deviazione a seconda dell'ammontare *
      *                          *-------------------------------------*
           if        rf-oft-tot-scc       >    9999999 or
                     rf-oft-tot-scc       <   -9999999
                     go to stp-cor-doc-744.
       stp-cor-doc-742.
      *                          *-------------------------------------*
      *                          * Editing esteso                      *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      rf-ofr-dec-vpf       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "GB"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-prz-acq-pos    to   p-pos                  .
           move      rf-oft-tot-scc       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Continuazione                       *
      *                          *-------------------------------------*
           go to     stp-cor-doc-750.
       stp-cor-doc-744.
      *                          *-------------------------------------*
      *                          * Editing compatto                    *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      rf-ofr-dec-vpf       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-prz-acq-pos    to   p-pos                  .
           move      rf-oft-tot-scc       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Continuazione                       *
      *                          *-------------------------------------*
           go to     stp-cor-doc-750.
       stp-cor-doc-750.
      *              *-------------------------------------------------*
      *              * Trattamento sconto pagamento                    *
      *              *-------------------------------------------------*
       stp-cor-doc-752.
      *                  *---------------------------------------------*
      *                  * Se non esiste il posizionamento per la de-  *
      *                  * scrizione : nessuna azione                  *
      *                  *---------------------------------------------*
           if        w-lpc-des-pro-pos    =    zero
                     go to stp-cor-doc-796.
       stp-cor-doc-754.
      *                  *---------------------------------------------*
      *                  * Se sia la percentuale che il valore sono a  *
      *                  * zero : nessuna azione                       *
      *                  *---------------------------------------------*
           if        rf-oft-per-scp       =    zero and
                     rf-oft-tot-scp       =    zero
                     go to stp-cor-doc-796.
       stp-cor-doc-756.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda se esiste o no la per- *
      *                  * centuale                                    *
      *                  *---------------------------------------------*
           if        rf-oft-per-scp       =    zero
                     go to stp-cor-doc-780.
       stp-cor-doc-760.
      *                  *---------------------------------------------*
      *                  * Se percentuale diversa da zero              *
      *                  *---------------------------------------------*
       stp-cor-doc-764.
      *                      *-----------------------------------------*
      *                      * Test su righe corpo residue             *
      *                      *-----------------------------------------*
           if        p-lnr                <    w-lpc-ult-rig-lin
                     go to stp-cor-doc-766.
      *                      *-----------------------------------------*
      *                      * Reintestazione documento                *
      *                      *-----------------------------------------*
           perform   rei-mod-tes-000      thru rei-mod-tes-999        .
      *                      *-----------------------------------------*
      *                      * Test su status di uscita                *
      *                      *-----------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to stp-cor-doc-766.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     stp-cor-doc-999.
       stp-cor-doc-766.
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-768.
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
           move      spaces               to   w-stp-cor-doc-spa      .
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<D"                 to   p-edm                  .
           move      rf-oft-per-scp       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           string    "Sconto su pagamento : "
                                delimited by   size
                     p-edt      delimited by   spaces
                     "%"        delimited by   size
                                          into w-stp-cor-doc-spa      .
       stp-cor-doc-770.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-des-pro-pos    to   p-pos                  .
           move      w-stp-cor-doc-spa    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-772.
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     stp-cor-doc-796.
       stp-cor-doc-780.
      *                  *---------------------------------------------*
      *                  * Se percentuale pari a zero, ma importo di-  *
      *                  * verso da zero                               *
      *                  *---------------------------------------------*
       stp-cor-doc-782.
      *                      *-----------------------------------------*
      *                      * Se non esiste un posizionamento per il  *
      *                      * prezzo : nessuna azione                 *
      *                      *-----------------------------------------*
           if        w-lpc-prz-acq-pos    =    zero
                     go to stp-cor-doc-796.
      *                      *-----------------------------------------*
      *                      * Se importo oltre i limiti di stampa :   *
      *                      * nessuna azione                          *
      *                      *-----------------------------------------*
           if        rf-oft-tot-scp       >    999999999 or
                     rf-oft-tot-scp       <   -999999999
                     go to stp-cor-doc-796.
       stp-cor-doc-784.
      *                      *-----------------------------------------*
      *                      * Test su righe corpo residue             *
      *                      *-----------------------------------------*
           if        p-lnr                <    w-lpc-ult-rig-lin
                     go to stp-cor-doc-786.
      *                      *-----------------------------------------*
      *                      * Reintestazione documento                *
      *                      *-----------------------------------------*
           perform   rei-mod-tes-000      thru rei-mod-tes-999        .
      *                      *-----------------------------------------*
      *                      * Test su status di uscita                *
      *                      *-----------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to stp-cor-doc-786.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     stp-cor-doc-999.
       stp-cor-doc-786.
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-788.
      *                      *-----------------------------------------*
      *                      * Stampa descrizione                      *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-des-pro-pos    to   p-pos                  .
           move      "Sconto su pagamento  "
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-790.
      *                      *-----------------------------------------*
      *                      * Stampa importo                          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Deviazione a seconda dell'ammontare *
      *                          *-------------------------------------*
           if        rf-oft-tot-scp       >    9999999 or
                     rf-oft-tot-scp       <   -9999999
                     go to stp-cor-doc-794.
       stp-cor-doc-792.
      *                          *-------------------------------------*
      *                          * Editing esteso                      *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      rf-ofr-dec-vpf       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "GB"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-prz-acq-pos    to   p-pos                  .
           move      rf-oft-tot-scp       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Continuazione                       *
      *                          *-------------------------------------*
           go to     stp-cor-doc-796.
       stp-cor-doc-794.
      *                          *-------------------------------------*
      *                          * Editing compatto                    *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      rf-ofr-dec-vpf       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-prz-acq-pos    to   p-pos                  .
           move      rf-oft-tot-scp       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Continuazione                       *
      *                          *-------------------------------------*
           go to     stp-cor-doc-796.
       stp-cor-doc-796.
      *              *-------------------------------------------------*
      *              * Trattamento spese in fatturazione               *
      *              *-------------------------------------------------*
           perform   stp-cor-doc-spe-000  thru stp-cor-doc-spe-999    .
       stp-cor-doc-800.
      *              *-------------------------------------------------*
      *              * Stampa totale ordine                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se il tipo documento non prevede la    *
      *                  * stampa del totale ordine                    *
      *                  *---------------------------------------------*
           if        rf-yof-snx-sto       not  = "S"
                     go to stp-cor-doc-830.
       stp-cor-doc-805.
      *                  *---------------------------------------------*
      *                  * Test se totale diverso da zero              *
      *                  *---------------------------------------------*
           if        rf-oft-tot-doc       =    zero
                     go to stp-cor-doc-830.
       stp-cor-doc-810.
      *                  *---------------------------------------------*
      *                  * Se totale diverso da zero                   *
      *                  *---------------------------------------------*
       stp-cor-doc-814.
      *                      *-----------------------------------------*
      *                      * Test su righe corpo residue             *
      *                      *-----------------------------------------*
           move      w-lpc-ult-rig-lin    to   w-lpc-ult-rig-wrk      .
           subtract  1                    from w-lpc-ult-rig-wrk      .
           if        p-lnr                <    w-lpc-ult-rig-wrk
                     go to stp-cor-doc-816.
      *                      *-----------------------------------------*
      *                      * Reintestazione documento                *
      *                      *-----------------------------------------*
           perform   rei-mod-tes-000      thru rei-mod-tes-999        .
      *                      *-----------------------------------------*
      *                      * Test su status di uscita                *
      *                      *-----------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to stp-cor-doc-816.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     stp-cor-doc-999.
       stp-cor-doc-816.
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa sottolineatura                   *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-des-pro-pos    to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-818.
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Editing totale ordine               *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      rf-oft-dec-vpf       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<BGD"               to   p-edm                  .
           move      rf-oft-tot-doc       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Composizione                        *
      *                          *-------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           if        rf-oft-cod-lng       not  = "I  " and
                     w-stp-cof-des (19)   not  = spaces
                     move  w-stp-cof-des (19)
                                          to   w-all-str-cat (1)
           else      move  "Totale ordine"
                                          to   w-all-str-cat (1)      .
           if        rf-oft-sgl-vpf       =    c-sgl
                     move  spaces         to   w-all-str-cat (2)
           else      move  rf-oft-sgl-vpf to   w-all-str-cat (2)      .
           move      ":"                  to   w-all-str-cat (3)      .
           move      p-edt                to   w-all-str-cat (4)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
       stp-cor-doc-820.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-des-pro-pos    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-822.
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     stp-cor-doc-830.
       stp-cor-doc-830.
      *              *-------------------------------------------------*
      *              * Stampa totale volume                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se il tipo documento non prevede la    *
      *                  * stampa del totale volume                    *
      *                  *---------------------------------------------*
           if        rf-yof-snx-stv       not  = "S"
                     go to stp-cor-doc-840.
      *                  *---------------------------------------------*
      *                  * Test se totale diverso da zero              *
      *                  *---------------------------------------------*
           if        w-stp-pie-tvo        =    zero
                     go to stp-cor-doc-840.
      *                  *---------------------------------------------*
      *                  * Se totale diverso da zero                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test su righe corpo residue             *
      *                      *-----------------------------------------*
           move      w-lpc-ult-rig-lin    to   w-lpc-ult-rig-wrk      .
           subtract  1                    from w-lpc-ult-rig-wrk      .
           if        p-lnr                <    w-lpc-ult-rig-wrk
                     go to stp-cor-doc-835.
      *                      *-----------------------------------------*
      *                      * Reintestazione documento                *
      *                      *-----------------------------------------*
           perform   rei-mod-tes-000      thru rei-mod-tes-999        .
      *                      *-----------------------------------------*
      *                      * Test su status di uscita                *
      *                      *-----------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to stp-cor-doc-835.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     stp-cor-doc-999.
       stp-cor-doc-835.
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa sottolineatura                   *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-des-pro-pos    to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Interlinea                              *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Composizione stringa                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Editing totale volume               *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      05                   to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<BGD"               to   p-edm                  .
           move      w-stp-pie-tvo        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Composizione                        *
      *                          *-------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      "Volume (MC) :"      to   w-all-str-cat (1)      .
           move      p-edt                to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-des-pro-pos    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Continuazione                           *
      *                      *-----------------------------------------*
           go to     stp-cor-doc-840.
       stp-cor-doc-840.
      *              *-------------------------------------------------*
      *              * Continuazione                                   *
      *              *-------------------------------------------------*
       stp-cor-doc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-cor-doc-999.
       stp-cor-doc-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Numero posizione (ELETTRA)       *
      *    *-----------------------------------------------------------*
       stp-cor-doc-npo-000.
      *              *-------------------------------------------------*
      *              * Scomposizione tipo riga                         *
      *              *-------------------------------------------------*
           move      rf-ofr-tip-rig       to   w-ctl-tip-rig-tri      .
           perform   ctl-tip-rig-000      thru ctl-tip-rig-999        .
      *              *-------------------------------------------------*
      *              * Se si tratta di una riga di commento o di adde- *
      *              * bito : no                                       *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "C" or
                     w-tip-rig-tpr        =    "A"
                     go to stp-cor-doc-npo-999.
      *              *-------------------------------------------------*
      *              * Se il tipo prodotto non e' pari a P,M,V : no    *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        not  = "P" and
                     w-tip-rig-tpr        not  = "M" and
                     w-tip-rig-tpr        not  = "V"
                     go to stp-cor-doc-npo-999.
      *              *-------------------------------------------------*
      *              * Incremento work per numero posizione            *
      *              *-------------------------------------------------*
           add       1                    to   w-stp-cor-doc-wnp      .
      *              *-------------------------------------------------*
      *              * Stampa                                          *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      4                    to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      spaces               to   p-msk                  .
           move      p-lnr                to   p-lin                  .
           move      004                  to   p-pos                  .
           move      w-stp-cor-doc-wnp    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-npo-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Determinazione indicatore stampa *
      *    *                          da eseguire per codice prodotto  *
      *    *-----------------------------------------------------------*
       stp-cor-doc-ico-000.
      *              *-------------------------------------------------*
      *              * Scomposizione tipo riga                         *
      *              *-------------------------------------------------*
           move      rf-ofr-tip-rig       to   w-ctl-tip-rig-tri      .
           perform   ctl-tip-rig-000      thru ctl-tip-rig-999        .
       stp-cor-doc-ico-050.
      *              *-------------------------------------------------*
      *              * Se posizionamento non esistente : no            *
      *              *-------------------------------------------------*
           if        w-lpc-cod-pro-pos    =    zero
                     go to stp-cor-doc-ico-999.
       stp-cor-doc-ico-100.
      *              *-------------------------------------------------*
      *              * Se si tratta di una riga di commento o di adde- *
      *              * bito : no                                       *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "C" or
                     w-tip-rig-tpr        =    "A"
                     go to stp-cor-doc-ico-999.
       stp-cor-doc-ico-150.
      *              *-------------------------------------------------*
      *              * Se il tipo prodotto non e' pari a P,M,V : no    *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        not  = "P" and
                     w-tip-rig-tpr        not  = "M" and
                     w-tip-rig-tpr        not  = "V"
                     go to stp-cor-doc-ico-999.
       stp-cor-doc-ico-200.
      *              *-------------------------------------------------*
      *              * Se tipo prodotto P ma tipo funzionamento non u- *
      *              * guale a spazi : no                              *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "P"  and
                     w-tip-rig-tfu        not  = spaces
                     go to stp-cor-doc-ico-999.
       stp-cor-doc-ico-200.
      *              *-------------------------------------------------*
      *              * Se tipo modulo non lo prevede : no              *
      *              *-------------------------------------------------*
           if        w-prs-sof-tmd        =    01
                     go to stp-cor-doc-ico-999.
       stp-cor-doc-ico-500.
      *              *-------------------------------------------------*
      *              * Indicatore di stampa da eseguire                *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-i10      .
       stp-cor-doc-ico-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Codice prodotto                  *
      *    *-----------------------------------------------------------*
       stp-cor-doc-cod-000.
      *              *-------------------------------------------------*
      *              * Se l'indicatore di stampa da eseguire indica di *
      *              * non stampare : uscita                           *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i10    not  = "S"
                     go to stp-cor-doc-cod-999.
       stp-cor-doc-cod-250.
      *              *-------------------------------------------------*
      *              * Preparazione del codice da stampare, a seconda  *
      *              * della personalizzazione                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se codice secondo il produttore             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test                                    *
      *                      *-----------------------------------------*
           if        w-prs-sof-cod        not  = "P"
                     go to stp-cor-doc-cod-300.
      *                      *-----------------------------------------*
      *                      * Normalizzazione record [aaq]            *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                      *-----------------------------------------*
      *                      * Lettura record [aaq]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      rf-ofr-tip-mag       to   rf-aaq-tip-mag         .
           move      rf-ofr-num-mag       to   rf-aaq-num-pro         .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                          *-------------------------------------*
      *                          * Test su esito lettura               *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-cor-doc-cod-500.
      *                          *-------------------------------------*
      *                          * Bufferizzazione codice letto        *
      *                          *-------------------------------------*
           move      rf-aaq-cdp-pdt       to   w-stp-cor-doc-cod      .
      *                      *-----------------------------------------*
      *                      * A test su codice                        *
      *                      *-----------------------------------------*
           go to     stp-cor-doc-cod-500.
       stp-cor-doc-cod-300.
           if        w-prs-sof-cod        =    "M"
                     move  rf-ofr-alf-mag to   w-stp-cor-doc-cod
           else if   w-prs-sof-cod        =    "F"
                     move  rf-ofr-cop-sfn to   w-stp-cor-doc-cod
           else      move  spaces         to   w-stp-cor-doc-cod      .
       stp-cor-doc-cod-500.
      *              *-------------------------------------------------*
      *              * Se codice da stampare a spaces : uscita         *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-cod    =    spaces
                     go to stp-cor-doc-cod-999.
       stp-cor-doc-cod-600.
      *              *-------------------------------------------------*
      *              * Flag di stampa eseguita in On                   *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-f10      .
       stp-cor-doc-cod-700.
      *              *-------------------------------------------------*
      *              * Stampa                                          *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-cod-pro-pos    to   p-pos                  .
           move      w-stp-cor-doc-cod    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-cod-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Determinazione indicatore stampa *
      *    *                          da eseguire per descrizione      *
      *    *-----------------------------------------------------------*
       stp-cor-doc-ide-000.
      *              *-------------------------------------------------*
      *              * Preparazione righe descrizione                  *
      *              *-------------------------------------------------*
       stp-cor-doc-ide-050.
      *                  *---------------------------------------------*
      *                  * Normalizzazione preliminare area descrizio- *
      *                  * ne                                          *
      *                  *---------------------------------------------*
           move      spaces               to   w-stp-cor-doc-der      .
       stp-cor-doc-ide-100.
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del flag di esten-   *
      *                  * sione                                       *
      *                  *---------------------------------------------*
           if        rf-ofr-des-ext       =    0
                     go to stp-cor-doc-ide-200
           else if   rf-ofr-des-ext       =    1
                     go to stp-cor-doc-ide-300
           else if   rf-ofr-des-ext       =    2
                     go to stp-cor-doc-ide-400
           else if   rf-ofr-des-ext       =    3
                     go to stp-cor-doc-ide-500
           else      go to stp-cor-doc-ide-200.
       stp-cor-doc-ide-200.
      *                  *---------------------------------------------*
      *                  * Se flag di estensione : 0                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Descrizione contenuta nel record [ofr]  *
      *                      * in 1. riga di descrizione               *
      *                      *-----------------------------------------*
           move      rf-ofr-des-rig       to   w-stp-cor-doc-rgd (01) .
      *                      *-----------------------------------------*
      *                      * A determinazione righe aggiuntive       *
      *                      *-----------------------------------------*
           go to     stp-cor-doc-ide-600.
       stp-cor-doc-ide-300.
      *                  *---------------------------------------------*
      *                  * Se flag di estensione : 1                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura descrizione da file [ofx]       *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-inp-mst-prt        to   rf-ofx-num-prt         .
           move      rf-ofr-num-prg       to   rf-ofx-num-prg         .
           move      11                   to   rf-ofx-tip-rec         .
           move      "pgm/orf/fls/ioc/obj/iofofx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ofx                 .
      *                      *-----------------------------------------*
      *                      * Se record non trovato : si lascia la    *
      *                      * descrizione normalizzata a spaces e si  *
      *                      * va' alla determinazione delle righe ag- *
      *                      * giuntive                                *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-cor-doc-ide-600.
      *                      *-----------------------------------------*
      *                      * Bufferizzazione righe descrizione       *
      *                      *-----------------------------------------*
           move      rf-ofx-rig-400 (01)  to   w-stp-cor-doc-rgd (01) .
           move      rf-ofx-rig-400 (02)  to   w-stp-cor-doc-rgd (02) .
           move      rf-ofx-rig-400 (03)  to   w-stp-cor-doc-rgd (03) .
           move      rf-ofx-rig-400 (04)  to   w-stp-cor-doc-rgd (04) .
           move      rf-ofx-rig-400 (05)  to   w-stp-cor-doc-rgd (05) .
           move      rf-ofx-rig-400 (06)  to   w-stp-cor-doc-rgd (06) .
           move      rf-ofx-rig-400 (07)  to   w-stp-cor-doc-rgd (07) .
           move      rf-ofx-rig-400 (08)  to   w-stp-cor-doc-rgd (08) .
           move      rf-ofx-rig-400 (09)  to   w-stp-cor-doc-rgd (09) .
           move      rf-ofx-rig-400 (10)  to   w-stp-cor-doc-rgd (10) .
      *                      *-----------------------------------------*
      *                      * A determinazione righe aggiuntive       *
      *                      *-----------------------------------------*
           go to     stp-cor-doc-ide-600.
       stp-cor-doc-ide-400.
      *                  *---------------------------------------------*
      *                  * Se flag di estensione : 2                   *
      *                  *---------------------------------------------*
       stp-cor-doc-ide-405.
      *                      *-----------------------------------------*
      *                      * Lettura descrizione da file [pdx], tipo *
      *                      * record 01                               *
      *                      *-----------------------------------------*
       stp-cor-doc-ide-410.
      *                          *-------------------------------------*
      *                          * Se il tipo codice di magazzino non  *
      *                          * indica un prodotto finito: si la-   *
      *                          * scia la descrizione normalizzata a  *
      *                          * spaces e si va' alla determinazione *
      *                          * delle righe aggiuntive              *
      *                          *-------------------------------------*
           if        rf-ofr-tip-mag       not  = 01
                     go to stp-cor-doc-ide-600.
       stp-cor-doc-ide-415.
      *                          *-------------------------------------*
      *                          * Contatore righe : a zero            *
      *                          *-------------------------------------*
           move      zero                 to   w-stp-cor-doc-ctr      .
       stp-cor-doc-ide-420.
      *                          *-------------------------------------*
      *                          * Start su file [pdx]                 *
      *                          *-------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "TRCLNG"             to   f-key                  .
           if        rf-oft-cod-lng       not  = "I  "
                     move  02             to   rf-pdx-tip-rec
           else      move  01             to   rf-pdx-tip-rec         .
           move      zero                 to   rf-pdx-cod-arc         .
           move      rf-oft-cod-lng       to   rf-pdx-cod-lng         .
           move      rf-ofr-num-mag       to   rf-pdx-cod-num         .
           move      spaces               to   rf-pdx-for-mat         .
           move      zero                 to   rf-pdx-num-prg         .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *                          *-------------------------------------*
      *                          * Se errore su start : si lascia la   *
      *                          * descrizione normalizzata a spaces   *
      *                          * e si va' alla determinazione delle  *
      *                          * righe aggiuntive                    *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-cor-doc-ide-600.
       stp-cor-doc-ide-425.
      *                          *-------------------------------------*
      *                          * Read next su file [pdx]             *
      *                          *-------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *                          *-------------------------------------*
      *                          * Se At end : a determinazione delle  *
      *                          * righe aggiuntive                    *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-cor-doc-ide-600.
       stp-cor-doc-ide-430.
      *                          *-------------------------------------*
      *                          * Test max su [pdx], se non superato  *
      *                          * : a determinazione righe aggiuntive *
      *                          *-------------------------------------*
           if        rf-oft-cod-lng       not  = "I  "
                     go to stp-cor-doc-ide-432.
       stp-cor-doc-ide-431.
           if        rf-pdx-tip-rec       not  = 01
                     go to stp-cor-doc-ide-600.
           go to     stp-cor-doc-ide-433.
       stp-cor-doc-ide-432.
           if        rf-pdx-tip-rec       not  = 02
                     go to stp-cor-doc-ide-600.
           go to     stp-cor-doc-ide-433.
       stp-cor-doc-ide-433.
           if        rf-pdx-cod-arc       not  = zero
                     go to stp-cor-doc-ide-600.
           if        rf-pdx-cod-lng       not  = rf-oft-cod-lng
                     go to stp-cor-doc-ide-600.
           if        rf-pdx-cod-num       not  = rf-ofr-num-mag
                     go to stp-cor-doc-ide-600.
           if        rf-pdx-for-mat       not  = spaces
                     go to stp-cor-doc-ide-600.
       stp-cor-doc-ide-435.
      *                          *-------------------------------------*
      *                          * Incremento contatore righe          *
      *                          *-------------------------------------*
           add       1                    to   w-stp-cor-doc-ctr      .
      *                          *-------------------------------------*
      *                          * Bufferizzazione riga di descrizione *
      *                          *-------------------------------------*
           move      rf-pdx-des-pro       to   w-stp-cor-doc-rgd
                                              (w-stp-cor-doc-ctr)     .
      *                          *-------------------------------------*
      *                          * Se raggiunto il massimo : a deter-  *
      *                          * minazione delle righe aggiuntive    *
      *                          *-------------------------------------*
           if        w-stp-cor-doc-ctr    =    10
                     go to stp-cor-doc-ide-600.
      *                          *-------------------------------------*
      *                          * Riciclo su read next su [pdx]       *
      *                          *-------------------------------------*
           go to     stp-cor-doc-ide-425.
       stp-cor-doc-ide-500.
      *                  *---------------------------------------------*
      *                  * Se flag di estensione : 3                   *
      *                  *---------------------------------------------*
       stp-cor-doc-ide-505.
      *                      *-----------------------------------------*
      *                      * Lettura descrizione da file [pdx], tipo *
      *                      * record 13 o 33 o 34                     *
      *                      *-----------------------------------------*
       stp-cor-doc-ide-510.
      *                          *-------------------------------------*
      *                          * Se il tipo codice di magazzino non  *
      *                          * indica ne' prodotto finito, ne' ma- *
      *                          * teria prima e ne' materiale vario : *
      *                          * si lascia la descrizione normaliz-  *
      *                          * zata a spaces e si va' alla deter-  *
      *                          * minazione delle righe aggiuntive    *
      *                          *-------------------------------------*
           if        rf-ofr-tip-mag       not  = 01 and
                     rf-ofr-tip-mag       not  = 03 and
                     rf-ofr-tip-mag       not  = 04
                     go to stp-cor-doc-ide-600.
       stp-cor-doc-ide-515.
      *                          *-------------------------------------*
      *                          * Contatore righe : a zero            *
      *                          *-------------------------------------*
           move      zero                 to   w-stp-cor-doc-ctr      .
       stp-cor-doc-ide-520.
      *                          *-------------------------------------*
      *                          * Start su file [pdx]                 *
      *                          *-------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "TRCLNG"             to   f-key                  .
           if        rf-ofr-tip-mag       =    01
                     move  13             to   rf-pdx-tip-rec
           else if   rf-ofr-tip-mag       =    03
                     move  33             to   rf-pdx-tip-rec
           else if   rf-ofr-tip-mag       =    04
                     move  43             to   rf-pdx-tip-rec         .
           move      rf-ofr-cod-arc       to   rf-pdx-cod-arc         .
           move      spaces               to   rf-pdx-cod-lng         .
           move      rf-ofr-num-mag       to   rf-pdx-cod-num         .
           move      rf-ofr-fda-pif       to   rf-pdx-for-mat         .
           move      zero                 to   rf-pdx-num-prg         .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *                          *-------------------------------------*
      *                          * Se errore su start : si lascia la   *
      *                          * descrizione normalizzata a spaces   *
      *                          * e si va' alla determinazione delle  *
      *                          * righe aggiuntive                    *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-cor-doc-ide-600.
       stp-cor-doc-ide-525.
      *                          *-------------------------------------*
      *                          * Read next su file [pdx]             *
      *                          *-------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdx"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdx                 .
      *                          *-------------------------------------*
      *                          * Se At end : a determinazione delle  *
      *                          * righe aggiuntive                    *
      *                          *-------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-cor-doc-ide-600.
       stp-cor-doc-ide-530.
      *                          *-------------------------------------*
      *                          * Test max su [pdx], se non superato  *
      *                          * : a determinazione righe aggiuntive *
      *                          *-------------------------------------*
           if        rf-ofr-tip-mag       =    01   and
                     rf-pdx-tip-rec       not  = 13
                     go to stp-cor-doc-ide-600.
           if        rf-ofr-tip-mag       =    03   and
                     rf-pdx-tip-rec       not  = 33
                     go to stp-cor-doc-ide-600.
           if        rf-ofr-tip-mag       =    04   and
                     rf-pdx-tip-rec       not  = 43
                     go to stp-cor-doc-ide-600.
           if        rf-pdx-cod-arc       not  = rf-ofr-cod-arc
                     go to stp-cor-doc-ide-600.
           if        rf-pdx-cod-lng       not  = spaces
                     go to stp-cor-doc-ide-600.
           if        rf-pdx-cod-num       not  = rf-ofr-num-mag
                     go to stp-cor-doc-ide-600.
           if        rf-pdx-for-mat       not  = rf-ofr-fda-pif
                     go to stp-cor-doc-ide-600.
       stp-cor-doc-ide-535.
      *                          *-------------------------------------*
      *                          * Incremento contatore righe          *
      *                          *-------------------------------------*
           add       1                    to   w-stp-cor-doc-ctr      .
      *                          *-------------------------------------*
      *                          * Bufferizzazione riga di descrizione *
      *                          *-------------------------------------*
           move      rf-pdx-des-pro       to   w-stp-cor-doc-rgd
                                              (w-stp-cor-doc-ctr)     .
      *                          *-------------------------------------*
      *                          * Se raggiunto il massimo : a deter-  *
      *                          * minazione delle righe aggiuntive    *
      *                          *-------------------------------------*
           if        w-stp-cor-doc-ctr    =    10
                     go to stp-cor-doc-ide-600.
      *                          *-------------------------------------*
      *                          * Riciclo su read next su [pdx]       *
      *                          *-------------------------------------*
           go to     stp-cor-doc-ide-525.
       stp-cor-doc-ide-600.
      *                  *---------------------------------------------*
      *                  * Determinazione righe aggiuntive             *
      *                  *---------------------------------------------*
       stp-cor-doc-ide-620.
      *                      *-----------------------------------------*
      *                      * Determinazione numero righe effettive   *
      *                      * di descrizione, con compattamento delle *
      *                      * righe vuote intermedie                  *
      *                      *-----------------------------------------*
           move      zero                 to   w-stp-cor-doc-ctr      .
       stp-cor-doc-ide-622.
           add       1                    to   w-stp-cor-doc-ctr      .
           if        w-stp-cor-doc-ctr    >    10
                     go to stp-cor-doc-ide-630.
           if        w-stp-cor-doc-rgd
                    (w-stp-cor-doc-ctr)   not  = spaces
                     go to stp-cor-doc-ide-622.
           move      w-stp-cor-doc-ctr    to   w-stp-cor-doc-c02      .
       stp-cor-doc-ide-624.
           add       1                    to   w-stp-cor-doc-c02      .
           if        w-stp-cor-doc-c02    >    10
                     go to stp-cor-doc-ide-630.
           if        w-stp-cor-doc-rgd
                    (w-stp-cor-doc-ctr)   =    spaces
                     go to stp-cor-doc-ide-624.
       stp-cor-doc-ide-626.
           move      w-stp-cor-doc-rgd
                    (w-stp-cor-doc-c02)   to   w-stp-cor-doc-rgd
                                              (w-stp-cor-doc-ctr)     .
           add       1                    to   w-stp-cor-doc-c02      .
           add       1                    to   w-stp-cor-doc-ctr      .
           if        w-stp-cor-doc-c02    not  > 10
                     go to stp-cor-doc-ide-626.
       stp-cor-doc-ide-628.
           move      spaces               to   w-stp-cor-doc-rgd
                                              (w-stp-cor-doc-ctr)     .
           add       1                    to   w-stp-cor-doc-ctr      .
           if        w-stp-cor-doc-ctr    >    10
                     go to stp-cor-doc-ide-620
           else      go to stp-cor-doc-ide-628.
       stp-cor-doc-ide-630.
           subtract  1                    from w-stp-cor-doc-ctr      .
       stp-cor-doc-ide-640.
      *                      *-----------------------------------------*
      *                      * Eventuale riga aggiuntiva per la nota   *
      *                      * sul prezzo di acquisto riferito ad u-   *
      *                      * nita' di misura diversa da quella in-   *
      *                      * dicata                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se il prezzo non e' da stampare :   *
      *                          * nessuna azione                      *
      *                          *-------------------------------------*
           if        w-stp-cor-doc-i50    not  = "S"
                     go to stp-cor-doc-ide-650.
      *                          *-------------------------------------*
      *                          * Se il tipo trasformazione unita'    *
      *                          * di misura e' diverso da 'P' : nes-  *
      *                          * suna azione                         *
      *                          *-------------------------------------*
           if        rf-ofr-snx-tum       not  = "P"
                     go to stp-cor-doc-ide-650.
      *                          *-------------------------------------*
      *                          * Se il prezzo e' a zero : nessuna    *
      *                          * azione                              *
      *                          *-------------------------------------*
           if        rf-ofr-prz-acq       =    zero
                     go to stp-cor-doc-ide-650.
      *                          *-------------------------------------*
      *                          * Se l'unita' di misura utilizzata    *
      *                          * dal fornitore e' a spaces : nessu-  *
      *                          * na azione                           *
      *                          *-------------------------------------*
           if        rf-ofr-umf-tum       =    spaces
                     go to stp-cor-doc-ide-650.
      *                          *-------------------------------------*
      *                          * Se l'unita' di misura utilizzata    *
      *                          * dal fornitore e' pari a quella u-   *
      *                          * tilizzata a magazzino : nessuna     *
      *                          * azione                              *
      *                          *-------------------------------------*
           if        rf-ofr-umf-tum       =    rf-ofr-umi-acq
                     go to stp-cor-doc-ide-650.
      *                          *-------------------------------------*
      *                          * Incremento numero righe effettive   *
      *                          *-------------------------------------*
           add       1                    to   w-stp-cor-doc-ctr      .
      *                          *-------------------------------------*
      *                          * Composizione riga aggiuntiva        *
      *                          *-------------------------------------*
           string    "  - Prezzo per : "
                                delimited by   size
                     rf-ofr-umf-tum
                                delimited by   size
                                          into w-stp-cor-doc-rgd
                                              (w-stp-cor-doc-ctr)     .
       stp-cor-doc-ide-650.
      *                      *-----------------------------------------*
      *                      * Eventuale riga aggiuntiva per la nota   *
      *                      * sulla quantita' di misura diversa da    *
      *                      * quella indicata                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se il tipo trasformazione unita'    *
      *                          * di misura e' diverso da 'S' : nes-  *
      *                          * suna azione                         *
      *                          *-------------------------------------*
           if        rf-ofr-snx-tum       not  = "S"
                     go to stp-cor-doc-ide-660.
      *                          *-------------------------------------*
      *                          * Se l'unita' di misura per l'acqui-  *
      *                          * sto e' a spaces : nessuna azione    *
      *                          *-------------------------------------*
           if        rf-ofr-umi-acq       =    spaces
                     go to stp-cor-doc-ide-660.
      *                          *-------------------------------------*
      *                          * Se l'unita' di misura utilizzata    *
      *                          * dal fornitore e' a spaces : nessu-  *
      *                          * na azione                           *
      *                          *-------------------------------------*
           if        rf-ofr-umf-tum       =    spaces
                     go to stp-cor-doc-ide-660.
      *                          *-------------------------------------*
      *                          * Se l'unita' di misura utilizzata    *
      *                          * dal fornitore e' pari a quella u-   *
      *                          * tilizzata a magazzino : nessuna     *
      *                          * azione                              *
      *                          *-------------------------------------*
           if        rf-ofr-umf-tum       =    rf-ofr-umi-acq
                     go to stp-cor-doc-ide-660.
      *                          *-------------------------------------*
      *                          * Incremento numero righe effettive   *
      *                          *-------------------------------------*
           add       1                    to   w-stp-cor-doc-ctr      .
      *                          *-------------------------------------*
      *                          * Editing preliminare della quantita' *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      rf-ofr-dec-qta       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GBD"               to   p-edm                  .
           move      rf-ofr-qta-ord       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Composizione riga aggiuntiva        *
      *                          *-------------------------------------*
           string    "  - Ns. quantita' : "
                                delimited by   size
                     p-edt
                                delimited by   spaces
                     " "        delimited by   size
                     rf-ofr-umi-acq
                                delimited by   size
                                          into w-stp-cor-doc-rgd
                                              (w-stp-cor-doc-ctr)     .
       stp-cor-doc-ide-660.
      *                      *-----------------------------------------*
      *                      * Eventuale riga aggiuntiva per il codice *
      *                      * per il fornitore                        *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se la personalizzazione non la pre- *
      *                          * vede : nessuna azione               *
      *                          *-------------------------------------*
           if        w-prs-sof-rac        not  = "F" and
                     w-prs-sof-rac        not  = "P" and
                     w-prs-sof-rac        not  = "E" and
                     w-prs-sof-rac        not  = "U"
                     go to stp-cor-doc-ide-680.
      *                          *-------------------------------------*
      *                          * Se il tipo codice di magazzino non  *
      *                          * indica ne' prodotto finito, ne' ma- *
      *                          * teria prima e ne' materiale vario : *
      *                          * nessuna azione                      *
      *                          *-------------------------------------*
           if        rf-ofr-tip-mag       not  = 01 and
                     rf-ofr-tip-mag       not  = 03 and
                     rf-ofr-tip-mag       not  = 04
                     go to stp-cor-doc-ide-680.
      *                          *-------------------------------------*
      *                          * Test se da stampare il codice per   *
      *                          * il produttore                       *
      *                          *-------------------------------------*
           if        w-prs-sof-rac        not  = "P"
                     go to stp-cor-doc-ide-670.
      *                              *---------------------------------*
      *                              * Normalizzazione record [aaq]    *
      *                              *---------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                              *---------------------------------*
      *                              * Lettura record [aaq]            *
      *                              *---------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      rf-ofr-tip-mag       to   rf-aaq-tip-mag         .
           move      rf-ofr-num-mag       to   rf-aaq-num-pro         .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *                                  *-----------------------------*
      *                                  * Test su esito lettura       *
      *                                  *-----------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-cor-doc-ide-675.
      *                                  *-----------------------------*
      *                                  * Test su codice letto        *
      *                                  *-----------------------------*
           if        rf-aaq-cdp-pdt       =    spaces
                     go to stp-cor-doc-ide-675.
      *                                  *-----------------------------*
      *                                  * Incremento numero righe     *
      *                                  *-----------------------------*
           add       1                    to   w-stp-cor-doc-ctr      .
      *                                  *-----------------------------*
      *                                  * Composizione riga           *
      *                                  *-----------------------------*
           if        rf-oft-cod-lng       =    "I  "
                     move  "- Vs. codice :"
                                          to   w-stp-cor-doc-pcf
           else      move  "- Your code :"
                                          to   w-stp-cor-doc-pcf      .
      *
           move      40                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      w-stp-cor-doc-pcf    to   w-all-str-cat (1)      .
           move      rf-aaq-cdp-pdt       to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-stp-cor-doc-rgd
                                              (w-stp-cor-doc-ctr)     .
      *                                  *-----------------------------*
      *                                  * A eventuale riga aggiuntiva *
      *                                  *-----------------------------*
           go to     stp-cor-doc-ide-675.
       stp-cor-doc-ide-670.
      *                          *-------------------------------------*
      *                          * Se il codice secondo il fornitore   *
      *                          * e' a spaces : nessuna azione        *
      *                          *-------------------------------------*
           if        rf-ofr-cop-sfn       =    spaces
                     go to stp-cor-doc-ide-675.
      *                          *-------------------------------------*
      *                          * Incremento numero righe effettive   *
      *                          *-------------------------------------*
           add       1                    to   w-stp-cor-doc-ctr      .
      *                          *-------------------------------------*
      *                          * Composizione riga aggiuntiva        *
      *                          *-------------------------------------*
           if        rf-oft-cod-lng       =    "I  "
                     move  "- Vs. codice :"
                                          to   w-stp-cor-doc-pcf
           else      move  "-Your code:"  to   w-stp-cor-doc-pcf      .
      *
           move      40                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      w-stp-cor-doc-pcf    to   w-all-str-cat (1)      .
           move      rf-ofr-cop-sfn       to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-stp-cor-doc-rgd
                                              (w-stp-cor-doc-ctr)     .
       stp-cor-doc-ide-675.
      *                      *-----------------------------------------*
      *                      * Eventuale riga aggiuntiva per il codice *
      *                      * EAN                                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se la personalizzazione non la pre- *
      *                          * vede : nessuna azione               *
      *                          *-------------------------------------*
           if        w-prs-sof-rac        not  = "U"
                     go to stp-cor-doc-ide-680.
      *                          *-------------------------------------*
      *                          * Se il tipo codice di magazzino non  *
      *                          * indica un prodotto finito : nessuna *
      *                          * azione                              *
      *                          *-------------------------------------*
           if        rf-ofr-tip-mag       not  = 01
                     go to stp-cor-doc-ide-680.
      *                          *-------------------------------------*
      *                          * Se il codice di magazzino e' zero : *
      *                          * nessuna azione                      *
      *                          *-------------------------------------*
           if        rf-ofr-num-mag       =    zero
                     go to stp-cor-doc-ide-680.
      *                          *-------------------------------------*
      *                          * Normalizzazione anagrafica prodotto *
      *                          *-------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                          *-------------------------------------*
      *                          * Lettura anagrafica prodotto         *
      *                          *-------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      rf-ofr-num-mag       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                          *-------------------------------------*
      *                          * Se il codice EAN e' a spaces :      *
      *                          * nessuna azione                      *
      *                          *-------------------------------------*
           if        rf-dcp-klb-pro       =    spaces
                     go to stp-cor-doc-ide-680.
      *                          *-------------------------------------*
      *                          * Incremento numero righe effettive   *
      *                          *-------------------------------------*
           add       1                    to   w-stp-cor-doc-ctr      .
      *                          *-------------------------------------*
      *                          * Composizione riga aggiuntiva        *
      *                          *-------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      "- EAN code:"        to   w-all-str-cat (1)      .
           move      rf-dcp-klb-pro       to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-stp-cor-doc-rgd
                                              (w-stp-cor-doc-ctr)     .
       stp-cor-doc-ide-680.
      *                      *-----------------------------------------*
      *                      * Eventuale riga aggiuntiva per il nostro *
      *                      * codice                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se la personalizzazione non la pre- *
      *                          * vede : nessuna azione               *
      *                          *-------------------------------------*
           if        w-prs-sof-rac        not  = "M" and
                     w-prs-sof-rac        not  = "E"
                     go to stp-cor-doc-ide-700.
      *                          *-------------------------------------*
      *                          * Se il tipo codice di magazzino non  *
      *                          * indica ne' prodotto finito, ne' ma- *
      *                          * teria prima e ne' materiale vario : *
      *                          * nessuna azione                      *
      *                          *-------------------------------------*
           if        rf-ofr-tip-mag       not  = 01 and
                     rf-ofr-tip-mag       not  = 03 and
                     rf-ofr-tip-mag       not  = 04
                     go to stp-cor-doc-ide-700.
      *                          *-------------------------------------*
      *                          * Se il nostro codice e' a spaces :   *
      *                          * nessuna azione                      *
      *                          *-------------------------------------*
           if        rf-ofr-alf-mag       =    spaces
                     go to stp-cor-doc-ide-700.
      *                          *-------------------------------------*
      *                          * Se si tratta di un prodotto di ven- *
      *                          * dita, ma il tipo funzionamento non  *
      *                          * e' a spaces : nessuna azione        *
      *                          *-------------------------------------*
           if        w-tip-rig-tpr        =    "P"  and
                     w-tip-rig-tfu        not  = spaces
                     go to stp-cor-doc-ide-700.
      *                          *-------------------------------------*
      *                          * Incremento numero righe effettive   *
      *                          *-------------------------------------*
           add       1                    to   w-stp-cor-doc-ctr      .
      *                          *-------------------------------------*
      *                          * Composizione riga aggiuntiva        *
      *                          *-------------------------------------*
           string    "  - Ns. codice : "
                                delimited by   size
                     rf-ofr-alf-mag
                                delimited by   size
                                          into w-stp-cor-doc-rgd
                                              (w-stp-cor-doc-ctr)     .
       stp-cor-doc-ide-700.
      *                      *-----------------------------------------*
      *                      * Fine righe aggiuntive                   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Se zero righe si forza 1            *
      *                          *-------------------------------------*
           if        w-stp-cor-doc-ctr    =    zero
                     move  1              to   w-stp-cor-doc-ctr      .
      *                          *-------------------------------------*
      *                          * A determinazione indicatore stampa  *
      *                          * da eseguire                         *
      *                          *-------------------------------------*
           go to     stp-cor-doc-ide-800.
       stp-cor-doc-ide-800.
      *              *-------------------------------------------------*
      *              * Determinazione indicatore stampa da eseguire    *
      *              *-------------------------------------------------*
       stp-cor-doc-ide-805.
      *                  *---------------------------------------------*
      *                  * Se posizionamento non esistente : no        *
      *                  *---------------------------------------------*
           if        w-lpc-des-pro-pos    =    zero
                     go to stp-cor-doc-ide-999.
       stp-cor-doc-ide-810.
      *                  *---------------------------------------------*
      *                  * Indicatore di stampa da eseguire            *
      *                  *---------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-i20      .
       stp-cor-doc-ide-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Prima riga descrizione           *
      *    *-----------------------------------------------------------*
       stp-cor-doc-d01-000.
      *              *-------------------------------------------------*
      *              * Se l'indicatore di stampa da eseguire indica di *
      *              * non stampare : uscita                           *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i20    not  = "S"
                     go to stp-cor-doc-d01-999.
       stp-cor-doc-d01-500.
      *              *-------------------------------------------------*
      *              * Se descrizione a spaces : uscita                *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-rgd (01)
                                          =    spaces
                     go to stp-cor-doc-d01-999.
       stp-cor-doc-d01-600.
      *              *-------------------------------------------------*
      *              * Flag di stampa eseguita in On                   *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-f20 (01) .
       stp-cor-doc-d01-700.
      *              *-------------------------------------------------*
      *              * Stampa                                          *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-des-pro-pos    to   p-pos                  .
           move      w-stp-cor-doc-rgd (01)
                                          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-d01-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Determinazione indicatore stampa *
      *    *                          da eseguire per quantita'        *
      *    *-----------------------------------------------------------*
       stp-cor-doc-iqt-000.
      *              *-------------------------------------------------*
      *              * Quantita' da stampare : a zero                  *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-cor-doc-qta      .
      *              *-------------------------------------------------*
      *              * Numero decimali quantita' da stampare : a zero  *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-cor-doc-dcq      .
      *              *-------------------------------------------------*
      *              * Se posizionamento non esistente : no            *
      *              *-------------------------------------------------*
           if        w-lpc-qta-ord-pos    =    zero
                     go to stp-cor-doc-iqt-999.
       stp-cor-doc-iqt-050.
      *              *-------------------------------------------------*
      *              * Se si tratta di una riga di commento o di adde- *
      *              * bito : no                                       *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "C" or
                     w-tip-rig-tpr        =    "A"
                     go to stp-cor-doc-iqt-999.
       stp-cor-doc-iqt-100.
      *              *-------------------------------------------------*
      *              * Se il tipo riga non indica ne' un prodotto fi-  *
      *              * nito ne' una materia prima e ne' un materiale   *
      *              * vario : no                                      *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        not  = "P" and
                     w-tip-rig-tpr        not  = "M" and
                     w-tip-rig-tpr        not  = "V"
                     go to stp-cor-doc-iqt-999.
       stp-cor-doc-iqt-150.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica una materia prima : si'  *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "M"
                     go to stp-cor-doc-iqt-500.
       stp-cor-doc-iqt-175.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica un materiale vario : si' *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "V"
                     go to stp-cor-doc-iqt-500.
       stp-cor-doc-iqt-200.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica un prodotto finito       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 1 o 2 : si'        *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    1 or
                     rf-ofr-epz-rgo       =    2
                     go to stp-cor-doc-iqt-500.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 3 : no             *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    3
                     go to stp-cor-doc-iqt-999.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 4 o 5              *
      *                  * - se quantita' diversa da 1 : si            *
      *                  * - se quantita' uguale a 1   : no            *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    4 or
                     rf-ofr-epz-rgo       =    5
                     if    rf-ofr-qta-fda =    1,000
                           go to stp-cor-doc-iqt-999
                     else  go to stp-cor-doc-iqt-500.
      *                  *---------------------------------------------*
      *                  * In ogni altro caso : si'                    *
      *                  *---------------------------------------------*
           go to     stp-cor-doc-iqt-500.
       stp-cor-doc-iqt-500.
      *              *-------------------------------------------------*
      *              * Indicatore di stampa da eseguire                *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-i30      .
      *              *-------------------------------------------------*
      *              * Determinazione quantita' da stampare            *
      *              *-------------------------------------------------*
           if        rf-ofr-snx-tum       =    "P"
                     move  rf-ofr-qta-ord to   w-stp-cor-doc-qta
           else if   rf-ofr-snx-tum       =    "S"
                     move  rf-ofr-qta-fda to   w-stp-cor-doc-qta
           else      move  rf-ofr-qta-ord to   w-stp-cor-doc-qta      .
      *              *-------------------------------------------------*
      *              * Determinazione numero decimali per quantita' da *
      *              * stampare                                        *
      *              *-------------------------------------------------*
           if        rf-ofr-snx-tum       =    "P"
                     move  rf-ofr-dec-qta to   w-stp-cor-doc-dcq
           else if   rf-ofr-snx-tum       =    "S"
                     move  rf-ofr-nde-tum to   w-stp-cor-doc-dcq
           else      move  rf-ofr-dec-qta to   w-stp-cor-doc-dcq      .
       stp-cor-doc-iqt-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Quantita'                        *
      *    *-----------------------------------------------------------*
       stp-cor-doc-qta-000.
      *              *-------------------------------------------------*
      *              * Se l'indicatore di stampa da eseguire indica di *
      *              * non stampare : uscita                           *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i30    not  = "S"
                     go to stp-cor-doc-qta-999.
       stp-cor-doc-qta-500.
      *              *-------------------------------------------------*
      *              * Se quantita' a zero : uscita                    *
      *              *-------------------------------------------------*
           if        rf-ofr-qta-fda       =    zero
                     go to stp-cor-doc-qta-999.
       stp-cor-doc-qta-600.
      *              *-------------------------------------------------*
      *              * Flag di stampa eseguita in On                   *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-f30      .
       stp-cor-doc-qta-700.
      *              *-------------------------------------------------*
      *              * Stampa                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test sulla personalizzazione che indica la  *
      *                  * richiesta di allineamento a destra della    *
      *                  * quantita'                                   *
      *                  *---------------------------------------------*
           if        w-prs-sof-snq        not  = "S"
                     go to stp-cor-doc-qta-800.
       stp-cor-doc-qta-750.
      *                  *---------------------------------------------*
      *                  * Se quantita' allineata a destra             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing preliminare della quantita'     *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      w-stp-cor-doc-dcq    to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GBD"               to   p-edm                  .
           move      w-stp-cor-doc-qta    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Allineamento a destra quantita'         *
      *                      *-----------------------------------------*
           move      11                   to   w-all-str-lun          .
           move      p-edt                to   w-all-str-alf          .
           perform   all-str-adx-000      thru all-str-adx-999        .
      *                      *-----------------------------------------*
      *                      * Stampa quantita' allineata a destra     *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-qta-ord-pos    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     stp-cor-doc-qta-900.
       stp-cor-doc-qta-800.
      *                  *---------------------------------------------*
      *                  * Se quantita' normale                        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           if        w-stp-cor-doc-qta    >    99999 or
                     w-stp-cor-doc-qta    <   -99999
                     move  06             to   p-car
           else      move  05             to   p-car                  .
           move      w-stp-cor-doc-dcq    to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           if        w-stp-cor-doc-qta    >    99999 or
                     w-stp-cor-doc-qta    <   -99999
                     move  "B"            to   p-edm
           else      move  "GB"           to   p-edm                  .
           move      spaces               to   p-msk                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-qta-ord-pos    to   p-pos                  .
           move      w-stp-cor-doc-qta    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Ad uscita                               *
      *                      *-----------------------------------------*
           go to     stp-cor-doc-qta-900.
       stp-cor-doc-qta-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-cor-doc-qta-999.
       stp-cor-doc-qta-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Determinazione indicatore stampa *
      *    *                          da eseguire per unita' di misura *
      *    *-----------------------------------------------------------*
       stp-cor-doc-ium-000.
      *              *-------------------------------------------------*
      *              * Unita' di misura da stampare : a spaces         *
      *              *-------------------------------------------------*
           move      spaces               to   w-stp-cor-doc-umi      .
      *              *-------------------------------------------------*
      *              * Se posizionamento non esistente : no            *
      *              *-------------------------------------------------*
           if        w-lpc-umi-acq-pos    =    zero
                     go to stp-cor-doc-ium-999.
       stp-cor-doc-ium-050.
      *              *-------------------------------------------------*
      *              * Se si tratta di una riga di commento o di adde- *
      *              * bito : no                                       *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "C" or
                     w-tip-rig-tpr        =    "A"
                     go to stp-cor-doc-ium-999.
       stp-cor-doc-ium-100.
      *              *-------------------------------------------------*
      *              * Se non c'e' stampa della quantita' : no         *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i30    =    spaces
                     go to stp-cor-doc-ium-999.
       stp-cor-doc-ium-500.
      *              *-------------------------------------------------*
      *              * Indicatore di stampa da eseguire                *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-i40      .
      *              *-------------------------------------------------*
      *              * Determinazione unita' di misura da stampare     *
      *              *-------------------------------------------------*
           if        rf-ofr-snx-tum       =    "P"
                     move  rf-ofr-umi-acq to   w-stp-cor-doc-umi
           else if   rf-ofr-snx-tum       =    "S"
                     move  rf-ofr-umf-tum to   w-stp-cor-doc-umi
           else      move  rf-ofr-umi-acq to   w-stp-cor-doc-umi      .
       stp-cor-doc-ium-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Unita' di misura                 *
      *    *-----------------------------------------------------------*
       stp-cor-doc-umi-000.
      *              *-------------------------------------------------*
      *              * Se l'indicatore di stampa da eseguire indica di *
      *              * non stampare : uscita                           *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i40    not  = "S"
                     go to stp-cor-doc-umi-999.
       stp-cor-doc-umi-500.
      *              *-------------------------------------------------*
      *              * Se unita' di misura a spaces : uscita           *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-umi    =    spaces
                     go to stp-cor-doc-umi-999
           else      go to stp-cor-doc-umi-600.
       stp-cor-doc-umi-600.
      *              *-------------------------------------------------*
      *              * Flag di stampa eseguita in On                   *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-f40      .
       stp-cor-doc-umi-700.
      *              *-------------------------------------------------*
      *              * Stampa unita' di misura                         *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-umi-acq-pos    to   p-pos                  .
           move      w-stp-cor-doc-umi    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-umi-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Determinazione indicatore stampa *
      *    *                          da eseguire per prezzo acquisto  *
      *    *-----------------------------------------------------------*
       stp-cor-doc-ipz-000.
      *              *-------------------------------------------------*
      *              * Se posizionamento non esistente : no            *
      *              *-------------------------------------------------*
           if        w-lpc-prz-acq-pos    =    zero
                     go to stp-cor-doc-ipz-999.
       stp-cor-doc-ipz-050.
      *              *-------------------------------------------------*
      *              * Se si tratta di una riga di commento o di adde- *
      *              * bito : no                                       *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "C" or
                     w-tip-rig-tpr        =    "A"
                     go to stp-cor-doc-ipz-999.
       stp-cor-doc-ipz-100.
      *              *-------------------------------------------------*
      *              * Se il tipo documento non prevede la stampa del  *
      *              * prezzo : no                                     *
      *              *-------------------------------------------------*
           if        rf-yof-snx-prz       not  = 01
                     go to stp-cor-doc-ipz-999.
       stp-cor-doc-ipz-150.
      *              *-------------------------------------------------*
      *              * Se il tipo riga non indica ne' un prodotto fi-  *
      *              * nito ne' una materia prima e ne' un materiale   *
      *              * vario : no                                      *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        not  = "P" and
                     w-tip-rig-tpr        not  = "M" and
                     w-tip-rig-tpr        not  = "V"
                     go to stp-cor-doc-ipz-999.
       stp-cor-doc-ipz-200.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica una materia prima : si'  *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "M"
                     go to stp-cor-doc-ipz-500.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica un materiale vario : si' *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "V"
                     go to stp-cor-doc-ipz-500.
       stp-cor-doc-ipz-250.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica un prodotto finito       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 1 : si'            *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    1
                     go to stp-cor-doc-ipz-500.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 2 : no             *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    2
                     go to stp-cor-doc-ipz-999.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 3 : no             *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    3
                     go to stp-cor-doc-ipz-999.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 4                  *
      *                  * - se quantita' diversa da 1 : si'           *
      *                  * - se quantita' uguale a 1   : no            *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    4
                     if    rf-ofr-qta-fda =    1,000
                           go to stp-cor-doc-ipz-999
                     else  go to stp-cor-doc-ipz-500.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 5 : no             *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    5
                     go to stp-cor-doc-ipz-999.
      *                  *---------------------------------------------*
      *                  * In ogni altro caso : si'                    *
      *                  *---------------------------------------------*
           go to     stp-cor-doc-ipz-500.
       stp-cor-doc-ipz-500.
      *              *-------------------------------------------------*
      *              * Indicatore di stampa da eseguire                *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-i50      .
       stp-cor-doc-ipz-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Prezzo di acquisto               *
      *    *-----------------------------------------------------------*
       stp-cor-doc-prz-000.
      *              *-------------------------------------------------*
      *              * Se l'indicatore di stampa da eseguire indica di *
      *              * non stampare : uscita                           *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i50    not  = "S"
                     go to stp-cor-doc-prz-999.
       stp-cor-doc-prz-500.
      *              *-------------------------------------------------*
      *              * Se prezzo di acquisto a zero : uscita           *
      *              *-------------------------------------------------*
           if        rf-ofr-prz-acq       =    zero
                     go to stp-cor-doc-prz-999.
       stp-cor-doc-prz-600.
      *              *-------------------------------------------------*
      *              * Flag di stampa eseguita in On                   *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-f50      .
       stp-cor-doc-prz-700.
      *              *-------------------------------------------------*
      *              * Stampa prezzo di acquisto                       *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           if        rf-ofr-prz-acq       >    99999999
                     move  09             to   p-car
           else      move  08             to   p-car                  .
           move      rf-ofr-dec-vpf       to   p-dec                  .
           add       rf-ofr-dec-prz       to   p-dec                  .
           move      spaces               to   p-sgn                  .
           if        rf-ofr-prz-acq       >    99999999
                     move  "B"            to   p-edm
           else      move  "GB"           to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-prz-acq-pos    to   p-pos                  .
           if        rf-ofr-prz-acq       >    99999999
                     add   1              to   p-pos                  .
           move      rf-ofr-prz-acq       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-prz-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Determinazione indicatore stampa *
      *    *                          da eseguire per importo          *
      *    *-----------------------------------------------------------*
       stp-cor-doc-iim-000.
      *              *-------------------------------------------------*
      *              * Se posizionamento non esistente : no            *
      *              *-------------------------------------------------*
           if        w-lpc-prz-acq-pos    =    zero
                     go to stp-cor-doc-iim-999.
       stp-cor-doc-iim-050.
      *              *-------------------------------------------------*
      *              * Se il tipo documento non prevede la stampa del  *
      *              * prezzo : no                                     *
      *              *-------------------------------------------------*
           if        rf-yof-snx-prz       not  = 01
                     go to stp-cor-doc-iim-999.
       stp-cor-doc-iim-100.
      *              *-------------------------------------------------*
      *              * Se il prezzo e' da stampare : no                *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i50    =    "S"
                     go to stp-cor-doc-iim-999.
       stp-cor-doc-iim-150.
      *              *-------------------------------------------------*
      *              * Se si tratta di una riga di commento : no       *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "C"
                     go to stp-cor-doc-iim-999.
       stp-cor-doc-iim-200.
      *              *-------------------------------------------------*
      *              * Se si tratta di una riga di addebito : si'      *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "A"
                     go to stp-cor-doc-iim-500.
       stp-cor-doc-iim-250.
      *              *-------------------------------------------------*
      *              * Se il tipo riga non indica ne' un prodotto fi-  *
      *              * nito ne' una materia prima ne' un materiale     *
      *              * vario : no                                      *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        not  = "P" and
                     w-tip-rig-tpr        not  = "M" and
                     w-tip-rig-tpr        not  = "V"
                     go to stp-cor-doc-iim-999.
       stp-cor-doc-iim-300.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica una materia prima : no   *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "M"
                     go to stp-cor-doc-iim-999.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica unmateriale vario : no   *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "V"
                     go to stp-cor-doc-iim-999.
       stp-cor-doc-iim-350.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica un prodotto finito       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 1 : no             *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    1
                     go to stp-cor-doc-iim-999.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 2 : si'            *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    2
                     go to stp-cor-doc-iim-500.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 3 : si'            *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    3
                     go to stp-cor-doc-iim-500.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 4                  *
      *                  * - se quantita' uguale a 1   : si'           *
      *                  * - se quantita' diversa da 1 : no            *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    4
                     if    rf-ofr-qta-fda =    1,000
                           go to stp-cor-doc-iim-500
                     else  go to stp-cor-doc-iim-999.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 5 : si'            *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    5
                     go to stp-cor-doc-iim-500.
      *                  *---------------------------------------------*
      *                  * In ogni altro caso : no                     *
      *                  *---------------------------------------------*
           go to     stp-cor-doc-iim-999.
       stp-cor-doc-iim-500.
      *              *-------------------------------------------------*
      *              * Indicatore di stampa da eseguire                *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-i60      .
       stp-cor-doc-iim-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Importo                          *
      *    *-----------------------------------------------------------*
       stp-cor-doc-imp-000.
      *              *-------------------------------------------------*
      *              * Se l'indicatore di stampa da eseguire indica di *
      *              * non stampare : uscita                           *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i60    not  = "S"
                     go to stp-cor-doc-imp-999.
       stp-cor-doc-imp-500.
      *              *-------------------------------------------------*
      *              * Se importo a zero : uscita                      *
      *              *-------------------------------------------------*
           if        rf-ofr-imp-rig       =    zero
                     go to stp-cor-doc-imp-999.
       stp-cor-doc-imp-600.
      *              *-------------------------------------------------*
      *              * Flag di stampa eseguita in On                   *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-f60      .
       stp-cor-doc-imp-700.
      *              *-------------------------------------------------*
      *              * Stampa importo                                  *
      *              *-------------------------------------------------*
       stp-cor-doc-imp-720.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda dell'ammontare         *
      *                  *---------------------------------------------*
           if        rf-ofr-imp-rig       >    9999999999 or
                     rf-ofr-imp-rig       <   -9999999999
                     go to stp-cor-doc-imp-760.
       stp-cor-doc-imp-740.
      *                  *---------------------------------------------*
      *                  * Editing esteso                              *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      rf-ofr-dec-vpf       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "GB"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-prz-acq-pos    to   p-pos                  .
           move      rf-ofr-imp-rig       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     stp-cor-doc-imp-999.
       stp-cor-doc-imp-760.
      *                  *---------------------------------------------*
      *                  * Editing compatto                            *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      rf-ofr-dec-vpf       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "B"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-prz-acq-pos    to   p-pos                  .
           move      rf-ofr-imp-rig       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     stp-cor-doc-imp-999.
       stp-cor-doc-imp-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Determinazione indicatore stampa *
      *    *                          da eseguire per % sconto 1       *
      *    *-----------------------------------------------------------*
       stp-cor-doc-is1-000.
      *              *-------------------------------------------------*
      *              * Se posizionamento non esistente : no            *
      *              *-------------------------------------------------*
           if        w-lpc-per-scr-pos (1)
                                          =    zero
                     go to stp-cor-doc-is1-999.
       stp-cor-doc-is1-050.
      *              *-------------------------------------------------*
      *              * Se il tipo documento non prevede la stampa del- *
      *              * le percentuali di sconto : no                   *
      *              *-------------------------------------------------*
           if        rf-yof-snx-sco       not  = 01
                     go to stp-cor-doc-is1-999.
       stp-cor-doc-is1-100.
      *              *-------------------------------------------------*
      *              * Se il prezzo non e' da stampare : no            *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i50    =    spaces
                     go to stp-cor-doc-is1-999.
       stp-cor-doc-is1-150.
      *              *-------------------------------------------------*
      *              * Se l'importo e' da stampare : no                *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i60    =    "S"
                     go to stp-cor-doc-is1-999.
       stp-cor-doc-is1-200.
      *              *-------------------------------------------------*
      *              * Se si tratta di una riga di commento o di adde- *
      *              * bito : no                                       *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "C" or
                     w-tip-rig-tpr        =    "A"
                     go to stp-cor-doc-is1-999.
       stp-cor-doc-is1-250.
      *              *-------------------------------------------------*
      *              * Se il tipo riga non indica ne' un prodotto fi-  *
      *              * nito ne' una materia prima e ne' un materiale   *
      *              * vario : no                                      *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        not  = "P" and
                     w-tip-rig-tpr        not  = "M" and
                     w-tip-rig-tpr        not  = "V"
                     go to stp-cor-doc-is1-999.
       stp-cor-doc-is1-300.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica una materia prima : si'  *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "M"
                     go to stp-cor-doc-is1-500.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica un materiale vario : si' *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "V"
                     go to stp-cor-doc-is1-500.
       stp-cor-doc-is1-350.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica un prodotto finito       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 1 : si'            *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    1
                     go to stp-cor-doc-is1-500.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 2 : no             *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    2
                     go to stp-cor-doc-is1-999.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 3 : no             *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    3
                     go to stp-cor-doc-is1-999.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 4                  *
      *                  * - se quantita' diversa da 1 : si'           *
      *                  * - se quantita' uguale a 1   : no            *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    4
                     if    rf-ofr-qta-fda =    1,000
                           go to stp-cor-doc-is1-999
                     else  go to stp-cor-doc-is1-500.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 5 : no             *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    5
                     go to stp-cor-doc-is1-999.
      *                  *---------------------------------------------*
      *                  * In ogni altro caso : si'                    *
      *                  *---------------------------------------------*
           go to     stp-cor-doc-is1-500.
       stp-cor-doc-is1-500.
      *              *-------------------------------------------------*
      *              * Indicatore di stampa da eseguire                *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-i70 (1)  .
       stp-cor-doc-is1-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Percentuale di sconto 1          *
      *    *-----------------------------------------------------------*
       stp-cor-doc-sc1-000.
      *              *-------------------------------------------------*
      *              * Se l'indicatore di stampa da eseguire indica di *
      *              * non stampare : uscita                           *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i70 (1)
                                          not  = "S"
                     go to stp-cor-doc-sc1-999.
       stp-cor-doc-sc1-500.
      *              *-------------------------------------------------*
      *              * Se percentuale a zero : uscita                  *
      *              *-------------------------------------------------*
           if        rf-ofr-per-scr (1)   =    zero
                     go to stp-cor-doc-sc1-999.
       stp-cor-doc-sc1-600.
      *              *-------------------------------------------------*
      *              * Flag di stampa eseguita in On                   *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-f70 (1)  .
       stp-cor-doc-sc1-700.
      *              *-------------------------------------------------*
      *              * Stampa percentuale di sconto                    *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "BD"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-per-scr-pos (1)
                                          to   p-pos                  .
           move      rf-ofr-per-scr (1)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-sc1-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Determinazione indicatore stampa *
      *    *                          da eseguire per % sconto 2       *
      *    *-----------------------------------------------------------*
       stp-cor-doc-is2-000.
      *              *-------------------------------------------------*
      *              * Se posizionamento non esistente : no            *
      *              *-------------------------------------------------*
           if        w-lpc-per-scr-pos (2)
                                          =    zero
                     go to stp-cor-doc-is2-999.
      *              *-------------------------------------------------*
      *              * Altrimenti si pone pari all'indicatore di stam- *
      *              * pa da eseguire relativo alla % di sconto 1      *
      *              *-------------------------------------------------*
           move      w-stp-cor-doc-i70 (1)
                                          to   w-stp-cor-doc-i70 (2)  .
       stp-cor-doc-is2-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Percentuale di sconto 2          *
      *    *-----------------------------------------------------------*
       stp-cor-doc-sc2-000.
      *              *-------------------------------------------------*
      *              * Se l'indicatore di stampa da eseguire indica di *
      *              * non stampare : uscita                           *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i70 (2)
                                          not  = "S"
                     go to stp-cor-doc-sc2-999.
       stp-cor-doc-sc2-500.
      *              *-------------------------------------------------*
      *              * Se percentuale a zero : uscita                  *
      *              *-------------------------------------------------*
           if        rf-ofr-per-scr (2)   =    zero
                     go to stp-cor-doc-sc2-999.
       stp-cor-doc-sc2-600.
      *              *-------------------------------------------------*
      *              * Flag di stampa eseguita in On                   *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-f70 (2)  .
       stp-cor-doc-sc2-700.
      *              *-------------------------------------------------*
      *              * Stampa percentuale di sconto                    *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "BD"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-per-scr-pos (2)
                                          to   p-pos                  .
           move      rf-ofr-per-scr (2)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-sc2-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Determinazione indicatore stampa *
      *    *                          da eseguire per % sconto 3       *
      *    *-----------------------------------------------------------*
       stp-cor-doc-is3-000.
      *              *-------------------------------------------------*
      *              * Se posizionamento non esistente : no            *
      *              *-------------------------------------------------*
           if        w-lpc-per-scr-pos (3)
                                          =    zero
                     go to stp-cor-doc-is3-999.
      *              *-------------------------------------------------*
      *              * Altrimenti si pone pari all'indicatore di stam- *
      *              * pa da eseguire relativo alla % di sconto 1      *
      *              *-------------------------------------------------*
           move      w-stp-cor-doc-i70 (1)
                                          to   w-stp-cor-doc-i70 (3)  .
       stp-cor-doc-is3-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Percentuale di sconto 3          *
      *    *-----------------------------------------------------------*
       stp-cor-doc-sc3-000.
      *              *-------------------------------------------------*
      *              * Se l'indicatore di stampa da eseguire indica di *
      *              * non stampare : uscita                           *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i70 (3)
                                          not  = "S"
                     go to stp-cor-doc-sc3-999.
       stp-cor-doc-sc3-500.
      *              *-------------------------------------------------*
      *              * Se percentuale a zero : uscita                  *
      *              *-------------------------------------------------*
           if        rf-ofr-per-scr (3)   =    zero
                     go to stp-cor-doc-sc3-999.
       stp-cor-doc-sc3-600.
      *              *-------------------------------------------------*
      *              * Flag di stampa eseguita in On                   *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-f70 (3)  .
       stp-cor-doc-sc3-700.
      *              *-------------------------------------------------*
      *              * Stampa percentuale di sconto                    *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "BD"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-per-scr-pos (3)
                                          to   p-pos                  .
           move      rf-ofr-per-scr (3)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-sc3-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Determinazione indicatore stampa *
      *    *                          da eseguire per % sconto 4       *
      *    *-----------------------------------------------------------*
       stp-cor-doc-is4-000.
      *              *-------------------------------------------------*
      *              * Se posizionamento non esistente : no            *
      *              *-------------------------------------------------*
           if        w-lpc-per-scr-pos (4)
                                          =    zero
                     go to stp-cor-doc-is4-999.
      *              *-------------------------------------------------*
      *              * Altrimenti si pone pari all'indicatore di stam- *
      *              * pa da eseguire relativo alla % di sconto 1      *
      *              *-------------------------------------------------*
           move      w-stp-cor-doc-i70 (1)
                                          to   w-stp-cor-doc-i70 (4)  .
       stp-cor-doc-is4-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Percentuale di sconto 4          *
      *    *-----------------------------------------------------------*
       stp-cor-doc-sc4-000.
      *              *-------------------------------------------------*
      *              * Se l'indicatore di stampa da eseguire indica di *
      *              * non stampare : uscita                           *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i70 (4)
                                          not  = "S"
                     go to stp-cor-doc-sc4-999.
       stp-cor-doc-sc4-500.
      *              *-------------------------------------------------*
      *              * Se percentuale a zero : uscita                  *
      *              *-------------------------------------------------*
           if        rf-ofr-per-scr (4)   =    zero
                     go to stp-cor-doc-sc4-999.
       stp-cor-doc-sc4-600.
      *              *-------------------------------------------------*
      *              * Flag di stampa eseguita in On                   *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-f70 (4)  .
       stp-cor-doc-sc4-700.
      *              *-------------------------------------------------*
      *              * Stampa percentuale di sconto                    *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "BD"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-per-scr-pos (4)
                                          to   p-pos                  .
           move      rf-ofr-per-scr (4)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-sc4-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Determinazione indicatore stampa *
      *    *                          da eseguire per % sconto 5       *
      *    *-----------------------------------------------------------*
       stp-cor-doc-is5-000.
      *              *-------------------------------------------------*
      *              * Se posizionamento non esistente : no            *
      *              *-------------------------------------------------*
           if        w-lpc-per-scr-pos (5)
                                          =    zero
                     go to stp-cor-doc-is5-999.
      *              *-------------------------------------------------*
      *              * Altrimenti si pone pari all'indicatore di stam- *
      *              * pa da eseguire relativo alla % di sconto 1      *
      *              *-------------------------------------------------*
           move      w-stp-cor-doc-i70 (1)
                                          to   w-stp-cor-doc-i70 (5)  .
       stp-cor-doc-is5-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Percentuale di sconto 5          *
      *    *-----------------------------------------------------------*
       stp-cor-doc-sc5-000.
      *              *-------------------------------------------------*
      *              * Se l'indicatore di stampa da eseguire indica di *
      *              * non stampare : uscita                           *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i70 (5)
                                          not  = "S"
                     go to stp-cor-doc-sc5-999.
       stp-cor-doc-sc5-500.
      *              *-------------------------------------------------*
      *              * Se percentuale a zero : uscita                  *
      *              *-------------------------------------------------*
           if        rf-ofr-per-scr (5)   =    zero
                     go to stp-cor-doc-sc5-999.
       stp-cor-doc-sc5-600.
      *              *-------------------------------------------------*
      *              * Flag di stampa eseguita in On                   *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-f70 (5)  .
       stp-cor-doc-sc5-700.
      *              *-------------------------------------------------*
      *              * Stampa percentuale di sconto                    *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "BD"                 to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-per-scr-pos (5)
                                          to   p-pos                  .
           move      rf-ofr-per-scr (5)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-sc5-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Determinazione indicatore stampa *
      *    *                          da eseguire per data di consegna *
      *    *-----------------------------------------------------------*
       stp-cor-doc-idc-000.
      *              *-------------------------------------------------*
      *              * Se posizionamento non esistente : no            *
      *              *-------------------------------------------------*
           if        w-lpc-dat-cns-pos    =    zero
                     go to stp-cor-doc-idc-999.
       stp-cor-doc-idc-050.
      *              *-------------------------------------------------*
      *              * Se il tipo documento non prevede la stampa del- *
      *              * la data di consegna : no                        *
      *              *-------------------------------------------------*
           if        rf-yof-snx-dtc       not  = 01
                     go to stp-cor-doc-idc-999.
       stp-cor-doc-idc-100.
      *              *-------------------------------------------------*
      *              * Se il tipo riga non indica ne' un prodotto fi-  *
      *              * nito, ne' una materia prima, ne' un materiale   *
      *              * vario, ne' una riga di addebito : no            *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        not  = "P" and
                     w-tip-rig-tpr        not  = "M" and
                     w-tip-rig-tpr        not  = "V" and
                     w-tip-rig-tpr        not  = "A"
                     go to stp-cor-doc-idc-999.
       stp-cor-doc-idc-500.
      *              *-------------------------------------------------*
      *              * Indicatore di stampa da eseguire                *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-i80      .
       stp-cor-doc-idc-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Determinazione del volume in     *
      *    *                          riga                             *
      *    *-----------------------------------------------------------*
       stp-cor-doc-dvr-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valore in uscita                *
      *              *-------------------------------------------------*
           move      zero                 to   w-stp-cor-doc-tvr      .
      *              *-------------------------------------------------*
      *              * Test se necessario                              *
      *              *-------------------------------------------------*
           if        rf-yof-snx-stv       not  = "S"
                     go to stp-cor-doc-dvr-900.
       stp-cor-doc-dvr-100.
      *              *-------------------------------------------------*
      *              * Se si tratta di una riga di commento o di adde- *
      *              * bito : no                                       *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "C" or
                     w-tip-rig-tpr        =    "A"
                     go to stp-cor-doc-dvr-900.
       stp-cor-doc-ico-150.
      *              *-------------------------------------------------*
      *              * Se il tipo prodotto non e' pari a 'P': no       *
      *              *                                                 *
      *              * N.B.: Attualmente implementato solo per riga di *
      *              *       prodotto                                  *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        not  = "P"
                     go to stp-cor-doc-dvr-900.
       stp-cor-doc-dvr-175.
      *              *-------------------------------------------------*
      *              * Se quantita' in ordine a zero : no              *
      *              *                                                 *
      *              * N.B.: Non si considera la trasformazione di     *
      *              *       unita' di misura                          *
      *              *-------------------------------------------------*
           if        rf-ofr-qta-ord       =    zero
                     go to stp-cor-doc-dvr-900.
       stp-cor-doc-ico-200.
      *              *-------------------------------------------------*
      *              * Normalizzazione anagrafica prodotto             *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * Lettura anagrafica prodotto                     *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      rf-ofr-num-mag       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * Determinazione del volume in riga               *
      *              *                                                 *
      *              * N.B.: Attualmente il calcolo avviene secondo la *
      *              *       formula :                                 *
      *              *                                                 *
      *              *       (VOLUME PRODOTTO :                        *
      *              *        QTA' PER CONFEZIONE) x QTA' ORDINATA     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Eventuale normalizzazione confezione        *
      *                  *---------------------------------------------*
           if        rf-dcp-qta-cfz       =    zero
                     move  1              to   rf-dcp-qta-cfz         .
           divide    rf-dcp-qta-cfz       into rf-ofr-qta-ord
                                        giving w-stp-cor-doc-tvr      .
           multiply  rf-dcp-vol-uni       by   w-stp-cor-doc-tvr      .
      *                  *---------------------------------------------*
      *                  * Incremento totale volume                    *
      *                  *---------------------------------------------*
           add       w-stp-cor-doc-tvr    to   w-stp-pie-tvo          .
       stp-cor-doc-dvr-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-cor-doc-dvr-999.
       stp-cor-doc-dvr-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Data di consegna                 *
      *    *-----------------------------------------------------------*
       stp-cor-doc-dtc-000.
      *              *-------------------------------------------------*
      *              * Se l'indicatore di stampa da eseguire indica di *
      *              * non stampare : uscita                           *
      *              *-------------------------------------------------*
           if        w-stp-cor-doc-i80    not  = "S"
                     go to stp-cor-doc-dtc-999.
       stp-cor-doc-dtc-500.
      *              *-------------------------------------------------*
      *              * Se data di consegna a zero : uscita             *
      *              *-------------------------------------------------*
           if        rf-ofr-dcn-ric       =   zero
                     go to stp-cor-doc-dtc-999.
       stp-cor-doc-dtc-600.
      *              *-------------------------------------------------*
      *              * Flag di stampa eseguita in On                   *
      *              *-------------------------------------------------*
           move      "S"                  to   w-stp-cor-doc-f80      .
       stp-cor-doc-dtc-700.
      *              *-------------------------------------------------*
      *              * Stampa data di consegna                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del formato di stam- *
      *                  * pa data consegna richiesta                  *
      *                  *---------------------------------------------*
           if        rf-ofr-fds-dcr       =    spaces
                     go to stp-cor-doc-dtc-710
           else if   rf-ofr-fds-dcr       =    "U"
                     go to stp-cor-doc-dtc-720
           else if   rf-ofr-fds-dcr       =    "A"
                     go to stp-cor-doc-dtc-730
           else if   rf-ofr-fds-dcr       =    "N"
                     go to stp-cor-doc-dtc-740.
       stp-cor-doc-dtc-710.
      *                  *---------------------------------------------*
      *                  * Formato di stampa data consegna richiesta : *
      *                  * Normale                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione del formato di   *
      *                      * stampa data consegna generale           *
      *                      *-----------------------------------------*
           if        rf-oft-fds-dtc       =    01
                     go to stp-cor-doc-dtc-712
           else if   rf-oft-fds-dtc       =    02
                     go to stp-cor-doc-dtc-714
           else if   rf-oft-fds-dtc       =    03
                     go to stp-cor-doc-dtc-716
           else if   rf-oft-fds-dtc       =    04
                     go to stp-cor-doc-dtc-718.
       stp-cor-doc-dtc-712.
      *                      *-----------------------------------------*
      *                      * Se formato di stampa 01 : gg/mm/aa      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-dat-cns-pos    to   p-pos                  .
           move      rf-ofr-dcn-ric       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     stp-cor-doc-dtc-999.
       stp-cor-doc-dtc-714.
      *                      *-----------------------------------------*
      *                      * Se formato di stampa 02 : mm/aa         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Data in area di ridefinizione       *
      *                          *-------------------------------------*
           move      rf-ofr-dcn-ric       to   s-dat                  .
      *                          *-------------------------------------*
      *                          * Se mese non compreso tra 1 e 12 :   *
      *                          * uscita senza alcuna azione          *
      *                          *-------------------------------------*
           if        s-mes                <    01 or
                     s-mes                >    12
                     go to stp-cor-doc-dtc-999.
      *                          *-------------------------------------*
      *                          * Editing data                        *
      *                          *-------------------------------------*
           move      spaces               to   w-stp-cor-doc-dce      .
           move      w-tbl-mes-des (s-mes)
                                          to   w-stp-cor-doc-dcm      .
           move      s-saa                to   w-stp-cor-doc-dca      .
           add       1900                 to   w-stp-cor-doc-dca      .
      *                          *-------------------------------------*
      *                          * Stampa data editata                 *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-dat-cns-pos    to   p-pos                  .
           move      w-stp-cor-doc-dce    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     stp-cor-doc-dtc-999.
       stp-cor-doc-dtc-716.
      *                      *-----------------------------------------*
      *                      * Se formato di stampa 03 : No stampa     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     stp-cor-doc-dtc-999.
       stp-cor-doc-dtc-718.
      *                      *-----------------------------------------*
      *                      * Formato di stampa richiesto : st/aaaa   *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Richiesta alla segreteria del nume- *
      *                          * ro della settimana nell'anno        *
      *                          *-------------------------------------*
           move      "SA"                 to   s-ope                  .
           move      rf-ofr-dcn-ric       to   s-dat                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *                          *-------------------------------------*
      *                          * Editing settimana nell'anno         *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      s-num                to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-dat-cns-set          .
      *                          *-------------------------------------*
      *                          * Editing anno data consegna          *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      rf-ofr-dcn-ric       to   s-dat                  .
           move      s-saa                to   p-num                  .
           add       1900                 to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-dat-cns-ann          .
      *                          *-------------------------------------*
      *                          * Composizione stringa                *
      *                          *-------------------------------------*
           move      07                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-dat-cns-set        to   w-all-str-cat (1)      .
           move      "/"                  to   w-all-str-cat (2)      .
           move      w-dat-cns-ann        to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-dat-cns-edt          .
      *                          *-------------------------------------*
      *                          * Stampa data editata                 *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      spaces               to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-dat-cns-pos    to   p-pos                  .
           move      w-dat-cns-edt        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Uscita                              *
      *                          *-------------------------------------*
           go to     stp-cor-doc-dtc-999.
       stp-cor-doc-dtc-720.
      *                  *---------------------------------------------*
      *                  * Formato di stampa data consegna richiesta : *
      *                  * Urgente                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Stampa literal 'Urgente'                *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-dat-cns-pos    to   p-pos                  .
           move      "Urgente "           to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     stp-cor-doc-dtc-999.
       stp-cor-doc-dtc-730.
      *                  *---------------------------------------------*
      *                  * Formato di stampa data consegna richiesta : *
      *                  * A.S.A.P.                                    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Stampa literal 'A.S.A.P.'               *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-dat-cns-pos    to   p-pos                  .
           move      "A.S.A.P."           to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     stp-cor-doc-dtc-999.
       stp-cor-doc-dtc-740.
      *                  *---------------------------------------------*
      *                  * Formato di stampa data consegna richiesta : *
      *                  * No stampa                                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Uscita                                  *
      *                      *-----------------------------------------*
           go to     stp-cor-doc-dtc-999.
       stp-cor-doc-dtc-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : Legame valutario                 *
      *    *-----------------------------------------------------------*
       stp-cor-doc-lvl-000.
      *              *-------------------------------------------------*
      *              * Se il tipo riga non indica ne' un prodotto fi-  *
      *              * nito, ne' una materia prima, ne' un materiale   *
      *              * vario : no                                      *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        not  = "P" and
                     w-tip-rig-tpr        not  = "M" and
                     w-tip-rig-tpr        not  = "V"
                     go to stp-cor-doc-lvl-999.
      *              *-------------------------------------------------*
      *              * Se non esiste la sigla valuta per il legame va- *
      *              * lutario : nessuna azione                        *
      *              *-------------------------------------------------*
           if        rf-ofr-sgl-vpl       =    spaces
                     go to stp-cor-doc-lvl-999.
      *              *-------------------------------------------------*
      *              * Se non esiste il posizionamento per la descri-  *
      *              * zione : nessuna azione                          *
      *              *-------------------------------------------------*
           if        w-lpc-des-pro-pos    =    zero
                     go to stp-cor-doc-lvl-999.
      *              *-------------------------------------------------*
      *              * Se il tipo documento non prevede la stampa del  *
      *              * prezzo : no                                     *
      *              *-------------------------------------------------*
           if        rf-yof-snx-prz       not  = 01
                     go to stp-cor-doc-lvl-999.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica una materia prima : si'  *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "M"
                     go to stp-cor-doc-lvl-500.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica un materiale vario : si' *
      *              *-------------------------------------------------*
           if        w-tip-rig-tpr        =    "V"
                     go to stp-cor-doc-lvl-500.
      *              *-------------------------------------------------*
      *              * Se il tipo riga indica un prodotto finito       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 1 : si'            *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    1
                     go to stp-cor-doc-lvl-500.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 2 : no             *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    2
                     go to stp-cor-doc-lvl-999.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 3 : no             *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    3
                     go to stp-cor-doc-lvl-999.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 4                  *
      *                  * - se quantita' diversa da 1 : si'           *
      *                  * - se quantita' uguale a 1   : no            *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    4
                     if    rf-ofr-qta-fda =    1,000
                           go to stp-cor-doc-lvl-999
                     else  go to stp-cor-doc-lvl-500.
      *                  *---------------------------------------------*
      *                  * Se tipo esposizione riga 5 : no             *
      *                  *---------------------------------------------*
           if        rf-ofr-epz-rgo       =    5
                     go to stp-cor-doc-lvl-999.
      *                  *---------------------------------------------*
      *                  * In ogni altro caso : si'                    *
      *                  *---------------------------------------------*
           go to     stp-cor-doc-lvl-500.
       stp-cor-doc-lvl-500.
      *              *-------------------------------------------------*
      *              * Stampa                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su righe corpo residue                 *
      *                  *---------------------------------------------*
           if        p-lnr                <    w-lpc-ult-rig-lin
                     go to stp-cor-doc-lvl-520.
      *                      *-----------------------------------------*
      *                      * Reintestazione documento                *
      *                      *-----------------------------------------*
           perform   rei-mod-tes-000      thru rei-mod-tes-999        .
      *                      *-----------------------------------------*
      *                      * Test su status di uscita                *
      *                      *-----------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to stp-cor-doc-lvl-520.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     stp-cor-doc-lvl-999.
       stp-cor-doc-lvl-520.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Composizione stringa                        *
      *                  *---------------------------------------------*
           move      spaces               to   w-stp-cor-doc-x40      .
           move      1                    to   w-stp-cor-doc-pnt      .
      *                      *-----------------------------------------*
      *                      * Prompt                                  *
      *                      *-----------------------------------------*
           string    "Legame: "
                                delimited by   size
                                          into w-stp-cor-doc-x40
                                  with pointer w-stp-cor-doc-pnt      .
      *                      *-----------------------------------------*
      *                      * Sigla valuta per legame                 *
      *                      *-----------------------------------------*
           string    rf-ofr-sgl-vpl
                                delimited by   spaces
                                          into w-stp-cor-doc-x40
                                  with pointer w-stp-cor-doc-pnt      .
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           string    " a "
                                delimited by   size
                                          into w-stp-cor-doc-x40
                                  with pointer w-stp-cor-doc-pnt      .
      *                          *-------------------------------------*
      *                          * Coefficiente di cambio di riferi-   *
      *                          * mento                               *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing                         *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      05                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<D"                 to   p-edm                  .
           move      rf-ofr-ccr-vpl       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * String                          *
      *                              *---------------------------------*
           string    p-edt
                                delimited by   spaces
                                          into w-stp-cor-doc-x40
                                  with pointer w-stp-cor-doc-pnt      .
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           string    " +/- "
                                delimited by   size
                                          into w-stp-cor-doc-x40
                                  with pointer w-stp-cor-doc-pnt      .
      *                          *-------------------------------------*
      *                          * Percentuale di limitazione          *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Editing                         *
      *                              *---------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<D"                 to   p-edm                  .
           move      rf-ofr-plm-vpl       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * String                          *
      *                              *---------------------------------*
           string    p-edt
                                delimited by   spaces
                     "%"        delimited by   size
                                          into w-stp-cor-doc-x40
                                  with pointer w-stp-cor-doc-pnt      .
       stp-cor-doc-lvl-540.
      *                          *-------------------------------------*
      *                          * Tipo di limitazione                 *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Deviazione in funzione del va-  *
      *                              * lore                            *
      *                              *---------------------------------*
           if        rf-ofr-tlm-vpl       =    "T"
                     go to stp-cor-doc-lvl-542
           else if   rf-ofr-tlm-vpl       =    "F"
                     go to stp-cor-doc-lvl-544
           else if   rf-ofr-tlm-vpl       =    "M"
                     go to stp-cor-doc-lvl-546
           else      go to stp-cor-doc-lvl-560.
       stp-cor-doc-lvl-542.
      *                          *-------------------------------------*
      *                          * Tipo di limitazione : Tolleranza    *
      *                          *-------------------------------------*
           go to     stp-cor-doc-lvl-560.
       stp-cor-doc-lvl-544.
      *                          *-------------------------------------*
      *                          * Tipo di limitazione : Franchigia    *
      *                          *-------------------------------------*
           string    " Fr."
                                delimited by   size
                                          into w-stp-cor-doc-x40
                                  with pointer w-stp-cor-doc-pnt      .
           go to     stp-cor-doc-lvl-560.
       stp-cor-doc-lvl-546.
      *                          *-------------------------------------*
      *                          * Tipo di limitazione : Tetto massimo *
      *                          *-------------------------------------*
           string    " Max"
                                delimited by   size
                                          into w-stp-cor-doc-x40
                                  with pointer w-stp-cor-doc-pnt      .
           go to     stp-cor-doc-lvl-560.
       stp-cor-doc-lvl-560.
      *                  *---------------------------------------------*
      *                  * Stampa stringa                              *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-des-pro-pos    to   p-pos                  .
           move      w-stp-cor-doc-x40    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-lvl-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento : stampa spese in fatturazione     *
      *    *-----------------------------------------------------------*
       stp-cor-doc-spe-000.
      *              *-------------------------------------------------*
      *              * Trattamento spese in fattura                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo per 6 spese                           *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-cor-doc-c01      .
       stp-cor-doc-spe-200.
           add       1                    to   w-stp-cor-doc-c01      .
           if        w-stp-cor-doc-c01    >    6
                     go to stp-cor-doc-spe-900.
      *                  *---------------------------------------------*
      *                  * Test su personalizzazione                   *
      *                  *---------------------------------------------*
           if        w-prs-sof-sns
                    (w-stp-cor-doc-c01)   not  = "S"
                     go to stp-cor-doc-spe-200.
      *                  *---------------------------------------------*
      *                  * Se spesa non addebitata : riciclo           *
      *                  *---------------------------------------------*
           if        rf-oft-spe-snx
                    (w-stp-cor-doc-c01)   =    zero
                     go to stp-cor-doc-spe-200.
      *                  *---------------------------------------------*
      *                  * Se spesa a zero : riciclo                   *
      *                  *---------------------------------------------*
           if        rf-oft-spe-imp
                    (w-stp-cor-doc-c01)   =    zero
                     go to stp-cor-doc-spe-200.
      *                  *---------------------------------------------*
      *                  * Test su righe corpo residue                 *
      *                  *---------------------------------------------*
           if        p-lnr                <    w-lpc-ult-rig-lin
                     go to stp-cor-doc-spe-300.
      *                      *-----------------------------------------*
      *                      * Reintestazione documento                *
      *                      *-----------------------------------------*
           perform   rei-mod-tes-000      thru rei-mod-tes-999        .
      *                      *-----------------------------------------*
      *                      * Test su status di uscita                *
      *                      *-----------------------------------------*
           if        w-out-mst-stp        =    spaces
                     go to stp-cor-doc-spe-300.
           move      spaces               to   w-out-mst              .
           perform   wrt-out-mst-000      thru wrt-out-mst-999        .
           go to     stp-cor-doc-spe-999.
       stp-cor-doc-spe-300.
      *                  *---------------------------------------------*
      *                  * Interlinea                                  *
      *                  *---------------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Composizione stringa                        *
      *                  *---------------------------------------------*
           move      w-stp-cor-doc-c01    to   w-det-des-ysf-cod      .
           move      rf-oft-cod-lng       to   w-det-des-ysf-lng      .
           perform   det-des-ysf-000      thru det-des-ysf-999        .
           if        w-det-des-ysf-des    =    spaces
                     move  "Spesa aggiuntiva                        "
                                          to   w-stp-cor-doc-spf
           else      move  w-det-des-ysf-des
                                          to   w-stp-cor-doc-spf      .
      *                  *---------------------------------------------*
      *                  * Composizione stringa                        *
      *                  *---------------------------------------------*
           move      spaces               to   w-stp-cor-doc-x40      .
           move      1                    to   w-stp-cor-doc-pnt      .
      *                      *-----------------------------------------*
      *                      * Literal fisso                           *
      *                      *-----------------------------------------*
           string    w-stp-cor-doc-spf
                                delimited by   size
                                          into w-stp-cor-doc-x40
                                  with pointer w-stp-cor-doc-pnt      .
      *                      *-----------------------------------------*
      *                      * Riposizionamento puntatore              *
      *                      *-----------------------------------------*
           move      zero                 to   w-stp-cor-doc-pnt      .
           inspect   w-stp-cor-doc-x40
                                      tallying w-stp-cor-doc-pnt
                                          for  trailing spaces        .
           subtract  40                   from w-stp-cor-doc-pnt      .
           add       1                    to   w-stp-cor-doc-pnt      .
      *                      *-----------------------------------------*
      *                      * Due punti                               *
      *                      *-----------------------------------------*
           string    " : "
                                delimited by   size
                                          into w-stp-cor-doc-x40
                                  with pointer w-stp-cor-doc-pnt      .
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda che esista o meno  *
      *                      * la percentuale                          *
      *                      *-----------------------------------------*
           if        rf-oft-spe-per
                    (w-stp-cor-doc-c01)   =    zero
                     go to stp-cor-doc-spe-400
           else      go to stp-cor-doc-spe-500.
       stp-cor-doc-spe-400.
      *                      *-----------------------------------------*
      *                      * Se percentuale non esistente            *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Editing importo                     *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "V"                  to   p-tip                  .
           move      09                   to   p-car                  .
           move      rf-oft-dec-vpf       to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "G<"                 to   p-edm                  .
           move      rf-oft-spe-imp
                    (w-stp-cor-doc-c01)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * String importo editato              *
      *                          *-------------------------------------*
           string    p-edt      delimited by   spaces
                                          into w-stp-cor-doc-x40
                                  with pointer w-stp-cor-doc-pnt      .
           go to     stp-cor-doc-spe-600.
       stp-cor-doc-spe-500.
      *                      *-----------------------------------------*
      *                      * Se percentuale esistente                *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Editing percentuale                 *
      *                          *-------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      02                   to   p-car                  .
           move      01                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<D"                 to   p-edm                  .
           move      rf-oft-spe-per
                    (w-stp-cor-doc-c01)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * String percentuale editata          *
      *                          *-------------------------------------*
           string    p-edt      delimited by   spaces
                     "%"        delimited by   size
                                          into w-stp-cor-doc-x40
                                  with pointer w-stp-cor-doc-pnt      .
           go to     stp-cor-doc-spe-600.
       stp-cor-doc-spe-600.
      *                  *---------------------------------------------*
      *                  * Stampa descrizione                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se posizionamento esistente        *
      *                      *-----------------------------------------*
           if        w-lpc-des-pro-pos    =    zero
                     go to stp-cor-doc-spe-800.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpc-des-pro-pos    to   p-pos                  .
           move      w-stp-cor-doc-x40    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-cor-doc-spe-800.
      *                  *---------------------------------------------*
      *                  * Riciclo su prossima spesa                   *
      *                  *---------------------------------------------*
           go to     stp-cor-doc-spe-200.
       stp-cor-doc-spe-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-cor-doc-spe-999.
       stp-cor-doc-spe-999.
           exit.

      *    *===========================================================*
      *    * Routine di stampa piede documento                         *
      *    *-----------------------------------------------------------*
       stp-pie-doc-000.
      *              *-------------------------------------------------*
      *              * Voci descrittive in ordine                      *
      *              *-------------------------------------------------*
       stp-pie-doc-010.
      *                  *---------------------------------------------*
      *                  * Se posizionamento a zero : no stampa        *
      *                  *---------------------------------------------*
           if        w-lpp-voc-des-lin    =    zero or
                     w-lpp-voc-des-pos    =    zero
                     go to stp-pie-doc-200.
       stp-pie-doc-020.
      *                  *---------------------------------------------*
      *                  * Inizializzazione contatore 1..6 per numero  *
      *                  * voce da esaminare                           *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-pie-c01          .
      *                  *---------------------------------------------*
      *                  * Inizializzazione contatore 1..6 per numero  *
      *                  * voce effettivamente stampata                *
      *                  *---------------------------------------------*
           move      zero                 to   w-stp-pie-c02          .
       stp-pie-doc-030.
      *                  *---------------------------------------------*
      *                  * Incremento contatore 1..6 per numero voce   *
      *                  * da esaminare                                *
      *                  *---------------------------------------------*
           add       1                    to   w-stp-pie-c01          .
      *                  *---------------------------------------------*
      *                  * Se oltre il massimo : fine stampa voci de-  *
      *                  * scrittive                                   *
      *                  *---------------------------------------------*
           if        w-stp-pie-c01        >    6
                     go to stp-pie-doc-200.
       stp-pie-doc-040.
      *                  *---------------------------------------------*
      *                  * Se la voce descrittiva in esame non e' da   *
      *                  * stampare, secondo le personalizzazioni :    *
      *                  * riciclo alla voce successiva                *
      *                  *---------------------------------------------*
           if        w-prs-sof-snv
                    (w-stp-pie-c01)       not  = "S"
                     go to stp-pie-doc-140.
       stp-pie-doc-050.
      *                  *---------------------------------------------*
      *                  * Se la voce descrittiva in esame e' a spaces *
      *                  * : riciclo alla voce successiva              *
      *                  *---------------------------------------------*
           if        rf-oft-voc-des
                    (w-stp-pie-c01)       =    spaces
                     go to stp-pie-doc-140.
       stp-pie-doc-060.
      *                  *---------------------------------------------*
      *                  * Lettura prompt voce descrittiva e bufferiz- *
      *                  * zazione in area di comodo                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura record [ydf] per il codice      *
      *                      * lingua 'I'                              *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODDEF"             to   f-key                  .
           move      w-stp-pie-c01        to   rf-ydf-num-def         .
           move      "I  "                to   rf-ydf-cod-lng         .
           move      "pgm/dcf/fls/ioc/obj/iofydf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ydf                 .
      *                      *-----------------------------------------*
      *                      * Se record [ydf] non esistente : si nor- *
      *                      * malizza il valore a spaces              *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     move  spaces         to   rf-ydf-des-stp         .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione del valore in area di   *
      *                      * comodo                                  *
      *                      *-----------------------------------------*
           move      rf-ydf-des-stp       to   w-stp-pie-pvd          .
      *                      *-----------------------------------------*
      *                      * Lettura record [ydf] per il codice      *
      *                      * nel caso forse diverso da 'I'           *
      *                      *-----------------------------------------*
           if        rf-oft-cod-lng       =    "I  "
                     go to stp-pie-doc-070.
           move      "RK"                 to   f-ope                  .
           move      "CODDEF"             to   f-key                  .
           move      w-stp-pie-c01        to   rf-ydf-num-def         .
           move      rf-oft-cod-lng       to   rf-ydf-cod-lng         .
           move      "pgm/dcf/fls/ioc/obj/iofydf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ydf                 .
      *                      *-----------------------------------------*
      *                      * Se record [ydf] non esistente : si con- *
      *                      * serva il valore letto con 'I'           *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-pie-doc-070.
      *                      *-----------------------------------------*
      *                      * Bufferizzazione del valore in area di   *
      *                      * comodo                                  *
      *                      *-----------------------------------------*
           move      rf-ydf-des-stp       to   w-stp-pie-pvd          .
       stp-pie-doc-070.
      *                  *---------------------------------------------*
      *                  * Se il prompt per la voce descrittiva in e-  *
      *                  * same e' a spaces : riciclo alla voce suc-   *
      *                  * cessiva                                     *
      *                  *---------------------------------------------*
           if        w-stp-pie-pvd        =    spaces
                     go to stp-pie-doc-140.
       stp-pie-doc-080.
      *                  *---------------------------------------------*
      *                  * Lettura valore voce descrittiva e bufferiz- *
      *                  * zazione in area di comodo                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura record [yvf] per il codice      *
      *                      * lingua 'I'                              *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODVDF"             to   f-key                  .
           move      w-stp-pie-c01        to   rf-yvf-num-def         .
           move      rf-oft-voc-des
                    (w-stp-pie-c01)       to   rf-yvf-cod-def         .
           move      "I  "                to   rf-yvf-cod-lng         .
           move      "pgm/dcf/fls/ioc/obj/iofyvf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yvf                 .
      *                      *-----------------------------------------*
      *                      * Se record [yvf] non esistente : si nor- *
      *                      * malizza il valore a spaces              *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     move  spaces         to   rf-yvf-des-stp         .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione del valore in area di   *
      *                      * comodo                                  *
      *                      *-----------------------------------------*
           move      rf-yvf-des-stp       to   w-stp-pie-vvd          .
       stp-pie-doc-085.
      *                      *-----------------------------------------*
      *                      * Lettura record [yvf] per il codice      *
      *                      * lingua se diverso da 'I'                *
      *                      *-----------------------------------------*
           if        rf-oft-cod-lng       =    "I  "
                     go to stp-pie-doc-090.
           move      "RK"                 to   f-ope                  .
           move      "CODVDF"             to   f-key                  .
           move      w-stp-pie-c01        to   rf-yvf-num-def         .
           move      rf-oft-voc-des
                    (w-stp-pie-c01)       to   rf-yvf-cod-def         .
           move      rf-oft-cod-lng       to   rf-yvf-cod-lng         .
           move      "pgm/dcf/fls/ioc/obj/iofyvf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yvf                 .
      *                      *-----------------------------------------*
      *                      * Se record [yvf] non esistente : si con- *
      *                      * serva il valore letto con 'I'           *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-pie-doc-090.
      *                      *-----------------------------------------*
      *                      * Bufferizzazione del valore in area di   *
      *                      * comodo                                  *
      *                      *-----------------------------------------*
           move      rf-yvf-des-stp       to   w-stp-pie-vvd          .
       stp-pie-doc-090.
      *                  *---------------------------------------------*
      *                  * Se il valore per la voce descrittiva in e-  *
      *                  * same e' a spaces : riciclo alla voce suc-   *
      *                  * cessiva                                     *
      *                  *---------------------------------------------*
           if        w-stp-pie-vvd        =    spaces
                     go to stp-pie-doc-140.
       stp-pie-doc-100.
      *                  *---------------------------------------------*
      *                  * Incremento contatore 1..6 per numero voce   *
      *                  * descrittiva effettivamente stampata         *
      *                  *---------------------------------------------*
           add       1                    to   w-stp-pie-c02          .
       stp-pie-doc-110.
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale                    *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-lpp-voc-des-lin    to   p-lin                  .
           add       w-stp-pie-c02        to   p-lin                  .
           subtract  1                    from p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-pie-doc-120.
      *                  *---------------------------------------------*
      *                  * Composizione stringa da stampare            *
      *                  *---------------------------------------------*
           move      spaces               to   w-stp-pie-vde          .
           string    w-stp-pie-pvd
                                delimited by   size
                     " : "      delimited by   size
                     w-stp-pie-vvd
                                delimited by   size
                                          into w-stp-pie-vde          .
       stp-pie-doc-130.
      *                  *---------------------------------------------*
      *                  * Stampa prompt e valore                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-voc-des-pos    to   p-pos                  .
           move      w-stp-pie-vde        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-pie-doc-140.
      *                  *---------------------------------------------*
      *                  * Riciclo a voce descrittiva successiva       *
      *                  *---------------------------------------------*
           go to     stp-pie-doc-030.
       stp-pie-doc-200.
      *              *-------------------------------------------------*
      *              * Condizioni di acquisto                          *
      *              *-------------------------------------------------*
       stp-pie-doc-210.
      *                  *---------------------------------------------*
      *                  * Se posizionamento a zero : no stampa        *
      *                  *---------------------------------------------*
           if        w-lpp-cda-des-lin    =    zero or
                     w-lpp-cda-des-pos    =    zero
                     go to stp-pie-doc-400.
       stp-pie-doc-220.
      *                  *---------------------------------------------*
      *                  * Se codice a zero : si prende la descrizione *
      *                  * dal record di estensione gia' letto         *
      *                  *---------------------------------------------*
           if        rf-oft-cod-cda       =    zero
                     move  w-ext-des-cda  to   w-stp-pie-cda
                     go to stp-pie-doc-250.
       stp-pie-doc-230.
      *                  *---------------------------------------------*
      *                  * Lettura e bufferizzazione condizioni di ac- *
      *                  * quisto                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura record [yca]                    *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCDA    "         to   f-key                  .
           move      rf-oft-cod-cda       to   rf-yca-cod-cda         .
           move      "pgm/orf/fls/ioc/obj/iofyca"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yca                 .
      *                      *-----------------------------------------*
      *                      * Se record [yca] non esistente : si nor- *
      *                      * malizza il valore a spaces              *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     move  spaces         to   rf-yca-des-cda         .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione del valore in area di   *
      *                      * comodo                                  *
      *                      *-----------------------------------------*
           move      rf-yca-des-cda       to   w-stp-pie-cda          .
       stp-pie-doc-250.
      *                  *---------------------------------------------*
      *                  * Stampa prima riga                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se a spaces : no stampa                 *
      *                      *-----------------------------------------*
           if        w-stp-pie-cda-001    =    spaces
                     go to stp-pie-doc-260.
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-lpp-cda-des-lin    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-cda-des-pos    to   p-pos                  .
           move      w-stp-pie-cda-001    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-pie-doc-260.
      *                  *---------------------------------------------*
      *                  * Stampa seconda riga                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se a spaces : no stampa                 *
      *                      *-----------------------------------------*
           if        w-stp-pie-cda-002    =    spaces
                     go to stp-pie-doc-270.
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-lpp-cda-des-lin    to   p-lin                  .
           add       1                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-cda-des-pos    to   p-pos                  .
           move      w-stp-pie-cda-002    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-pie-doc-270.
      *                  *---------------------------------------------*
      *                  * Stampa terza riga                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se a spaces : no stampa                 *
      *                      *-----------------------------------------*
           if        w-stp-pie-cda-003    =    spaces
                     go to stp-pie-doc-280.
      *                      *-----------------------------------------*
      *                      * Posizionamento verticale                *
      *                      *-----------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-lpp-cda-des-lin    to   p-lin                  .
           add       2                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-cda-des-pos    to   p-pos                  .
           move      w-stp-pie-cda-003    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-pie-doc-280.
      *                  *---------------------------------------------*
      *                  * Fine stampa condizioni di acquisto          *
      *                  *---------------------------------------------*
           go to     stp-pie-doc-400.
       stp-pie-doc-400.
      *              *-------------------------------------------------*
      *              * Forma di pagamento                              *
      *              *-------------------------------------------------*
       stp-pie-doc-410.
      *                  *---------------------------------------------*
      *                  * Se posizionamento a zero : no stampa        *
      *                  *---------------------------------------------*
           if        w-lpp-des-fop-lin    =    zero or
                     w-lpp-des-fop-pos    =    zero
                     go to stp-pie-doc-500.
       stp-pie-doc-420.
      *                  *---------------------------------------------*
      *                  * Se codice a zero : no stampa                *
      *                  *---------------------------------------------*
           if        rf-oft-cod-fop       =    zero
                     go to stp-pie-doc-500.
       stp-pie-doc-430.
      *                  *---------------------------------------------*
      *                  * Lettura e bufferizzazione forma di pagamen- *
      *                  * to                                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura archivio [yfx]                  *
      *                      *-----------------------------------------*
           move      rf-oft-cod-fop       to   w-let-yfp-yfx-cod      .
           move      rf-oft-cod-lng       to   w-let-yfp-yfx-lng      .
           perform   let-yfp-yfx-000      thru let-yfp-yfx-999        .
      *                      *-----------------------------------------*
      *                      * Bufferizzazione del valore in area di   *
      *                      * comodo                                  *
      *                      *-----------------------------------------*
           move      w-let-yfp-yfx-des    to   w-stp-pie-fop          .
       stp-pie-doc-440.
      *                  *---------------------------------------------*
      *                  * Se descrizione a spaces : no stampa         *
      *                  *---------------------------------------------*
           if        w-stp-pie-fop        =    spaces
                     go to stp-pie-doc-500.
       stp-pie-doc-450.
      *                  *---------------------------------------------*
      *                  * Posizionamento verticale                    *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-lpp-des-fop-lin    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-des-fop-pos    to   p-pos                  .
           move      w-stp-pie-fop        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-pie-doc-500.
      *              *-------------------------------------------------*
      *              * Informazioni relative all'appoggio pagamento    *
      *              *-------------------------------------------------*
       stp-pie-doc-505.
      *                  *---------------------------------------------*
      *                  * Deviazione a seconda del tipo di appoggio   *
      *                  * da esporre                                  *
      *                  *---------------------------------------------*
           if        rf-oft-nos-ban       not  = spaces
                     go to stp-pie-doc-550
           else if   rf-oft-cod-abi       not  = zero
                     go to stp-pie-doc-600
           else if   rf-oft-ccp-app       not  = spaces
                     go to stp-pie-doc-700
           else      go to stp-pie-doc-750.
       stp-pie-doc-550.
      *                  *---------------------------------------------*
      *                  * Se tipo di appoggio da esporre : riferimen- *
      *                  * ti alla nostra banca                        *
      *                  *---------------------------------------------*
       stp-pie-doc-560.
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica nostra banca         *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCBP    "         to   f-key                  .
           move      02                   to   rf-cbp-tip-cbp         .
           move      rf-oft-nos-ban       to   rf-cbp-cod-cbp         .
           move      "pgm/gep/fls/ioc/obj/iofcbp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cbp                 .
       stp-pie-doc-565.
      *                      *-----------------------------------------*
      *                      * Se record anagrafica nostra banca non   *
      *                      * esistente : non si stampano i riferi-   *
      *                      * menti                                   *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-pie-doc-750.
       stp-pie-doc-570.
      *                      *-----------------------------------------*
      *                      * Preparazione codice ABI da stampare     *
      *                      *-----------------------------------------*
           move      rf-cbp-abi-ban       to   w-stp-pie-abi          .
      *                      *-----------------------------------------*
      *                      * Preparazione codice CAB da stampare     *
      *                      *-----------------------------------------*
           move      rf-cbp-cab-ban       to   w-stp-pie-cab          .
      *                      *-----------------------------------------*
      *                      * Forzatura codice C/C bancario da stam-  *
      *                      * pare a spaces                           *
      *                      *-----------------------------------------*
           move      spaces               to   w-stp-pie-ccb          .
       stp-pie-doc-575.
      *                      *-----------------------------------------*
      *                      * A stampa riferimenti bancari            *
      *                      *-----------------------------------------*
           go to     stp-pie-doc-650.
       stp-pie-doc-600.
      *                  *---------------------------------------------*
      *                  * Se tipo di appoggio da esporre : riferimen- *
      *                  * ti alla banca del fornitore                 *
      *                  *---------------------------------------------*
       stp-pie-doc-605.
      *                      *-----------------------------------------*
      *                      * Preparazione codice ABI da stampare     *
      *                      *-----------------------------------------*
           move      rf-oft-cod-abi       to   w-stp-pie-abi          .
      *                      *-----------------------------------------*
      *                      * Preparazione codice CAB da stampare     *
      *                      *-----------------------------------------*
           move      rf-oft-cod-cab       to   w-stp-pie-cab          .
      *                      *-----------------------------------------*
      *                      * Preparazione codice C/C bancario da     *
      *                      * stampare                                *
      *                      *-----------------------------------------*
           move      rf-oft-ccc-app       to   w-stp-pie-ccb          .
       stp-pie-doc-610.
      *                      *-----------------------------------------*
      *                      * A stampa riferimenti bancari            *
      *                      *-----------------------------------------*
           go to     stp-pie-doc-650.
       stp-pie-doc-650.
      *                  *---------------------------------------------*
      *                  * Stampa riferimenti bancari                  *
      *                  *---------------------------------------------*
       stp-pie-doc-655.
      *                      *-----------------------------------------*
      *                      * Se posizionamento per stampa codice ABI *
      *                      * a zero : nessuna stampa                 *
      *                      *-----------------------------------------*
           if        w-lpp-des-abi-lin    =    zero or
                     w-lpp-des-abi-pos    =    zero
                     go to stp-pie-doc-695.
      *                      *-----------------------------------------*
      *                      * Se codice ABI a zero : nessuna stampa   *
      *                      *-----------------------------------------*
           if        w-stp-pie-abi        =    zero
                     go to stp-pie-doc-695.
       stp-pie-doc-660.
      *                      *-----------------------------------------*
      *                      * Lettura del codice ABI                  *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODABI"             to   f-key                  .
           move      w-stp-pie-abi        to   rf-axi-cod-abi         .
           move      "pgm/abi/fls/ioc/obj/iofaxi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axi                 .
      *                      *-----------------------------------------*
      *                      * Se codice ABI non esistente : nessuna   *
      *                      * stampa                                  *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-pie-doc-695.
      *                      *-----------------------------------------*
      *                      * Bufferizzazione descrizione in area di  *
      *                      * comodo                                  *
      *                      *-----------------------------------------*
           move      rf-axi-den-abi       to   w-stp-pie-abi-des      .
       stp-pie-doc-665.
      *                      *-----------------------------------------*
      *                      * Stampa codice ABI                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale            *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-lpp-des-abi-lin    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-des-abi-pos    to   p-pos                  .
           move      "ABI"                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Codice                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-des-abi-pos    to   p-pos                  .
           add       04                   to   p-pos                  .
           move      w-stp-pie-abi        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-des-abi-pos    to   p-pos                  .
           add       11                   to   p-pos                  .
           move      w-stp-pie-abi-des    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-pie-doc-670.
      *                      *-----------------------------------------*
      *                      * Se posizionamento per stampa codice CAB *
      *                      * a zero : no stampa codice CAB           *
      *                      *-----------------------------------------*
           if        w-lpp-des-cab-lin    =    zero or
                     w-lpp-des-cab-pos    =    zero
                     go to stp-pie-doc-685.
      *                      *-----------------------------------------*
      *                      * Se codice CAB a zero : no stampa codice *
      *                      * CAB                                     *
      *                      *-----------------------------------------*
           if        w-stp-pie-abi        =    zero
                     go to stp-pie-doc-685.
       stp-pie-doc-675.
      *                      *-----------------------------------------*
      *                      * Lettura del codice CAB                  *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "ABICAB"             to   f-key                  .
           move      w-stp-pie-abi        to   rf-axs-cod-abi         .
           move      w-stp-pie-cab        to   rf-axs-cod-cab         .
           move      "pgm/abi/fls/ioc/obj/iofaxs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-axs                 .
      *                      *-----------------------------------------*
      *                      * Se codice CAB non esistente : no stampa *
      *                      * codice CAB                              *
      *                      *-----------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-pie-doc-685.
      *                      *-----------------------------------------*
      *                      * Bufferizzazione descrizione in area di  *
      *                      * comodo                                  *
      *                      *-----------------------------------------*
           move      rf-axs-den-spt       to   w-stp-pie-cab-des      .
       stp-pie-doc-680.
      *                      *-----------------------------------------*
      *                      * Stampa codice CAB                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale            *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-lpp-des-cab-lin    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-des-cab-pos    to   p-pos                  .
           move      "CAB"                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Codice                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-des-cab-pos    to   p-pos                  .
           add       04                   to   p-pos                  .
           move      w-stp-pie-cab        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-des-cab-pos    to   p-pos                  .
           add       11                   to   p-pos                  .
           move      w-stp-pie-cab-des    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-pie-doc-685.
      *                      *-----------------------------------------*
      *                      * Se posizionamento per stampa codice C/C *
      *                      * a zero : no stampa codice C/C           *
      *                      *-----------------------------------------*
           if        w-lpp-ccc-app-lin    =    zero or
                     w-lpp-ccc-app-pos    =    zero
                     go to stp-pie-doc-695.
      *                      *-----------------------------------------*
      *                      * Se codice C/C a spaces : no stampa co-  *
      *                      * dice C/C                                *
      *                      *-----------------------------------------*
           if        w-stp-pie-ccb        =    spaces
                     go to stp-pie-doc-695.
       stp-pie-doc-690.
      *                      *-----------------------------------------*
      *                      * Stampa codice C/C                       *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale            *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-lpp-ccc-app-lin    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-ccc-app-pos    to   p-pos                  .
           move      "C/C"                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      12                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-ccc-app-pos    to   p-pos                  .
           add       10                   to   p-pos                  .
           move      w-stp-pie-ccb        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-pie-doc-695.
      *                  *---------------------------------------------*
      *                  * Fine stampa riferimenti bancari             *
      *                  *---------------------------------------------*
           go to     stp-pie-doc-750.
       stp-pie-doc-700.
      *                  *---------------------------------------------*
      *                  * Se tipo di appoggio da esporre : riferimen- *
      *                  * ta a C/C postale                            *
      *                  *---------------------------------------------*
       stp-pie-doc-705.
      *                      *-----------------------------------------*
      *                      * Se posizionamento per stampa codice C/C *
      *                      * a zero : no stampa codice C/C           *
      *                      *-----------------------------------------*
           if        w-lpp-ccc-app-lin    =    zero or
                     w-lpp-ccc-app-pos    =    zero
                     go to stp-pie-doc-715.
      *                      *-----------------------------------------*
      *                      * Se codice C/C a spaces : no stampa co-  *
      *                      * dice C/C                                *
      *                      *-----------------------------------------*
           if        rf-oft-ccp-app       =    spaces
                     go to stp-pie-doc-715.
       stp-pie-doc-710.
      *                      *-----------------------------------------*
      *                      * Stampa codice C/C postale               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale            *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-lpp-ccc-app-lin    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-ccc-app-pos    to   p-pos                  .
           move      "C/C"                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Lineetta di indicazione             *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-ccc-app-pos    to   p-pos                  .
           add       10                   to   p-pos                  .
           move      "-"                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Descrizione                         *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      12                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-ccc-app-pos    to   p-pos                  .
           add       12                   to   p-pos                  .
           move      rf-oft-ccp-app       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-pie-doc-715.
      *                      *-----------------------------------------*
      *                      * Fine stampa codice C/C postale          *
      *                      *-----------------------------------------*
           go to     stp-pie-doc-750.
       stp-pie-doc-750.
      *                  *---------------------------------------------*
      *                  * Stampa sigla valuta per la fatturazione     *
      *                  *---------------------------------------------*
       stp-pie-doc-800.
      *                  *---------------------------------------------*
      *                  * Stampa numero fax                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se posizionamento per stampa numero fax *
      *                      * a zero : nessuna stampa                 *
      *                      *-----------------------------------------*
           if        w-lpp-num-fax-lin    =    zero or
                     w-lpp-num-fax-pos    =    zero
                     go to stp-pie-doc-820.
      *                      *-----------------------------------------*
      *                      * Se numero fax a spazi : nessuna stampa  *
      *                      *-----------------------------------------*
           if        w-inl-dcm-fax        =    spaces
                     go to stp-pie-doc-810.
      *                      *-----------------------------------------*
      *                      * Test se personalizzazione lo consente   *
      *                      *-----------------------------------------*
           if        w-prs-sof-snf        =    "N"
                     go to stp-pie-doc-820.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale            *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-lpp-num-fax-lin    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-num-fax-pos    to   p-pos                  .
           move      "Fax      :"         to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Valore                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-num-fax-pos    to   p-pos                  .
           add       11                   to   p-pos                  .
           move      w-inl-dcm-fax        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-pie-doc-810.
      *                  *---------------------------------------------*
      *                  * Stampa numero di telefono                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se numero telefono a spazi : no stampa  *
      *                      *-----------------------------------------*
           if        w-inl-dcm-tel        =    spaces
                     go to stp-pie-doc-820.
      *                      *-----------------------------------------*
      *                      * Test se personalizzazione lo consente   *
      *                      *-----------------------------------------*
           if        w-prs-sof-snf        not  = "T"
                     go to stp-pie-doc-820.
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale            *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-lpp-num-fax-lin    to   p-lin                  .
           add       1                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Literal                             *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      10                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-num-fax-pos    to   p-pos                  .
           move      "Telefono :"         to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Valore                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      20                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-num-fax-pos    to   p-pos                  .
           add       11                   to   p-pos                  .
           move      w-inl-dcm-tel        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-pie-doc-820.
      *                  *---------------------------------------------*
      *                  * Stampa responsabile ordine                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se posizionamento per stampa a zero :   *
      *                      * nessuna stampa                          *
      *                      *-----------------------------------------*
           if        w-lpp-rsp-ord-lin    =    zero or
                     w-lpp-rsp-ord-pos    =    zero
                     go to stp-pie-doc-900.
      *                      *-----------------------------------------*
      *                      * Test se personalizzazione lo consente   *
      *                      *-----------------------------------------*
           if        w-prs-sof-snr        not  = "S"
                     go to stp-pie-doc-900.
      *                      *-----------------------------------------*
      *                      * Se codice a zero : nessuna stampa       *
      *                      *-----------------------------------------*
           if        rf-oft-cod-rsp       =    zero
                     go to stp-pie-doc-900.
      *                      *-----------------------------------------*
      *                      * Normalizzazione [yro]                   *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/orf/fls/ioc/obj/iofyro"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yro                 .
      *                      *-----------------------------------------*
      *                      * Lettura [yro]                           *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODRSP    "         to   f-key                  .
           move      rf-oft-cod-rsp       to   rf-yro-cod-rsp         .
           move      "pgm/orf/fls/ioc/obj/iofyro"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yro                 .
           if        f-sts                not  = e-not-err
                     move  spaces         to   rf-yro-des-rsp         .
      *                      *-----------------------------------------*
      *                      * Stampa                                  *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Posizionamento verticale            *
      *                          *-------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-lpp-rsp-ord-lin    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Valore                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      w-lpp-rsp-ord-pos    to   p-pos                  .
           move      rf-yro-des-rsp       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-pie-doc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-pie-doc-999.
       stp-pie-doc-999.
           exit.

      *    *===========================================================*
      *    * Routine di reintestazione per superamento numero righe    *
      *    * previste dal modulo di stampa                             *
      *    *-----------------------------------------------------------*
       rei-mod-tes-000.
      *              *-------------------------------------------------*
      *              * Se posizionamento per il literal 'segue' e' a   *
      *              * zero : non si stampa il literal                 *
      *              *-------------------------------------------------*
           if        w-lpp-lit-seg-lin    =    zero or
                     w-lpp-lit-seg-pos    =    zero
                     go to rei-mod-tes-100.
      *              *-------------------------------------------------*
      *              * Literal 'segue'                                 *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      13                   to   p-car                  .
           move      w-lpp-lit-seg-lin    to   p-lin                  .
           move      w-lpp-lit-seg-pos    to   p-pos                  .
           move      "*** Segue ***"      to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       rei-mod-tes-100.
      *              *-------------------------------------------------*
      *              * Incremento numero pagina                        *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-npr-num-pag      .
       rei-mod-tes-200.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Se errore grave di i-o su stampa si esce con    *
      *              * status di errore                                *
      *              *-------------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  rei-mod-tes-999.
       rei-mod-tes-400.
      *              *-------------------------------------------------*
      *              * Eventuale intestazione pagina                   *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Routine di stampa dati di testata               *
      *              *-------------------------------------------------*
           perform   stp-tes-doc-000      thru stp-tes-doc-999        .
       rei-mod-tes-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina stampa                                *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Se il tipo stampato non e' libero : uscita      *
      *              *-------------------------------------------------*
           if        w-prs-sof-tst        not  = "L" and
                     w-prs-sof-tin        not  = "F"
                     go to int-pag-sta-999.
       int-pag-sta-100.
      *              *-------------------------------------------------*
      *              * Intestazione azienda                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se posizionamento esistente            *
      *                  *---------------------------------------------*
           if        w-lpi-int-azi-lin    =    zero or
                     w-lpi-int-azi-pos    =    zero
                     go to int-pag-sta-200.
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione del tipo intestazio- *
      *                  * ne                                          *
      *                  *---------------------------------------------*
           if        w-prs-sof-tin        =    "N"
                     go to int-pag-sta-120
           else if   w-prs-sof-tin        =    "R"
                     go to int-pag-sta-140
           else if   w-prs-sof-tin        =    "P"
                     go to int-pag-sta-160
           else      go to int-pag-sta-200.
       int-pag-sta-120.
      *                  *---------------------------------------------*
      *                  * Tipo intestazione : Nessuna intestazione    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * A seguito routine                       *
      *                      *-----------------------------------------*
           go to     int-pag-sta-200.
       int-pag-sta-140.
      *                  *---------------------------------------------*
      *                  * Tipo intestazione : Come da referenza       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Ciclo fino a sei righe di intestazione  *
      *                      *-----------------------------------------*
           move      zero                 to   w-int-pag-sta-ctr      .
       int-pag-sta-142.
           add       1                    to   w-int-pag-sta-ctr      .
           if        w-int-pag-sta-ctr    >    8
                     go to int-pag-sta-144.
           if        w-ref-stp-int-des
                    (w-int-pag-sta-ctr)   =    spaces
                     go to int-pag-sta-142.
      *                          *-------------------------------------*
      *                          * Preparazione numero linea           *
      *                          *-------------------------------------*
           move      w-lpi-int-azi-lin    to   p-lin                  .
           add       w-int-pag-sta-ctr    to   p-lin                  .
           subtract  1                    from p-lin                  .
      *                          *-------------------------------------*
      *                          * Stampa riga di intestazione         *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      w-lpi-int-azi-pos    to   p-pos                  .
           move      w-ref-stp-int-des
                    (w-int-pag-sta-ctr)   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Riciclo                             *
      *                          *-------------------------------------*
           go to     int-pag-sta-142.
       int-pag-sta-144.
      *                      *-----------------------------------------*
      *                      * A seguito routine                       *
      *                      *-----------------------------------------*
           go to     int-pag-sta-200.
       int-pag-sta-160.
      *                  *---------------------------------------------*
      *                  * Tipo intestazione : Standard                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione [ada]                   *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
      *                      *-----------------------------------------*
      *                      * Lettura [ada] dati anagrafici Sede      *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODDPZ    "         to   f-key                  .
           move      zero                 to   rf-ada-cod-dpz         .
           move      "pgm/azi/fls/ioc/obj/iofada"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ada                 .
       int-pag-sta-162.
      *                      *-----------------------------------------*
      *                      * Prima riga : Nome azienda               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Determinazione nome azienda         *
      *                          *-------------------------------------*
           move      "IA"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .

           move      s-asx                to   p-alf                  .
      *                          *-------------------------------------*
      *                          * Preparazione numero linea           *
      *                          *-------------------------------------*
           move      w-lpi-int-azi-lin    to   p-lin                  .
      *                          *-------------------------------------*
      *                          * Stampa riga di intestazione         *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      w-lpi-int-azi-pos    to   p-pos                  .
           move      s-asx                to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-164.
      *                      *-----------------------------------------*
      *                      * Seconda riga : Vuota                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Preparazione numero linea           *
      *                          *-------------------------------------*
           add       1                    to   p-lin                  .
       int-pag-sta-166.
      *                      *-----------------------------------------*
      *                      * Terza riga : Indirizzo azienda          *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Preparazione numero linea           *
      *                          *-------------------------------------*
           add       1                    to   p-lin                  .
      *                          *-------------------------------------*
      *                          * Stampa riga di intestazione         *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      w-lpi-int-azi-pos    to   p-pos                  .
           move      rf-ada-via-azi       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-168.
      *                      *-----------------------------------------*
      *                      * Quarta riga : Vuota                     *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Preparazione numero linea           *
      *                          *-------------------------------------*
           add       1                    to   p-lin                  .
       int-pag-sta-170.
      *                      *-----------------------------------------*
      *                      * Quinta riga : Localita' azienda         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Preparazione numero linea           *
      *                          *-------------------------------------*
           add       1                    to   p-lin                  .
      *                          *-------------------------------------*
      *                          * Stampa riga di intestazione         *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      50                   to   p-car                  .
           move      w-lpi-int-azi-pos    to   p-pos                  .
           move      rf-ada-loc-azi       to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-172.
      *                      *-----------------------------------------*
      *                      * Sesta riga : Vuota                      *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Preparazione numero linea           *
      *                          *-------------------------------------*
           add       1                    to   p-lin                  .
       int-pag-sta-174.
      *                      *-----------------------------------------*
      *                      * Settima riga : Vuota                    *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Preparazione numero linea           *
      *                          *-------------------------------------*
           add       1                    to   p-lin                  .
       int-pag-sta-176.
      *                      *-----------------------------------------*
      *                      * Ottava riga : Partita iva               *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Preparazione numero linea           *
      *                          *-------------------------------------*
           add       1                    to   p-lin                  .
      *                          *-------------------------------------*
      *                          * Prompt                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      14                   to   p-car                  .
           move      w-lpi-int-azi-pos    to   p-pos                  .
           move      "Partita iva : "     to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Valore                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-lpi-int-azi-pos    to   p-pos                  .
           add       14                   to   p-pos                  .
           move      rf-ada-prt-iva       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * A seguito routine                       *
      *                      *-----------------------------------------*
           go to     int-pag-sta-200.
       int-pag-sta-200.
      *              *-------------------------------------------------*
      *              * Scheletro per intestazione                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Tipo documento                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-210.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-tip-doc-lin    =    zero or
                     w-lpi-tip-doc-pin    =    zero or
                     w-lpi-tip-doc-lfi    =    zero or
                     w-lpi-tip-doc-pfi    =    zero
                     go to int-pag-sta-210.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-tip-doc-lin    to   w-box-int-pag-lin      .
           move      w-lpi-tip-doc-pin    to   w-box-int-pag-pin      .
           move      w-lpi-tip-doc-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-tip-doc-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-210.
      *                  *---------------------------------------------*
      *                  * Numero documento                            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-215.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-num-doc-lin    =    zero or
                     w-lpi-num-doc-pin    =    zero or
                     w-lpi-num-doc-lfi    =    zero or
                     w-lpi-num-doc-pfi    =    zero
                     go to int-pag-sta-220.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-num-doc-lin    to   w-box-int-pag-lin      .
           move      w-lpi-num-doc-pin    to   w-box-int-pag-pin      .
           move      w-lpi-num-doc-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-num-doc-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-215.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (2)    =    spaces
                     go to int-pag-sta-220.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-lit-num-lin    =    zero or
                     w-lpi-lit-num-pos    =    zero
                     go to int-pag-sta-220.
      *                          *-------------------------------------*
      *                          * Literal centrato                    *
      *                          *-------------------------------------*
           move      w-lpi-num-doc-pfi    to   w-all-str-lun          .
           subtract  w-lpi-num-doc-pin    from w-all-str-lun          .
           subtract  1                    from w-all-str-lun          .
           move      w-stp-cof-des (2)    to   w-all-str-alf          .
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (2)    to   p-car                  .
           move      w-lpi-lit-num-lin    to   p-lin                  .
           move      w-lpi-num-doc-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-220.
      *                  *---------------------------------------------*
      *                  * Data documento                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-225.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-dat-doc-lin    =    zero or
                     w-lpi-dat-doc-pin    =    zero or
                     w-lpi-dat-doc-lfi    =    zero or
                     w-lpi-dat-doc-pfi    =    zero
                     go to int-pag-sta-230.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-dat-doc-lin    to   w-box-int-pag-lin      .
           move      w-lpi-dat-doc-pin    to   w-box-int-pag-pin      .
           move      w-lpi-dat-doc-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-dat-doc-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-225.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (3)    =    spaces
                     go to int-pag-sta-230.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-lit-dat-lin    =    zero or
                     w-lpi-lit-dat-pos    =    zero
                     go to int-pag-sta-230.
      *                          *-------------------------------------*
      *                          * Literal centrato                    *
      *                          *-------------------------------------*
           move      w-lpi-dat-doc-pfi    to   w-all-str-lun          .
           subtract  w-lpi-dat-doc-pin    from w-all-str-lun          .
           subtract  1                    from w-all-str-lun          .
           move      w-stp-cof-des (3)    to   w-all-str-alf          .
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (3)    to   p-car                  .
           move      w-lpi-lit-dat-lin    to   p-lin                  .
           move      w-lpi-dat-doc-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-230.
      *                  *---------------------------------------------*
      *                  * Codice fiscale                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-235.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-cod-fis-lin    =    zero or
                     w-lpi-cod-fis-pin    =    zero or
                     w-lpi-cod-fis-lfi    =    zero or
                     w-lpi-cod-fis-pfi    =    zero
                     go to int-pag-sta-240.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-cod-fis-lin    to   w-box-int-pag-lin      .
           move      w-lpi-cod-fis-pin    to   w-box-int-pag-pin      .
           move      w-lpi-cod-fis-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-cod-fis-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-235.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (4)    =    spaces
                     go to int-pag-sta-240.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-lit-cfi-lin    =    zero or
                     w-lpi-lit-cfi-pos    =    zero
                     go to int-pag-sta-240.
      *                          *-------------------------------------*
      *                          * Literal centrato                    *
      *                          *-------------------------------------*
           move      w-lpi-cod-fis-pfi    to   w-all-str-lun          .
           subtract  w-lpi-cod-fis-pin    from w-all-str-lun          .
           subtract  1                    from w-all-str-lun          .
           move      w-stp-cof-des (4)    to   w-all-str-alf          .
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (4)    to   p-car                  .
           move      w-lpi-lit-cfi-lin    to   p-lin                  .
           move      w-lpi-cod-fis-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-240.
      *                  *---------------------------------------------*
      *                  * Partita iva                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-245.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-prt-iva-lin    =    zero or
                     w-lpi-prt-iva-pin    =    zero or
                     w-lpi-prt-iva-lfi    =    zero or
                     w-lpi-prt-iva-pfi    =    zero
                     go to int-pag-sta-250.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-prt-iva-lin    to   w-box-int-pag-lin      .
           move      w-lpi-prt-iva-pin    to   w-box-int-pag-pin      .
           move      w-lpi-prt-iva-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-prt-iva-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-245.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (5)    =    spaces
                     go to int-pag-sta-250.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-lit-piv-lin    =    zero or
                     w-lpi-lit-piv-pos    =    zero
                     go to int-pag-sta-250.
      *                          *-------------------------------------*
      *                          * Literal centrato                    *
      *                          *-------------------------------------*
           move      w-lpi-prt-iva-pfi    to   w-all-str-lun          .
           subtract  w-lpi-prt-iva-pin    from w-all-str-lun          .
           subtract  1                    from w-all-str-lun          .
           move      w-stp-cof-des (5)    to   w-all-str-alf          .
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (5)    to   p-car                  .
      *                              *---------------------------------*
      *                              * Correttivo per tipo modulo con  *
      *                              * codice prodotto                 *
      *                              *---------------------------------*
           if        w-prs-sof-tmd        =    51
                     add   1              to   p-car                  .
           move      w-lpi-lit-piv-lin    to   p-lin                  .
           move      w-lpi-prt-iva-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-250.
      *                  *---------------------------------------------*
      *                  * Spettabile                                  *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-255.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-fin-spt-lin    =    zero or
                     w-lpi-fin-spt-pin    =    zero or
                     w-lpi-fin-spt-pfi    =    zero
                     go to int-pag-sta-260.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Prima riga                          *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * '+' iniziale                    *
      *                              *---------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      w-lpi-fin-spt-lin    to   p-lin                  .
           move      w-lpi-fin-spt-pin    to   p-pos                  .
           move      "+"                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * Trattini intermedi              *
      *                              *---------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-lpi-fin-spt-pfi    to   p-car                  .
           subtract  w-lpi-fin-spt-pin    from p-car                  .
           subtract  1                    from p-car                  .
           move      w-lpi-fin-spt-lin    to   p-lin                  .
           move      w-lpi-fin-spt-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      all "-"              to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * '+' finale                      *
      *                              *---------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      w-lpi-fin-spt-lin    to   p-lin                  .
           move      w-lpi-fin-spt-pfi    to   p-pos                  .
           move      "+"                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Seconda riga                        *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * '|' iniziale                    *
      *                              *---------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      w-lpi-fin-spt-lin    to   p-lin                  .
           add       1                    to   p-lin                  .
           move      w-lpi-fin-spt-pin    to   p-pos                  .
           move      "|"                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                              *---------------------------------*
      *                              * '|' finale                      *
      *                              *---------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      01                   to   p-car                  .
           move      w-lpi-fin-spt-lin    to   p-lin                  .
           add       1                    to   p-lin                  .
           move      w-lpi-fin-spt-pfi    to   p-pos                  .
           move      "|"                  to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-255.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (7)    =    spaces
                     go to int-pag-sta-260.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-lit-spt-lin    =    zero or
                     w-lpi-lit-spt-pos    =    zero
                     go to int-pag-sta-260.
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (7)    to   p-car                  .
           move      w-lpi-lit-spt-lin    to   p-lin                  .
           move      w-lpi-fin-spt-pin    to   p-pos                  .
           add       2                    to   p-pos                  .
           move      w-stp-cof-des (7)    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-260.
      *                  *---------------------------------------------*
      *                  * Indirizzo di spedizione                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-265.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-ind-spe-lin    =    zero or
                     w-lpi-ind-spe-pin    =    zero or
                     w-lpi-ind-spe-lfi    =    zero or
                     w-lpi-ind-spe-pfi    =    zero
                     go to int-pag-sta-300.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-ind-spe-lin    to   w-box-int-pag-lin      .
           move      w-lpi-ind-spe-pin    to   w-box-int-pag-pin      .
           move      w-lpi-ind-spe-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-ind-spe-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-265.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (6)    =    spaces
                     go to int-pag-sta-300.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-lit-ids-lin    =    zero or
                     w-lpi-lit-ids-pos    =    zero
                     go to int-pag-sta-300.
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (6)    to   p-car                  .
           move      w-lpi-lit-ids-lin    to   p-lin                  .
           move      w-lpi-ind-spe-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-stp-cof-des (6)    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-300.
      *                  *---------------------------------------------*
      *                  * Fincatura per : Descrizione                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-305.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-fin-des-lin    =    zero or
                     w-lpi-fin-des-pin    =    zero or
                     w-lpi-fin-des-lfi    =    zero or
                     w-lpi-fin-des-pfi    =    zero
                     go to int-pag-sta-310.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-fin-des-lin    to   w-box-int-pag-lin      .
           move      w-lpi-fin-des-pin    to   w-box-int-pag-pin      .
           move      w-lpi-fin-des-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-fin-des-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-305.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (10)   =    spaces
                     go to int-pag-sta-310.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-fin-des-lin    =    zero or
                     w-lpi-fin-des-pin    =    zero or
                     w-lpi-fin-des-lfi    =    zero or
                     w-lpi-fin-des-pfi    =    zero
                     go to int-pag-sta-310.
      *                          *-------------------------------------*
      *                          * Literal centrato                    *
      *                          *-------------------------------------*
           move      w-lpi-fin-des-pfi    to   w-all-str-lun          .
           subtract  w-lpi-fin-des-pin    from w-all-str-lun          .
           subtract  1                    from w-all-str-lun          .
           move      w-stp-cof-des (10)   to   w-all-str-alf          .
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (10)   to   p-car                  .
           move      w-lpi-fin-des-lin    to   p-lin                  .
           add       1                    to   p-lin                  .
           move      w-lpi-fin-des-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-310.
      *                  *---------------------------------------------*
      *                  * Riferimenti ordine                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-315.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-rif-orf-lin    =    zero or
                     w-lpi-rif-orf-pin    =    zero or
                     w-lpi-rif-orf-lfi    =    zero or
                     w-lpi-rif-orf-pfi    =    zero
                     go to int-pag-sta-320.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-rif-orf-lin    to   w-box-int-pag-lin      .
           move      w-lpi-rif-orf-pin    to   w-box-int-pag-pin      .
           move      w-lpi-rif-orf-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-rif-orf-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-315.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (8)    =    spaces
                     go to int-pag-sta-320.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-lit-rif-lin    =    zero or
                     w-lpi-lit-rif-pos    =    zero
                     go to int-pag-sta-320.
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (8)    to   p-car                  .
           move      w-lpi-lit-rif-lin    to   p-lin                  .
           move      w-lpi-rif-orf-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-stp-cof-des (8)    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-320.
      *                  *---------------------------------------------*
      *                  * Fincatura per : Codice prodotto             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-325.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-fin-cod-lin    =    zero or
                     w-lpi-fin-cod-pin    =    zero or
                     w-lpi-fin-cod-lfi    =    zero or
                     w-lpi-fin-cod-pfi    =    zero
                     go to int-pag-sta-330.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-fin-cod-lin    to   w-box-int-pag-lin      .
           move      w-lpi-fin-cod-pin    to   w-box-int-pag-pin      .
           move      w-lpi-fin-cod-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-fin-cod-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-325.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (9)    =    spaces
                     go to int-pag-sta-330.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-fin-cod-lin    =    zero or
                     w-lpi-fin-cod-pin    =    zero or
                     w-lpi-fin-cod-lfi    =    zero or
                     w-lpi-fin-cod-pfi    =    zero
                     go to int-pag-sta-330.
      *                          *-------------------------------------*
      *                          * Literal centrato                    *
      *                          *-------------------------------------*
           move      w-lpi-fin-cod-pfi    to   w-all-str-lun          .
           subtract  w-lpi-fin-cod-pin    from w-all-str-lun          .
           subtract  1                    from w-all-str-lun          .
           move      w-stp-cof-des (9)    to   w-all-str-alf          .
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (9)    to   p-car                  .
           move      w-lpi-fin-cod-lin    to   p-lin                  .
           add       1                    to   p-lin                  .
           move      w-lpi-fin-cod-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-330.
      *                  *---------------------------------------------*
      *                  * Fincatura per : Quantita'                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-335.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-fin-qta-lin    =    zero or
                     w-lpi-fin-qta-pin    =    zero or
                     w-lpi-fin-qta-lfi    =    zero or
                     w-lpi-fin-qta-pfi    =    zero
                     go to int-pag-sta-340.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-fin-qta-lin    to   w-box-int-pag-lin      .
           move      w-lpi-fin-qta-pin    to   w-box-int-pag-pin      .
           move      w-lpi-fin-qta-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-fin-qta-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-335.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (11)   =    spaces
                     go to int-pag-sta-340.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-fin-qta-lin    =    zero or
                     w-lpi-fin-qta-pin    =    zero or
                     w-lpi-fin-qta-lfi    =    zero or
                     w-lpi-fin-qta-pfi    =    zero
                     go to int-pag-sta-340.
      *                          *-------------------------------------*
      *                          * Literal centrato                    *
      *                          *-------------------------------------*
           move      w-lpi-fin-qta-pfi    to   w-all-str-lun          .
           subtract  w-lpi-fin-qta-pin    from w-all-str-lun          .
           subtract  1                    from w-all-str-lun          .
           move      w-stp-cof-des (11)   to   w-all-str-alf          .
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (11)   to   p-car                  .
           move      w-lpi-fin-qta-lin    to   p-lin                  .
           add       1                    to   p-lin                  .
           move      w-lpi-fin-qta-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-340.
      *                  *---------------------------------------------*
      *                  * Fincatura per : Unita' di misura            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-345.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-fin-udm-lin    =    zero or
                     w-lpi-fin-udm-pin    =    zero or
                     w-lpi-fin-udm-lfi    =    zero or
                     w-lpi-fin-udm-pfi    =    zero
                     go to int-pag-sta-350.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-fin-udm-lin    to   w-box-int-pag-lin      .
           move      w-lpi-fin-udm-pin    to   w-box-int-pag-pin      .
           move      w-lpi-fin-udm-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-fin-udm-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-345.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (12)   =    spaces
                     go to int-pag-sta-350.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-fin-udm-lin    =    zero or
                     w-lpi-fin-udm-pin    =    zero or
                     w-lpi-fin-udm-lfi    =    zero or
                     w-lpi-fin-udm-pfi    =    zero
                     go to int-pag-sta-350.
      *                          *-------------------------------------*
      *                          * Literal centrato                    *
      *                          *-------------------------------------*
           move      w-lpi-fin-udm-pfi    to   w-all-str-lun          .
           subtract  w-lpi-fin-udm-pin    from w-all-str-lun          .
           subtract  1                    from w-all-str-lun          .
           move      w-stp-cof-des (12)   to   w-all-str-alf          .
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-lpi-fin-udm-pfi    to   p-car                  .
           subtract  w-lpi-fin-udm-pin    from p-car                  .
           subtract  1                    from p-car                  .
           move      w-lpi-fin-udm-lin    to   p-lin                  .
           add       1                    to   p-lin                  .
           move      w-lpi-fin-udm-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-350.
      *                  *---------------------------------------------*
      *                  * Fincatura per : Prezzo                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-355.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-fin-prz-lin    =    zero or
                     w-lpi-fin-prz-pin    =    zero or
                     w-lpi-fin-prz-lfi    =    zero or
                     w-lpi-fin-prz-pfi    =    zero
                     go to int-pag-sta-360.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-fin-prz-lin    to   w-box-int-pag-lin      .
           move      w-lpi-fin-prz-pin    to   w-box-int-pag-pin      .
           move      w-lpi-fin-prz-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-fin-prz-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-355.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (13)   =    spaces
                     go to int-pag-sta-360.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-fin-prz-lin    =    zero or
                     w-lpi-fin-prz-pin    =    zero or
                     w-lpi-fin-prz-lfi    =    zero or
                     w-lpi-fin-prz-pfi    =    zero
                     go to int-pag-sta-360.
      *                          *-------------------------------------*
      *                          * Literal centrato                    *
      *                          *-------------------------------------*
           move      w-lpi-fin-prz-pfi    to   w-all-str-lun          .
           subtract  w-lpi-fin-prz-pin    from w-all-str-lun          .
           subtract  1                    from w-all-str-lun          .
           move      w-stp-cof-des (13)   to   w-all-str-alf          .
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (13)   to   p-car                  .
           move      w-lpi-fin-prz-lin    to   p-lin                  .
           add       1                    to   p-lin                  .
           move      w-lpi-fin-prz-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-360.
      *                  *---------------------------------------------*
      *                  * Fincatura per : Sconti                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-365.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-fin-sco-lin    =    zero or
                     w-lpi-fin-sco-pin    =    zero or
                     w-lpi-fin-sco-lfi    =    zero or
                     w-lpi-fin-sco-pfi    =    zero
                     go to int-pag-sta-370.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-fin-sco-lin    to   w-box-int-pag-lin      .
           move      w-lpi-fin-sco-pin    to   w-box-int-pag-pin      .
           move      w-lpi-fin-sco-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-fin-sco-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-365.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (14)   =    spaces
                     go to int-pag-sta-370.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-fin-sco-lin    =    zero or
                     w-lpi-fin-sco-pin    =    zero or
                     w-lpi-fin-sco-lfi    =    zero or
                     w-lpi-fin-sco-pfi    =    zero
                     go to int-pag-sta-370.
      *                          *-------------------------------------*
      *                          * Literal centrato                    *
      *                          *-------------------------------------*
           move      w-lpi-fin-sco-pfi    to   w-all-str-lun          .
           subtract  w-lpi-fin-sco-pin    from w-all-str-lun          .
           subtract  1                    from w-all-str-lun          .
           move      w-stp-cof-des (14)   to   w-all-str-alf          .
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (14)   to   p-car                  .
           move      w-lpi-fin-sco-lin    to   p-lin                  .
           add       1                    to   p-lin                  .
           move      w-lpi-fin-sco-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-370.
      *                  *---------------------------------------------*
      *                  * Fincatura per : Data consegna               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-375.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-fin-dcn-lin    =    zero or
                     w-lpi-fin-dcn-pin    =    zero or
                     w-lpi-fin-dcn-lfi    =    zero or
                     w-lpi-fin-dcn-pfi    =    zero
                     go to int-pag-sta-400.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-fin-dcn-lin    to   w-box-int-pag-lin      .
           move      w-lpi-fin-dcn-pin    to   w-box-int-pag-pin      .
           move      w-lpi-fin-dcn-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-fin-dcn-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-375.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (15)   =    spaces
                     go to int-pag-sta-400.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-fin-dcn-lin    =    zero or
                     w-lpi-fin-dcn-pin    =    zero or
                     w-lpi-fin-dcn-lfi    =    zero or
                     w-lpi-fin-dcn-pfi    =    zero
                     go to int-pag-sta-400.
      *                          *-------------------------------------*
      *                          * Literal centrato                    *
      *                          *-------------------------------------*
           move      w-lpi-fin-dcn-pfi    to   w-all-str-lun          .
           subtract  w-lpi-fin-dcn-pin    from w-all-str-lun          .
           subtract  1                    from w-all-str-lun          .
           move      w-stp-cof-des (15)   to   w-all-str-alf          .
           perform   all-str-cen-000      thru all-str-cen-999        .
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (15)   to   p-car                  .
           move      w-lpi-fin-dcn-lin    to   p-lin                  .
           add       1                    to   p-lin                  .
           move      w-lpi-fin-dcn-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-400.
      *                  *---------------------------------------------*
      *                  * Box corpo per : Codice prodotto             *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-500.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-cor-cod-lin    =    zero or
                     w-lpi-cor-cod-pin    =    zero or
                     w-lpi-cor-cod-lfi    =    zero or
                     w-lpi-cor-cod-pfi    =    zero
                     go to int-pag-sta-410.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-cor-cod-lin    to   w-box-int-pag-lin      .
           move      w-lpi-cor-cod-pin    to   w-box-int-pag-pin      .
           move      w-lpi-cor-cod-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-cor-cod-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-410.
      *                  *---------------------------------------------*
      *                  * Box corpo per : Descrizione prodotto        *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-cor-des-lin    =    zero or
                     w-lpi-cor-des-pin    =    zero or
                     w-lpi-cor-des-lfi    =    zero or
                     w-lpi-cor-des-pfi    =    zero
                     go to int-pag-sta-420.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-cor-des-lin    to   w-box-int-pag-lin      .
           move      w-lpi-cor-des-pin    to   w-box-int-pag-pin      .
           move      w-lpi-cor-des-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-cor-des-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-420.
      *                  *---------------------------------------------*
      *                  * Box corpo per : Quantita'                   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-cor-qta-lin    =    zero or
                     w-lpi-cor-qta-pin    =    zero or
                     w-lpi-cor-qta-lfi    =    zero or
                     w-lpi-cor-qta-pfi    =    zero
                     go to int-pag-sta-430.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-cor-qta-lin    to   w-box-int-pag-lin      .
           move      w-lpi-cor-qta-pin    to   w-box-int-pag-pin      .
           move      w-lpi-cor-qta-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-cor-qta-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-430.
      *                  *---------------------------------------------*
      *                  * Box corpo per : Unita' di misura            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-cor-udm-lin    =    zero or
                     w-lpi-cor-udm-pin    =    zero or
                     w-lpi-cor-udm-lfi    =    zero or
                     w-lpi-cor-udm-pfi    =    zero
                     go to int-pag-sta-440.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-cor-udm-lin    to   w-box-int-pag-lin      .
           move      w-lpi-cor-udm-pin    to   w-box-int-pag-pin      .
           move      w-lpi-cor-udm-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-cor-udm-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-440.
      *                  *---------------------------------------------*
      *                  * Box corpo per : Prezzo                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-cor-prz-lin    =    zero or
                     w-lpi-cor-prz-pin    =    zero or
                     w-lpi-cor-prz-lfi    =    zero or
                     w-lpi-cor-prz-pfi    =    zero
                     go to int-pag-sta-450.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-cor-prz-lin    to   w-box-int-pag-lin      .
           move      w-lpi-cor-prz-pin    to   w-box-int-pag-pin      .
           move      w-lpi-cor-prz-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-cor-prz-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-450.
      *                  *---------------------------------------------*
      *                  * Box corpo per : Sconti                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-cor-sco-lin    =    zero or
                     w-lpi-cor-sco-pin    =    zero or
                     w-lpi-cor-sco-lfi    =    zero or
                     w-lpi-cor-sco-pfi    =    zero
                     go to int-pag-sta-460.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-cor-sco-lin    to   w-box-int-pag-lin      .
           move      w-lpi-cor-sco-pin    to   w-box-int-pag-pin      .
           move      w-lpi-cor-sco-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-cor-sco-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-460.
      *                  *---------------------------------------------*
      *                  * Box corpo per : Data consegna               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-cor-dcn-lin    =    zero or
                     w-lpi-cor-dcn-pin    =    zero or
                     w-lpi-cor-dcn-lfi    =    zero or
                     w-lpi-cor-dcn-pfi    =    zero
                     go to int-pag-sta-500.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-cor-dcn-lin    to   w-box-int-pag-lin      .
           move      w-lpi-cor-dcn-pin    to   w-box-int-pag-pin      .
           move      w-lpi-cor-dcn-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-cor-dcn-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-500.
      *                  *---------------------------------------------*
      *                  * Condizioni di pagamento                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-505.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-cdz-pag-lin    =    zero or
                     w-lpi-cdz-pag-pin    =    zero or
                     w-lpi-cdz-pag-lfi    =    zero or
                     w-lpi-cdz-pag-pfi    =    zero
                     go to int-pag-sta-510.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-cdz-pag-lin    to   w-box-int-pag-lin      .
           move      w-lpi-cdz-pag-pin    to   w-box-int-pag-pin      .
           move      w-lpi-cdz-pag-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-cdz-pag-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-505.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (17)   =    spaces
                     go to int-pag-sta-510.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-lit-cdp-lin    =    zero or
                     w-lpi-lit-cdp-pos    =    zero
                     go to int-pag-sta-510.
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (17)   to   p-car                  .
           move      w-lpi-lit-cdp-lin    to   p-lin                  .
           move      w-lpi-cdz-pag-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-stp-cof-des (17)   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-510.
      *                  *---------------------------------------------*
      *                  * Condizioni di fornitura                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-515.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-cdz-frn-lin    =    zero or
                     w-lpi-cdz-frn-pin    =    zero or
                     w-lpi-cdz-frn-lfi    =    zero or
                     w-lpi-cdz-frn-pfi    =    zero
                     go to int-pag-sta-520.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-cdz-frn-lin    to   w-box-int-pag-lin      .
           move      w-lpi-cdz-frn-pin    to   w-box-int-pag-pin      .
           move      w-lpi-cdz-frn-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-cdz-frn-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-515.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (16)   =    spaces
                     go to int-pag-sta-520.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-lit-cdf-lin    =    zero or
                     w-lpi-lit-cdf-pos    =    zero
                     go to int-pag-sta-520.
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (16)   to   p-car                  .
           move      w-lpi-lit-cdf-lin    to   p-lin                  .
           move      w-lpi-cdz-frn-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-stp-cof-des (16)   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-520.
      *                  *---------------------------------------------*
      *                  * Annotazioni per la fornitura                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-525.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-ann-frn-lin    =    zero or
                     w-lpi-ann-frn-pin    =    zero or
                     w-lpi-ann-frn-lfi    =    zero or
                     w-lpi-ann-frn-pfi    =    zero
                     go to int-pag-sta-530.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-ann-frn-lin    to   w-box-int-pag-lin      .
           move      w-lpi-ann-frn-pin    to   w-box-int-pag-pin      .
           move      w-lpi-ann-frn-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-ann-frn-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-525.
      *                      *-----------------------------------------*
      *                      * Literal nel Box                         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se valore a spaces             *
      *                          *-------------------------------------*
           if        w-stp-cof-des (18)   =    spaces
                     go to int-pag-sta-530.
      *                          *-------------------------------------*
      *                          * Test se posizionamenti esistenti    *
      *                          *-------------------------------------*
           if        w-lpi-lit-apf-lin    =    zero or
                     w-lpi-lit-apf-pos    =    zero
                     go to int-pag-sta-530.
      *                          *-------------------------------------*
      *                          * Stampa                              *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-pmt-cof-car (18)   to   p-car                  .
           move      w-lpi-lit-apf-lin    to   p-lin                  .
           move      w-lpi-ann-frn-pin    to   p-pos                  .
           add       1                    to   p-pos                  .
           move      w-stp-cof-des (18)   to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       int-pag-sta-530.
      *                  *---------------------------------------------*
      *                  * Spazio libero                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se richieste solo fincature        *
      *                      *-----------------------------------------*
           if        w-prs-sof-tin        =    "F"
                     go to int-pag-sta-600.
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-spz-lib-lin    =    zero or
                     w-lpi-spz-lib-pin    =    zero or
                     w-lpi-spz-lib-lfi    =    zero or
                     w-lpi-spz-lib-pfi    =    zero
                     go to int-pag-sta-540.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-spz-lib-lin    to   w-box-int-pag-lin      .
           move      w-lpi-spz-lib-pin    to   w-box-int-pag-pin      .
           move      w-lpi-spz-lib-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-spz-lib-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-540.
      *                  *---------------------------------------------*
      *                  * Nostri riferimenti                          *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se posizionamenti esistenti        *
      *                      *-----------------------------------------*
           if        w-lpi-nsx-rif-lin    =    zero or
                     w-lpi-nsx-rif-pin    =    zero or
                     w-lpi-nsx-rif-lfi    =    zero or
                     w-lpi-nsx-rif-pfi    =    zero
                     go to int-pag-sta-600.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
           move      w-lpi-nsx-rif-lin    to   w-box-int-pag-lin      .
           move      w-lpi-nsx-rif-pin    to   w-box-int-pag-pin      .
           move      w-lpi-nsx-rif-lfi    to   w-box-int-pag-lfi      .
           move      w-lpi-nsx-rif-pfi    to   w-box-int-pag-pfi      .
           perform   box-int-pag-000      thru box-int-pag-999        .
       int-pag-sta-600.
       int-pag-sta-800.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     int-pag-sta-999.
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Box per intestazione pagina                               *
      *    *-----------------------------------------------------------*
       box-int-pag-000.
      *              *-------------------------------------------------*
      *              * Preparazione line - position - size             *
      *              *-------------------------------------------------*
           move      w-box-int-pag-lin    to   w-box-int-pag-wln      .
           move      w-box-int-pag-pin    to   w-box-int-pag-wps      .
           subtract  w-box-int-pag-pin    from w-box-int-pag-pfi
                                        giving w-box-int-pag-wsz      .
           add       1                    to   w-box-int-pag-wsz      .
      *              *-------------------------------------------------*
      *              * Linea superiore                                 *
      *              *-------------------------------------------------*
           move      w-box-int-pag-wtr    to   w-box-int-pag-wst      .
           move      "+"                  to   w-box-int-pag-wch (1)  .
           move      "+"                  to   w-box-int-pag-wch
                                              (w-box-int-pag-wsz)     .
           perform   box-int-pag-900      thru box-int-pag-919        .
      *              *-------------------------------------------------*
      *              * Linee intermedie                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione                                *
      *                  *---------------------------------------------*
           move      spaces               to   w-box-int-pag-wst      .
           move      "|"                  to   w-box-int-pag-wch (1)  .
           move      "|"                  to   w-box-int-pag-wch
                                              (w-box-int-pag-wsz)     .
           subtract  w-box-int-pag-lin    from w-box-int-pag-lfi
                                        giving w-box-int-pag-ctr      .
           subtract  1                    from w-box-int-pag-ctr      .
       box-int-pag-500.
           add       1                    to   w-box-int-pag-wln      .
           if        w-box-int-pag-ctr    >    zero
                     subtract 1           from w-box-int-pag-ctr
                     perform  box-int-pag-900
                                          thru box-int-pag-919
                     go to    box-int-pag-500.
      *              *-------------------------------------------------*
      *              * Linea inferiore                                 *
      *              *-------------------------------------------------*
           move      w-box-int-pag-wtr    to   w-box-int-pag-wst      .
           move      "+"                  to   w-box-int-pag-wch (1)  .
           move      "+"                  to   w-box-int-pag-wch
                                              (w-box-int-pag-wsz)     .
           perform   box-int-pag-900      thru box-int-pag-919        .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     box-int-pag-999.
       box-int-pag-900.
      *              *=================================================*
      *              * Sub-routine interna di stampa riga              *
      *              *-------------------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      w-box-int-pag-wsz    to   p-car                  .
           move      w-box-int-pag-wln    to   p-lin                  .
           move      w-box-int-pag-wps    to   p-pos                  .
           move      w-box-int-pag-wst    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       box-int-pag-919.
           exit.
       box-int-pag-999.
           exit.

      *    *===========================================================*
      *    * Determinazione posizionamenti per la stampa               *
      *    *-----------------------------------------------------------*
       det-pos-stp-000.
      *              *-------------------------------------------------*
      *              * Determinazione del displacement verticale       *
      *              *-------------------------------------------------*
           move      w-dsp-top-mrg        to   w-dsp-dsp-vrt          .
           multiply  -1                   by   w-dsp-dsp-vrt          .
       det-pos-stp-050.
      *              *-------------------------------------------------*
      *              * Determinazione posizionamento iniziale          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione della personalizza-  *
      *                  * zione relativa al tipo modulo di stampa     *
      *                  *---------------------------------------------*
           if        w-prs-sof-tmd        =    01
                     go to det-pos-stp-100
           else if   w-prs-sof-tmd        =    51
                     go to det-pos-stp-200.
       det-pos-stp-100.
      *                  *---------------------------------------------*
      *                  * Tipo modulo stampa : Senza codice prodotto  *
      *                  *---------------------------------------------*
       det-pos-stp-110.
      *                      *-----------------------------------------*
      *                      * Campi testata                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Tipo documento                      *
      *                          *-------------------------------------*
           if        w-prs-sof-snl        =    "S"
                     move  001            to   w-lpt-tmo-orf-lin
           else if   w-prs-sof-snl        =    "P"
                     move  004            to   w-lpt-tmo-orf-lin
           else      move  004            to   w-lpt-tmo-orf-lin      .
      *
           move      068                  to   w-lpt-tmo-orf-pos      .
      *                          *-------------------------------------*
      *                          * Numero documento                    *
      *                          *-------------------------------------*
           if        w-prs-sof-snl        =    "S"
                     move  005            to   w-lpt-num-doc-lin
           else if   w-prs-sof-snl        =    "P"
                     move  007            to   w-lpt-num-doc-lin
           else      move  009            to   w-lpt-num-doc-lin      .
      *
           move      069                  to   w-lpt-num-doc-pos      .
      *                          *-------------------------------------*
      *                          * Data documento                      *
      *                          *-------------------------------------*
           if        w-prs-sof-snl        =    "S"
                     move  005            to   w-lpt-dat-doc-lin
           else if   w-prs-sof-snl        =    "P"
                     move  007            to   w-lpt-dat-doc-lin
           else      move  009            to   w-lpt-dat-doc-lin      .
      *
           move      084                  to   w-lpt-dat-doc-pos      .
      *                          *-------------------------------------*
      *                          * Codice fiscale                      *
      *                          *-------------------------------------*
           if        w-prs-sof-snl        =    "S"
                     move  008            to   w-lpt-cod-fis-lin
           else if   w-prs-sof-snl        =    "P"
                     move  010            to   w-lpt-cod-fis-lin
           else      move  012            to   w-lpt-cod-fis-lin      .
      *
           move      066                  to   w-lpt-cod-fis-pos      .
      *                          *-------------------------------------*
      *                          * Partita iva                         *
      *                          *-------------------------------------*
           if        w-prs-sof-snl        =    "S"
                     move  008            to   w-lpt-prt-iva-lin
           else if   w-prs-sof-snl        =    "P"
                     move  010            to   w-lpt-prt-iva-lin
           else      move  012            to   w-lpt-prt-iva-lin      .
      *
           move      084                  to   w-lpt-prt-iva-pos      .
      *                          *-------------------------------------*
      *                          * Indirizzo di spedizione             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Ragione sociale                 *
      *                              *---------------------------------*
           move      015                  to   w-lpt-ids-rag-lin      .
           move      003                  to   w-lpt-ids-rag-pos      .
      *                              *---------------------------------*
      *                              * Via                             *
      *                              *---------------------------------*
           move      016                  to   w-lpt-ids-via-lin      .
           move      003                  to   w-lpt-ids-via-pos      .
      *                              *---------------------------------*
      *                              * Localita'                       *
      *                              *---------------------------------*
           move      017                  to   w-lpt-ids-loc-lin      .
           move      003                  to   w-lpt-ids-loc-pos      .
      *                          *-------------------------------------*
      *                          * Indirizzo di inoltro documento      *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Ragione sociale 1               *
      *                              *---------------------------------*
           move      016                  to   w-lpt-inl-rs1-lin      .
           move      054                  to   w-lpt-inl-rs1-pos      .
      *                              *---------------------------------*
      *                              * Ragione sociale 2               *
      *                              *---------------------------------*
           move      017                  to   w-lpt-inl-rs2-lin      .
           move      054                  to   w-lpt-inl-rs2-pos      .
      *                              *---------------------------------*
      *                              * Via                             *
      *                              *---------------------------------*
           move      018                  to   w-lpt-inl-via-lin      .
           move      054                  to   w-lpt-inl-via-pos      .
      *                              *---------------------------------*
      *                              * Localita'                       *
      *                              *---------------------------------*
           move      020                  to   w-lpt-inl-loc-lin      .
           move      054                  to   w-lpt-inl-loc-pos      .
      *                          *-------------------------------------*
      *                          * Tipo evasione, anche se non gestito *
      *                          *-------------------------------------*
           move      020                  to   w-lpt-tip-eva-lin      .
           move      003                  to   w-lpt-tip-eva-pos      .
      *                          *-------------------------------------*
      *                          * Riferimenti conferma ordine         *
      *                          *-------------------------------------*
           move      020                  to   w-lpt-rif-cof-lin      .
           move      003                  to   w-lpt-rif-cof-pos      .
      *                          *-------------------------------------*
      *                          * Nostra dipendenza                   *
      *                          *-------------------------------------*
           move      022                  to   w-lpt-des-dpz-lin      .
           move      003                  to   w-lpt-des-dpz-pos      .
       det-pos-stp-120.
      *                      *-----------------------------------------*
      *                      * Campi corpo                             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Prima linea corpo                   *
      *                          *-------------------------------------*
           move      026                  to   w-lpc-pri-rig-lin      .
      *                          *-------------------------------------*
      *                          * Ultima linea corpo                  *
      *                          *-------------------------------------*
           move      054                  to   w-lpc-ult-rig-lin      .
      *                          *-------------------------------------*
      *                          * Posizioni                           *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Codice prodotto                 *
      *                              *---------------------------------*
           move      000                  to   w-lpc-cod-pro-pos      .
      *                              *---------------------------------*
      *                              * Descrizione                     *
      *                              *---------------------------------*
           move      003                  to   w-lpc-des-pro-pos      .
      *                              *---------------------------------*
      *                              * Quantita' ordinata              *
      *                              *---------------------------------*
           move      044                  to   w-lpc-qta-ord-pos      .
      *                              *---------------------------------*
      *                              * Unita' di misura                *
      *                              *---------------------------------*
           move      056                  to   w-lpc-umi-acq-pos      .
      *                              *---------------------------------*
      *                              * Prezzo di acquisto              *
      *                              *---------------------------------*
           move      060                  to   w-lpc-prz-acq-pos      .
      *                              *---------------------------------*
      *                              * 1. percentuale sconto           *
      *                              *---------------------------------*
           move      072                  to   w-lpc-per-scr-pos (1)  .
      *                              *---------------------------------*
      *                              * 2. percentuale sconto           *
      *                              *---------------------------------*
           move      077                  to   w-lpc-per-scr-pos (2)  .
      *                              *---------------------------------*
      *                              * 3. percentuale sconto           *
      *                              *---------------------------------*
           move      072                  to   w-lpc-per-scr-pos (3)  .
      *                              *---------------------------------*
      *                              * 4. percentuale sconto           *
      *                              *---------------------------------*
           move      077                  to   w-lpc-per-scr-pos (4)  .
      *                              *---------------------------------*
      *                              * 5. percentuale sconto           *
      *                              *---------------------------------*
           move      072                  to   w-lpc-per-scr-pos (5)  .
      *                              *---------------------------------*
      *                              * Data di consegna                *
      *                              *---------------------------------*
           move      087                  to   w-lpc-dat-cns-pos      .
       det-pos-stp-130.
      *                      *-----------------------------------------*
      *                      * Campi piede                             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * 1. voce descrittiva                 *
      *                          *-------------------------------------*
           move      058                  to   w-lpp-voc-des-lin      .
           move      003                  to   w-lpp-voc-des-pos      .
      *                          *-------------------------------------*
      *                          * 1. linea descr. condiz. acquisto    *
      *                          *-------------------------------------*
           move      066                  to   w-lpp-cda-des-lin      .
           move      003                  to   w-lpp-cda-des-pos      .
      *                          *-------------------------------------*
      *                          * Forma di pagamento                  *
      *                          *-------------------------------------*
           move      058                  to   w-lpp-des-fop-lin      .
           move      044                  to   w-lpp-des-fop-pos      .
      *                          *-------------------------------------*
      *                          * ABI                                 *
      *                          *-------------------------------------*
           move      059                  to   w-lpp-des-abi-lin      .
           move      044                  to   w-lpp-des-abi-pos      .
      *                          *-------------------------------------*
      *                          * CAB                                 *
      *                          *-------------------------------------*
           move      060                  to   w-lpp-des-cab-lin      .
           move      044                  to   w-lpp-des-cab-pos      .
      *                          *-------------------------------------*
      *                          * C/C di appoggio                     *
      *                          *-------------------------------------*
           move      061                  to   w-lpp-ccc-app-lin      .
           move      044                  to   w-lpp-ccc-app-pos      .
      *                          *-------------------------------------*
      *                          * Literal segue                       *
      *                          *-------------------------------------*
           move      068                  to   w-lpp-lit-seg-lin      .
           move      081                  to   w-lpp-lit-seg-pos      .
      *                          *-------------------------------------*
      *                          * Numero fax                          *
      *                          *-------------------------------------*
           if        w-prs-sof-snl        =    "S"
                     move  070            to   w-lpp-num-fax-lin
           else if   w-prs-sof-snl        =    "P"
                     move  066            to   w-lpp-num-fax-lin
           else      move  070            to   w-lpp-num-fax-lin      .
      *
           if        w-prs-sof-snl        =    "S"
                     move  003            to   w-lpp-num-fax-pos
           else if   w-prs-sof-snl        =    "P"
                     move  062            to   w-lpp-num-fax-pos
           else      move  003            to   w-lpp-num-fax-pos      .
      *                          *-------------------------------------*
      *                          * Responsabile ordine                 *
      *                          *-------------------------------------*
           move      066                  to   w-lpp-rsp-ord-lin      .
           move      045                  to   w-lpp-rsp-ord-pos      .
       det-pos-stp-140.
      *                      *-----------------------------------------*
      *                      * Posizionamenti per intestazione         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da eseguire                 *
      *                          *-------------------------------------*
           if        w-prs-sof-tst        not  = "L" and
                     w-prs-sof-tin        not  = "F"
                     go to det-pos-stp-180.
      *
           move      003                  to   w-lpi-int-azi-lin      .
           move      003                  to   w-lpi-int-azi-pos      .
      *
           move      003                  to   w-lpi-tip-doc-lin      .
           move      065                  to   w-lpi-tip-doc-pin      .
           move      005                  to   w-lpi-tip-doc-lfi      .
           move      095                  to   w-lpi-tip-doc-pfi      .
      *
           move      007                  to   w-lpi-num-doc-lin      .
           move      065                  to   w-lpi-num-doc-pin      .
           move      010                  to   w-lpi-num-doc-lfi      .
           move      082                  to   w-lpi-num-doc-pfi      .
      *
           move      007                  to   w-lpi-dat-doc-lin      .
           move      082                  to   w-lpi-dat-doc-pin      .
           move      010                  to   w-lpi-dat-doc-lfi      .
           move      095                  to   w-lpi-dat-doc-pfi      .
      *
           move      010                  to   w-lpi-cod-fis-lin      .
           move      065                  to   w-lpi-cod-fis-pin      .
           move      013                  to   w-lpi-cod-fis-lfi      .
           move      082                  to   w-lpi-cod-fis-pfi      .
      *
           move      010                  to   w-lpi-prt-iva-lin      .
           move      082                  to   w-lpi-prt-iva-pin      .
           move      013                  to   w-lpi-prt-iva-lfi      .
           move      095                  to   w-lpi-prt-iva-pfi      .
      *
           move      014                  to   w-lpi-fin-spt-lin      .
           move      052                  to   w-lpi-fin-spt-pin      .
           move      095                  to   w-lpi-fin-spt-pfi      .
      *
           move      013                  to   w-lpi-ind-spe-lin      .
           move      002                  to   w-lpi-ind-spe-pin      .
           move      018                  to   w-lpi-ind-spe-lfi      .
           move      043                  to   w-lpi-ind-spe-pfi      .
      *
           move      018                  to   w-lpi-rif-orf-lin      .
           move      002                  to   w-lpi-rif-orf-pin      .
           move      023                  to   w-lpi-rif-orf-lfi      .
           move      043                  to   w-lpi-rif-orf-pfi      .
      *
           move      000                  to   w-lpi-fin-cod-lin      .
           move      000                  to   w-lpi-fin-cod-pin      .
           move      000                  to   w-lpi-fin-cod-lfi      .
           move      000                  to   w-lpi-fin-cod-pfi      .
      *
           move      023                  to   w-lpi-fin-des-lin      .
           move      002                  to   w-lpi-fin-des-pin      .
           move      025                  to   w-lpi-fin-des-lfi      .
           move      043                  to   w-lpi-fin-des-pfi      .
      *
           move      023                  to   w-lpi-fin-qta-lin      .
           move      043                  to   w-lpi-fin-qta-pin      .
           move      025                  to   w-lpi-fin-qta-lfi      .
           move      055                  to   w-lpi-fin-qta-pfi      .
      *
           move      023                  to   w-lpi-fin-udm-lin      .
           move      055                  to   w-lpi-fin-udm-pin      .
           move      025                  to   w-lpi-fin-udm-lfi      .
           move      059                  to   w-lpi-fin-udm-pfi      .
      *
           move      023                  to   w-lpi-fin-prz-lin      .
           move      059                  to   w-lpi-fin-prz-pin      .
           move      025                  to   w-lpi-fin-prz-lfi      .
           move      071                  to   w-lpi-fin-prz-pfi      .
      *
           move      023                  to   w-lpi-fin-sco-lin      .
           move      071                  to   w-lpi-fin-sco-pin      .
           move      025                  to   w-lpi-fin-sco-lfi      .
           move      081                  to   w-lpi-fin-sco-pfi      .
      *
           move      023                  to   w-lpi-fin-dcn-lin      .
           move      081                  to   w-lpi-fin-dcn-pin      .
           move      025                  to   w-lpi-fin-dcn-lfi      .
           move      095                  to   w-lpi-fin-dcn-pfi      .
      *
           move      000                  to   w-lpi-cor-cod-lin      .
           move      000                  to   w-lpi-cor-cod-pin      .
           move      000                  to   w-lpi-cor-cod-lfi      .
           move      000                  to   w-lpi-cor-cod-pfi      .
      *
           move      025                  to   w-lpi-cor-des-lin      .
           move      002                  to   w-lpi-cor-des-pin      .
           move      055                  to   w-lpi-cor-des-lfi      .
           move      043                  to   w-lpi-cor-des-pfi      .
      *
           move      025                  to   w-lpi-cor-qta-lin      .
           move      043                  to   w-lpi-cor-qta-pin      .
           move      055                  to   w-lpi-cor-qta-lfi      .
           move      055                  to   w-lpi-cor-qta-pfi      .
      *
           move      025                  to   w-lpi-cor-udm-lin      .
           move      055                  to   w-lpi-cor-udm-pin      .
           move      055                  to   w-lpi-cor-udm-lfi      .
           move      059                  to   w-lpi-cor-udm-pfi      .
      *
           move      025                  to   w-lpi-cor-prz-lin      .
           move      059                  to   w-lpi-cor-prz-pin      .
           move      055                  to   w-lpi-cor-prz-lfi      .
           move      071                  to   w-lpi-cor-prz-pfi      .
      *
           move      025                  to   w-lpi-cor-sco-lin      .
           move      071                  to   w-lpi-cor-sco-pin      .
           move      055                  to   w-lpi-cor-sco-lfi      .
           move      081                  to   w-lpi-cor-sco-pfi      .
      *
           move      025                  to   w-lpi-cor-dcn-lin      .
           move      081                  to   w-lpi-cor-dcn-pin      .
           move      055                  to   w-lpi-cor-dcn-lfi      .
           move      095                  to   w-lpi-cor-dcn-pfi      .
      *
           move      056                  to   w-lpi-cdz-frn-lin      .
           move      002                  to   w-lpi-cdz-frn-pin      .
           move      064                  to   w-lpi-cdz-frn-lfi      .
           move      043                  to   w-lpi-cdz-frn-pfi      .
      *
           move      056                  to   w-lpi-cdz-pag-lin      .
           move      043                  to   w-lpi-cdz-pag-pin      .
           move      064                  to   w-lpi-cdz-pag-lfi      .
           move      095                  to   w-lpi-cdz-pag-pfi      .
      *
           move      064                  to   w-lpi-ann-frn-lin      .
           move      002                  to   w-lpi-ann-frn-pin      .
           move      069                  to   w-lpi-ann-frn-lfi      .
           move      043                  to   w-lpi-ann-frn-pfi      .
      *
           move      069                  to   w-lpi-nsx-rif-lin      .
           move      002                  to   w-lpi-nsx-rif-pin      .
           move      072                  to   w-lpi-nsx-rif-lfi      .
           move      043                  to   w-lpi-nsx-rif-pfi      .
      *
           move      064                  to   w-lpi-spz-lib-lin      .
           move      043                  to   w-lpi-spz-lib-pin      .
           move      072                  to   w-lpi-spz-lib-lfi      .
           move      095                  to   w-lpi-spz-lib-pfi      .
      *
           if        w-prs-sof-snl        =    "S"
                     move  004            to   w-lpi-lit-num-lin
           else      move  008            to   w-lpi-lit-num-lin      .
           move      066                  to   w-lpi-lit-num-pos      .
      *
           if        w-prs-sof-snl        =    "S"
                     move  004            to   w-lpi-lit-dat-lin
           else      move  008            to   w-lpi-lit-dat-lin      .
           move      083                  to   w-lpi-lit-dat-pos      .
      *
           if        w-prs-sof-snl        =    "S"
                     move  007            to   w-lpi-lit-cfi-lin
           else      move  011            to   w-lpi-lit-cfi-lin      .
           move      066                  to   w-lpi-lit-cfi-pos      .
      *
           if        w-prs-sof-snl        =    "S"
                     move  007            to   w-lpi-lit-piv-lin
           else      move  011            to   w-lpi-lit-piv-lin      .
           move      083                  to   w-lpi-lit-piv-pos      .
      *
           move      015                  to   w-lpi-lit-spt-lin      .
           move      054                  to   w-lpi-lit-spt-pos      .
      *
           move      014                  to   w-lpi-lit-ids-lin      .
           move      003                  to   w-lpi-lit-ids-pos      .
      *
           move      019                  to   w-lpi-lit-rif-lin      .
           move      003                  to   w-lpi-lit-rif-pos      .
      *
           move      057                  to   w-lpi-lit-cdf-lin      .
           move      003                  to   w-lpi-lit-cdf-pos      .
      *
           move      057                  to   w-lpi-lit-cdp-lin      .
           move      044                  to   w-lpi-lit-cdp-pos      .
      *
           move      065                  to   w-lpi-lit-apf-lin      .
           move      003                  to   w-lpi-lit-apf-pos      .
      *
       det-pos-stp-180.
      *                      *-----------------------------------------*
      *                      * A correzioni su posizionamenti orizzon- *
      *                      * tali                                    *
      *                      *-----------------------------------------*
           go to     det-pos-stp-300.
       det-pos-stp-200.
      *                  *---------------------------------------------*
      *                  * Tipo modulo stampa : Con codice prodotto    *
      *                  *---------------------------------------------*
       det-pos-stp-210.
      *                      *-----------------------------------------*
      *                      * Campi testata                           *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Tipo documento                      *
      *                          *-------------------------------------*
           if        w-prs-sof-snl        =    "S"
                     move  001            to   w-lpt-tmo-orf-lin
           else if   w-prs-sof-snl        =    "P"
                     move  004            to   w-lpt-tmo-orf-lin
           else      move  004            to   w-lpt-tmo-orf-lin      .
      *
           move      091                  to   w-lpt-tmo-orf-pos      .
      *                          *-------------------------------------*
      *                          * Numero documento                    *
      *                          *-------------------------------------*
           if        w-prs-sof-snl        =    "S"
                     move  005            to   w-lpt-num-doc-lin
           else if   w-prs-sof-snl        =    "P"
                     move  007            to   w-lpt-num-doc-lin
           else      move  009            to   w-lpt-num-doc-lin      .
      *
           move      090                  to   w-lpt-num-doc-pos      .
      *                          *-------------------------------------*
      *                          * Data documento                      *
      *                          *-------------------------------------*
           if        w-prs-sof-snl        =    "S"
                     move  005            to   w-lpt-dat-doc-lin
           else if   w-prs-sof-snl        =    "P"
                     move  007            to   w-lpt-dat-doc-lin
           else      move  009            to   w-lpt-dat-doc-lin      .
      *
           move      107                  to   w-lpt-dat-doc-pos      .
      *                          *-------------------------------------*
      *                          * Codice fiscale                      *
      *                          *-------------------------------------*
           if        w-prs-sof-snl        =    "S"
                     move  008            to   w-lpt-cod-fis-lin
           else if   w-prs-sof-snl        =    "P"
                     move  010            to   w-lpt-cod-fis-lin
           else      move  012            to   w-lpt-cod-fis-lin      .
      *
           move      087                  to   w-lpt-cod-fis-pos      .
      *                          *-------------------------------------*
      *                          * Partita iva                         *
      *                          *-------------------------------------*
           if        w-prs-sof-snl        =    "S"
                     move  008            to   w-lpt-prt-iva-lin
           else if   w-prs-sof-snl        =    "P"
                     move  010            to   w-lpt-prt-iva-lin
           else      move  012            to   w-lpt-prt-iva-lin      .
      *
           move      107                  to   w-lpt-prt-iva-pos      .
      *                          *-------------------------------------*
      *                          * Indirizzo di spedizione             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Ragione sociale                 *
      *                              *---------------------------------*
           move      015                  to   w-lpt-ids-rag-lin      .
           move      004                  to   w-lpt-ids-rag-pos      .
      *                              *---------------------------------*
      *                              * Via                             *
      *                              *---------------------------------*
           move      016                  to   w-lpt-ids-via-lin      .
           move      004                  to   w-lpt-ids-via-pos      .
      *                              *---------------------------------*
      *                              * Localita'                       *
      *                              *---------------------------------*
           move      017                  to   w-lpt-ids-loc-lin      .
           move      004                  to   w-lpt-ids-loc-pos      .
      *                          *-------------------------------------*
      *                          * Indirizzo di inoltro documento      *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Ragione sociale 1               *
      *                              *---------------------------------*
           move      016                  to   w-lpt-inl-rs1-lin      .
           move      070                  to   w-lpt-inl-rs1-pos      .
      *                              *---------------------------------*
      *                              * Ragione sociale 2               *
      *                              *---------------------------------*
           move      017                  to   w-lpt-inl-rs2-lin      .
           move      070                  to   w-lpt-inl-rs2-pos      .
      *                              *---------------------------------*
      *                              * Via                             *
      *                              *---------------------------------*
           move      018                  to   w-lpt-inl-via-lin      .
           move      070                  to   w-lpt-inl-via-pos      .
      *                              *---------------------------------*
      *                              * Localita'                       *
      *                              *---------------------------------*
           move      020                  to   w-lpt-inl-loc-lin      .
           move      070                  to   w-lpt-inl-loc-pos      .
      *                          *-------------------------------------*
      *                          * Tipo evasione, anche se non gestito *
      *                          *-------------------------------------*
           move      020                  to   w-lpt-tip-eva-lin      .
           move      004                  to   w-lpt-tip-eva-pos      .
      *                          *-------------------------------------*
      *                          * Riferimenti conferma ordine         *
      *                          *-------------------------------------*
           move      020                  to   w-lpt-rif-cof-lin      .
           move      004                  to   w-lpt-rif-cof-pos      .
      *                          *-------------------------------------*
      *                          * Nostra dipendenza                   *
      *                          *-------------------------------------*
           move      022                  to   w-lpt-des-dpz-lin      .
           move      004                  to   w-lpt-des-dpz-pos      .
       det-pos-stp-220.
      *                      *-----------------------------------------*
      *                      * Campi corpo                             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Prima linea corpo                   *
      *                          *-------------------------------------*
           move      026                  to   w-lpc-pri-rig-lin      .
      *                          *-------------------------------------*
      *                          * Ultima linea corpo                  *
      *                          *-------------------------------------*
           move      054                  to   w-lpc-ult-rig-lin      .
      *                          *-------------------------------------*
      *                          * Posizioni                           *
      *                          *                                     *
      *                          * ELETTRA                             *
      *                          *-------------------------------------*
      *                              *---------------------------------*
      *                              * Codice prodotto                 *
      *                              *---------------------------------*
           move      010                  to   w-lpc-cod-pro-pos      .
      *                              *---------------------------------*
      *                              * Descrizione                     *
      *                              *---------------------------------*
           move      025                  to   w-lpc-des-pro-pos      .
      *                              *---------------------------------*
      *                              * Quantita' ordinata              *
      *                              *---------------------------------*
           move      066                  to   w-lpc-qta-ord-pos      .
      *                              *---------------------------------*
      *                              * Unita' di misura                *
      *                              *---------------------------------*
           move      078                  to   w-lpc-umi-acq-pos      .
      *                              *---------------------------------*
      *                              * Prezzo di acquisto              *
      *                              *---------------------------------*
           move      082                  to   w-lpc-prz-acq-pos      .
      *                              *---------------------------------*
      *                              * 1. percentuale sconto           *
      *                              *---------------------------------*
           move      095                  to   w-lpc-per-scr-pos (1)  .
      *                              *---------------------------------*
      *                              * 2. percentuale sconto           *
      *                              *---------------------------------*
           move      101                  to   w-lpc-per-scr-pos (2)  .
      *                              *---------------------------------*
      *                              * 3. percentuale sconto           *
      *                              *---------------------------------*
           move      095                  to   w-lpc-per-scr-pos (3)  .
      *                              *---------------------------------*
      *                              * 4. percentuale sconto           *
      *                              *---------------------------------*
           move      101                  to   w-lpc-per-scr-pos (4)  .
      *                              *---------------------------------*
      *                              * 5. percentuale sconto           *
      *                              *---------------------------------*
           move      095                  to   w-lpc-per-scr-pos (5)  .
      *                              *---------------------------------*
      *                              * Data di consegna                *
      *                              *---------------------------------*
           move      106                  to   w-lpc-dat-cns-pos      .
       det-pos-stp-230.
      *                      *-----------------------------------------*
      *                      * Campi piede                             *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * 1. voce descrittiva                 *
      *                          *-------------------------------------*
           move      058                  to   w-lpp-voc-des-lin      .
           move      004                  to   w-lpp-voc-des-pos      .
      *                          *-------------------------------------*
      *                          * 1. linea descr. condiz. acquisto    *
      *                          *-------------------------------------*
           move      066                  to   w-lpp-cda-des-lin      .
           move      004                  to   w-lpp-cda-des-pos      .
      *                          *-------------------------------------*
      *                          * Forma di pagamento                  *
      *                          *-------------------------------------*
           move      058                  to   w-lpp-des-fop-lin      .
           move      062                  to   w-lpp-des-fop-pos      .
      *                          *-------------------------------------*
      *                          * ABI                                 *
      *                          *-------------------------------------*
           move      059                  to   w-lpp-des-abi-lin      .
           move      062                  to   w-lpp-des-abi-pos      .
      *                          *-------------------------------------*
      *                          * CAB                                 *
      *                          *-------------------------------------*
           move      060                  to   w-lpp-des-cab-lin      .
           move      062                  to   w-lpp-des-cab-pos      .
      *                          *-------------------------------------*
      *                          * C/C di appoggio                     *
      *                          *-------------------------------------*
           move      061                  to   w-lpp-ccc-app-lin      .
           move      062                  to   w-lpp-ccc-app-pos      .
      *                          *-------------------------------------*
      *                          * Literal segue                       *
      *                          *-------------------------------------*
           move      066                  to   w-lpp-lit-seg-lin      .
           move      105                  to   w-lpp-lit-seg-pos      .
      *                          *-------------------------------------*
      *                          * Numero fax                          *
      *                          *-------------------------------------*
           if        w-prs-sof-snl        =    "S"
                     move  070            to   w-lpp-num-fax-lin
           else if   w-prs-sof-snl        =    "P"
                     move  066            to   w-lpp-num-fax-lin
           else      move  070            to   w-lpp-num-fax-lin      .
      *
           if        w-prs-sof-snl        =    "S"
                     move  004            to   w-lpp-num-fax-pos
           else if   w-prs-sof-snl        =    "P"
                     move  062            to   w-lpp-num-fax-pos
           else      move  004            to   w-lpp-num-fax-pos      .
      *                          *-------------------------------------*
      *                          * Responsabile ordine                 *
      *                          *-------------------------------------*
           move      066                  to   w-lpp-rsp-ord-lin      .
           move      062                  to   w-lpp-rsp-ord-pos      .
       det-pos-stp-240.
      *                      *-----------------------------------------*
      *                      * Posizionamenti per intestazione         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da eseguire                 *
      *                          *-------------------------------------*
           if        w-prs-sof-tst        not  = "L" and
                     w-prs-sof-tin        not  = "F"
                     go to det-pos-stp-280.
      *
           move      003                  to   w-lpi-int-azi-lin      .
           move      003                  to   w-lpi-int-azi-pos      .
      *
           move      003                  to   w-lpi-tip-doc-lin      .
           move      086                  to   w-lpi-tip-doc-pin      .
           move      005                  to   w-lpi-tip-doc-lfi      .
           move      118                  to   w-lpi-tip-doc-pfi      .
      *
           move      007                  to   w-lpi-num-doc-lin      .
           move      086                  to   w-lpi-num-doc-pin      .
           move      010                  to   w-lpi-num-doc-lfi      .
           move      103                  to   w-lpi-num-doc-pfi      .
      *
           move      007                  to   w-lpi-dat-doc-lin      .
           move      103                  to   w-lpi-dat-doc-pin      .
           move      010                  to   w-lpi-dat-doc-lfi      .
           move      118                  to   w-lpi-dat-doc-pfi      .
      *
           move      010                  to   w-lpi-cod-fis-lin      .
           move      086                  to   w-lpi-cod-fis-pin      .
           move      013                  to   w-lpi-cod-fis-lfi      .
           move      103                  to   w-lpi-cod-fis-pfi      .
      *
           move      010                  to   w-lpi-prt-iva-lin      .
           move      103                  to   w-lpi-prt-iva-pin      .
           move      013                  to   w-lpi-prt-iva-lfi      .
           move      118                  to   w-lpi-prt-iva-pfi      .
      *
           move      014                  to   w-lpi-fin-spt-lin      .
           move      068                  to   w-lpi-fin-spt-pin      .
           move      118                  to   w-lpi-fin-spt-pfi      .
      *
           move      013                  to   w-lpi-ind-spe-lin      .
           move      003                  to   w-lpi-ind-spe-pin      .
           move      018                  to   w-lpi-ind-spe-lfi      .
           move      044                  to   w-lpi-ind-spe-pfi      .
      *
           move      018                  to   w-lpi-rif-orf-lin      .
           move      003                  to   w-lpi-rif-orf-pin      .
           move      023                  to   w-lpi-rif-orf-lfi      .
           move      044                  to   w-lpi-rif-orf-pfi      .
      *
           move      023                  to   w-lpi-fin-cod-lin      .
           move      003                  to   w-lpi-fin-cod-pin      .
           move      025                  to   w-lpi-fin-cod-lfi      .
           move      018                  to   w-lpi-fin-cod-pfi      .
      *
           move      023                  to   w-lpi-fin-des-lin      .
           move      018                  to   w-lpi-fin-des-pin      .
           move      025                  to   w-lpi-fin-des-lfi      .
           move      061                  to   w-lpi-fin-des-pfi      .
      *
           move      023                  to   w-lpi-fin-qta-lin      .
           move      061                  to   w-lpi-fin-qta-pin      .
           move      025                  to   w-lpi-fin-qta-lfi      .
           move      073                  to   w-lpi-fin-qta-pfi      .
      *
           move      023                  to   w-lpi-fin-udm-lin      .
           move      073                  to   w-lpi-fin-udm-pin      .
           move      025                  to   w-lpi-fin-udm-lfi      .
           move      079                  to   w-lpi-fin-udm-pfi      .
      *
           move      023                  to   w-lpi-fin-prz-lin      .
           move      079                  to   w-lpi-fin-prz-pin      .
           move      025                  to   w-lpi-fin-prz-lfi      .
           move      092                  to   w-lpi-fin-prz-pfi      .
      *
           move      023                  to   w-lpi-fin-sco-lin      .
           move      092                  to   w-lpi-fin-sco-pin      .
           move      025                  to   w-lpi-fin-sco-lfi      .
           move      103                  to   w-lpi-fin-sco-pfi      .
      *
           move      023                  to   w-lpi-fin-dcn-lin      .
           move      103                  to   w-lpi-fin-dcn-pin      .
           move      025                  to   w-lpi-fin-dcn-lfi      .
           move      118                  to   w-lpi-fin-dcn-pfi      .
      *
           move      025                  to   w-lpi-cor-cod-lin      .
           move      003                  to   w-lpi-cor-cod-pin      .
           move      055                  to   w-lpi-cor-cod-lfi      .
           move      018                  to   w-lpi-cor-cod-pfi      .
      *
           move      025                  to   w-lpi-cor-des-lin      .
           move      018                  to   w-lpi-cor-des-pin      .
           move      055                  to   w-lpi-cor-des-lfi      .
           move      061                  to   w-lpi-cor-des-pfi      .
      *
           move      025                  to   w-lpi-cor-qta-lin      .
           move      061                  to   w-lpi-cor-qta-pin      .
           move      055                  to   w-lpi-cor-qta-lfi      .
           move      073                  to   w-lpi-cor-qta-pfi      .
      *
           move      025                  to   w-lpi-cor-udm-lin      .
           move      073                  to   w-lpi-cor-udm-pin      .
           move      055                  to   w-lpi-cor-udm-lfi      .
           move      079                  to   w-lpi-cor-udm-pfi      .
      *
           move      025                  to   w-lpi-cor-prz-lin      .
           move      079                  to   w-lpi-cor-prz-pin      .
           move      055                  to   w-lpi-cor-prz-lfi      .
           move      092                  to   w-lpi-cor-prz-pfi      .
      *
           move      025                  to   w-lpi-cor-sco-lin      .
           move      092                  to   w-lpi-cor-sco-pin      .
           move      055                  to   w-lpi-cor-sco-lfi      .
           move      103                  to   w-lpi-cor-sco-pfi      .
      *
           move      025                  to   w-lpi-cor-dcn-lin      .
           move      103                  to   w-lpi-cor-dcn-pin      .
           move      055                  to   w-lpi-cor-dcn-lfi      .
           move      118                  to   w-lpi-cor-dcn-pfi      .
      *
           move      056                  to   w-lpi-cdz-frn-lin      .
           move      003                  to   w-lpi-cdz-frn-pin      .
           move      064                  to   w-lpi-cdz-frn-lfi      .
           move      061                  to   w-lpi-cdz-frn-pfi      .
      *
           move      056                  to   w-lpi-cdz-pag-lin      .
           move      061                  to   w-lpi-cdz-pag-pin      .
           move      064                  to   w-lpi-cdz-pag-lfi      .
           move      118                  to   w-lpi-cdz-pag-pfi      .
      *
           move      064                  to   w-lpi-ann-frn-lin      .
           move      003                  to   w-lpi-ann-frn-pin      .
           move      069                  to   w-lpi-ann-frn-lfi      .
           move      061                  to   w-lpi-ann-frn-pfi      .
      *
           move      069                  to   w-lpi-nsx-rif-lin      .
           move      003                  to   w-lpi-nsx-rif-pin      .
           move      072                  to   w-lpi-nsx-rif-lfi      .
           move      061                  to   w-lpi-nsx-rif-pfi      .
      *
           move      064                  to   w-lpi-spz-lib-lin      .
           move      061                  to   w-lpi-spz-lib-pin      .
           move      072                  to   w-lpi-spz-lib-lfi      .
           move      118                  to   w-lpi-spz-lib-pfi      .
      *
           if        w-prs-sof-snl        =    "S"
                     move  004            to   w-lpi-lit-num-lin
           else      move  008            to   w-lpi-lit-num-lin      .
           move      092                  to   w-lpi-lit-num-pos      .
      *
           if        w-prs-sof-snl        =    "S"
                     move  004            to   w-lpi-lit-dat-lin
           else      move  008            to   w-lpi-lit-dat-lin      .
           move      109                  to   w-lpi-lit-dat-pos      .
      *
           if        w-prs-sof-snl        =    "S"
                     move  007            to   w-lpi-lit-cfi-lin
           else      move  011            to   w-lpi-lit-cfi-lin      .
           move      088                  to   w-lpi-lit-cfi-pos      .
      *
           if        w-prs-sof-snl        =    "S"
                     move  007            to   w-lpi-lit-piv-lin
           else      move  011            to   w-lpi-lit-piv-lin      .
           move      105                  to   w-lpi-lit-piv-pos      .
      *
           move      015                  to   w-lpi-lit-spt-lin      .
           move      070                  to   w-lpi-lit-spt-pos      .
      *
           move      014                  to   w-lpi-lit-ids-lin      .
           move      004                  to   w-lpi-lit-ids-pos      .
      *
           move      019                  to   w-lpi-lit-rif-lin      .
           move      004                  to   w-lpi-lit-rif-pos      .
      *
           move      057                  to   w-lpi-lit-cdf-lin      .
           move      004                  to   w-lpi-lit-cdf-pos      .
      *
           move      057                  to   w-lpi-lit-cdp-lin      .
           move      062                  to   w-lpi-lit-cdp-pos      .
      *
           move      065                  to   w-lpi-lit-apf-lin      .
           move      004                  to   w-lpi-lit-apf-pos      .
      *
       det-pos-stp-280.
      *                      *-----------------------------------------*
      *                      * A correzioni su posizionamenti orizzon- *
      *                      * tali                                    *
      *                      *-----------------------------------------*
           go to     det-pos-stp-300.
       det-pos-stp-300.
      *              *-------------------------------------------------*
      *              * Correzione posizionamento orizzontali in base   *
      *              * all'ampiezza caratteri prescelta                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se correzione da effettuare            *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Se l'ampiezza caratteri selezionata e'  *
      *                      * a zero, vuol dire che e' stata selezio- *
      *                      * nata una stampante PostScript o HP-GL,  *
      *                      * quindi non si effettuano correzioni     *
      *                      *-----------------------------------------*
           if        p-sel-amc-sel        =    zero
                     go to det-pos-stp-500.
           if       (w-prs-sof-tmd        =    01    and
                     p-sel-amc-sel        =    12,00   ) or
                    (w-prs-sof-tmd        =    51    and
                     p-sel-amc-sel        =    15,00   )
                     go to det-pos-stp-500.
      *                  *---------------------------------------------*
      *                  * Determinazione coefficiente di correzione   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Deviazione in funzione del tipo modulo  *
      *                      *-----------------------------------------*
           if        w-prs-sof-tmd        =    01
                     go to det-pos-stp-310
           else if   w-prs-sof-tmd        =    51
                     go to det-pos-stp-320.
       det-pos-stp-310.
      *                      *-----------------------------------------*
      *                      * Tipo modulo : Senza codice prodotto     *
      *                      *-----------------------------------------*
           divide    12                   into p-sel-amc-sel
                                        giving w-det-pos-stp-coe      .
           go to     det-pos-stp-400.
       det-pos-stp-320.
      *                      *-----------------------------------------*
      *                      * Tipo modulo : Con codice prodotto       *
      *                      *-----------------------------------------*
           divide    15                   into p-sel-amc-sel
                                        giving w-det-pos-stp-coe      .
           go to     det-pos-stp-400.
       det-pos-stp-400.
      *                  *---------------------------------------------*
      *                  * Calcolo                                     *
      *                  *---------------------------------------------*
       det-pos-stp-410.
      *                      *-----------------------------------------*
      *                      * Campi testata                           *
      *                      *-----------------------------------------*
           multiply  w-det-pos-stp-coe    by   w-lpt-tmo-orf-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpt-num-doc-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpt-dat-doc-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpt-cod-fis-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpt-prt-iva-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpt-ids-rag-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpt-ids-via-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpt-ids-loc-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpt-inl-rs1-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpt-inl-rs2-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpt-inl-via-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpt-inl-loc-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpt-tip-eva-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpt-des-dpz-pos      .
       det-pos-stp-420.
      *                      *-----------------------------------------*
      *                      * Campi corpo                             *
      *                      *-----------------------------------------*
           multiply  w-det-pos-stp-coe    by   w-lpc-cod-pro-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpc-des-pro-pos      .
           add       10                   to   w-lpc-qta-ord-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpc-qta-ord-pos      .
           subtract  10                   from w-lpc-qta-ord-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpc-umi-acq-pos      .
           add       9                    to   w-lpc-prz-acq-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpc-prz-acq-pos      .
           subtract  9                    from w-lpc-prz-acq-pos      .
           add       3                    to   w-lpc-per-scr-pos (1)  .
           multiply  w-det-pos-stp-coe    by   w-lpc-per-scr-pos (1)  .
           subtract  3                    from w-lpc-per-scr-pos (1)  .
           add       3                    to   w-lpc-per-scr-pos (2)  .
           multiply  w-det-pos-stp-coe    by   w-lpc-per-scr-pos (2)  .
           subtract  3                    from w-lpc-per-scr-pos (2)  .
           add       3                    to   w-lpc-per-scr-pos (3)  .
           multiply  w-det-pos-stp-coe    by   w-lpc-per-scr-pos (3)  .
           subtract  3                    from w-lpc-per-scr-pos (3)  .
           add       3                    to   w-lpc-per-scr-pos (4)  .
           multiply  w-det-pos-stp-coe    by   w-lpc-per-scr-pos (4)  .
           subtract  3                    from w-lpc-per-scr-pos (4)  .
           add       3                    to   w-lpc-per-scr-pos (5)  .
           multiply  w-det-pos-stp-coe    by   w-lpc-per-scr-pos (5)  .
           subtract  3                    from w-lpc-per-scr-pos (5)  .
           multiply  w-det-pos-stp-coe    by   w-lpc-dat-cns-pos      .
       det-pos-stp-430.
      *                      *-----------------------------------------*
      *                      * Campi piede                             *
      *                      *-----------------------------------------*
           multiply  w-det-pos-stp-coe    by   w-lpp-voc-des-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpp-cda-des-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpp-des-fop-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpp-des-abi-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpp-des-cab-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpp-ccc-app-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpp-lit-seg-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpp-num-fax-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpp-rsp-ord-pos      .
      *                      *-----------------------------------------*
      *                      * Posizionamenti per intestazione         *
      *                      *-----------------------------------------*
      *                          *-------------------------------------*
      *                          * Test se da eseguire                 *
      *                          *-------------------------------------*
           if        w-prs-sof-tst        not  = "L" and
                     w-prs-sof-tin        not  = "F"
                     go to det-pos-stp-500.
      *                          *-------------------------------------*
      *                          * Esecuzione                          *
      *                          *-------------------------------------*
           multiply  w-det-pos-stp-coe    by   w-lpi-int-azi-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpi-tip-doc-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-tip-doc-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-num-doc-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-num-doc-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-dat-doc-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-dat-doc-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cod-fis-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cod-fis-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-prt-iva-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-prt-iva-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-spt-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-spt-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-ind-spe-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-ind-spe-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-rif-orf-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-rif-orf-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-cod-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-cod-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-des-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-des-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-qta-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-qta-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-udm-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-udm-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-prz-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-prz-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-sco-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-sco-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-dcn-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-fin-dcn-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-cod-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-cod-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-des-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-des-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-qta-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-qta-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-udm-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-udm-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-prz-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-prz-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-sco-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-sco-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-dcn-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cor-dcn-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cdz-frn-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cdz-frn-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cdz-pag-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-cdz-pag-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-ann-frn-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-ann-frn-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-nsx-rif-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-nsx-rif-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-spz-lib-pin      .
           multiply  w-det-pos-stp-coe    by   w-lpi-spz-lib-pfi      .
           multiply  w-det-pos-stp-coe    by   w-lpi-lit-num-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpi-lit-dat-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpi-lit-cfi-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpi-lit-piv-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpi-lit-spt-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpi-lit-ids-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpi-lit-rif-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpi-lit-cdp-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpi-lit-cdf-pos      .
           multiply  w-det-pos-stp-coe    by   w-lpi-lit-apf-pos      .
       det-pos-stp-500.
      *              *-------------------------------------------------*
      *              * Correzione posizionamenti con displacement o-   *
      *              * rizzontale e verticale                          *
      *              *-------------------------------------------------*
       det-pos-stp-510.
      *                  *---------------------------------------------*
      *                  * Campi testata                               *
      *                  *---------------------------------------------*
           add       w-dsp-dsp-vrt        to   w-lpt-tmo-orf-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-tmo-orf-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-num-doc-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-num-doc-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-dat-doc-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-dat-doc-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-cod-fis-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-cod-fis-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-prt-iva-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-prt-iva-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-ids-rag-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-ids-rag-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-ids-via-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-ids-via-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-ids-loc-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-ids-loc-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-inl-rs1-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-inl-rs1-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-inl-rs2-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-inl-rs2-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-inl-via-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-inl-via-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-inl-loc-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-inl-loc-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-tip-eva-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-tip-eva-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-rif-cof-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-rif-cof-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpt-des-dpz-lin      .
           add       w-dsp-dsp-hor        to   w-lpt-des-dpz-pos      .
       det-pos-stp-520.
      *                  *---------------------------------------------*
      *                  * Campi corpo                                 *
      *                  *---------------------------------------------*
           add       w-dsp-dsp-vrt        to   w-lpc-pri-rig-lin      .
      *
           add       w-dsp-dsp-vrt        to   w-lpc-ult-rig-lin      .
      *
           add       w-dsp-dsp-hor        to   w-lpc-cod-pro-pos      .
      *
           add       w-dsp-dsp-hor        to   w-lpc-des-pro-pos      .
      *
           add       w-dsp-dsp-hor        to   w-lpc-qta-ord-pos      .
      *
           add       w-dsp-dsp-hor        to   w-lpc-umi-acq-pos      .
      *
           add       w-dsp-dsp-hor        to   w-lpc-prz-acq-pos      .
      *
           add       w-dsp-dsp-hor        to   w-lpc-per-scr-pos (1)  .
           add       w-dsp-dsp-hor        to   w-lpc-per-scr-pos (2)  .
           add       w-dsp-dsp-hor        to   w-lpc-per-scr-pos (3)  .
           add       w-dsp-dsp-hor        to   w-lpc-per-scr-pos (4)  .
           add       w-dsp-dsp-hor        to   w-lpc-per-scr-pos (5)  .
      *
           add       w-dsp-dsp-hor        to   w-lpc-dat-cns-pos      .
       det-pos-stp-530.
      *                  *---------------------------------------------*
      *                  * Campi piede                                 *
      *                  *---------------------------------------------*
           add       w-dsp-dsp-vrt        to   w-lpp-voc-des-lin      .
           add       w-dsp-dsp-hor        to   w-lpp-voc-des-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpp-cda-des-lin      .
           add       w-dsp-dsp-hor        to   w-lpp-cda-des-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpp-des-fop-lin      .
           add       w-dsp-dsp-hor        to   w-lpp-des-fop-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpp-des-abi-lin      .
           add       w-dsp-dsp-hor        to   w-lpp-des-abi-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpp-des-cab-lin      .
           add       w-dsp-dsp-hor        to   w-lpp-des-cab-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpp-ccc-app-lin      .
           add       w-dsp-dsp-hor        to   w-lpp-ccc-app-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpp-lit-seg-lin      .
           add       w-dsp-dsp-hor        to   w-lpp-lit-seg-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpp-num-fax-lin      .
           add       w-dsp-dsp-hor        to   w-lpp-num-fax-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpp-rsp-ord-lin      .
           add       w-dsp-dsp-hor        to   w-lpp-rsp-ord-pos      .
      *                  *---------------------------------------------*
      *                  * Posizionamenti per intestazione documento   *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Test se da eseguire                     *
      *                      *-----------------------------------------*
           if        w-prs-sof-tst        not  = "L" and
                     w-prs-sof-tin        not  = "F"
                     go to det-pos-stp-999.
      *                      *-----------------------------------------*
      *                      * Esecuzione                              *
      *                      *-----------------------------------------*
      *
           add       w-dsp-dsp-vrt        to   w-lpi-int-azi-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-int-azi-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-tip-doc-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-tip-doc-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-tip-doc-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-tip-doc-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-num-doc-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-num-doc-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-num-doc-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-num-doc-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-dat-doc-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-dat-doc-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-dat-doc-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-dat-doc-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-cod-fis-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-cod-fis-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-cod-fis-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-cod-fis-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-prt-iva-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-prt-iva-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-prt-iva-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-prt-iva-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-fin-spt-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-spt-pin      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-spt-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-ind-spe-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-ind-spe-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-ind-spe-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-ind-spe-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-rif-orf-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-rif-orf-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-rif-orf-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-rif-orf-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-fin-cod-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-cod-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-fin-cod-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-cod-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-fin-des-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-des-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-fin-des-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-des-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-fin-qta-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-qta-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-fin-qta-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-qta-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-fin-udm-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-udm-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-fin-udm-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-udm-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-fin-prz-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-prz-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-fin-prz-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-prz-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-fin-sco-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-sco-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-fin-sco-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-sco-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-fin-dcn-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-dcn-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-fin-dcn-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-fin-dcn-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-cor-cod-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-cod-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-cor-cod-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-cod-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-cor-des-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-des-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-cor-des-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-des-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-cor-qta-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-qta-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-cor-qta-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-qta-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-cor-udm-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-udm-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-cor-udm-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-udm-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-cor-prz-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-prz-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-cor-prz-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-prz-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-cor-sco-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-sco-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-cor-sco-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-sco-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-cor-dcn-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-dcn-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-cor-dcn-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-cor-dcn-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-cdz-frn-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-cdz-frn-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-cdz-frn-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-cdz-frn-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-cdz-pag-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-cdz-pag-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-cdz-pag-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-cdz-pag-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-ann-frn-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-ann-frn-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-ann-frn-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-ann-frn-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-nsx-rif-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-nsx-rif-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-nsx-rif-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-nsx-rif-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-spz-lib-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-spz-lib-pin      .
           add       w-dsp-dsp-vrt        to   w-lpi-spz-lib-lfi      .
           add       w-dsp-dsp-hor        to   w-lpi-spz-lib-pfi      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-lit-num-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-lit-num-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-lit-dat-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-lit-dat-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-lit-cfi-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-lit-cfi-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-lit-piv-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-lit-piv-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-lit-spt-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-lit-spt-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-lit-ids-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-lit-ids-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-lit-rif-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-lit-rif-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-lit-cdp-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-lit-cdp-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-lit-cdf-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-lit-cdf-pos      .
      *
           add       w-dsp-dsp-vrt        to   w-lpi-lit-apf-lin      .
           add       w-dsp-dsp-hor        to   w-lpi-lit-apf-pos      .
      *
       det-pos-stp-999.
           exit.

      *    *===========================================================*
      *    * Descrizione in lingua per la stampa di : spese per la     *
      *    * fatturazione e sconti in chiusura e pagamento             *
      *    *-----------------------------------------------------------*
       det-des-ysf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valore in uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-des-ysf-des      .
       det-des-ysf-100.
      *              *-------------------------------------------------*
      *              * Normalizzazione record [ysf]                    *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofysf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ysf                 .
      *              *-------------------------------------------------*
      *              * Tentativo di lettura della descrizione con il   *
      *              * codice lingua del cliente                       *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODSPF    "         to   f-key                  .
           move      w-det-des-ysf-cod    to   rf-ysf-num-spf         .
           move      w-det-des-ysf-lng    to   rf-ysf-cod-lng         .
           move      "pgm/dcf/fls/ioc/obj/iofysf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ysf                 .
      *                  *---------------------------------------------*
      *                  * Se valore trovato : uscita con il valore    *
      *                  * letto                                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-des-ysf-200.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valore letto                *
      *                  *---------------------------------------------*
           move      rf-ysf-des-stp       to   w-det-des-ysf-des      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-des-ysf-999.
       det-des-ysf-200.
      *              *-------------------------------------------------*
      *              * Tentativo di lettura della descrizione con il   *
      *              * codice lingua per l'Italia                      *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODSPF    "         to   f-key                  .
           move      w-det-des-ysf-cod    to   rf-ysf-num-spf         .
           move      "I  "                to   rf-ysf-cod-lng         .
           move      "pgm/dcf/fls/ioc/obj/iofysf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ysf                 .
      *                  *---------------------------------------------*
      *                  * Se valore trovato : uscita con il valore    *
      *                  * letto                                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-des-ysf-400.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione valore letto                *
      *                  *---------------------------------------------*
           move      rf-ysf-des-stp       to   w-det-des-ysf-des      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-des-ysf-999.
       det-des-ysf-400.
      *              *-------------------------------------------------*
      *              * Uscita con valore a spaces                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     det-des-ysf-999.
       det-des-ysf-999.
           exit.

      *    *===========================================================*
      *    * Controllo tipo riga                                       *
      *    *-----------------------------------------------------------*
       ctl-tip-rig-000.
      *              *-------------------------------------------------*
      *              * Controllo se ci sono asterischi                 *
      *              *-------------------------------------------------*
           move      zero                 to   w-ctl-tip-rig-c01      .
           inspect   w-ctl-tip-rig-tri
                                      tallying w-ctl-tip-rig-c01
                                          for  all "*"                .
      *               *------------------------------------------------*
      *               * Deviazione in funzione del numero di asterischi*
      *               * trovati                                        *
      *               *------------------------------------------------*
           if        w-ctl-tip-rig-c01    =    zero
                     go to ctl-tip-rig-200
           else if   w-ctl-tip-rig-c01    =    1
                     go to ctl-tip-rig-100.
       ctl-tip-rig-100.
      *              *-------------------------------------------------*
      *              * Se c'e' un asterisco                            *
      *              *-------------------------------------------------*
           inspect   w-ctl-tip-rig-tri
                                     replacing all "*" by   spaces    .
      *              *-------------------------------------------------*
      *              * Segnale di presenza di asterisco                *
      *              *-------------------------------------------------*
           move      "#"                  to   w-tip-rig-ast          .
       ctl-tip-rig-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione tipo prodotto connesso al tipo  *
      *              * riga                                            *
      *              *-------------------------------------------------*
           move      w-ctl-tip-rig-chr (1)
                                          to   w-tip-rig-tpr          .
      *              *-------------------------------------------------*
      *              * Se tipo prodotto P                              *
      *              *-------------------------------------------------*
           if        w-ctl-tip-rig-chr (1)
                                          not  = "P"
                     go to ctl-tip-rig-999.
      *                  *---------------------------------------------*
      *                  * Bufferizzazione tipo funzionamento riga     *
      *                  * connesso al tipo riga                       *
      *                  *---------------------------------------------*
           move      w-ctl-tip-rig-chr (2)
                                          to   w-tip-rig-tfu          .
       ctl-tip-rig-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .

      *    *===========================================================*
      *    * Routine lettura archivio [yfp] e [yfx]                    *
      *    *-----------------------------------------------------------*
           copy      "pgm/dcf/prg/cpy/ldcfyfx0.lts"                   .


