       Identification Division.
       Program-Id.                                 elebol01           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    www                 *
      *                        Area gestionale:    cgi                 *
      *                                Settore:    bol                 *
      *                                   Fase:    elebol              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 31/12/23    *
      *                       Ultima revisione:    NdK del 07/01/25    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Bolla: conferma consegna                    *
      *                                                                *
      *                    ELETTRA                                     *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Progressivo riga per ordinamento                  *
      *            *---------------------------------------------------*
               10  srt-rig-key            pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Codice numerico prodotto                          *
      *            *---------------------------------------------------*
               10  srt-num-pro            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice alfanumerico prodotto                      *
      *            *---------------------------------------------------*
               10  srt-alf-pro            pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Residuo ordine                                    *
      *            *---------------------------------------------------*
               10  srt-qta-ven            pic s9(10)v9(03)            .
      *            *---------------------------------------------------*
      *            * Record [bir]                                      *
      *            *---------------------------------------------------*
               10  srt-rec-bir.
                   15  filler  occurs  1536
                                          pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*
      
      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mopsys"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/o"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mhtml0" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/h"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [cli]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rfcli"                          .
      *        *-------------------------------------------------------*
      *        * [zbi]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bol/fls/rec/rfzbi"                          .
      *        *-------------------------------------------------------*
      *        * [bit]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bol/fls/rec/rfbit"                          .
      *        *-------------------------------------------------------*
      *        * [bir]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bol/fls/rec/rfbir"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [zrm]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfzrm"                          .

      *    *===========================================================*
      *    * Work-area routine di trattamento variabile POST           *
      *    *                                                           *
      *    * ELETTRA                                                   *
      *    *-----------------------------------------------------------*
           copy      "ele/cgi/prg/cpy/elecgi00.cpw"                   .

      *    *===========================================================*
      *    * Area di comodo                                            *
      *    *-----------------------------------------------------------*
       01  w-exe.
      *        *-------------------------------------------------------*
      *        * Data di esecuzione                                    *
      *        *-------------------------------------------------------*
           05  w-exe-dat-exe              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Mese di esecuzione                                    *
      *        *-------------------------------------------------------*
           05  w-exe-mes-exe              pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Secolo/anno di esecuzione                             *
      *        *-------------------------------------------------------*
           05  w-exe-saa-exe              pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Ora                                                   *
      *        *-------------------------------------------------------*
           05  w-exe-ora-itr              pic  9(04)                  .
      *        *-------------------------------------------------------*
      *        * Stringhe di comodo per display                        *
      *        *-------------------------------------------------------*
           05  w-exe-str-dsp              pic  x(512)                 .
           05  w-exe-str-chd              pic  x(15)                  .
           05  w-exe-str-dsb              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Contatori di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-exe-ctr-rig              pic  9(05)                  .
           05  w-exe-ctr-ria              pic  x(05)                  .
           05  w-exe-sel-pro              pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Parametri in input estratti                           *
      *        *-------------------------------------------------------*
           05  w-exe-cod-rsm              pic  x(03)                  .
           05  w-exe-cnv-rsm              pic  9(03)                  .
           05  w-exe-let-rsm              pic  9(11)                  .
           05  w-exe-num-bol              pic  x(08)                  .
           05  w-exe-num-cnv              pic  9(06)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per visualizzazione tag tabella                *
      *        *-------------------------------------------------------*
           05  w-exe-ttd.
               10  w-exe-ttd-cki          pic  x(07)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per visualizzazione riga tabella               *
      *        *-------------------------------------------------------*
           05  w-exe-rig.
               10  w-exe-lun-prt          pic  9(02)                  .
               10  w-exe-saa-prt          pic  x(03)                  .
               10  w-exe-dpz-prt          pic  x(02)                  .
               10  w-exe-rig-qta          pic  9(11)                  .
               10  w-exe-rig-qtv          pic  9(11)                  .
               10  w-exe-flg-spn          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per messaggi di output                         *
      *        *-------------------------------------------------------*
           05  w-exe-err-msg              pic  x(80)                  .
           05  w-exe-cla-msg              pic  x(07)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per regolarizzazioni                           *
      *        *-------------------------------------------------------*
           05  w-exe-prm-vx1              pic  x(20)                  .
           05  w-exe-prm-vx2              pic  x(20)                  .

      *    *===========================================================*
      *    * Work area per Determinazioni                              *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Per determinazione codice numerico prodotto           *
      *        *-------------------------------------------------------*
           05  w-det-num-pro.
      *            *---------------------------------------------------*
      *            * Codice alfanumerico prodotto                      *
      *            *---------------------------------------------------*
               10  w-det-num-pro-alf      pic  x(24)                  .
               10  w-det-num-pro-ele      pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Codice numerico prodotto                          *
      *            *---------------------------------------------------*
               10  w-det-num-pro-num      pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Per determinazione tabella responsabili               *
      *        *-------------------------------------------------------*
           05  w-det-tbl-rsm.
      *            *---------------------------------------------------*
      *            * Tabella codici                                    *
      *            *---------------------------------------------------*
               10  w-det-tbl-cod-ele  occurs  48.
                   15  w-det-tbl-cod-rsp  pic  9(05)                  .
                   15  w-det-tbl-des-rsp  pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Contatori di comodo                               *
      *            *---------------------------------------------------*
               10  w-det-tbl-rsm-max      pic  9(03) value 48         .
               10  w-det-tbl-rsm-ctr      pic  9(03)                  .
               10  w-det-tbl-rsm-inx      pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Per determinazione tabella codici prodotto da verifi- *
      *        * care nell'ambito dell'ordine                          *
      *        *-------------------------------------------------------*
           05  w-det-cod-pdv.
      *            *---------------------------------------------------*
      *            * Tabella codici                                    *
      *            *---------------------------------------------------*
               10  w-det-cod-pdv-ele  occurs  500.
                   15  w-det-cod-pdv-alf  pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Contatori di comodo                               *
      *            *---------------------------------------------------*
               10  w-det-cod-pdv-max      pic  9(03) value 500        .
               10  w-det-cod-pdv-ctr      pic  9(03)                  .
               10  w-det-cod-pdv-inx      pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zrm]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zrm.
               10  w-let-arc-zrm-flg      pic  x(01)                  .
               10  w-let-arc-zrm-cod      pic  9(05)                  .
               10  w-let-arc-zrm-des      pic  x(40)                  .
               10  w-let-arc-zrm-fds      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcp.
               10  w-let-arc-dcp-flg      pic  x(01)                  .
               10  w-let-arc-dcp-num      pic  9(07)                  .
               10  w-let-arc-dcp-alf      pic  x(14)                  .
               10  w-let-arc-dcp-des      pic  x(40)                  .
               10  w-let-arc-dcp-umi      pic  x(03)                  .
               10  w-let-arc-dcp-ndq      pic  9(01)                  .
               10  w-let-arc-dcp-tip      pic  9(02)                  .
               10  w-let-arc-dcp-klb      pic  x(14)                  .

      *    *===========================================================*
      *    * Work area per esecuzione stampa                           *
      *    *-----------------------------------------------------------*
       01  w-stp.
      *        *-------------------------------------------------------*
      *        * Sub-work per intestazione pagina                      *
      *        *-------------------------------------------------------*
           05  w-stp-int.
      *            *---------------------------------------------------*
      *            * Campi di comodo                                   *
      *            *---------------------------------------------------*
               10  w-stp-int-nde          pic  x(08)                  .
               10  w-stp-int-ndo          pic  9(11)                  .
               10  w-stp-int-ndo-r redefines
                   w-stp-int-ndo.
                   15  w-stp-int-ndo-saa  pic  9(03)                  .
                   15  w-stp-int-ndo-dpz  pic  9(02)                  .
                   15  w-stp-int-ndo-prg  pic  9(06)                  .
               10  w-stp-int-npr          pic  9(09)                  .
               10  w-stp-int-npr-r redefines
                   w-stp-int-npr.
                   15  w-stp-int-npr-saa  pic  9(03)                  .
                   15  w-stp-int-npr-prg  pic  9(06)                  .

      *    *===========================================================*
      *    * Work per subroutines di Select                            *
      *    *-----------------------------------------------------------*
       01  w-slc.
      *        *-------------------------------------------------------*
      *        * Work per Select numero documento                      *
      *        *-------------------------------------------------------*
           05  w-slc-num-bit.
      *            *---------------------------------------------------*
      *            * Valori in entrata                                 *
      *            *---------------------------------------------------*
               10  w-slc-num-bit-num      pic  9(11)                  .
               10  w-slc-num-bit-dds      pic  9(07)                  .
               10  w-slc-num-bit-nds      pic  9(11)                  .
               10  w-slc-num-bit-nds-r redefines
                   w-slc-num-bit-nds.
                   15  w-slc-num-bit-nsa  pic  9(03)                  .
                   15  w-slc-num-bit-ndp  pic  9(02)                  .
                   15  w-slc-num-bit-npg  pic  9(06)                  .
               10  w-slc-num-bit-dpz      pic  9(02)                  .
               10  w-slc-num-bit-sgl      pic  x(03)                  .
               10  w-slc-num-bit-saa      pic  9(03)                  .
               10  w-slc-num-bit-fac      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Valori in uscita                                  *
      *            *---------------------------------------------------*
               10  w-slc-num-bit-sel      pic  x(01)                  .
               10  w-slc-num-bit-toc      pic  x(05)                  .
               10  w-slc-num-bit-dat      pic  9(07)                  .
               10  w-slc-num-bit-prt      pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Area di comodo                                    *
      *            *---------------------------------------------------*
               10  w-slc-num-bit-crb      pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per contatori ed indici                         *
      *    *-----------------------------------------------------------*
       01  w-cix.
      *        *-------------------------------------------------------*
      *        * Contatori generici                                    *
      *        *-------------------------------------------------------*
           05  w-cix-ctr-001              pic  9(05)                  .

      *    *===========================================================*
      *    * Work-area per routine int-lin-res-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-int-lin-res.
      *        *-------------------------------------------------------*
      *        * Flag di uscita                                        *
      *        *-------------------------------------------------------*
           05  w-int-lin-res-flg          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Numero di interlinee                                  *
      *        *-------------------------------------------------------*
           05  w-int-lin-res-lin          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Numero di linee per il test sulle residue             *
      *        *-------------------------------------------------------*
           05  w-int-lin-res-res          pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per operazioni sulle date                       *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wnrgdat0.cpw"                   .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  filler                 pic  x(01)                  .

      ******************************************************************
       Procedure Division                                             .
      ******************************************************************

      *================================================================*
      * Main                                                           *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Estrazione parametri                            *
      *              *-------------------------------------------------*
           perform   ext-prm-000          thru ext-prm-999            .
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           perform   opn-fls-000          thru opn-fls-999            .
       main-100.
      *              *-------------------------------------------------*
      *              * Ciclo di lettura e preparazione html            *
      *              *-------------------------------------------------*
           perform   exe-cph-000          thru exe-cph-999            .
       main-800.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   cls-fls-000          thru cls-fls-999            .
       main-999.
           exit      program.

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Estrazione parametri                                      *
      *    *-----------------------------------------------------------*
       ext-prm-000.
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Data di sistema                                 *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-exe-dat-exe          .
      *              *-------------------------------------------------*
      *              * CORRETTIVO PROVVISORIO                          *
      *              *-------------------------------------------------*
           if        w-exe-dat-exe        <    999999
                     add  1000000         to   w-exe-dat-exe          .
           move      w-exe-dat-exe        to   s-dat                  .
           move      s-mes                to   w-exe-mes-exe          .
           move      s-saa                to   w-exe-saa-exe          .
      *              *-------------------------------------------------*
      *              * Ora                                             *
      *              *-------------------------------------------------*
           move      s-ora                to   w-exe-ora-itr          .
           multiply  100                  by   w-exe-ora-itr          .
           add       s-min                to   w-exe-ora-itr          .
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-exe-cod-rsm          .
           move      zero                 to   w-exe-cnv-rsm          .
           move      zero                 to   w-exe-let-rsm          .
           move      spaces               to   w-exe-num-bol          .
           move      zero                 to   w-exe-num-cnv          .
           move      zero                 to   w-slc-num-bit-prt      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri                       *
      *              *-------------------------------------------------*
           move      "NO"                 to   w-cgi-tip-ope          .
           move      04                   to   w-cgi-str-num          .
           perform   ope-prm-inp-000      thru ope-prm-inp-999        .
      *              *-------------------------------------------------*
      *              * Lettura della variabile di environment          *
      *              *-------------------------------------------------*
           move      "I2"                 to   o-ope                  .
           move      "POST"               to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *              *-------------------------------------------------*
      *              * Estrazione parametri                            *
      *              *-------------------------------------------------*
           move      o-pst                to   w-cgi-str-var          .
           perform   cgi-str-ext-000      thru cgi-str-ext-999        .
       ext-prm-300.
      *              *-------------------------------------------------*
      *              * Assegnazione componenti                         *
      *              *-------------------------------------------------*
           move      "EX"                 to   w-cgi-tip-ope          .
           move      w-cgi-str-num        to   w-cgi-str-num          .
           perform   ope-prm-inp-000      thru ope-prm-inp-999        .
       ext-prm-500.
      *              *-------------------------------------------------*
      *              * Regolarizzazioni                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Codice numerico responsabile                *
      *                  *---------------------------------------------*
           move      "CV"                 to   p-ope                  .
           move      03                   to   p-car                  .
           move      w-exe-cod-rsm        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-num                to   w-exe-cnv-rsm          .
      *                  *---------------------------------------------*
      *                  * Conversione numero documento                *
      *                  *---------------------------------------------*
           move      "CV"                 to   p-ope                  .
           move      06                   to   p-car                  .
           move      w-exe-num-bol        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-num                to   w-exe-num-cnv          .
       ext-prm-700.
      *              *-------------------------------------------------*
      *              * Operazioni preliminari                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione tabella responsabili           *
      *                  *---------------------------------------------*
           perform   det-tbl-rsm-000      thru det-tbl-rsm-999        .
       ext-prm-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ext-prm-999.
       ext-prm-999.
           exit.

      *    *===========================================================*
      *    * Estrazione parametri                                      *
      *    *                                                           *
      *    * Subroutine di assegnazione del valore in base al nome del *
      *    * campo in input                                            *
      *    *-----------------------------------------------------------*
       ext-prm-ass-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del nome campo           *
      *              *-------------------------------------------------*
           if        w-all-str-cat (1)    =    "rsp_doc"
                     move  w-all-str-cat (2)
                                          to   w-exe-cod-rsm
           else if   w-all-str-cat (1)    =    "num_bol"
                     move  w-all-str-cat (2)
                                          to   w-exe-num-bol          .
       ext-prm-ass-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ext-prm-ass-999.
       ext-prm-ass-999.
           exit.

      *    *===========================================================*
      *    * Open files                                                *
      *    *-----------------------------------------------------------*
       opn-fls-000.
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [zbi]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofzbi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zbi                 .
      *              *-------------------------------------------------*
      *              * [bit]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
      *              *-------------------------------------------------*
      *              * [bir]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bir                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
       opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files                                               *
      *    *-----------------------------------------------------------*
       cls-fls-000.
      *              *-------------------------------------------------*
      *              * [cli]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
      *              *-------------------------------------------------*
      *              * [zbi]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofzbi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zbi                 .
      *              *-------------------------------------------------*
      *              * [bit]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
      *              *-------------------------------------------------*
      *              * [bir]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bir                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
       cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Esecuzione funzione ST : Stampa                           *
      *    *-----------------------------------------------------------*
       exe-cph-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Esecuzione routine di stampa                    *
      *              *-------------------------------------------------*
           perform   rou-stp-doc-000      thru rou-stp-doc-999        .
       exe-cph-999.
           exit.

      *    *===========================================================*
      *    * Stampa documento                                          *
      *    *-----------------------------------------------------------*
       rou-stp-doc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       rou-stp-doc-020.
      *              *-------------------------------------------------*
      *              * Test preliminare su operatore                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        w-exe-cnv-rsm        not  = zero
                     go to rou-stp-doc-030.
      *                  *---------------------------------------------*
      *                  * Intestazione pagina                         *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                  *---------------------------------------------*
      *                  * Messaggio                                   *
      *                  *---------------------------------------------*
           move      "SELEZIONARE UN OPERATORE"
                                          to   w-exe-err-msg          .
           move      "msg_red"            to   w-exe-cla-msg          .
           perform   err-msg-htm-000      thru err-msg-htm-999        .
      *                  *---------------------------------------------*
      *                  * A chiusura HTML                             *
      *                  *---------------------------------------------*
           go to     rou-stp-doc-800.
       rou-stp-doc-030.
      *              *-------------------------------------------------*
      *              * Test preliminare su numero documento            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        w-exe-num-bol        not  = spaces
                     go to rou-stp-doc-050.
      *                  *---------------------------------------------*
      *                  * Intestazione pagina                         *
      *                  *---------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                  *---------------------------------------------*
      *                  * Messaggio                                   *
      *                  *---------------------------------------------*
           move      "INSERIRE UN NUMERO DOCUMENTO"
                                          to   w-exe-err-msg          .
           move      "msg_red"            to   w-exe-cla-msg          .
           perform   err-msg-htm-000      thru err-msg-htm-999        .
      *                  *---------------------------------------------*
      *                  * A chiusura HTML                             *
      *                  *---------------------------------------------*
           go to     rou-stp-doc-800.
       rou-stp-doc-050.
      *              *-------------------------------------------------*
      *              * Routine di ricerca                              *
      *              *-------------------------------------------------*
           perform   slc-num-bit-000      thru slc-num-bit-999        .
      *                  *---------------------------------------------*
      *                  * Se non selezionato alcun elemento : a       *
      *                  * reimpostazione                              *
      *                  *---------------------------------------------*
           if        w-slc-num-bit-sel    not  = spaces
                     go to rou-stp-doc-080.
       rou-stp-doc-060.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
      *              *-------------------------------------------------*
      *              * Lettura record testata da stampare              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-slc-num-bit-prt    to   rf-bit-num-prt         .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
           if        f-sts                =    e-not-err
                     go to rou-stp-doc-100.
       rou-stp-doc-080.
      *                  *---------------------------------------------*
      *                  * Se record non trovato                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Intestazione pagina                     *
      *                      *-----------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *                      *-----------------------------------------*
      *                      * Literal                                 *
      *                      *-----------------------------------------*
           move      "DDT NON TROVATO !"  to   w-exe-err-msg          .
           move      "msg_red"            to   w-exe-cla-msg          .
           perform   err-msg-htm-000      thru err-msg-htm-999        .
      *                      *-----------------------------------------*
      *                      * A chiusura HTML                         *
      *                      *-----------------------------------------*
           go to     rou-stp-doc-800.
       rou-stp-doc-100.
      *              *-------------------------------------------------*
      *              * Test se documento consegnato                    *
      *              *-------------------------------------------------*
       rou-stp-doc-200.
      *              *-------------------------------------------------*
      *              * Flag di spunta                                  *
      *              *-------------------------------------------------*
           if        rf-bit-flg-nbx (3)   =    spaces
                     move  "N"            to   w-exe-flg-spn
           else      move  "S"            to   w-exe-flg-spn          .
      *              *-------------------------------------------------*
      *              * Responsabile di magazzino                       *
      *              *-------------------------------------------------*
           move      rf-bit-pvf-ime       to   w-exe-let-rsm          .
      *              *-------------------------------------------------*
      *              * Eventuale stampa intestazione pagina            *
      *              *-------------------------------------------------*
           perform   int-pag-sta-000      thru int-pag-sta-999        .
      *              *-------------------------------------------------*
      *              * Stampa testata documento                        *
      *              *-------------------------------------------------*
           perform   stp-tes-doc-000      thru stp-tes-doc-999        .
      *              *-------------------------------------------------*
      *              * Eventuale segnale di documento consegnato       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rf-bit-flg-nbx (3)   =    spaces
                     go to rou-stp-doc-300.
      *                  *---------------------------------------------*
      *                  * Literal                                     *
      *                  *---------------------------------------------*
           move      "DOCUMENTO DI TRASPORTO CONSEGNATO !"
                                          to   w-exe-err-msg          .
           move      "msg_red"            to   w-exe-cla-msg          .
           perform   err-msg-htm-000      thru err-msg-htm-999        .
       rou-stp-doc-300.
      *              *-------------------------------------------------*
      *              * Stampa corpo documento                          *
      *              *-------------------------------------------------*
           perform   stp-cor-doc-000      thru stp-cor-doc-999        .
       rou-stp-doc-400.
      *              *-------------------------------------------------*
      *              * Stampa piede documento                          *
      *              *-------------------------------------------------*
           perform   stp-pie-doc-000      thru stp-pie-doc-999        .
       rou-stp-doc-800.
      *              *-------------------------------------------------*
      *              * Chiusura html                                   *
      *              *-------------------------------------------------*
           perform   emi-htm-cls-000      thru emi-htm-cls-999        .
       rou-stp-doc-900.
      *              *-------------------------------------------------*
      *              * Chiusura                                        *
      *              *-------------------------------------------------*
           go to     rou-stp-doc-999.
       rou-stp-doc-999.
           exit.

      *    *===========================================================*
      *    * Routine di stampa testata documento                       *
      *    *-----------------------------------------------------------*
       stp-tes-doc-000.
      *              *-------------------------------------------------*
      *              * Inizio testata                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Apertura tabella per la testata             *
      *                  *---------------------------------------------*
           display   "<table class='bordotab' id='tes' name='tes' width=
      -              "100%>"                                          .
      *                  *---------------------------------------------*
      *                  * Apertura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-tes-doc-100.
      *                  *---------------------------------------------*
      *                  * Estremi documento                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing numero                          *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-slc-num-bit-npg    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      70                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      rf-bit-cod-tmb       to   w-all-str-cat (1)      .
           move      p-edt                to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * Editing data documento                  *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      rf-bit-dat-doc       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (3)      .
      *                      *-----------------------------------------*
      *                      * Editing data inizio trasporto           *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      rf-bit-dat-itr       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (5)      .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      120                  to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      "del"                to   w-all-str-cat (2)      .
           move      "- Inizio trasporto :"
                                          to   w-all-str-cat (4)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * Assemblaggio ora inizio trasporto       *
      *                      *-----------------------------------------*
           move      120                  to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      "- ore"              to   w-all-str-cat (2)      .
           move      rf-bit-ora-itr
                    (01 : 02)             to   w-all-str-cat (3)      .
           move      ":"                  to   w-all-str-cat (4)      .
           move      rf-bit-ora-itr
                    (03 : 02)             to   w-all-str-cat (5)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * Test su codice responsabile             *
      *                      *-----------------------------------------*
           if        rf-bit-pvf-ime       =    zero
                     go to stp-tes-doc-150.
      *                      *-----------------------------------------*
      *                      * Lettura descrizione responsabile        *
      *                      *-----------------------------------------*
           move      rf-bit-pvf-ime       to   w-let-arc-zrm-cod      .
           perform   let-arc-zrm-000      thru let-arc-zrm-999        .
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      120                  to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      "-"                  to   w-all-str-cat (2)      .
           move      w-let-arc-zrm-des    to   w-all-str-cat (3)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
       stp-tes-doc-150.
      *                  *---------------------------------------------*
      *                  * Estremi bolla                               *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      w-all-str-alf        to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "B"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Data                                        *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Data attuale"       to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "B"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Ora                                         *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Ora"                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "B"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-tes-doc-180.
      *                  *---------------------------------------------*
      *                  * Chiusura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Apertura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-tes-doc-200.
      *                  *---------------------------------------------*
      *                  * Cliente                                     *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing                                 *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      rf-bit-cod-arc       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       stp-tes-doc-300.
      *                      *-----------------------------------------*
      *                      * Lettura anagrafica cliente              *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLI"             to   f-key                  .
           move      rf-bit-cod-arc       to   rf-cli-cod-cli         .
           move      "pgm/cge/fls/ioc/obj/iofcli"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-cli                 .
           if        f-sts                not  = e-not-err
                     move  all "."        to   rf-cli-rag-soc         .
       stp-tes-doc-320.
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      70                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      p-edt                to   w-all-str-cat (1)      .
           move      rf-bit-dpz-arc       to   w-all-str-cat (2)      .
           move      "-"                  to   w-all-str-cat (3)      .
           move      rf-cli-rag-soc       to   w-all-str-cat (4)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *                      *-----------------------------------------*
      *                      * Emissione                               *
      *                      *-----------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      w-all-str-alf        to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                      *-----------------------------------------*
      *                      * Barcode numero ordine                   *
      *                      *                                         *
      *                      * ATTUALMENTE INIBITO                     *
      *                      *-----------------------------------------*
           go to     stp-tes-doc-600.
           move      spaces               to   w-exe-str-dsp          .
      *
           string    "<td colspan='1' align='left'>"
                                delimited by size
                     "<img border=0 src='./elebcd01?BAR=c39&COD="
                                delimited by size
                     rf-bit-num-prt
                    (06 : 06)   delimited by spaces
                     "'></td>"
                                delimited by size
                                          into w-exe-str-dsp          .
           display   w-exe-str-dsp                                    .
       stp-tes-doc-600.
      *                  *---------------------------------------------*
      *                  * Data attuale                                *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Editing data attuale                    *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      w-exe-dat-exe        to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Emissione                               *
      *                      *-----------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      p-edt                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-tes-doc-700.
      *                  *---------------------------------------------*
      *                  * Ora attuale                                 *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Assemblaggio                            *
      *                      *-----------------------------------------*
           move      20                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      w-exe-ora-itr
                    (01 : 02)             to   w-all-str-cat (1)      .
           move      ":"                  to   w-all-str-cat (2)      .
           move      w-exe-ora-itr
                    (03 : 02)             to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                      *-----------------------------------------*
      *                      * Emissione                               *
      *                      *-----------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      w-all-str-alf        to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Chiusura riga                               *
      *                  *---------------------------------------------*
           display   "</tr>"                                          .
      *                  *---------------------------------------------*
      *                  * Chiusura tabella                            *
      *                  *---------------------------------------------*
           display   "</table>"                                       .
       stp-tes-doc-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *-----------------------------------------------------------*
       stp-cor-doc-000.
      *              *-------------------------------------------------*
      *              * Intestazione colonne                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Apertura tabella per le righe               *
      *                  *---------------------------------------------*
           display   "<table class='bordotab' id='rig' name='rig' width=
      -              "100% style='opacity:0.4;'>"                     .
      *                  *---------------------------------------------*
      *                  * Apertura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Progressivo riga                *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "NR"                 to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Codice                          *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Codice"             to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Descrizione                     *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Descrizione"        to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Quantita'                       *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Qta"                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Chiusura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-800.
      *              *-------------------------------------------------*
      *              * Esecuzione sort per ordinamento                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-cor-doc-inp-000
                                          thru stp-cor-doc-inp-999
                     output procedure     is   stp-cor-doc-out-000
                                          thru stp-cor-doc-out-999    .
       stp-cor-doc-900.
      *              *-------------------------------------------------*
      *              * Fine Stampa                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura tabella                            *
      *                  *---------------------------------------------*
           display   "</table>"                                       .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     stp-cor-doc-999.
       stp-cor-doc-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine di input                                       *
      *    *-----------------------------------------------------------*
       stp-cor-doc-inp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione contatori                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-exe-ctr-rig          .
           move      zero                 to   w-exe-sel-pro          .
       stp-cor-doc-inp-100.
      *              *-------------------------------------------------*
      *              * Start su [bir]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-slc-num-bit-prt    to   rf-bir-num-prt         .
           move      zero                 to   rf-bir-num-prg         .
           move      "pgm/bol/fls/ioc/obj/iofbir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bir                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : fine lettura           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  stp-cor-doc-inp-900.
       stp-cor-doc-inp-200.
      *              *-------------------------------------------------*
      *              * Next su [bir]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bir                 .
      *                  *---------------------------------------------*
      *                  * Se at end : fine lettura                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  stp-cor-doc-inp-900.
       stp-cor-doc-inp-300.
      *              *-------------------------------------------------*
      *              * Se oltre il massimo : fine lettura              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su protocollo                          *
      *                  *---------------------------------------------*
           if        rf-bir-num-prt       not  = w-slc-num-bit-prt
                     go to  stp-cor-doc-inp-900.
       stp-cor-doc-inp-400.
      *              *-------------------------------------------------*
      *              * Selezioni su [bir]                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo riga                           *
      *                  *---------------------------------------------*
           if        rf-bir-tip-rig       not  = "P    " and
                     rf-bir-tip-rig       not  = "PN   "
                     go to  stp-cor-doc-inp-200.
       stp-cor-doc-inp-500.
      *              *-------------------------------------------------*
      *              * Letture complementari                           *
      *              *-------------------------------------------------*
       stp-cor-doc-inp-600.
      *              *-------------------------------------------------*
      *              * Composizione record di sort                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record di sort              *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
      *                  *---------------------------------------------*
      *                  * Composizione chiave                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Progressivo riga                        *
      *                      *-----------------------------------------*
           move      rf-bir-num-prg       to   srt-rig-key            .
      *                  *---------------------------------------------*
      *                  * Composizione dati                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice numerico prodotto                *
      *                      *-----------------------------------------*
           move      rf-bir-num-pro       to   srt-num-pro            .
      *                      *-----------------------------------------*
      *                      * Codice alfanumerico prodotto            *
      *                      *-----------------------------------------*
           move      rf-bir-alf-pro       to   srt-alf-pro            .
      *                      *-----------------------------------------*
      *                      * Quantita' da spedire                    *
      *                      *-----------------------------------------*
           move      rf-bir-qta-ven       to   srt-qta-ven            .
      *                      *-----------------------------------------*
      *                      * Un intero record [bir]                  *
      *                      *-----------------------------------------*
           move      rf-bir               to   srt-rec-bir            .
       stp-cor-doc-inp-700.
      *              *-------------------------------------------------*
      *              * Rilascio del record al Sort                     *
      *              *-------------------------------------------------*
           release   srt-rec                                          .
       stp-cor-doc-inp-800.
      *              *-------------------------------------------------*
      *              * Riciclo a record successivo                     *
      *              *-------------------------------------------------*
           go to     stp-cor-doc-inp-200.
       stp-cor-doc-inp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-cor-doc-inp-999.
       stp-cor-doc-inp-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine di output                                      *
      *    *-----------------------------------------------------------*
       stp-cor-doc-out-000.
      *              *-------------------------------------------------*
      *              * Test su numero prodotti selezionati             *
      *              *-------------------------------------------------*
       stp-cor-doc-out-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se At End : uscita                          *
      *                  *---------------------------------------------*
           return    srt    at end
                            go to stp-cor-doc-out-900                 .
       stp-cor-doc-out-300.
      *              *-------------------------------------------------*
      *              * Normalizzazione record [bir]                    *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbir"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bir                 .
      *              *-------------------------------------------------*
      *              * Ripresa record [bir]                            *
      *              *-------------------------------------------------*
           move      srt-rec-bir          to   rf-bir                 .
      *              *-------------------------------------------------*
      *              * Incremento contatore righe                      *
      *              *-------------------------------------------------*
           add       1                    to   w-exe-ctr-rig          .
       stp-cor-doc-out-500.
      *              *-------------------------------------------------*
      *              * Emissione riga                                  *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine di emissione                     *
      *                  *---------------------------------------------*
           perform   stp-cor-doc-rig-000  thru stp-cor-doc-rig-999    .
       stp-cor-doc-out-800.
      *              *-------------------------------------------------*
      *              * Riciclo a riga successiva                       *
      *              *-------------------------------------------------*
           go to     stp-cor-doc-out-200.
       stp-cor-doc-out-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-cor-doc-out-999.
       stp-cor-doc-out-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine di emissione della riga                        *
      *    *-----------------------------------------------------------*
       stp-cor-doc-rig-000.
      *              *-------------------------------------------------*
      *              * Letture preliminari                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Quantita' ordine                            *
      *                  *---------------------------------------------*
           move      rf-bir-qta-ven       to   w-exe-rig-qta          .
      *                  *---------------------------------------------*
      *                  * Quantita' spuntata                          *
      *                  *---------------------------------------------*
           move      rf-bir-qta-a03       to   w-exe-rig-qtv          .
      *                  *---------------------------------------------*
      *                  * Lettura prodotto                            *
      *                  *---------------------------------------------*
           move      srt-num-pro          to   w-let-arc-dcp-num      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
      *                  *---------------------------------------------*
      *                  * Determinazione ubicazione                   *
      *                  *---------------------------------------------*
       stp-cor-doc-rig-050.
      *              *-------------------------------------------------*
      *              * Apertura riga                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing del progressivo interno riga        *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-exe-ctr-rig        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-exe-ctr-ria          .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      20                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "<tr id='row_"       to   w-all-str-cat (1)      .
           move      w-exe-ctr-ria        to   w-all-str-cat (2)      .
           move      "' "                 to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           display   w-all-str-alf                                    .
      *                  *---------------------------------------------*
      *                  * Eventuale evidenziazione                    *
      *                  *---------------------------------------------*
           display   "/>"                                             .
      *              *-------------------------------------------------*
      *              * Apertura Form                                   *
      *              *-------------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      "<form id='frm_"     to   w-all-str-cat (1)      .
           move      w-exe-ctr-ria        to   w-all-str-cat (2)      .
           move      "' name='frm_"       to   w-all-str-cat (3)      .
           move      w-exe-ctr-ria        to   w-all-str-cat (4)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *
           move      02                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      "action='' method='post'>"
                                          to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *
           display   w-all-str-alf                                    .
      *              *-------------------------------------------------*
      *              * Campi 'hidden' per la riga                      *
      *              *-------------------------------------------------*
______*    perform   stp-cor-doc-hid-000  thru stp-cor-doc-hid-999    .
       stp-cor-doc-rig-100.
      *              *-------------------------------------------------*
      *              * Progressivo riga                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-exe-ctr-rig        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      p-edt                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-rig-150.
      *              *-------------------------------------------------*
      *              * Codice prodotto                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione                                *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      rf-bir-alf-pro       to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-rig-200.
      *              *-------------------------------------------------*
      *              * Descrizione prodotto                            *
      *              *-------------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      w-let-arc-dcp-des    to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-rig-250.
      *              *-------------------------------------------------*
      *              * Codice prodotto per il Produttore               *
      *              *-------------------------------------------------*
       stp-cor-doc-rig-300.
      *              *-------------------------------------------------*
      *              * Numero ordine                                   *
      *              *-------------------------------------------------*
       stp-cor-doc-rig-400.
      *              *-------------------------------------------------*
      *              * Quantita'                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<BGD"               to   p-edm                  .
           move      srt-qta-ven          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      p-edt                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-rig-600.
      *              *-------------------------------------------------*
      *              * Ubicazione                                      *
      *              *-------------------------------------------------*
       stp-cor-doc-rig-800.
      *              *-------------------------------------------------*
      *              * Chiusura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-rig-850.
      *              *-------------------------------------------------*
      *              * Chiusura Form                                   *
      *              *-------------------------------------------------*
           display   "</form>"                                        .           
       stp-cor-doc-rig-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-cor-doc-rig-999.
       stp-cor-doc-rig-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine per i campi 'hidden'                           *
      *    *-----------------------------------------------------------*
       stp-cor-doc-hid-000.
      *              *-------------------------------------------------*
      *              * Responsabile 'hidden'                           *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "rsm"                to   h-nam                  .
           move      w-exe-cod-rsm        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-hid-075.
      *              *-------------------------------------------------*
      *              * Protocollo [bit] 'hidden'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      rf-bit-num-prt       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "prt"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-hid-100.
      *              *-------------------------------------------------*
      *              * Progressivo riga [bir] 'hidden'                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      rf-bir-num-prg       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "prg"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-hid-150.
      *              *-------------------------------------------------*
      *              * Progressivo riga interno 'hidden'               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-exe-ctr-rig        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "pri"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-hid-200.
      *              *-------------------------------------------------*
      *              * Progressivo collo 'hidden'                      *
      *              *-------------------------------------------------*
       stp-cor-doc-hid-300.
      *              *-------------------------------------------------*
      *              * Si/no riga spuntata 'hidden'                    *
      *              *-------------------------------------------------*
       stp-cor-doc-hid-400.
      *              *-------------------------------------------------*
      *              * Quantita' 'hidden'                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      rf-bir-qta-ven       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "qta"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-hid-400.
      *              *-------------------------------------------------*
      *              * Quantita' verificata 'hidden'                   *
      *              *-------------------------------------------------*
       stp-cor-doc-hid-500.
      *              *-------------------------------------------------*
      *              * Ubicazioni 'hidden'                             *
      *              *-------------------------------------------------*
       stp-cor-doc-hid-600.
      *              *-------------------------------------------------*
      *              * Codice alfanumerico prodotto 'hidden'           *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "alf"                to   h-nam                  .
           move      rf-bir-alf-pro       to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-hid-700.
      *              *-------------------------------------------------*
      *              * Codice numerico prodotto 'hidden'               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      srt-num-pro          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "pro"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-hid-700.
      *              *-------------------------------------------------*
      *              * Contatore ricorrenze prodotto 'hidden'          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-exe-sel-pro        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "spr"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       stp-cor-doc-hid-750.
      *              *-------------------------------------------------*
      *              * Si/no prodotto con barcode                      *
      *              *-------------------------------------------------*
       stp-cor-doc-hid-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-cor-doc-hid-999.
       stp-cor-doc-hid-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine di accettazione quantita' verificata           *
      *    *-----------------------------------------------------------*
       stp-cor-doc-qtv-000.
       stp-cor-doc-qtv-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-cor-doc-qtv-999.
       stp-cor-doc-qtv-999.
           exit.

      *    *===========================================================*
      *    * Routine di stampa piede documento                         *
      *    *-----------------------------------------------------------*
       stp-pie-doc-000.
       stp-pie-doc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-pie-doc-999.
       stp-pie-doc-999.
           exit.

      *    *===========================================================*
      *    * Interlinea generica con test su linee residue             *
      *    *-----------------------------------------------------------*
       int-lin-res-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione Flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-int-lin-res-flg      .
       int-lin-res-999.
           exit.

      *    *===========================================================*
      *    * Intestazione                                              *
      *    *-----------------------------------------------------------*
       int-pag-sta-000.
      *              *-------------------------------------------------*
      *              * Emissione 'header'                              *
      *              *-------------------------------------------------*
           perform   int-pag-sta-hea-000  thru int-pag-sta-hea-999    .
       int-pag-sta-200.
      *              *-------------------------------------------------*
      *              * Modulo                                          *
      *              *-------------------------------------------------*
           display   "<form name='bol_001' id='bol_001' method='post' ac
      -              "tion='/cgi-bin/elebol01'>"                      .
       int-pag-sta-300.
      *              *-------------------------------------------------*
      *              * Allineamento                                    *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "center"             to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Area di input testata ordine                    *
      *              *-------------------------------------------------*
           display   "<table class='tes' id='tes2' name='tes2'>"      .
      *              *-------------------------------------------------*
      *              * Apertura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Responsabile                                    *
      *              *-------------------------------------------------*
           perform   int-pag-sta-rsm-000  thru int-pag-sta-rsm-999    .
      *              *-------------------------------------------------*
      *              * Numero ordine                                   *
      *              *-------------------------------------------------*
           perform   int-pag-sta-num-000  thru int-pag-sta-num-999    .
      *              *-------------------------------------------------*
      *              * Spunta                                          *
      *              *-------------------------------------------------*
           perform   int-pag-sta-spn-000  thru int-pag-sta-spn-999    .
      *              *-------------------------------------------------*
      *              * Campi 'hidden' per la testata                   *
      *              *-------------------------------------------------*
           perform   int-pag-sta-hid-000  thru int-pag-sta-hid-999    .
      *              *-------------------------------------------------*
      *              * Tasto di reset                                  *
      *              *-------------------------------------------------*
           display   "<td id='cel_res' name='cel_res'>"               .
           display   "<button type='button' id='res' name='res'>"     .
           display   "<img src='../icons/gomma.png' width='70'>"      .
           display   "</button>"                                      .
           display   "</td>"                                          .
      *              *-------------------------------------------------*
      *              * Chiusura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura tabella                                *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "table"              to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura allineamento centrato                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "center"             to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura 'body'                                 *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "form"               to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Separatori                                      *
      *              *-------------------------------------------------*
           display   "<hr>"                                           .
       int-pag-sta-999.
           exit.

      *    *===========================================================*
      *    * Intestazione                                              *
      *    *                                                           *
      *    * Subroutine per accettazione Responsabile (Operatore)      *
      *    *-----------------------------------------------------------*
       int-pag-sta-rsm-000.
      *              *-------------------------------------------------*
      *              * Test se valore assegnato                        *
      *              *-------------------------------------------------*
           if        w-exe-cnv-rsm        not  = zero
                     go to int-pag-sta-rsm-600.
       int-pag-sta-rsm-050.
      *              *-------------------------------------------------*
      *              * Se valore da selezionare                        *
      *              *-------------------------------------------------*
           display   "<td id='cel_ute' name='cel_ute' align='center'>".
      *              *-------------------------------------------------*
      *              * Prompt                                          *
      *              *-------------------------------------------------*
           display   "<h1> Operatore </h1>"                           .
      *              *-------------------------------------------------*
      *              * Apertura campo Select                           *
      *              *-------------------------------------------------*
           display   "<select name='rsp_doc' id='rsp_doc'>"           .
      *              *-------------------------------------------------*
      *              * Elemento iniziale vuoto                         *
      *              *-------------------------------------------------*
           if        w-exe-cnv-rsm        not  = zero
                     go to int-pag-sta-rsm-100.
           display   "<option value=0 selected> (non selezionato)"    .
           display   "</option>"                                      .
       int-pag-sta-rsm-100.
      *              *-------------------------------------------------*
      *              * Costruzione tabella responsabili                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizializzazione contatore                  *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-tbl-rsm-inx      .
       int-pag-sta-rsm-200.
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-det-tbl-rsm-inx      .
      *                  *---------------------------------------------*
      *                  * Test su contatore                           *
      *                  *---------------------------------------------*
           if        w-det-tbl-rsm-inx    >    w-det-tbl-rsm-ctr
                     go to int-pag-sta-rsm-500.
           if        w-det-tbl-rsm-inx    >    w-det-tbl-rsm-max
                     go to int-pag-sta-rsm-500.
      *                  *---------------------------------------------*
      *                  * Editing codice responsabile                 *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-det-tbl-cod-rsp
                    (w-det-tbl-rsm-inx)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Test se elemento selezionato                *
      *                  *---------------------------------------------*
           if        w-det-tbl-cod-rsp
                    (w-det-tbl-rsm-inx)   =    w-exe-cnv-rsm
                     move  "selected"     to   w-all-str-cat (1)
           else      move  spaces         to   w-all-str-cat (1)      .
      *                  *---------------------------------------------*
      *                  * Eventuale disabilitazione                   *
      *                  *---------------------------------------------*
______*    if        w-exe-flg-spn        =    "S"
______*              move  "disabled"     to   w-all-str-cat (2)
______*    else      move  spaces         to   w-all-str-cat (2)      .
      *                  *---------------------------------------------*
      *                  * Emissione elemento                          *
      *                  *---------------------------------------------*
           move      spaces               to   w-exe-str-dsp          .
      *
           string    "<option "
                                delimited by   size
                     w-all-str-cat (1)
                                delimited by   spaces
                     " "
                                delimited by   size
                     w-all-str-cat (2)
                                delimited by   spaces
                     " value='"
                                delimited by   size
                     p-edt
                                delimited by   spaces
                     "'>"
                                delimited by   size
                     w-det-tbl-des-rsp
                    (w-det-tbl-rsm-inx)
                                delimited by   size
                     "</option>"
                                delimited by   size
                                          into w-exe-str-dsp          .
      *
           display   w-exe-str-dsp                                    .
      *                  *---------------------------------------------*
      *                  * A riciclo                                   *
      *                  *---------------------------------------------*
           go to     int-pag-sta-rsm-200.
       int-pag-sta-rsm-500.
      *              *-------------------------------------------------*
      *              * Chiusura accettazione                           *
      *              *-------------------------------------------------*
           display   "</select>"                                      .
      *              *-------------------------------------------------*
      *              * Chiusura cella                                  *
      *              *-------------------------------------------------*
           display   "</td>"                                          .
      *              *-------------------------------------------------*
      *              * Ad uscita                                       *
      *              *-------------------------------------------------*
           go to     int-pag-sta-rsm-900.
       int-pag-sta-rsm-600.
      *              *-------------------------------------------------*
      *              * Operatore (responsabile di magazzino)           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura descrizione responsabile            *
      *                  *---------------------------------------------*
           move      w-exe-cnv-rsm        to   w-let-arc-zrm-cod      .
           perform   let-arc-zrm-000      thru let-arc-zrm-999        .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           display   "<td>"                                           .
           display   "<b>"                                            .
           display   w-let-arc-zrm-des                                .
           display   "</b>"                                           .
           display   "</td>"                                          .
      *                  *---------------------------------------------*
      *                  * Responsabile 'hidden'                       *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "rsp_doc"            to   h-nam                  .
           move      w-exe-cod-rsm        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       int-pag-sta-rsm-800.
      *              *-------------------------------------------------*
      *              * Operatore (responsabile di magazzino) se diver- *
      *              * so da quello richiamato                         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Confronto                                   *
      *                  *---------------------------------------------*
           if        w-exe-let-rsm        =    zero
                     go to int-pag-sta-rsm-900.
______*    if        w-exe-let-rsm        =    w-exe-cnv-rsm
______*              go to int-pag-sta-rsm-900.
      *                  *---------------------------------------------*
      *                  * Lettura descrizione responsabile            *
      *                  *---------------------------------------------*
           move      w-exe-let-rsm        to   w-let-arc-zrm-cod      .
           perform   let-arc-zrm-000      thru let-arc-zrm-999        .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           display   "<td class='sel' style='font-weight: bold';>Doc. co
      -              "nsegnato da : "                                 .
           display   w-let-arc-zrm-des                                .
           display   "</td>"                                          .
       int-pag-sta-rsm-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     int-pag-sta-rsm-999.
       int-pag-sta-rsm-999.
           exit.

      *    *===========================================================*
      *    * Intestazione                                              *
      *    *                                                           *
      *    * Subroutine per accettazione numero ordine                 *
      *    *-----------------------------------------------------------*
       int-pag-sta-num-000.
      *              *-------------------------------------------------*
      *              * Apertura cella                                  *
      *              *-------------------------------------------------*
           display   "<td id='cel_num' name='cel_num' align='center'>".
      *              *-------------------------------------------------*
      *              * Prompt                                          *
      *              *-------------------------------------------------*
           display   "<h1> Nr. bolla </h1>"                           .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           move      spaces               to   w-exe-str-dsp          .
           string    "<input type='number' name='num_bol' id='num_bol'"
                                delimited by   size
                     " value='"
                                delimited by   size
                     w-exe-num-bol
                                delimited by   spaces
                     "'>"
                                delimited by   size
                                          into w-exe-str-dsp          .
           display   w-exe-str-dsp                                    .
      *              *-------------------------------------------------*
      *              * Chiusura cella                                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       int-pag-sta-num-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     int-pag-sta-num-999.
       int-pag-sta-num-999.
           exit.

      *    *===========================================================*
      *    * Intestazione                                              *
      *    *                                                           *
      *    * Subroutine di accettazione spunta                         *
      *    *-----------------------------------------------------------*
       int-pag-sta-spn-000.
      *              *-------------------------------------------------*
      *              * Editing del progressivo interno riga            *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-exe-ctr-rig        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-exe-ttd-cki          .
       int-pag-sta-spn-200.
      *              *-------------------------------------------------*
      *              * Spunta                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Apertura cella                              *
      *                  *---------------------------------------------*
           display   "<td id='cel_spn' name='cel_spn' align='center' cla
      -              "ss='td_nb'>"                                    .
      *                  *---------------------------------------------*
      *                  * Test se attiva o no                         *
      *                  *---------------------------------------------*
           if        w-exe-flg-spn        =    "S"
                     move  "checked"      to   w-exe-str-chd
           else      move  spaces         to   w-exe-str-chd          .
      *                  *---------------------------------------------*
      *                  * Eventuale disabilitazione se gia' spuntata  *
      *                  *---------------------------------------------*
           if        w-exe-flg-spn        =    "S"
                     move  "disabled"     to   w-exe-str-dsb
           else      move  spaces         to   w-exe-str-dsb          .
      *                  *---------------------------------------------*
      *                  * Eventuale disabilitazione se bolla ante-    *
      *                  * cedente 10 gg                               *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * DA ATTIVARE                             *
      *                      *-----------------------------------------*
           go to     int-pag-sta-spn-300.
      *                      *-----------------------------------------*
      *                      * Calcolo data                            *
      *                      *-----------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *
           move      s-dat                to   w-det-nrg-dat-dtb      .
           move      10                   to   w-det-nrg-dat-ngd      .
           perform   det-nrg-dat-000      thru det-nrg-dat-999        .
      *                      *-----------------------------------------*
      *                      * Test su data                            *
      *                      *-----------------------------------------*
           if        rf-bit-dat-doc       <    w-det-nrg-dat-dtd
                     move  "disabled"     to   w-exe-str-dsb          .
       int-pag-sta-spn-300.
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-exe-str-dsp          .
      *
           string    "<input type='checkbox' id='acc_spn' "
                                delimited by   size
                     "name='acc_spn' "
                                delimited by   size
                     w-exe-str-chd
                                delimited by   spaces
                     " "
                                delimited by   size
                     w-exe-str-dsb
                                delimited by   spaces
                     "> Merce partita"
                                delimited by   size
                                          into w-exe-str-dsp          .
      *
           display   w-exe-str-dsp                                    .
      *                  *---------------------------------------------*
      *                  * Chiusura cella                              *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       int-pag-sta-spn-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     int-pag-sta-spn-999.
       int-pag-sta-spn-999.
           exit.

      *    *===========================================================*
      *    * Intestazione                                              *
      *    *                                                           *
      *    * Subroutine per campi 'hidden' di testata                  *
      *    *-----------------------------------------------------------*
       int-pag-sta-hid-000.
      *              *-------------------------------------------------*
      *              * Protocollo [bit] 'hidden'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-slc-num-bit-prt    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "prt_bol"            to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       int-pag-sta-hid-100.
      *              *-------------------------------------------------*
      *              * Data conferma                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing come numero                         *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-exe-dat-exe        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "dat_att"            to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       int-pag-sta-hid-200.
      *              *-------------------------------------------------*
      *              * Ora conferma                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing come numero                         *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      04                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-exe-ora-itr        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "ora_att"            to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       int-pag-sta-hid-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     int-pag-sta-hid-999.
       int-pag-sta-hid-999.
           exit.

      *    *===========================================================*
      *    * Intestazione                                              *
      *    *                                                           *
      *    * Subroutine per 'header'                                   *
      *    *-----------------------------------------------------------*
       int-pag-sta-hea-000.
      *              *-------------------------------------------------*
      *              * Emissione testata documento                     *
      *              *-------------------------------------------------*
           move      "HH"                 to   h-ope                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Emissione icona                                 *
      *              *-------------------------------------------------*
           move      "HF"                 to   h-ope                  .
           move      "../icons/"          to   h-prm                  .
           move      "favicon.ico"        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Commento di apertura                            *
      *              *-------------------------------------------------*
           move      "EC"                 to   h-ope                  .
           move      "* wip - Tutti i diritti riservati *"
                                          to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Commento di aggiornamento                       *
      *              *-------------------------------------------------*
           move      "EC"                 to   h-ope                  .
           move      "* .....Aggiornamento : 05/06/2023 *"
                                          to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Titolo documento                                *
      *              *-------------------------------------------------*
           move      "HT"                 to   h-ope                  .
           move      "{ELETTRA} CONFERMA USCITA MERCE"
                                          to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Jquery UI CSS                                   *
      *              *-------------------------------------------------*
           move      "HC"                 to   h-ope                  .
           move      "../css_ele/"        to   h-prm                  .
           move      "jquery-ui.css"      to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Css per il documento                            *
      *              *-------------------------------------------------*
           move      "HC"                 to   h-ope                  .
           move      "../css_ele/"        to   h-prm                  .
           move      "ele.css"            to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Jquery min                                      *
      *              *-------------------------------------------------*
           move      "HJ"                 to   h-ope                  .
           move      "../jsc_ele/"        to   h-prm                  .
           move      "jquery.min.js"      to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Jquery UI min                                   *
      *              *-------------------------------------------------*
           move      "HJ"                 to   h-ope                  .
           move      "../jsc_ele/"        to   h-prm                  .
           move      "jquery-ui.min.js"   to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Jquery redirect                                 *
      *              *-------------------------------------------------*
           move      "HJ"                 to   h-ope                  .
           move      "../jsc_ele/"        to   h-prm                  .
           move      "jquery.redirect.js" to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Javascript per il documento                     *
      *              *-------------------------------------------------*
           move      "HJ"                 to   h-ope                  .
           move      "../jsc_ele/"        to   h-prm                  .
           move      "elebol01.js"        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Javascript accessoria per il documento          *
      *              *-------------------------------------------------*
           move      "HJ"                 to   h-ope                  .
           move      "../jsc_ele/"        to   h-prm                  .
           move      "eleipx01.js"        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Head - fine                                     *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "head"               to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Corpo                                           *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "body"               to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       int-pag-sta-hea-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     int-pag-sta-hea-999.
       int-pag-sta-hea-999.
           exit.

      *    *===========================================================*
      *    * Emissione chiusura HTML                                   *
      *    *-----------------------------------------------------------*
       emi-htm-cls-000.
      *              *-------------------------------------------------*
      *              * Linea di fondo                                  *
      *              *-------------------------------------------------*
           display   "<hr>"                                           .
      *              *-------------------------------------------------*
      *              * Allineamento centrato                           *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "center"             to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Box per bottone di ritorno a menu               *
      *              *-------------------------------------------------*
           perform   emi-htm-bck-000      thru emi-htm-bck-999        .
      *              *-------------------------------------------------*
      *              * Copyright                                       *
      *              *-------------------------------------------------*
           move      "CY"                 to   h-ope                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura allineamento centrato                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "center"             to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura 'body'                                 *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "body"               to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura 'html'                                 *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "html"               to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       emi-htm-cls-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-htm-cls-999.
       emi-htm-cls-999.
           exit.

      *    *===========================================================*
      *    * Emissione rientro a menu'                                 *
      *    *-----------------------------------------------------------*
       emi-htm-bck-000.
      *              *-------------------------------------------------*
      *              * Box per bottone di ritorno a menu               *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "div"                to   h-tag                  .
           move      "I"                  to   h-sub                  .
           move      "back"               to   h-idx                  .
           move      "back"               to   h-nam                  .
           move      spaces               to   h-cla                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Tag 'a' per link                                *
      *              *-------------------------------------------------*
           move      "EA"                 to   h-ope                  .
           move      "../ele.html"        to   h-hrf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Immagine                                        *
      *              *-------------------------------------------------*
           move      "IM"                 to   h-ope                  .
           move      "../icons/next-blue-1.png"
                                          to   h-src                  .
           move      "50"                 to   h-wdt                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura 'a'                                    *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "a"                  to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura Box per rientro a menu                 *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "div"                to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       emi-htm-bck-999.
           exit.

      *    *===========================================================*
      *    * Determinazione tabella responsabili                       *
      *    *-----------------------------------------------------------*
       det-tbl-rsm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni iniziali                        *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-tbl-rsm-ctr      .
       det-tbl-rsm-050.
      *              *-------------------------------------------------*
      *              * [zrm]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
       det-tbl-rsm-100.
      *              *-------------------------------------------------*
      *              * Start su archivio [zrm]                         *
      *              *-------------------------------------------------*
           move      "ST"                 to   f-ope                  .
           move      "CODRSP    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      zero                 to   rf-zrm-cod-rsp         .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata: a close                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-tbl-rsm-900.
       det-tbl-rsm-200.
      *              *-------------------------------------------------*
      *              * Read-next su archivio [zrm]                     *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
      *                  *---------------------------------------------*
      *                  * Test se fine file                           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-tbl-rsm-900.
       det-tbl-rsm-300.
      *              *-------------------------------------------------*
      *              * Test max su archivio [zrm]                      *
      *              *-------------------------------------------------*
       det-tbl-rsm-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su Codice ambito di responsabilita'    *
      *                  *---------------------------------------------*
______*    if        rf-zrm-cod-adr       not  = 02
______*              go to det-tbl-rsm-200.
       det-tbl-rsm-500.
      *              *-------------------------------------------------*
      *              * Incremento tabella                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento tabella                          *
      *                  *---------------------------------------------*
           add       1                    to   w-det-tbl-rsm-ctr      .
           move      rf-zrm-cod-rsp       to   w-det-tbl-cod-rsp
                                              (w-det-tbl-rsm-ctr)     .
           move      rf-zrm-des-rsp       to   w-det-tbl-des-rsp
                                              (w-det-tbl-rsm-ctr)     .
       det-tbl-rsm-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     det-tbl-rsm-200.
       det-tbl-rsm-900.
      *              *-------------------------------------------------*
      *              * [zrm]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-tbl-rsm-999.
       det-tbl-rsm-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [dcp]                            *
      *    *-----------------------------------------------------------*
       let-arc-dcp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice Prodotto di vendita a zero       *
      *              *-------------------------------------------------*
           if        w-let-arc-dcp-num    =    zero
                     go to let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      w-let-arc-dcp-num    to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcp-400.
       let-arc-dcp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcp-alf-pro       to   w-let-arc-dcp-alf      .
           move      rf-dcp-des-pro       to   w-let-arc-dcp-des      .
           move      rf-dcp-umi-ven       to   w-let-arc-dcp-umi      .
           move      rf-dcp-dec-qta       to   w-let-arc-dcp-ndq      .
           move      rf-dcp-tip-pro       to   w-let-arc-dcp-tip      .
           move      rf-dcp-klb-pro       to   w-let-arc-dcp-klb      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcp-999.
       let-arc-dcp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcp-flg      .
           move      all   "."            to   w-let-arc-dcp-des      .
           go to     let-arc-dcp-600.
       let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-des      .
       let-arc-dcp-600.
           move      spaces               to   w-let-arc-dcp-alf      .
           move      spaces               to   w-let-arc-dcp-umi      .
           move      zero                 to   w-let-arc-dcp-ndq      .
           move      zero                 to   w-let-arc-dcp-tip      .
           move      spaces               to   w-let-arc-dcp-klb      .
       let-arc-dcp-999.
           exit.

      *    *===========================================================*
      *    * Emissione messaggio                                       *
      *    *-----------------------------------------------------------*
       err-msg-htm-000.
      *              *-------------------------------------------------*
      *              * Emissione messaggio                             *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "div"                to   h-tag                  .
           move      "I"                  to   h-sub                  .
           move      "msg"                to   h-idx                  .
           move      "msg"                to   h-nam                  .
           move      w-exe-cla-msg        to   h-cla                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *
           move      "ET"                 to   h-ope                  .
           move      "h1"                 to   h-tag                  .
           move      "V"                  to   h-sub                  .
           move      w-exe-err-msg        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *
           move      "ET"                 to   h-ope                  .
           move      "div"                to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       err-msg-htm-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [zrm]                         *
      *    *-----------------------------------------------------------*
       let-arc-zrm-000.
      *              *-------------------------------------------------*
      *              * [zrm]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zrm-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-zrm-cod    =    zero
                     go to let-arc-zrm-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODRSP"             to   f-key                  .
           move      w-let-arc-zrm-cod    to   rf-zrm-cod-rsp         .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zrm-400.
       let-arc-zrm-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zrm-des-rsp       to   w-let-arc-zrm-des      .
           move      rf-zrm-flg-spn       to   w-let-arc-zrm-fds      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zrm-999.
       let-arc-zrm-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zrm-flg      .
           move      all   "."            to   w-let-arc-zrm-des      .
           move      "?"                  to   w-let-arc-zrm-fds      .
           go to     let-arc-zrm-600.
       let-arc-zrm-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zrm-des      .
           move      spaces               to   w-let-arc-zrm-fds      .
       let-arc-zrm-600.
      *              *-------------------------------------------------*
      *              * [zrm]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
       let-arc-zrm-999.
           exit.

      *    *===========================================================*
      *    * Select archivio [bit] in base al numero documento         *
      *    *-----------------------------------------------------------*
       slc-num-bit-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-slc-num-bit-sel      .
      *              *-------------------------------------------------*
      *              * Normalizzazioni iniziali                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-slc-num-bit-toc      .
           move      zero                 to   w-slc-num-bit-dat      .
           move      zero                 to   w-slc-num-bit-num      .
           move      zero                 to   w-slc-num-bit-prt      .
           move      zero                 to   w-slc-num-bit-crb      .
           move      "N"                  to   w-slc-num-bit-toc      .
      *              *-------------------------------------------------*
      *              * Preparazione secolo, anno                       *
      *              *-------------------------------------------------*
           perform   slc-num-bit-saa-000  thru slc-num-bit-saa-999    .
       slc-num-bit-080.
      *              *-------------------------------------------------*
      *              * Normalizzazione [zbi]                           *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofzbi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zbi                 .
      *              *-------------------------------------------------*
      *              * Lettura tipo documento per codice               *
      *              *                                                 *
      *              * ___ MIGLIORABILE ___                            *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODTMB"             to   f-key                  .
           move      "BVFS "              to   rf-zbi-cod-tmb         .
           move      01                   to   rf-zbi-cod-dpz         .
           move      "pgm/bol/fls/ioc/obj/iofzbi"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zbi                 .
      *              *-------------------------------------------------*
      *              * Completamento numero documento                  *
      *              *-------------------------------------------------*
           move      w-exe-num-cnv        to   w-slc-num-bit-npg      .
           move      w-slc-num-bit-saa    to   w-slc-num-bit-nsa      .
           move      01                   to   w-slc-num-bit-ndp      .
           move      01                   to   w-slc-num-bit-dpz      .
           move      rf-zbi-sgl-num       to   w-slc-num-bit-sgl      .
           move      "N"                  to   w-slc-num-bit-fac      .
       slc-num-bit-100.
      *              *-------------------------------------------------*
      *              * Start su file [bit]                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Start                                       *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "CNTDEN    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-slc-num-bit-fac    to   rf-bit-snx-fac         .
           move      w-slc-num-bit-saa    to   rf-bit-scl-ann         .
           move      w-slc-num-bit-dpz    to   rf-bit-cod-dpz         .
           move      w-slc-num-bit-sgl    to   rf-bit-sgl-num         .
           move      w-slc-num-bit-nds    to   rf-bit-num-doc         .
           move      zero                 to   rf-bit-num-prt         .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : a controllo contatore  *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to slc-num-bit-900.
       slc-num-bit-200.
      *              *-------------------------------------------------*
      *              * Read-next su [bit]                              *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bol/fls/ioc/obj/iofbit"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bit                 .
      *                  *---------------------------------------------*
      *                  * Se at end : a controllo contatore           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to slc-num-bit-900.
       slc-num-bit-300.
      *              *-------------------------------------------------*
      *              * Se oltre il massimo : a trattamento errore      *
      *              *-------------------------------------------------*
           if        rf-bit-snx-fac       not  = w-slc-num-bit-fac or
                     rf-bit-scl-ann       not  = w-slc-num-bit-saa or
                     rf-bit-cod-dpz       not  = w-slc-num-bit-dpz or
                     rf-bit-sgl-num       not  = w-slc-num-bit-sgl or
                     rf-bit-num-doc       not  = w-slc-num-bit-nds
                     go to slc-num-bit-900.
       slc-num-bit-400.
      *              *-------------------------------------------------*
      *              * Bufferizzazione                                 *
      *              *-------------------------------------------------*
           move      rf-bit-num-prt       to   w-slc-num-bit-prt      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     slc-num-bit-999.
       slc-num-bit-900.
      *              *-------------------------------------------------*
      *              * Trattamento errore                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Flag di uscita ad errore                    *
      *                  *---------------------------------------------*
           move      "#"                  to   w-slc-num-bit-sel      .
       slc-num-bit-999.
           exit.

      *    *===========================================================*
      *    * Select archivio [bit] in base al numero documento         *
      *    *                                                           *
      *    * Subroutine di trattamento secolo anno                     *
      *    *-----------------------------------------------------------*
       slc-num-bit-saa-000.
      *              *-------------------------------------------------*
      *              * Preparazione valore di uscita                   *
      *              *-------------------------------------------------*
           move      w-exe-saa-exe        to   w-slc-num-bit-saa      .
       slc-num-bit-saa-100.
      *              *-------------------------------------------------*
      *              * Test se presente separatore '.'                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           move      w-exe-num-bol        to   w-all-str-alf          .
           move      "."                  to   w-all-str-del          .
           perform   all-str-chr-000      thru all-str-chr-999        .
      *                  *---------------------------------------------*
      *                  * Se non trovato: oltre                       *
      *                  *---------------------------------------------*
           if        w-all-str-num        =    zero
                     go to slc-num-bit-saa-300.
      *                  *---------------------------------------------*
      *                  * Scomposizione                               *
      *                  *---------------------------------------------*
           move      w-exe-num-bol        to   w-all-str-alf          .
           move      "."                  to   w-all-str-del          .
           perform   all-str-ext-000      thru all-str-ext-999        .
      *                  *---------------------------------------------*
      *                  * Trattamento secolo/anno                     *
      *                  *---------------------------------------------*
           move      "CV"                 to   p-ope                  .
           move      03                   to   p-car                  .
           move      w-all-str-cat (1)    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-num                to   w-slc-num-bit-saa      .
           add       100                  to   w-slc-num-bit-saa      .
      *                  *---------------------------------------------*
      *                  * Trattamento numero documento                *
      *                  *---------------------------------------------*
           move      "CV"                 to   p-ope                  .
           move      06                   to   p-car                  .
           move      w-all-str-cat (2)    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-num                to   w-exe-num-cnv          .
      *                  *---------------------------------------------*
      *                  * Pulizia numero documento                    *
      *                  *---------------------------------------------*
           move      w-all-str-cat (2)    to   w-exe-num-bol          .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     slc-num-bit-saa-900.
       slc-num-bit-saa-300.
      *              *-------------------------------------------------*
      *              * Solo se primo mese dell'anno                    *
      *              *-------------------------------------------------*
           if        w-exe-mes-exe        >    1
                     go to slc-num-bit-saa-900.
       slc-num-bit-saa-400.
      *              *-------------------------------------------------*
      *              * Test su lunghezza del campo in input            *
      *              *-------------------------------------------------*
           if        w-exe-num-cnv        <    2000
                     go to slc-num-bit-saa-900.
       slc-num-bit-saa-500.
      *              *-------------------------------------------------*
      *              * Se lunghezza di 4 caratteri o superiore allora  *
      *              * anno precedente                                 *
      *              *-------------------------------------------------*
           subtract  1                    from w-slc-num-bit-saa      .
       slc-num-bit-saa-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     slc-num-bit-saa-999.
       slc-num-bit-saa-999.
           exit.

      *    *===========================================================*
      *    * Subroutines di trattamento variabile POST                 *
      *    *                                                           *
      *    * ELETTRA                                                   *
      *    *-----------------------------------------------------------*
           copy      "ele/cgi/prg/cpy/elecgi00.cps"                   .

      *    *===========================================================*
      *    * Subroutines per operazioni sulle date                     *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wnrgdat0.cps"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .
