       Identification Division.
       Program-Id.                                 elebfoB2           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    cnv                 *
      *                        Area gestionale:    cgi                 *
      *                                Settore:                        *
      *                                   Fase:    elebfo              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 04/07/06    *
      *                       Ultima revisione:    NdK del 25/02/25    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Carico fornitore generico                   *
      *                                                                *
      *                    ELETTRA (VERSIONE NUOVA)                    *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Indice di percorso ubicazione                     *
      *            *---------------------------------------------------*
               10  srt-inx-key            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice alfanumerico prodotto per ordinamento      *
      *            *---------------------------------------------------*
               10  srt-alf-key            pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Progressivo riga per ordinamento                  *
      *            *---------------------------------------------------*
               10  srt-rig-key            pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Codice numerico prodotto                          *
      *            *---------------------------------------------------*
               10  srt-num-pro            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice alfanumerico prodotto                      *
      *            *---------------------------------------------------*
               10  srt-alf-pro            pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Barcode prodotto                                  *
      *            *---------------------------------------------------*
               10  srt-klb-pro            pic  x(14)                  .
      *            *---------------------------------------------------*
      *            * Flag prodotto selezionato                         *
      *            *---------------------------------------------------*
               10  srt-sel-pro            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag prodotto senza barcode                       *
      *            *---------------------------------------------------*
               10  srt-snb-pro            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di presenza colli                            *
      *            *---------------------------------------------------*
               10  srt-snx-pcr            pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Record [bfr]                                      *
      *            *---------------------------------------------------*
               10  srt-rec-bfr.
                   15  filler  occurs  1536
                                          pic  x(01)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*
      
      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di definizione della valuta base                     *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/c"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mopsys"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/o"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                 "mhtml0" *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/h"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(99)                  .
                   15  w-cnt-prn-sav-l04  pic  x(99)                  .
                   15  w-cnt-prn-sav-l03  pic  x(99)                  .
                   15  w-cnt-prn-sav-l02  pic  x(99)                  .
                   15  w-cnt-prn-sav-l01  pic  x(99)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 495  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Record files                                              *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [bfu]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bfo/fls/rec/rfbfu"                          .
      *        *-------------------------------------------------------*
      *        * [ybf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bfo/fls/rec/rfybf"                          .
      *        *-------------------------------------------------------*
      *        * [bfe]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bfo/fls/rec/rfbfe"                          .
      *        *-------------------------------------------------------*
      *        * [bft]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bfo/fls/rec/rfbft"                          .
      *        *-------------------------------------------------------*
      *        * [bfr]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bfo/fls/rec/rfbfr"                          .
      *        *-------------------------------------------------------*
      *        * [bfs]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bfo/fls/rec/rfbfs"                          .
      *        *-------------------------------------------------------*
      *        * [bfk]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/bfo/fls/rec/rfbfk"                          .
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [dcp]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfdcp"                          .
      *        *-------------------------------------------------------*
      *        * [pdk]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcp/fls/rec/rfpdk"                          .
      *        *-------------------------------------------------------*
      *        * [aaq]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfaaq"                          .
      *        *-------------------------------------------------------*
      *        * [aaf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfaaf"                          .
      *        *-------------------------------------------------------*
      *        * [zrm]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/mag/fls/rec/rfzrm"                          .
      
      *    *===========================================================*
      *    * Work-area routine di trattamento variabile POST           *
      *    *                                                           *
      *    * ELETTRA                                                   *
      *    *-----------------------------------------------------------*
           copy      "ele/cgi/prg/cpy/elecgi00.cpw"                   .

      *    *===========================================================*
      *    * Work per contatori ed indici                              *
      *    *-----------------------------------------------------------*
       01  w-cix.
      *        *-------------------------------------------------------*
      *        * Work per contatori righe                              *
      *        *-------------------------------------------------------*
           05  w-cix-ctr-rig.
      *            *---------------------------------------------------*
      *            * Contatore righe colli per la riga                 *
      *            *---------------------------------------------------*
               10  w-cix-ctr-rig-cpr      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Contatore righe da spuntare                       *
      *            *---------------------------------------------------*
               10  w-cix-ctr-rig-das      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Contatore righe spuntate                          *
      *            *---------------------------------------------------*
               10  w-cix-ctr-rig-spu      pic  9(05)                  .

      *    *===========================================================*
      *    * Area di comodo                                            *
      *    *-----------------------------------------------------------*
       01  w-exe.
      *        *-------------------------------------------------------*
      *        * Data di esecuzione                                    *
      *        *-------------------------------------------------------*
           05  w-exe-dat-exe              pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Livello operativo                                     *
      *        *-------------------------------------------------------*
           05  w-exe-liv-ope              pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Parametri in input estratti                           *
      *        *-------------------------------------------------------*
           05  w-exe-cod-rsm              pic  x(03)                  .
           05  w-exe-cnv-rsm              pic  9(03)                  .
           05  w-exe-num-bfo              pic  x(20)                  .
           05  w-exe-prt-bfo              pic  x(11)                  .
           05  w-exe-prg-bfo              pic  x(05)                  .
           05  w-exe-alf-pro              pic  x(24)                  .
           05  w-exe-num-pro              pic  9(07)                  .
           05  w-exe-des-pro              pic  x(40)                  .
           05  w-exe-ann-ncf              pic  x(80)                  .
           05  w-exe-num-col              pic  x(25)                  .
           05  w-exe-cod-ubi              pic  x(08)                  .
           05  w-exe-pri-ubi              pic  x(08)                  .
      *        *-------------------------------------------------------*
      *        * Stringa di comodo per display                         *
      *        *-------------------------------------------------------*
           05  w-exe-str-dsp              pic  x(512)                 .
           05  w-exe-str-chd              pic  x(15)                  .
      *        *-------------------------------------------------------*
      *        * Contatori di comodo                                   *
      *        *-------------------------------------------------------*
           05  w-exe-prt-mag              pic  9(11)                  .
           05  w-exe-drg-mag              pic  9(07)                  .
           05  w-exe-ctr-mag              pic  9(05)                  .
           05  w-exe-dsl-mag              pic  x(07)                  .
           05  w-exe-ctr-rig              pic  9(05)                  .
           05  w-exe-ctr-pro              pic  9(05)                  .
           05  w-exe-ctr-ria              pic  x(05)                  .
           05  w-exe-ctr-bfk              pic  9(05)                  .
           05  w-exe-sel-pro              pic  9(05)                  .
           05  w-exe-snx-pcr              pic  9(03)                  .
           05  w-exe-qta-ppu              pic s9(11)                  .
           05  w-exe-qta-tot              pic s9(11)                  .
           05  w-exe-qta-spn              pic s9(11)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per visualizzazione tag tabella                *
      *        *-------------------------------------------------------*
           05  w-exe-ttd.
               10  w-exe-ttd-ub1          pic  x(07)                  .
               10  w-exe-ttd-ub2          pic  x(07)                  .
               10  w-exe-ttd-ub3          pic  x(07)                  .
               10  w-exe-ttd-ub4          pic  x(07)                  .
               10  w-exe-ttd-cki          pic  x(07)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per visualizzazione riga tabella               *
      *        *-------------------------------------------------------*
           05  w-exe-rig.
               10  w-exe-rig-prt          pic  9(11)                  .
               10  w-exe-rig-prg          pic  9(05)                  .
               10  w-exe-rig-col          pic  9(03)                  .
               10  w-exe-rig-sco          pic  x(15)                  .
               10  w-exe-rig-qta          pic  9(11)                  .
               10  w-exe-rig-qtv          pic  9(11)                  .
               10  w-exe-rig-sel          pic  x(01)                  .
               10  w-exe-inx-ubi          pic  9(01)                  .
               10  w-exe-inx-ubc          pic  x(01)                  .
               10  w-exe-rig-ubi          pic  x(07)                  .
               10  w-exe-rig-ub1          pic  x(07)                  .
               10  w-exe-rig-ub2          pic  x(07)                  .
               10  w-exe-rig-ub3          pic  x(07)                  .
               10  w-exe-rig-ub4          pic  x(07)                  .
               10  w-exe-flg-spn          pic  x(01)                  .
               10  w-exe-rwi-idx          pic  x(07)                  .
               10  w-exe-lun-prt          pic  9(02)                  .
               10  w-exe-saa-prt          pic  x(03)                  .
               10  w-exe-wrk-prt          pic  x(06)                  .
               10  w-exe-dpz-prt          pic  x(02)                  .
               10  w-exe-num-prt          pic  x(11)                  .
               10  w-exe-flg-stp          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Comodo per parsing stringa alfanumerica               *
      *        *-------------------------------------------------------*
           05  w-exe-str-prs occurs 2.
               15  w-exe-str-cat          pic  x(80)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per messaggi di output                         *
      *        *-------------------------------------------------------*
           05  w-exe-err-msg              pic  x(80)                  .
           05  w-exe-cla-msg              pic  x(07)                  .
      *        *-------------------------------------------------------*
      *        * Comodi per regolarizzazioni                           *
      *        *-------------------------------------------------------*
           05  w-exe-prm-vx1              pic  x(24)                  .
           05  w-exe-prm-vx2              pic  x(24)                  .

      *    *===========================================================*
      *    * Work area per Determinazioni                              *
      *    *-----------------------------------------------------------*
       01  w-det.
      *        *-------------------------------------------------------*
      *        * Per determinazione codice numerico prodotto           *
      *        *-------------------------------------------------------*
           05  w-det-num-pro.
      *            *---------------------------------------------------*
      *            * Codice alfanumerico prodotto                      *
      *            *---------------------------------------------------*
               10  w-det-num-pro-alf      pic  x(24)                  .
               10  w-det-num-pro-ele      pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Codice numerico prodotto                          *
      *            *---------------------------------------------------*
               10  w-det-num-pro-num      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Descrizione prodotto                              *
      *            *---------------------------------------------------*
               10  w-det-num-pro-des      pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Per determinazione componente numerica contrassegno   *
      *        *-------------------------------------------------------*
           05  w-det-cmp-num.
      *            *---------------------------------------------------*
      *            * Codice alfanumerico contrassegno                  *
      *            *---------------------------------------------------*
               10  w-det-cmp-num-alf      pic  x(15)                  .
      *            *---------------------------------------------------*
      *            * Componente numerica                               *
      *            *---------------------------------------------------*
               10  w-det-cmp-num-num      pic  9(09)                  .
      *        *-------------------------------------------------------*
      *        * Determinazione se documento in distinta di verifica   *
      *        *-------------------------------------------------------*
           05  w-det-dst-num-prt          pic  9(11)                  .
           05  w-det-dst-num-dst          pic  9(09)                  .
           05  w-det-dst-sts-dst          pic  x(40)                  .
           05  w-det-dst-nik-nam          pic  x(20)                  .
           05  w-det-dst-ctr-ele          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Per determinazione tabella responsabili               *
      *        *-------------------------------------------------------*
           05  w-det-tbl-rsm.
      *            *---------------------------------------------------*
      *            * Tabella codici                                    *
      *            *---------------------------------------------------*
               10  w-det-tbl-cod-ele  occurs  48.
                   15  w-det-tbl-cod-rsp  pic  9(05)                  .
                   15  w-det-tbl-des-rsp  pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Contatori di comodo                               *
      *            *---------------------------------------------------*
               10  w-det-tbl-rsm-max      pic  9(03) value 48         .
               10  w-det-tbl-rsm-ctr      pic  9(03)                  .
               10  w-det-tbl-rsm-inx      pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det su giacenze per ubicazione               *
      *        *-------------------------------------------------------*
           05  w-det-gia-ubi.
      *            *---------------------------------------------------*
      *            * Contatori di comodo                               *
      *            *---------------------------------------------------*
               10  w-det-gia-ubi-ctr      pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Quantita' di comodo                               *
      *            *---------------------------------------------------*
               10  w-det-gia-ubi-qta      pic s9(10)v9(03)            .
      *        *-------------------------------------------------------*
      *        * Per determinazione tabella quantita' ubicazioni       *
      *        *-------------------------------------------------------*
           05  w-det-qta-ubi.
      *            *---------------------------------------------------*
      *            * Tabella codici ubicazione                         *
      *            *---------------------------------------------------*
               10  w-det-qta-ubi-ele  occurs  9.
                   15  w-det-qta-ubi-qta  pic  9(10)                  .
                   15  w-det-qta-ubi-ubi  pic  x(07)                  .
      *            *---------------------------------------------------*
      *            * Contatori di comodo                               *
      *            *---------------------------------------------------*
               10  w-det-qta-ubi-max      pic  9(02) value 9          .
               10  w-det-qta-ubi-ctr      pic  9(02)                  .
               10  w-det-qta-ubi-inx      pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Per determinazione dati prodotto da visualizzare      *
      *        *-------------------------------------------------------*
           05  w-det-vis-pro.
      *            *---------------------------------------------------*
      *            * Progressivo riga                                  *
      *            *---------------------------------------------------*
               10  w-det-vis-pro-rig      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Codice numerico prodotto                          *
      *            *---------------------------------------------------*
               10  w-det-vis-pro-num      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codice alfanumerico prodotto                      *
      *            *---------------------------------------------------*
               10  w-det-vis-pro-alf      pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Descrizione prodotto                              *
      *            *---------------------------------------------------*
               10  w-det-vis-pro-des      pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Quantita' da spedire                              *
      *            *---------------------------------------------------*
               10  w-det-vis-pro-qds      pic s9(10)                  .
      *            *---------------------------------------------------*
      *            * Quantita' assegnata all'ubicazione                *
      *            *---------------------------------------------------*
               10  w-det-vis-pro-qau      pic s9(10)                  .
      *            *---------------------------------------------------*
      *            * Codice ubicazione                                 *
      *            *---------------------------------------------------*
               10  w-det-vis-pro-ubi      pic  x(07)                  .
      *        *-------------------------------------------------------*
      *        * Per determinazione tabella quantita' prodotto         *
      *        *-------------------------------------------------------*
           05  w-det-qta-pro.
      *            *---------------------------------------------------*
      *            * Tabella codici ubicazione                         *
      *            *---------------------------------------------------*
               10  w-det-qta-pro-ele  occurs  20.
                   15  w-det-qta-pro-prg  pic  9(05)                  .
                   15  w-det-qta-pro-qta  pic  9(10)                  .
      *            *---------------------------------------------------*
      *            * Contatori di comodo                               *
      *            *---------------------------------------------------*
               10  w-det-qta-pro-max      pic  9(02) value 20         .
               10  w-det-qta-pro-ctr      pic  9(02)                  .
               10  w-det-qta-pro-inx      pic  9(02)                  .
               10  w-det-qta-pro-qas      pic s9(10)                  .
               10  w-det-qta-pro-qaz      pic s9(10)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det responsabile spunte documento            *
      *        *-------------------------------------------------------*
           05  w-det-rsm-doc.
      *            *---------------------------------------------------*
      *            * Protocollo documento                              *
      *            *---------------------------------------------------*
               10  w-det-rsm-doc-prt      pic  9(11)                  .
      *            *---------------------------------------------------*
      *            * Responsabile                                      *
      *            *---------------------------------------------------*
               10  w-det-rsm-doc-rsm      pic  9(05)                  .
      *        *-------------------------------------------------------*
      *        * Work per Det riga documento in base al protocollo     *
      *        *-------------------------------------------------------*
           05  w-det-rig-bfr.
      *            *---------------------------------------------------*
      *            * Flag di uscita                                    *
      *            *---------------------------------------------------*
               10  w-det-rig-bfr-flg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Contrassegno collo                                *
      *            *---------------------------------------------------*
               10  w-det-rig-bfr-cts      pic  x(20)                  .
      *            *---------------------------------------------------*
      *            * Quantita' collo                                   *
      *            *---------------------------------------------------*
               10  w-det-rig-bfr-qta      pic  9(08)v9(03)            .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [dcp]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-dcp.
               10  w-let-arc-dcp-flg      pic  x(01)                  .
               10  w-let-arc-dcp-num      pic  9(07)                  .
               10  w-let-arc-dcp-alf      pic  x(14)                  .
               10  w-let-arc-dcp-des      pic  x(40)                  .
               10  w-let-arc-dcp-umi      pic  x(03)                  .
               10  w-let-arc-dcp-ndq      pic  9(01)                  .
               10  w-let-arc-dcp-tip      pic  9(02)                  .
               10  w-let-arc-dcp-klb      pic  x(14)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [bfs]                        *
      *        *-------------------------------------------------------*
           05  w-let-rec-bfs.
               10  w-let-rec-bfs-flg      pic  x(01)                  .
               10  w-let-rec-bfs-prt      pic  9(11)                  .
               10  w-let-rec-bfs-prg      pic  9(05)                  .
               10  w-let-rec-bfs-prr      pic  9(05)                  .
               10  w-let-rec-bfs-qta      pic s9(10)v9(03)            .
               10  w-let-rec-bfs-spn      pic  x(01)                  .
               10  w-let-rec-bfs-odm      pic  x(03)                  .
               10  w-let-rec-bfs-ub1      pic  x(07)                  .
               10  w-let-rec-bfs-ub2      pic  x(07)                  .
               10  w-let-rec-bfs-ub3      pic  x(07)                  .
               10  w-let-rec-bfs-ub4      pic  x(07)                  .
               10  w-let-rec-bfs-ncf      pic  x(80)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [zrm]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-zrm.
               10  w-let-arc-zrm-flg      pic  x(01)                  .
               10  w-let-arc-zrm-cod      pic  9(05)                  .
               10  w-let-arc-zrm-des      pic  x(40)                  .
               10  w-let-arc-zrm-fds      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [ybf]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-ybf.
               10  w-let-arc-ybf-flg      pic  x(01)                  .
               10  w-let-arc-ybf-cod      pic  x(05)                  .
               10  w-let-arc-ybf-dpz      pic  9(02)                  .
               10  w-let-arc-ybf-des      pic  x(30)                  .
               10  w-let-arc-ybf-dsl      pic  x(07)                  .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione saldi magazzino  *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldmag0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per determinazione saldi magazzino  *
      *    * per ubicazione                                            *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldubi0.dtl"                   .

      *    *===========================================================*
      *    * Area di comunicazione per movimento di magazzino          *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/pmag300z.pgl"                   .

      *    *===========================================================*
      *    * Work per subroutines di Select                            *
      *    *-----------------------------------------------------------*
       01  w-slc.
      *        *-------------------------------------------------------*
      *        * Work per Select numero documento                      *
      *        *-------------------------------------------------------*
           05  w-slc-num-bft.
      *            *---------------------------------------------------*
      *            * Valori in entrata                                 *
      *            *---------------------------------------------------*
               10  w-slc-num-bft-dds      pic  9(07)                  .
               10  w-slc-num-bft-nds      pic  9(11)                  .
               10  w-slc-num-bft-nds-r redefines
                   w-slc-num-bft-nds.
                   15  w-slc-num-bft-nsa  pic  9(03)                  .
                   15  w-slc-num-bft-ndp  pic  9(02)                  .
                   15  w-slc-num-bft-npg  pic  9(06)                  .
               10  w-slc-num-prt-num      pic  9(09)                  .
               10  w-slc-num-prt-num-r    redefines
                   w-slc-num-prt-num.
                   15  w-slc-num-prt-saa  pic  9(03)                  .
                   15  w-slc-num-prt-prg  pic  9(06)                  .
      *            *---------------------------------------------------*
      *            * Valori in uscita                                  *
      *            *---------------------------------------------------*
               10  w-slc-num-bft-sel      pic  x(01)                  .
               10  w-slc-num-bft-toc      pic  x(05)                  .
               10  w-slc-num-bft-dat      pic  9(07)                  .
               10  w-slc-num-bft-prt      pic  9(11)                  .
               10  w-slc-num-bft-prg      pic  9(05)                  .
      *            *---------------------------------------------------*
      *            * Area di comodo                                    *
      *            *---------------------------------------------------*
               10  w-slc-num-bft-crb      pic  9(02)                  .

      *    *===========================================================*
      *    * Work-area per contatori ed indici                         *
      *    *-----------------------------------------------------------*
       01  w-cix.
      *        *-------------------------------------------------------*
      *        * Contatori generici                                    *
      *        *-------------------------------------------------------*
           05  w-cix-ctr-001              pic  9(05)                  .

      *    *===========================================================*
      *    * Work-area per routine int-lin-res-000/999                 *
      *    *-----------------------------------------------------------*
       01  w-int-lin-res.
      *        *-------------------------------------------------------*
      *        * Flag di uscita                                        *
      *        *-------------------------------------------------------*
           05  w-int-lin-res-flg          pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Numero di interlinee                                  *
      *        *-------------------------------------------------------*
           05  w-int-lin-res-lin          pic  9(03)                  .
      *        *-------------------------------------------------------*
      *        * Numero di linee per il test sulle residue             *
      *        *-------------------------------------------------------*
           05  w-int-lin-res-res          pic  9(03)                  .

      *    *===========================================================*
      *    * Work-area per allineamenti a destra o a sinistra oppure   *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cpw"                   .

      ******************************************************************
       Procedure Division                                             .
      ******************************************************************

      *================================================================*
      * Main                                                           *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Estrazione parametri                            *
      *              *-------------------------------------------------*
           perform   ext-prm-000          thru ext-prm-999            .
      *              *-------------------------------------------------*
      *              * Open files                                      *
      *              *-------------------------------------------------*
           perform   opn-fls-000          thru opn-fls-999            .
       main-100.
      *              *-------------------------------------------------*
      *              * Ciclo di lettura e preparazione html            *
      *              *-------------------------------------------------*
           perform   exe-cph-000          thru exe-cph-999            .
       main-800.
      *              *-------------------------------------------------*
      *              * Close files                                     *
      *              *-------------------------------------------------*
           perform   cls-fls-000          thru cls-fls-999            .
       main-999.
           exit      program.

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Estrazione parametri                                      *
      *    *-----------------------------------------------------------*
       ext-prm-000.
      *              *-------------------------------------------------*
      *              * Subroutine per la preparazione dei valori rela- *
      *              * tivi alla valuta base, determinati dalla segre- *
      *              * teria                                           *
      *              *-------------------------------------------------*
           move      "VB"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dec                to   c-dec                  .
           move      s-asx                to   c-sgl                  .
           move      s-sgn                to   c-tdc                  .
           move      s-num                to   c-cdc                  .
           move      s-adx (01 : 20)      to   c-des                  .
           move      s-adx (21 : 20)      to   c-din                  .
      *              *-------------------------------------------------*
      *              * Data di sistema                                 *
      *              *-------------------------------------------------*
           move      "DT"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
           move      s-dat                to   w-exe-dat-exe          .
      *              *-------------------------------------------------*
      *              * CORRETTIVO PROVVISORIO                          *
      *              *-------------------------------------------------*
           if        w-exe-dat-exe        <    999999
                     add  1000000         to   w-exe-dat-exe          .
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-exe-liv-ope          .
           move      spaces               to   w-exe-cod-rsm          .
           move      zero                 to   w-exe-cnv-rsm          .
           move      spaces               to   w-exe-num-bfo          .
           move      spaces               to   w-exe-prt-bfo          .
           move      spaces               to   w-exe-prg-bfo          .
           move      spaces               to   w-exe-ann-ncf          .
           move      spaces               to   w-exe-num-col          .
           move      spaces               to   w-exe-alf-pro          .
           move      zero                 to   w-exe-num-pro          .
           move      zero                 to   w-slc-num-bft-prt      .
      *              *-------------------------------------------------*
      *              * Normalizzazione parametri                       *
      *              *-------------------------------------------------*
           move      "NO"                 to   w-cgi-tip-ope          .
           move      04                   to   w-cgi-str-num          .
           perform   ope-prm-inp-000      thru ope-prm-inp-999        .
      *              *-------------------------------------------------*
      *              * Lettura della variabile di environment          *
      *              *-------------------------------------------------*
           move      "I2"                 to   o-ope                  .
           move      "POST"               to   o-com                  .
           call      "swd/mod/prg/obj/mopsys"
                                         using o                      .
      *              *-------------------------------------------------*
      *              * Estrazione parametri                            *
      *              *-------------------------------------------------*
           move      o-pst                to   w-cgi-str-var          .
           perform   cgi-str-ext-000      thru cgi-str-ext-999        .
       ext-prm-300.
      *              *-------------------------------------------------*
      *              * Assegnazione componenti                         *
      *              *-------------------------------------------------*
           move      "EX"                 to   w-cgi-tip-ope          .
           move      w-cgi-str-num        to   w-cgi-str-num          .
           perform   ope-prm-inp-000      thru ope-prm-inp-999        .
       ext-prm-500.
      *              *-------------------------------------------------*
      *              * Regolarizzazioni                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Protocollo documento                        *
      *                  *---------------------------------------------*
           perform   ext-prm-prt-000      thru ext-prm-prt-999        .
      *                  *---------------------------------------------*
      *                  * Numero documento in uppercase               *
      *                  *---------------------------------------------*
           move      w-exe-num-bfo        to   w-all-str-alf          .
           move      20                   to   w-all-str-lun          .
           perform   all-str-upp-000      thru all-str-upp-999        .
           move      w-all-str-alf        to   w-exe-num-bfo          .
      *                  *---------------------------------------------*
      *                  * Eliminazione eventuale prefisso contras-    *
      *                  * segno collo                                 *
      *                  *---------------------------------------------*
           if        w-exe-num-bfo
                    (01 : 05)             =    "%2BC1"
                     move  w-exe-num-bfo
                          (06 : 15)       to   w-exe-num-col
                                               w-exe-num-bfo          .
      *                  *---------------------------------------------*
      *                  * Numero collo in uppercase                   *
      *                  *---------------------------------------------*
           move      w-exe-num-bfo        to   w-all-str-alf          .
           move      25                   to   w-all-str-lun          .
           perform   all-str-upp-000      thru all-str-upp-999        .
           move      w-all-str-alf        to   w-exe-num-col          .
      *                  *---------------------------------------------*
      *                  * Progressivo riga in numerico                *
      *                  *---------------------------------------------*
           move      "CV"                 to   p-ope                  .
           move      05                   to   p-car                  .
           move      w-exe-prg-bfo        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-num                to   w-slc-num-bft-prg      .
      *                  *---------------------------------------------*
      *                  * Codice numerico responsabile                *
      *                  *---------------------------------------------*
           move      "CV"                 to   p-ope                  .
           move      03                   to   p-car                  .
           move      w-exe-cod-rsm        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-num                to   w-exe-cnv-rsm          .
      *                  *---------------------------------------------*
      *                  * Codice dipendenza                           *
      *                  *---------------------------------------------*
           move      01                   to   w-slc-num-bft-ndp      .
      *                  *---------------------------------------------*
      *                  * Codice alfanumerico prodotto                *
      *                  *---------------------------------------------*
           move      w-exe-alf-pro        to   w-cgi-alf-pro          .
           perform   ext-prm-pro-000      thru ext-prm-pro-999        .
           move      w-cgi-alf-pro        to   w-exe-alf-pro          .
      *                  *---------------------------------------------*
      *                  * Codice ubicazione                           *
      *                  *---------------------------------------------*
           move      w-exe-cod-ubi        to   w-all-str-alf          .
           move      07                   to   w-all-str-lun          .
           perform   all-str-upp-000      thru all-str-upp-999        .
           move      w-all-str-alf        to   w-exe-cod-ubi          .
       ext-prm-700.
      *              *-------------------------------------------------*
      *              * Operazioni preliminari                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione tabella responsabili           *
      *                  *---------------------------------------------*
           perform   det-tbl-rsm-000      thru det-tbl-rsm-999        .
       ext-prm-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ext-prm-999.
       ext-prm-999.
           exit.

      *    *===========================================================*
      *    * Estrazione parametri                                      *
      *    *                                                           *
      *    * Subroutine di assegnazione del valore in base al nome del *
      *    * campo in input                                            *
      *    *-----------------------------------------------------------*
       ext-prm-ass-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del nome campo           *
      *              *-------------------------------------------------*
           if        w-all-str-cat (1)    =    "liv_ope"
                     move  w-all-str-cat (2)
                                          to   w-exe-liv-ope
           else if   w-all-str-cat (1)    =    "rsp_doc"
                     move  w-all-str-cat (2)
                                          to   w-exe-cod-rsm
           else if   w-all-str-cat (1)    =    "num_doc"
                     move  w-all-str-cat (2)
                                          to   w-exe-num-bfo
           else if   w-all-str-cat (1)    =    "prt_bfo"
                     move  w-all-str-cat (2)
                                          to   w-exe-prt-bfo
           else if   w-all-str-cat (1)    =    "prg_bfo"
                     move  w-all-str-cat (2)
                                          to   w-exe-prg-bfo
           else if   w-all-str-cat (1)    =    "cod_ubi"
                     move  w-all-str-cat (2)
                                          to   w-exe-cod-ubi
           else if   w-all-str-cat (1)    =    "alf_pro"
                     move  w-all-str-cat (2)
                                          to   w-exe-alf-pro          .
       ext-prm-ass-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ext-prm-ass-999.
       ext-prm-ass-999.
           exit.

      *    *===========================================================*
      *    * Estrazione parametri                                      *
      *    *                                                           *
      *    * Subroutine di eventuale estrazione protocollo             *
      *    *-----------------------------------------------------------*
       ext-prm-prt-000.
      *              *-------------------------------------------------*
      *              * Test su protocollo in input                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        w-exe-prt-bfo        =    spaces
                     go to ext-prm-prt-030.
      *                  *---------------------------------------------*
      *                  * Conversione in numerico                     *
      *                  *---------------------------------------------*
           move      "CV"                 to   p-ope                  .
           move      11                   to   p-car                  .
           move      w-exe-prt-bfo        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-num                to   w-slc-num-bft-prt      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     ext-prm-prt-900.
       ext-prm-prt-030.
      *              *-------------------------------------------------*
      *              * Test su valore del campo in input               *
      *              *-------------------------------------------------*
           if        w-exe-num-bfo        =    spaces
                     go to ext-prm-prt-900.
           if        w-slc-num-bft-prt    not  = zero
                     go to ext-prm-prt-900.
       ext-prm-prt-050.
      *              *-------------------------------------------------*
      *              * Test su presenza del carattere '.'              *
      *              *-------------------------------------------------*
           move      w-exe-num-bfo        to   w-all-str-alf          .
           move      "."                  to   w-all-str-del          .
           perform   all-str-chr-000      thru all-str-chr-999        .
           if        w-all-str-num        =    1
                     perform ext-prm-prt-sep-000
                                          thru ext-prm-prt-sep-999
                     go to ext-prm-prt-900.
       ext-prm-prt-100.
      *              *-------------------------------------------------*
      *              * Test su lunghezza del campo in input            *
      *              *-------------------------------------------------*
           move      w-exe-num-bfo        to   w-all-str-alf          .
           perform   all-str-lun-000      thru all-str-lun-999        .
           if        w-all-str-lun        >    6
                     go to ext-prm-prt-400.
       ext-prm-prt-200.
      *              *-------------------------------------------------*
      *              * Se lunghezza di 6 caratteri o inferiore         *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lunghezza stringa                           *
      *                  *---------------------------------------------*
           move      w-all-str-lun        to   w-exe-lun-prt          .
      *                  *---------------------------------------------*
      *                  * Secolo/anno da data di sistema              *
      *                  *---------------------------------------------*
           move      w-exe-dat-exe
                    (01 : 03)             to   w-exe-saa-prt          .
      *                  *---------------------------------------------*
      *                  * Codice dipendenza                           *
      *                  *---------------------------------------------*
           move      "01"                 to   w-exe-dpz-prt          .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      11                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      w-exe-saa-prt        to   w-all-str-cat (1)      .
           move      w-exe-dpz-prt        to   w-all-str-cat (2)      .
      *
           if        w-exe-lun-prt        =    1
                     move  "00000"        to   w-all-str-cat (3)
           else if   w-exe-lun-prt        =    2
                     move  "0000"         to   w-all-str-cat (3)
           else if   w-exe-lun-prt        =    3
                     move  "000"          to   w-all-str-cat (3)
           else if   w-exe-lun-prt        =    4
                     move  "00"           to   w-all-str-cat (3)
           else if   w-exe-lun-prt        =    5
                     move  "0"            to   w-all-str-cat (3)
           else      move  spaces         to   w-all-str-cat (3)      .
      *
           move      w-exe-num-bfo        to   w-all-str-cat (4)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                  *---------------------------------------------*
      *                  * Conversione in numerico                     *
      *                  *---------------------------------------------*
           move      "CV"                 to   p-ope                  .
           move      11                   to   p-car                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-num                to   w-slc-num-bft-prt      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     ext-prm-prt-900.
       ext-prm-prt-400.
      *              *-------------------------------------------------*
      *              * Se lunghezza 11                                 *
      *              *-------------------------------------------------*
           if        w-all-str-lun        not  = 11
                     go to ext-prm-prt-900.
      *                  *---------------------------------------------*
      *                  * Conversione in numerico                     *
      *                  *---------------------------------------------*
           move      "CV"                 to   p-ope                  .
           move      11                   to   p-car                  .
           move      w-exe-num-bfo        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-num                to   w-slc-num-bft-prt      .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     ext-prm-prt-900.
       ext-prm-prt-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ext-prm-prt-999.
       ext-prm-prt-999.
           exit.

      *    *===========================================================*
      *    * Estrazione parametri                                      *
      *    *                                                           *
      *    * Subroutine di eventuale estrazione protocollo             *
      *    *                                                           *
      *    * Sub-subroutine di estrazione protocollo e anno            *
      *    *-----------------------------------------------------------*
       ext-prm-prt-sep-000.
      *              *-------------------------------------------------*
      *              * Estrazione                                      *
      *              *-------------------------------------------------*
           move      w-exe-num-bfo        to   w-all-str-alf          .
           move      "."                  to   w-all-str-del          .
           perform   all-str-ext-000      thru all-str-ext-999        .
           move      w-all-str-cat (2)    to   w-exe-wrk-prt          .
      *              *-------------------------------------------------*
      *              * Estrazione secolo/anno                          *
      *              *-------------------------------------------------*
           move      w-all-str-cat (1)    to   w-exe-saa-prt
                                              (02 : 02)               .
           move      "1"                  to   w-exe-saa-prt
                                              (01 : 01)               .
      *              *-------------------------------------------------*
      *              * Test su lunghezza del componente numero         *
      *              *-------------------------------------------------*
           move      w-exe-wrk-prt        to   w-all-str-alf          .
           perform   all-str-lun-000      thru all-str-lun-999        .
           move      w-all-str-lun        to   w-exe-lun-prt          .
       ext-prm-prt-sep-200.
      *              *-------------------------------------------------*
      *              * Codice dipendenza                               *
      *              *-------------------------------------------------*
           move      "01"                 to   w-exe-dpz-prt          .
      *              *-------------------------------------------------*
      *              * Assemblaggio                                    *
      *              *-------------------------------------------------*
           move      11                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      w-exe-saa-prt        to   w-all-str-cat (1)      .
           move      w-exe-dpz-prt        to   w-all-str-cat (2)      .
      *
           if        w-exe-lun-prt        =    1
                     move  "00000"        to   w-all-str-cat (3)
           else if   w-exe-lun-prt        =    2
                     move  "0000"         to   w-all-str-cat (3)
           else if   w-exe-lun-prt        =    3
                     move  "000"          to   w-all-str-cat (3)
           else if   w-exe-lun-prt        =    4
                     move  "00"           to   w-all-str-cat (3)
           else if   w-exe-lun-prt        =    5
                     move  "0"            to   w-all-str-cat (3)
           else      move  spaces         to   w-all-str-cat (3)      .
      *
           move      w-exe-wrk-prt        to   w-all-str-cat (4)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *                  *---------------------------------------------*
      *                  * Conversione in numerico                     *
      *                  *---------------------------------------------*
           move      "CV"                 to   p-ope                  .
           move      11                   to   p-car                  .
           move      w-all-str-alf        to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-num                to   w-slc-num-bft-prt      .
       ext-prm-prt-sep-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ext-prm-prt-sep-999.
       ext-prm-prt-sep-999.
           exit.

      *    *===========================================================*
      *    * Open files                                                *
      *    *-----------------------------------------------------------*
       opn-fls-000.
      *              *-------------------------------------------------*
      *              * [bfu]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfu                 .
      *              *-------------------------------------------------*
      *              * [ybf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofybf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ybf                 .
      *              *-------------------------------------------------*
      *              * [bfe]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfe"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfe                 .
      *              *-------------------------------------------------*
      *              * [bft]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *              *-------------------------------------------------*
      *              * [bfr]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *              *-------------------------------------------------*
      *              * [bfk]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfk                 .
      *              *-------------------------------------------------*
      *              * [bfs]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfs                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [pdk]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdk                 .
      *              *-------------------------------------------------*
      *              * [aaq]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *              *-------------------------------------------------*
      *              * [aaf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaf                 .
      *              *-------------------------------------------------*
      *              * [zrm]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione saldo di magazz.  *
      *              *-------------------------------------------------*
           perform   det-sld-mag-opn-000  thru det-sld-mag-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione saldo di magaz-   *
      *              * zino per ubicazione                             *
      *              *-------------------------------------------------*
           perform   det-sld-ubi-opn-000  thru det-sld-ubi-opn-999    .
      *              *-------------------------------------------------*
      *              * Open modulo gestione movimenti di MAG           *
      *              *-------------------------------------------------*
           perform   mdl-agg-mag-opn-000  thru mdl-agg-mag-opn-999    .
       opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Close files                                               *
      *    *-----------------------------------------------------------*
       cls-fls-000.
      *              *-------------------------------------------------*
      *              * [bfu]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfu                 .
      *              *-------------------------------------------------*
      *              * [ybf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofybf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ybf                 .
      *              *-------------------------------------------------*
      *              * [bfe]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfe"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfe                 .
      *              *-------------------------------------------------*
      *              * [bft]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *              *-------------------------------------------------*
      *              * [bfr]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *              *-------------------------------------------------*
      *              * [bfk]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfk                 .
      *              *-------------------------------------------------*
      *              * [bfs]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfs                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [dcp]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * [pdk]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdk                 .
      *              *-------------------------------------------------*
      *              * [aaq]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *              *-------------------------------------------------*
      *              * [aaf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaf                 .
      *              *-------------------------------------------------*
      *              * [zrm]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione saldo di magazz. *
      *              *-------------------------------------------------*
           perform   det-sld-mag-cls-000  thru det-sld-mag-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione saldo di magaz-  *
      *              * zino per ubicazione                             *
      *              *-------------------------------------------------*
           perform   det-sld-ubi-cls-000  thru det-sld-ubi-cls-999    .
      *              *-------------------------------------------------*
      *              * Close modulo gestione movimenti di MAG          *
      *              *-------------------------------------------------*
           perform   mdl-agg-mag-cls-000  thru mdl-agg-mag-cls-999    .
       cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *-----------------------------------------------------------*
       exe-cph-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
       exe-cph-010.
      *              *-------------------------------------------------*
      *              * Test preliminare su livello operativo           *
      *              *-------------------------------------------------*
           if        w-exe-liv-ope        =    "0"
                     go to exe-cph-100
           else if   w-exe-liv-ope        =    "1"
                     go to exe-cph-300
           else if   w-exe-liv-ope        =    "2"
                     go to exe-cph-500
           else      go to exe-cph-100.
       exe-cph-100.
      *              *-------------------------------------------------*
      *              * Livello '0': accettazione responsabile          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine                                  *
      *                  *---------------------------------------------*
           perform   exe-cph-lv0-000      thru exe-cph-lv0-999        .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     exe-cph-900.
       exe-cph-300.
      *              *-------------------------------------------------*
      *              * Livello '1': accettazione protocollo            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine                                  *
      *                  *---------------------------------------------*
           perform   exe-cph-lv1-000      thru exe-cph-lv1-999        .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     exe-cph-900.
       exe-cph-500.
      *              *-------------------------------------------------*
      *              * Livello '2': accettazione quantita' per ubica-  *
      *              *              zione                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine                                  *
      *                  *---------------------------------------------*
           perform   exe-cph-lv2-000      thru exe-cph-lv2-999        .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     exe-cph-900.
       exe-cph-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-999.
       exe-cph-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '0'                                *
      *    *-----------------------------------------------------------*
       exe-cph-lv0-000.
      *              *-------------------------------------------------*
      *              * Emissione 'header'                              *
      *              *-------------------------------------------------*
           perform   exe-cph-hea-000      thru exe-cph-hea-999        .
       exe-cph-lv0-200.
      *              *-------------------------------------------------*
      *              * Modulo                                          *
      *              *-------------------------------------------------*
           display   "<form name='bfo_002' id='bfo_002' method='post' ac
      -              "tion=''>"                                       .
       exe-cph-lv0-300.
      *              *-------------------------------------------------*
      *              * Allineamento                                    *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "center"             to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Area di input chiave                            *
      *              *-------------------------------------------------*
           display   "<table class='tes' id='key_lv0' name='key_lv0'>".
      *              *-------------------------------------------------*
      *              * Apertura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Responsabile                                    *
      *              *-------------------------------------------------*
           perform   exe-cph-lv0-rsm-000  thru exe-cph-lv0-rsm-999    .
      *              *-------------------------------------------------*
      *              * Chiusura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura tabella                                *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "table"              to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura allineamento centrato                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "center"             to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv0-700.
      *              *-------------------------------------------------*
      *              * Livello operativo 'hidden'                      *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "liv_ope"            to   h-nam                  .
           move      "0"                  to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv0-800.
      *              *-------------------------------------------------*
      *              * Chiusura 'form'                                 *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "form"               to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura html                                   *
      *              *-------------------------------------------------*
           perform   emi-htm-cls-000      thru emi-htm-cls-999        .
       exe-cph-lv0-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv0-999.
       exe-cph-lv0-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '0'                                *
      *    *                                                           *
      *    * Sub-subroutine per accettazione Responsabile (Operatore)  *
      *    *-----------------------------------------------------------*
       exe-cph-lv0-rsm-000.
      *              *-------------------------------------------------*
      *              * Apertura cella                                  *
      *              *-------------------------------------------------*
           display   "<td id='cel_ute' name='cel_ute' align='center'>".
      *              *-------------------------------------------------*
      *              * Prompt                                          *
      *              *-------------------------------------------------*
           display   "<h1> Operatore </h1>"                           .
      *              *-------------------------------------------------*
      *              * Apertura campo Select                           *
      *              *-------------------------------------------------*
           display   "<select name='rsp_doc' id='rsp_doc'>"           .
      *              *-------------------------------------------------*
      *              * Elemento iniziale vuoto                         *
      *              *-------------------------------------------------*
           if        w-exe-cnv-rsm        not  = zero
                     go to exe-cph-lv0-rsm-100.
           display   "<option value=0 selected> (non selezionato)"    .
           display   "</option>"                                      .
       exe-cph-lv0-rsm-100.
      *              *-------------------------------------------------*
      *              * Costruzione tabella responsabili                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizializzazione contatore                  *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-tbl-rsm-inx      .
       exe-cph-lv0-rsm-200.
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-det-tbl-rsm-inx      .
      *                  *---------------------------------------------*
      *                  * Test su contatore                           *
      *                  *---------------------------------------------*
           if        w-det-tbl-rsm-inx    >    w-det-tbl-rsm-ctr
                     go to exe-cph-lv0-rsm-500.
           if        w-det-tbl-rsm-inx    >    w-det-tbl-rsm-max
                     go to exe-cph-lv0-rsm-500.
      *                  *---------------------------------------------*
      *                  * Editing codice responsabile                 *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-det-tbl-cod-rsp
                    (w-det-tbl-rsm-inx)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Test se elemento selezionato                *
      *                  *---------------------------------------------*
           if        w-det-tbl-cod-rsp
                    (w-det-tbl-rsm-inx)   =    w-exe-cnv-rsm
                     move  "selected"     to   w-all-str-cat (1)
           else      move  spaces         to   w-all-str-cat (1)      .
      *                  *---------------------------------------------*
      *                  * Eventuale disabilitazione                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-all-str-cat (2)      .
      *                  *---------------------------------------------*
      *                  * Emissione elemento                          *
      *                  *---------------------------------------------*
           move      spaces               to   w-exe-str-dsp          .
      *
           string    "<option "
                                delimited by   size
                     w-all-str-cat (1)
                                delimited by   spaces
                     " "
                                delimited by   size
                     w-all-str-cat (2)
                                delimited by   spaces
                     " value='"
                                delimited by   size
                     p-edt
                                delimited by   spaces
                     "'>"
                                delimited by   size
                     w-det-tbl-des-rsp
                    (w-det-tbl-rsm-inx)
                                delimited by   size
                     "</option>"
                                delimited by   size
                                          into w-exe-str-dsp          .
      *
           display   w-exe-str-dsp                                    .
      *                  *---------------------------------------------*
      *                  * A riciclo                                   *
      *                  *---------------------------------------------*
           go to exe-cph-lv0-rsm-200.
       exe-cph-lv0-rsm-500.
      *              *-------------------------------------------------*
      *              * Chiusura accettazione                           *
      *              *-------------------------------------------------*
           display   "</select>"                                      .
      *              *-------------------------------------------------*
      *              * Chiusura cella                                  *
      *              *-------------------------------------------------*
           display   "</td>"                                          .
       exe-cph-lv0-rsm-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv0-rsm-999.
       exe-cph-lv0-rsm-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flags                           *
      *              *-------------------------------------------------*
           move      spaces               to   w-exe-flg-stp          .
       exe-cph-lv1-030.
       exe-cph-lv1-050.
      *              *-------------------------------------------------*
      *              * Se documento spuntato: eventuale aggiornamento  *
      *              * magazzino                                       *
      *              *-------------------------------------------------*
           if        w-exe-flg-stp        not  = spaces
                     go to exe-cph-lv1-080.
      *              *-------------------------------------------------*
      *              * Aggiornamento di magazzino                      *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-mag-000  thru exe-cph-lv1-mag-999    .
       exe-cph-lv1-080.
      *              *-------------------------------------------------*
      *              * Emissione 'header'                              *
      *              *-------------------------------------------------*
           perform   exe-cph-hea-000      thru exe-cph-hea-999        .
       exe-cph-lv1-100.
      *              *-------------------------------------------------*
      *              * Modulo                                          *
      *              *-------------------------------------------------*
           display   "<form name='bfo_002' id='bfo_002' method='post' ac
      -              "tion=''>"                                       .
       exe-cph-lv1-200.
      *              *-------------------------------------------------*
      *              * Allineamento                                    *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "center"             to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Area di input chiave                            *
      *              *-------------------------------------------------*
           display   "<table class='tes' id='tes' name='tes'>"        .
      *              *-------------------------------------------------*
      *              * Apertura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-250.
      *              *-------------------------------------------------*
      *              * ATTUALMENTE INIBITO                             *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-300.
      *              *-------------------------------------------------*
      *              * Apertura cella                                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Box per bottone di ritorno a menu               *
      *              *-------------------------------------------------*
           perform   emi-htm-bck-000      thru emi-htm-bck-999        .
      *              *-------------------------------------------------*
      *              * Chiusura cella                                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-300.
      *              *-------------------------------------------------*
      *              * Operatore (responsabile di magazzino)           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura descrizione responsabile            *
      *                  *---------------------------------------------*
           move      w-exe-cnv-rsm        to   w-let-arc-zrm-cod      .
           perform   let-arc-zrm-000      thru let-arc-zrm-999        .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           display   "<td>"                                           .
           display   "<b>"                                            .
           display   w-let-arc-zrm-des                                .
           display   "</b>"                                           .
           display   "</td>"                                          .
       exe-cph-lv1-400.
      *              *-------------------------------------------------*
      *              * Cella per tasto di reset                        *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "I"                  to   h-sub                  .
           move      "cel_res"            to   h-idx                  .
           move      "cel_res"            to   h-nam                  .
           move      "td_nb"              to   h-cla                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Tasto di reset                                  *
      *              *-------------------------------------------------*
           display   "<button type='button' id='res' name='res'>"     .
           display   "<img src='../icons/gomma.png' width='70'>"      .
           display   "</button>"                                      .
           display   "</td>"                                          .
      *              *-------------------------------------------------*
      *              * Numero documento del fornitore                  *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-num-000  thru exe-cph-lv1-num-999    .
      *              *-------------------------------------------------*
      *              * Codice prodotto                                 *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-pro-000  thru exe-cph-lv1-pro-999    .
      *              *-------------------------------------------------*
      *              * Cella per tasto di stampa                       *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "I"                  to   h-sub                  .
           move      "cel_stp"            to   h-idx                  .
           move      "cel_stp"            to   h-nam                  .
           move      "td_nb"              to   h-cla                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Tasto di stampa                                 *
      *              *-------------------------------------------------*
           display   "<button type='button' id='stp' name='stp'>"     .
           display   "<img src='../icons/printer.png' width='70'>"    .
           display   "</button>"                                      .
      *              *-------------------------------------------------*
      *              * Chiusura cella                                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-500.
      *              *-------------------------------------------------*
      *              * Chiusura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura tabella                                *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "table"              to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Box di dialogo per lista ordini                 *
      *              *-------------------------------------------------*
           display   "<div id='dialog' name='dialog' title=''>"       .                                 .
           display   "</div>"                                         .
      *              *-------------------------------------------------*
      *              * Box di dialogo per conferma spunta generale     *
      *              *-------------------------------------------------*
           display   "<div id='dialog-confirm' name='dialog-confirm' tit
      -              "le=''>"                                         .                                 .
           display   "</div>"                                         .
      *              *-------------------------------------------------*
      *              * Chiusura allineamento centrato                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "center"             to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-600.
      *              *-------------------------------------------------*
      *              * Test preliminare su numero documento            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se protocollo gia' individuato         *
      *                  *---------------------------------------------*
           if        w-slc-num-bft-prt    not  = zero
                     go to exe-cph-lv1-640.
      *                  *---------------------------------------------*
      *                  * Test su numero documento                    *
      *                  *---------------------------------------------*
           if        w-exe-num-bfo        not  = spaces
                     go to exe-cph-lv1-620.
      *                  *---------------------------------------------*
      *                  * Messaggio                                   *
      *                  *---------------------------------------------*
           move      "Inserire un numero documento o un protocollo BFO"
                                          to   w-exe-err-msg          .
           move      "msg_red"            to   w-exe-cla-msg          .
           perform   err-msg-htm-000      thru err-msg-htm-999        .
      *                  *---------------------------------------------*
      *                  * Campi 'hidden' per la testata               *
      *                  *---------------------------------------------*
           perform   exe-cph-lv1-hit-000  thru exe-cph-lv1-hit-999    .
      *                  *---------------------------------------------*
      *                  * Chiusura 'form'                             *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "form"               to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * A chiusura HTML                             *
      *                  *---------------------------------------------*
           go to     exe-cph-lv1-800.
       exe-cph-lv1-620.
      *              *-------------------------------------------------*
      *              * Ricerca record testata da stampare tramite il   *
      *              * numero collo                                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ricerca                                     *
      *                  *---------------------------------------------*
           perform   exe-cph-lv1-col-000  thru exe-cph-lv1-col-999    .
      *                  *---------------------------------------------*
      *                  * Test se record trovato                      *
      *                  *---------------------------------------------*
           if        w-slc-num-bft-prt    not  = zero
                     go to exe-cph-lv1-640.
       exe-cph-lv1-630.
      *              *-------------------------------------------------*
      *              * Ricerca record testata da stampare tramite il   *
      *              * numero documento                                *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-rnd-000  thru exe-cph-lv1-rnd-999    .
       exe-cph-lv1-640.
      *              *-------------------------------------------------*
      *              * Lettura record testata da stampare              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-slc-num-bft-prt    to   rf-bft-num-prt         .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
           if        f-sts                =    e-not-err
                     go to exe-cph-lv1-680.
       exe-cph-lv1-660.
      *                  *---------------------------------------------*
      *                  * Se record non trovato                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Messaggio                               *
      *                      *-----------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "DOCUMENTO '"        to   w-all-str-cat (1)      .
           move      w-exe-num-bfo        to   w-all-str-cat (2)      .
           move      "' NON TROVATO!"     to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-exe-err-msg          .
           move      "msg_red"            to   w-exe-cla-msg          .
           perform   err-msg-htm-000      thru err-msg-htm-999        .
      *                      *-----------------------------------------*
      *                      * Campi 'hidden' per la testata           *
      *                      *-----------------------------------------*
           perform   exe-cph-lv1-hit-000  thru exe-cph-lv1-hit-999    .
      *                      *-----------------------------------------*
      *                      * Chiusura 'form'                         *
      *                      *-----------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "form"               to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                      *-----------------------------------------*
      *                      * A chiusura HTML                         *
      *                      *-----------------------------------------*
           go to     exe-cph-lv1-800.
       exe-cph-lv1-680.
      *              *-------------------------------------------------*
      *              * Test se documento chiuso                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        rf-bft-flg-bch       =    spaces
                     go to exe-cph-lv1-690.
      *                  *---------------------------------------------*
      *                  * Campi 'hidden' per la testata               *
      *                  *---------------------------------------------*
           perform   exe-cph-lv1-hit-000  thru exe-cph-lv1-hit-999    .
      *                  *---------------------------------------------*
      *                  * Chiusura 'form'                             *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "form"               to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Messaggio                                   *
      *                  *---------------------------------------------*
           move      "DOCUMENTO CHIUSO !" to   w-exe-err-msg          .
           move      "msg_red"            to   w-exe-cla-msg          .
           perform   err-msg-htm-000      thru err-msg-htm-999        .
      *                  *---------------------------------------------*
      *                  * A chiusura HTML                             *
      *                  *---------------------------------------------*
           go to     exe-cph-lv1-800.
       exe-cph-lv1-690.
      *              *-------------------------------------------------*
      *              * Test se fornitore non ABB                       *
      *              *-------------------------------------------------*
       exe-cph-lv1-700.
      *              *-------------------------------------------------*
      *              * Controllo preliminare che il documento sia      *
      *              * stampabile                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine                                  *
      *                  *---------------------------------------------*
           perform   ctl-prl-spn-bfr-000  thru ctl-prl-spn-bfr-999    .
      *                  *---------------------------------------------*
      *                  * Se i contatori sono a zero: oltre           *
      *                  *---------------------------------------------*
           if        w-cix-ctr-rig-das    =    zero and
                     w-cix-ctr-rig-spu    =    zero
                     move  "#"            to   w-exe-flg-stp
                     go to exe-cph-lv1-710.
      *                  *---------------------------------------------*
      *                  * Confronto tra i contatori                   *
      *                  *---------------------------------------------*
           if        w-cix-ctr-rig-das    not  = w-cix-ctr-rig-spu
                     move  "#"            to   w-exe-flg-stp          .
       exe-cph-lv1-710.
      *              *-------------------------------------------------*
      *              * Campi 'hidden' per la testata                   *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-hit-000  thru exe-cph-lv1-hit-999    .
      *              *-------------------------------------------------*
      *              * Chiusura 'form'                                 *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "form"               to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-720.
      *              *-------------------------------------------------*
      *              * Preparazione messaggio di documento trovato     *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-mok-000  thru exe-cph-lv1-mok-999    .
      *              *-------------------------------------------------*
      *              * Preparazione messaggio riferimenti documento    *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-mrd-000  thru exe-cph-lv1-mrd-999    .
       exe-cph-lv1-750.
      *              *-------------------------------------------------*
      *              * Esecuzione sort per ordinamento                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   exe-cph-lv1-inp-000
                                          thru exe-cph-lv1-inp-999
                     output procedure     is   exe-cph-lv1-out-000
                                          thru exe-cph-lv1-out-999    .
       exe-cph-lv1-800.
      *              *-------------------------------------------------*
      *              * Chiusura tabella                                *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "table"              to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura html                                   *
      *              *-------------------------------------------------*
           perform   emi-htm-cls-000      thru emi-htm-cls-999        .
       exe-cph-lv1-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-999.
       exe-cph-lv1-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine di aggiornamento magazzino                     *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-mag-000.
      *              *-------------------------------------------------*
      *              * Scrittura movimenti di MAG                      *
      *              *-------------------------------------------------*
           perform   exe-cph-agg-mag-000  thru exe-cph-agg-mag-999    .
       exe-cph-lv1-mag-100.
      *              *-------------------------------------------------*
      *              * Aggiornamento record testata [bft]              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ottenimento record [bft]                    *
      *                  *---------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-slc-num-bft-prt    to   rf-bft-num-prt         .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *                  *---------------------------------------------*
      *                  * Aggiornamento flag a verificato             *
      *                  *---------------------------------------------*
           move      spaces               to   rf-bft-flg-nbx (1)     .
      *                  *---------------------------------------------*
      *                  * Update record [bft]                         *
      *                  *---------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *                  *---------------------------------------------*
      *                  * Rilascio record [bft]                       *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
       exe-cph-lv1-mag-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-mag-999.
       exe-cph-lv1-mag-999.
           exit.

      *    *===========================================================*
      *    * Stampa documento                                          *
      *    *                                                           *
      *    * Subroutine per messaggio di documento trovato             *
      *    *                                                           *
      *    * ___ TUTTA DA RISISTEMARE SE SERVE ___                     *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-mok-000.
      *              *-------------------------------------------------*
      *              * Lettura anagrafica fornitore                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [fnt]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *                  *---------------------------------------------*
      *                  * Lettura record [fnt]                        *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODFNT    "         to   f-key                  .
           move      rf-bft-cod-arc       to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
       exe-cph-lv1-mok-100.
      *              *-------------------------------------------------*
      *              * Editing protocollo documento                    *
      *              *-------------------------------------------------*
           move      w-slc-num-bft-prt    to   w-slc-num-bft-nds      .
           move      w-slc-num-bft-nsa    to   w-slc-num-prt-saa      .
           move      w-slc-num-bft-npg    to   w-slc-num-prt-prg      .
      *
           move      "ED"                 to   p-ope                  .
           move      "P"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      "<B"                 to   p-edm                  .
           move      w-slc-num-prt-num    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (9)      .
      *              *-------------------------------------------------*
      *              * Editing data registrazione                      *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      rf-bft-dat-reg       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (7)      .
      *              *-------------------------------------------------*
      *              * Assemblaggio                                    *
      *              *-------------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      09                   to   w-all-str-num          .
           move      rf-fnt-rag-soc       to   w-all-str-cat (1)      .
           move      "-"                  to   w-all-str-cat (2)      .
           move      rf-bft-cod-tmb       to   w-all-str-cat (3)      .
           move      "nr."                to   w-all-str-cat (4)      .
           move      rf-bft-num-doc       to   w-all-str-cat (5)      .
           move      "del"                to   w-all-str-cat (6)      .
           move      "-"                  to   w-all-str-cat (8)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-exe-err-msg          .
       exe-cph-lv1-mok-200.
      *              *-------------------------------------------------*
      *              * Lettura distinte [bfe]                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine                                  *
      *                  *---------------------------------------------*
           move      w-slc-num-bft-prt    to   w-det-dst-num-prt      .
           perform   exe-cph-lv1-bfe-000  thru exe-cph-lv1-bfe-999    .
      *                  *---------------------------------------------*
      *                  * Test se protocollo determinato              *
      *                  *---------------------------------------------*
           if        w-det-dst-num-dst    =    zero
                     go to exe-cph-lv1-mok-300.
      *                  *---------------------------------------------*
      *                  * Editing protocollo distinta                 *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "P"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      "<B"                 to   p-edm                  .
           move      w-det-dst-num-dst    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      05                   to   w-all-str-num          .
           move      w-exe-err-msg        to   w-all-str-cat (1)      .
           move      "- Distinta"         to   w-all-str-cat (2)      .
           move      p-edt                to   w-all-str-cat (3)      .
      *
           if        w-det-dst-nik-nam    =    spaces
                     move  spaces         to   w-all-str-cat (4)
                     move  spaces         to   w-all-str-cat (5)
           else      move  "-"            to   w-all-str-cat (4)
                     move  w-det-dst-nik-nam
                                          to   w-all-str-cat (5)      .
      *
           perform   all-str-csb-000      thru all-str-csb-999        .
           move      w-all-str-alf        to   w-exe-err-msg          .
       exe-cph-lv1-mok-300.
      *              *-------------------------------------------------*
      *              * Eventuale segnale di altro operatore            *
      *              *                                                 *
      *              * N.B.: attualmente non gestito                   *
      *              *-------------------------------------------------*
       exe-cph-lv1-mok-400.
      *              *-------------------------------------------------*
      *              * Messaggio                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Distanziatore                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "br"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Apertura tabella per il messaggio           *
      *                  *---------------------------------------------*
           display   "<table class='bordotab' id='rif' name='rif' width=
      -              "60%>"                                          .
      *                  *---------------------------------------------*
      *                  * Apertura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Prompt Fornitore                            *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      "Fornitore"          to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "20"                 to   h-wdt                  .
           move      "n"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Fornitore                                   *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      rf-fnt-rag-soc       to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Chiusura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Apertura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Prompt documento                            *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      rf-bft-cod-tmb       to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "20"                 to   h-wdt                  .
           move      "n"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .


      *              *-------------------------------------------------*
      *              * Editing data registrazione                      *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      rf-bft-dat-reg       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (3)      .
      *              *-------------------------------------------------*
      *              * Assemblaggio                                    *
      *              *-------------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      rf-bft-num-doc       to   w-all-str-cat (1)      .
           move      "del"                to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .

      *                  *---------------------------------------------*
      *                  * Estremi documento                           *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      w-all-str-alf        to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .


      *                  *---------------------------------------------*
      *                  * Chiusura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Apertura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Editing protocollo documento                    *
      *              *-------------------------------------------------*
           move      w-slc-num-bft-prt    to   w-slc-num-bft-nds      .
           move      w-slc-num-bft-nsa    to   w-slc-num-prt-saa      .
           move      w-slc-num-bft-npg    to   w-slc-num-prt-prg      .
      *
           move      "ED"                 to   p-ope                  .
           move      "P"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      "<B"                 to   p-edm                  .
           move      w-slc-num-prt-num    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (9)      .
      *                  *---------------------------------------------*
      *                  * Prompt protocollo                           *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      "Protocollo"         to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "20"                 to   h-wdt                  .
           move      "n"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .

      *                  *---------------------------------------------*
      *                  * Estremi documento                           *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      w-all-str-cat (9)    to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .


      *                  *---------------------------------------------*
      *                  * Chiusura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .

      *                  *---------------------------------------------*
      *                  * Apertura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .

      *                  *---------------------------------------------*
      *                  * Prompt distinta                             *
      *                  *---------------------------------------------*
      
      *                      *-----------------------------------------*
      *                      * Test se protocollo determinato          *
      *                      *-----------------------------------------*
           if        w-det-dst-num-dst    =    zero
                     go to exe-cph-lv1-mok-600.
      *                      *-----------------------------------------*
      *                      * Editing protocollo distinta             *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "P"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      "<B"                 to   p-edm                  .
           move      w-det-dst-num-dst    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      02                   to   w-all-str-num          .
           move      "Distinta"           to   w-all-str-cat (1)      .
           move      p-edt                to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      
      
      
      
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      w-all-str-alf        to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "20"                 to   h-wdt                  .
           move      "n"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .





      *                  *---------------------------------------------*
      *                  * Nickname distinta                           *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      w-det-dst-nik-nam    to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .




      *                  *---------------------------------------------*
      *                  * Chiusura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-mok-600.





       exe-cph-lv1-mok-900.
      *              *-------------------------------------------------*
      *              * Chiusura                                        *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-mok-999.
       exe-cph-lv1-mok-999.
           exit.

      *    *===========================================================*
      *    * Stampa documento                                          *
      *    *                                                           *
      *    * Subroutine per messaggio di riferimenti documento         *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-mrd-000.
      *              *-------------------------------------------------*
      *              * Lettura responsabile                            *
      *              *-------------------------------------------------*
           move      w-slc-num-bft-prt    to   w-det-rsm-doc-prt      .
           perform   det-rsm-doc-000      thru det-rsm-doc-999        .
           if        w-det-rsm-doc-rsm    =    zero
                     go to exe-cph-lv1-mrd-900.
      *              *-------------------------------------------------*
      *              * Lettura responsabile                            *
      *              *-------------------------------------------------*
           move      w-det-rsm-doc-rsm    to   w-let-arc-zrm-cod      .
           perform   let-arc-zrm-000      thru let-arc-zrm-999        .
       exe-cph-lv1-mrd-200.
      *              *-------------------------------------------------*
      *              * Normalizzazione [bft]                           *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *              *-------------------------------------------------*
      *              * Lettura [bft]                                   *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-slc-num-bft-prt    to   rf-bft-num-prt         .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
       exe-cph-lv1-mrd-400.
      *              *-------------------------------------------------*
      *              * Preparazione messaggio                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing numero                              *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      rf-bft-pr2-mag
                    (06 : 06)             to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (1)      .
      *                  *---------------------------------------------*
      *                  * Editing data                                *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "D"                  to   p-tip                  .
           move      rf-bft-dat-reg       to   p-dat                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (3)      .
      *
           if        rf-bft-dat-reg       =    zero
                     move  spaces         to   w-all-str-cat (3)      .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "-"                  to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
       exe-cph-lv1-mrd-600.
       
       
       
      *                  *---------------------------------------------*
      *                  * Apertura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       
       
      *                  *---------------------------------------------*
      *                  * Prompt magazzino                            *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      w-let-arc-zrm-des    to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "20"                 to   h-wdt                  .
           move      "n"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       

      *                  *---------------------------------------------*
      *                  * Prompt magazzino                            *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      w-all-str-alf        to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .






      *                  *---------------------------------------------*
      *                  * Chiusura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .



      *                  *---------------------------------------------*
      *                  * Chiusura tabella                            *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "table"              to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Distanziatore                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "br"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .


       exe-cph-lv1-mrd-900.
      *              *-------------------------------------------------*
      *              * Chiusura                                        *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-mrd-999.
       exe-cph-lv1-mrd-999.
           exit.

      *    *===========================================================*
      *    * Stampa documento                                          *
      *    *                                                           *
      *    * Subroutine di determinazione se documento in distinta     *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-bfe-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-dst-ctr-ele      .
           move      zero                 to   w-det-dst-num-dst      .
           move      spaces               to   w-det-dst-sts-dst      .
           move      spaces               to   w-det-dst-nik-nam      .
       exe-cph-lv1-bfe-100.
      *              *-------------------------------------------------*
      *              * Start su [bfe]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "DOCDST    "         to   f-key                  .
           move      w-det-dst-num-prt    to   rf-bfe-prt-doc         .
           move      zero                 to   rf-bfe-num-dst         .
           move      zero                 to   rf-bfe-num-prg         .
           move      "pgm/bfo/fls/ioc/obj/iofbfe"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfe                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : ad uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-cph-lv1-bfe-900.
       exe-cph-lv1-bfe-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale [bfe]                       *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfe"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfe                 .
      *                  *---------------------------------------------*
      *                  * Se fine file : ad uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-cph-lv1-bfe-900.
       exe-cph-lv1-bfe-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-bfe-prt-doc       not  = w-det-dst-num-prt
                     go to exe-cph-lv1-bfe-900.
       exe-cph-lv1-bfe-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
       exe-cph-lv1-bfe-600.
      *              *-------------------------------------------------*
      *              * Incremento contatore                            *
      *              *-------------------------------------------------*
           add       1                    to   w-det-dst-ctr-ele      .
      *              *-------------------------------------------------*
      *              * Numero distinta                                 *
      *              *-------------------------------------------------*
           move      rf-bfe-num-dst       to   w-det-dst-num-dst      .
      *              *-------------------------------------------------*
      *              * Nickname distinta                               *
      *              *-------------------------------------------------*
           move      rf-bfe-nik-nam       to   w-det-dst-nik-nam      .
       exe-cph-lv1-bfe-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-bfe-999.
       exe-cph-lv1-bfe-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Sub-subroutine di ricerca documento tramite collo         *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-col-000.
      *              *-------------------------------------------------*
      *              * Test iniziali                                   *
      *              *-------------------------------------------------*
           if        w-exe-num-col        =    spaces
                     go to exe-cph-lv1-col-900.
       exe-cph-lv1-col-100.
      *              *-------------------------------------------------*
      *              * Start su [bfk] per contrassegno                 *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "CTSPRC    "         to   f-key                  .
           move      w-exe-num-col        to   rf-bfk-cts-prc         .
           move      zero                 to   rf-bfk-num-prt         .
           move      zero                 to   rf-bfk-num-prg         .
           move      zero                 to   rf-bfk-num-prc         .
           move      "pgm/bfo/fls/ioc/obj/iofbfk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfk                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : fine lettura           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  exe-cph-lv1-col-900.
       exe-cph-lv1-col-200.
      *              *-------------------------------------------------*
      *              * Next su [bfk]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfk                 .
      *                  *---------------------------------------------*
      *                  * Se at end : fine lettura                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  exe-cph-lv1-col-900.
       exe-cph-lv1-col-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-bfk-cts-prc       not  = w-exe-num-col
                     go to  exe-cph-lv1-col-900.
       exe-cph-lv1-col-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
       exe-cph-lv1-col-500.
      *              *-------------------------------------------------*
      *              * Bufferizzazione protocollo individuato          *
      *              *-------------------------------------------------*
           move      rf-bfk-num-prt       to   w-slc-num-bft-prt      .
      *              *-------------------------------------------------*
      *              * Normalizzazione record testata                  *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *              *-------------------------------------------------*
      *              * Lettura record testata                          *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-slc-num-bft-prt    to   rf-bft-num-prt         .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *              *-------------------------------------------------*
      *              * Bufferizzazione numero documento                *
      *              *-------------------------------------------------*
           move      rf-bft-num-doc       to   w-exe-num-bfo          .
       exe-cph-lv1-col-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-col-999.
       exe-cph-lv1-col-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Sub-subroutine di ricerca documento tramite numero        *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-rnd-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione contatori                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-slc-num-bft-prt      .
       exe-cph-lv1-rnd-100.
      *              *-------------------------------------------------*
      *              * Start su [bfr]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "RCHARCDOC "         to   f-key                  .
           move      01                   to   rf-bfr-cod-dpz         .
           move      spaces               to   rf-bfr-flg-rch         .
           move      "F"                  to   rf-bfr-tip-arc         .
           move      zero                 to   rf-bfr-cod-arc         .
           move      w-exe-num-bfo        to   rf-bfr-num-doc         .
           move      zero                 to   rf-bfr-num-prt         .
           move      zero                 to   rf-bfr-num-prg         .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : fine lettura           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  exe-cph-lv1-rnd-900.
       exe-cph-lv1-rnd-200.
      *              *-------------------------------------------------*
      *              * Next su [bfr]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                  *---------------------------------------------*
      *                  * Se at end : fine lettura                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  exe-cph-lv1-rnd-900.
       exe-cph-lv1-rnd-300.
      *              *-------------------------------------------------*
      *              * Se oltre il massimo : fine lettura              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su codice dipendenza e tipo archivio   *
      *                  *---------------------------------------------*
           if        rf-bfr-cod-dpz       not  = 01     or
                     rf-bfr-flg-rch       not  = spaces or
                     rf-bfr-tip-arc       not  = "F"
                     go to  exe-cph-lv1-rnd-900.
       exe-cph-lv1-rnd-400.
      *              *-------------------------------------------------*
      *              * Selezioni su [bfr]                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo riga                           *
      *                  *---------------------------------------------*
           if        rf-bfr-tip-rig       not  = "P    "
                     go to  exe-cph-lv1-rnd-200.
      *                  *---------------------------------------------*
      *                  * Test su numero documento                    *
      *                  *---------------------------------------------*
           if        w-exe-num-bfo        not  = spaces        and
                     rf-bfr-num-doc       not  = w-exe-num-bfo
                     go to  exe-cph-lv1-rnd-200.
       exe-cph-lv1-rnd-500.
      *              *-------------------------------------------------*
      *              * Protocollo determinato                          *
      *              *-------------------------------------------------*
           move      rf-bfr-num-prt       to   w-slc-num-bft-prt      .
       exe-cph-lv1-rnd-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-rnd-999.
       exe-cph-lv1-rnd-999.
           exit.

      *    *===========================================================*
      *    * Intestazione                                              *
      *    *                                                           *
      *    * Subroutine per Protocollo documento                       *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-num-000.
      *              *-------------------------------------------------*
      *              * Apertura cella                                  *
      *              *-------------------------------------------------*
           display   "<td id='cel_num' name='cel_num' align='center'>".
      *              *-------------------------------------------------*
      *              * Prompt                                          *
      *              *-------------------------------------------------*
           display   "<h1> Identificativo documento </h1>"            .
      *
           move      spaces               to   w-exe-str-dsp          .
      *
           string    "<input type='text' id='num_doc' name='num_doc'"
                                delimited by   size
                     " value='"
                                delimited by   size
                     w-exe-num-bfo
                                delimited by   spaces
                     "' style='text-transform: uppercase;' "
                                delimited by   size
                     "maxlength='18'>"
                                delimited by   size
                                          into w-exe-str-dsp          .
      *
           display   w-exe-str-dsp                                    .
      *              *-------------------------------------------------*
      *              * Chiusura cella                                  *
      *              *-------------------------------------------------*
           display   "</td>"                                          .
       exe-cph-lv1-num-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-num-999.
       exe-cph-lv1-num-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Sub-subroutine di accettazione codice prodotto            *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-pro-000.
      *              *-------------------------------------------------*
      *              * Apertura cella                                  *
      *              *-------------------------------------------------*
           display   "<td id='cel_pro' name='cel_pro' align='center'>".
       exe-cph-lv1-pro-100.
      *              *-------------------------------------------------*
      *              * Ricerca del codice numerico prodotto            *
      *              *-------------------------------------------------*
           if        w-exe-alf-pro        =    spaces
                     go to exe-cph-lv1-pro-200.
           move      w-exe-alf-pro        to   w-det-num-pro-alf      .
           perform   det-num-pro-000      thru det-num-pro-999        .
           move      w-det-num-pro-num    to   w-exe-num-pro          .
           move      w-det-num-pro-alf    to   w-exe-alf-pro          .
       exe-cph-lv1-pro-200.
      *              *-------------------------------------------------*
      *              * Prompt                                          *
      *              *-------------------------------------------------*
           display   "<h1> Prodotto </h1>"                            .
      *
           move      spaces               to   w-exe-str-dsp          .
      *
           string    "<input type='text' id='alf_pro' name='alf_pro' "
                                delimited by   size
                     " value='"
                                delimited by   size
                     w-exe-alf-pro
                                delimited by   spaces
                     "' style='text-transform: uppercase;' "
                                delimited by   size
                     "maxlength='18'>"
                                delimited by   size
                                          into w-exe-str-dsp          .
      *
           display   w-exe-str-dsp                                    .
      *              *-------------------------------------------------*
      *              * Chiusura cella                                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-pro-400.
      *              *-------------------------------------------------*
      *              * Bottone di reset prodotto                       *
      *              *                                                 *
      *              * Attualmente inibito                             *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-pro-900.
      *              *-------------------------------------------------*
      *              * Apertura cella                                  *
      *              *-------------------------------------------------*
           display   "<td id='cel_res' name='cel_res' align='center'>".
      *              *-------------------------------------------------*
      *              * Chiusura cella                                  *
      *              *-------------------------------------------------*
           display   "<button type='button' id='rep' name='rep' class='e
      -              "rase'>"                                         .
           display   "<img src='../icons/erase.png' width='70'>"      .
           display   "</button>"                                      .
      *              *-------------------------------------------------*
      *              * Chiusura cella                                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-pro-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-pro-999.
       exe-cph-lv1-pro-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Sub-subroutine di input                                   *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-inp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione contatori                       *
      *              *-------------------------------------------------*
           move      zero                 to   w-exe-ctr-rig          .
           move      zero                 to   w-exe-ctr-pro          .
           move      zero                 to   w-exe-snx-pcr          .
           move      zero                 to   w-exe-sel-pro          .
      *              *-------------------------------------------------*
      *              * Ricerca del codice numerico prodotto            *
      *              *-------------------------------------------------*
           if        w-exe-alf-pro        =    spaces
                     go to exe-cph-lv1-inp-100.
           move      w-exe-alf-pro        to   w-det-num-pro-alf      .
           perform   det-num-pro-000      thru det-num-pro-999        .
           move      w-det-num-pro-num    to   w-exe-num-pro          .
       exe-cph-lv1-inp-100.
      *              *-------------------------------------------------*
      *              * Start su [bfr]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-slc-num-bft-prt    to   rf-bfr-num-prt         .
           move      zero                 to   rf-bfr-num-prg         .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : fine lettura           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  exe-cph-lv1-inp-900.
       exe-cph-lv1-inp-200.
      *              *-------------------------------------------------*
      *              * Next su [bfr]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                  *---------------------------------------------*
      *                  * Se at end : fine lettura                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  exe-cph-lv1-inp-900.
       exe-cph-lv1-inp-300.
      *              *-------------------------------------------------*
      *              * Se oltre il massimo : fine lettura              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su protocollo                          *
      *                  *---------------------------------------------*
           if        rf-bfr-num-prt       not  = w-slc-num-bft-prt
                     go to  exe-cph-lv1-inp-900.
       exe-cph-lv1-inp-400.
      *              *-------------------------------------------------*
      *              * Selezioni su [bfr]                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo riga                           *
      *                  *---------------------------------------------*
           if        rf-bfr-tip-rig       not  = "P    "
                     go to  exe-cph-lv1-inp-200.
      *                  *---------------------------------------------*
      *                  * Codice prodotto selezionato                 *
      *                  *---------------------------------------------*
           if        w-exe-alf-pro        =    spaces
                     go to exe-cph-lv1-inp-500.
           if        rf-bfr-num-mag       =    w-exe-num-pro
                     add   1              to   w-exe-ctr-pro          .
       exe-cph-lv1-inp-500.
      *              *-------------------------------------------------*
      *              * Letture complementari                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione ubicazione                   *
      *                  *---------------------------------------------*
           move      "PU"                 to   d-sld-ubi-tip-ope      .
           move      w-exe-dat-exe        to   d-sld-ubi-dat-ela      .
           move      01                   to   d-sld-ubi-cod-dpz      .
           move      01                   to   d-sld-ubi-tip-mag      .
           move      rf-bfr-num-mag       to   d-sld-ubi-num-mag      .
           move      spaces               to   d-sld-ubi-cod-ubi      .
           move      spaces               to   d-sld-ubi-lit-ubi      .
           perform   det-sld-ubi-cll-000  thru det-sld-ubi-cll-999    .
      *                  *---------------------------------------------*
      *                  * Lettura prodotto                            *
      *                  *---------------------------------------------*
           move      rf-bfr-num-mag       to   w-let-arc-dcp-num      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
       exe-cph-lv1-inp-600.
      *              *-------------------------------------------------*
      *              * Composizione record di sort                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record di sort              *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
      *                  *---------------------------------------------*
      *                  * Composizione chiave                         *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Determinazione ubicazione principale    *
      *                      *-----------------------------------------*
           move      "UP"                 to   d-sld-ubi-tip-ope      .
           move      01                   to   d-sld-ubi-cod-dpz      .
           move      01                   to   d-sld-ubi-tip-mag      .
           move      rf-bfr-num-mag       to   d-sld-ubi-num-mag      .
           perform   det-sld-ubi-cll-000  thru det-sld-ubi-cll-999    .
      *                      *-----------------------------------------*
      *                      * Indice percorso ubicazione principale   *
      *                      *-----------------------------------------*
           move      d-sld-ubi-inx-ppr    to   srt-inx-key            .
           move      spaces               to   srt-alf-key            .
      *                      *-----------------------------------------*
      *                      * Progressivo riga                        *
      *                      *-----------------------------------------*
           move      rf-bfr-num-prg       to   srt-rig-key            .
      *                  *---------------------------------------------*
      *                  * Composizione dati                           *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Codice numerico prodotto                *
      *                      *-----------------------------------------*
           move      rf-bfr-num-mag       to   srt-num-pro            .
      *                      *-----------------------------------------*
      *                      * Codice alfanumerico prodotto            *
      *                      *-----------------------------------------*
           move      rf-bfr-alf-mag       to   srt-alf-pro            .
      *                      *-----------------------------------------*
      *                      * Barcode prodotto                        *
      *                      *-----------------------------------------*
           move      w-let-arc-dcp-klb    to   srt-klb-pro            .
      *                      *-----------------------------------------*
      *                      * Codice prodotto selezionato             *
      *                      *-----------------------------------------*
           if        rf-bfr-num-mag       =    w-exe-num-pro
                     move  "S"            to   srt-sel-pro
                     add   1              to   w-exe-sel-pro
           else      move  "N"            to   srt-sel-pro            .
      *                      *-----------------------------------------*
      *                      * Codice prodotto senza barcode           *
      *                      *-----------------------------------------*
           if        w-let-arc-dcp-klb    =    spaces
                     move  "N"            to   srt-snb-pro
           else      move  "S"            to   srt-snb-pro            .
      *                      *-----------------------------------------*
      *                      * Un intero record [bfr]                  *
      *                      *-----------------------------------------*
           move      rf-bfr               to   srt-rec-bfr            .
       exe-cph-lv1-inp-700.
      *              *-------------------------------------------------*
      *              * Rilascio del record al Sort                     *
      *              *-------------------------------------------------*
           release   srt-rec                                          .
       exe-cph-lv1-inp-800.
      *              *-------------------------------------------------*
      *              * Riciclo a record successivo                     *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-inp-200.
       exe-cph-lv1-inp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-inp-999.
       exe-cph-lv1-inp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Sub-subroutine di output                                  *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-out-000.
      *              *-------------------------------------------------*
      *              * Test su numero prodotti selezionati             *
      *              *-------------------------------------------------*
       exe-cph-lv1-out-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Se At End : uscita                          *
      *                  *---------------------------------------------*
           return    srt    at end
                            go to exe-cph-lv1-out-900                 .
       exe-cph-lv1-out-300.
      *              *-------------------------------------------------*
      *              * Normalizzazione record [bfr]                    *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *              *-------------------------------------------------*
      *              * Ripresa record [bfr]                            *
      *              *-------------------------------------------------*
           move      srt-rec-bfr          to   rf-bfr                 .
      *              *-------------------------------------------------*
      *              * Incremento contatore righe                      *
      *              *-------------------------------------------------*
           add       1                    to   w-exe-ctr-rig          .
       exe-cph-lv1-out-400.
      *              *-------------------------------------------------*
      *              * Test preliminare se per la riga in corso di     *
      *              * trattamento esistono dei colli                  *
      *              *-------------------------------------------------*
       exe-cph-lv1-out-700.
      *                  *---------------------------------------------*
      *                  * Se senza colli                              *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura spunte riga                     *
      *                      *-----------------------------------------*
           move      rf-bfr-num-prt       to   w-let-rec-bfs-prt      .
           move      rf-bfr-num-prg       to   w-let-rec-bfs-prg      .
           move      zero                 to   w-let-rec-bfs-prr      .
           perform   let-rec-bfs-000      thru let-rec-bfs-999        .
           move      w-let-rec-bfs-qta    to   w-exe-rig-qtv          .
           move      w-let-rec-bfs-ub1    to   w-exe-rig-ub1          .
           move      w-let-rec-bfs-ub2    to   w-exe-rig-ub2          .
           move      w-let-rec-bfs-ub3    to   w-exe-rig-ub3          .
           move      w-let-rec-bfs-ub4    to   w-exe-rig-ub4          .
      *                      *-----------------------------------------*
      *                      * Preparazione elementi riga              *
      *                      *-----------------------------------------*
           move      rf-bfr-num-prt       to   w-exe-rig-prt          .
           move      rf-bfr-num-prg       to   w-exe-rig-prg          .
           move      zero                 to   w-exe-rig-col          .
           move      spaces               to   w-exe-rig-sco          .
           move      rf-bfr-qta-acq       to   w-exe-rig-qta          .
           move      srt-sel-pro          to   w-exe-rig-sel          .
      *                      *-----------------------------------------*
      *                      * Emissione riga                          *
      *                      *-----------------------------------------*
           perform   exe-cph-lv1-rig-000  thru exe-cph-lv1-rig-999    .
      *                      *-----------------------------------------*
      *                      * A riciclo                               *
      *                      *-----------------------------------------*
           go to     exe-cph-lv1-out-800.
       exe-cph-lv1-out-800.
      *              *-------------------------------------------------*
      *              * Riciclo a riga successiva                       *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-out-200.
       exe-cph-lv1-out-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-out-999.
       exe-cph-lv1-out-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Sub-subroutine di gestione riga prodotto                  *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-rig-000.
      *              *-------------------------------------------------*
      *              * Letture preliminari                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Valori spunta                               *
      *                  *---------------------------------------------*
           perform   exe-cph-lv1-bfs-000  thru exe-cph-lv1-bfs-999    .
      *                  *---------------------------------------------*
      *                  * Lettura prodotto                            *
      *                  *---------------------------------------------*
           move      srt-num-pro          to   w-let-arc-dcp-num      .
           perform   let-arc-dcp-000      thru let-arc-dcp-999        .
      *                  *---------------------------------------------*
      *                  * Determinazione buffer giacenze ubicazione   *
      *                  *---------------------------------------------*
           move      "PU"                 to   d-sld-ubi-tip-ope      .
           move      w-exe-dat-exe        to   d-sld-ubi-dat-ela      .
           move      01                   to   d-sld-ubi-cod-dpz      .
           move      01                   to   d-sld-ubi-tip-mag      .
           move      rf-dcp-num-pro       to   d-sld-ubi-num-mag      .
           move      spaces               to   d-sld-ubi-cod-ubi      .
           move      spaces               to   d-sld-ubi-lit-ubi      .
           perform   det-sld-ubi-cll-000  thru det-sld-ubi-cll-999    .
       exe-cph-lv1-rig-020.
      *              *-------------------------------------------------*
      *              * Intestazione righe                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da effettuare                       *
      *                  *---------------------------------------------*
           if        w-exe-ctr-rig        >    1
                     go to exe-cph-lv1-rig-050.
      *                  *---------------------------------------------*
      *                  * Eventuali errori prodotto                   *
      *                  *---------------------------------------------*
           perform   exe-cph-lv1-eep-000  thru exe-cph-lv1-eep-999    .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           perform   exe-cph-lv1-irg-000  thru exe-cph-lv1-irg-999    .
       exe-cph-lv1-rig-050.
      *              *-------------------------------------------------*
      *              * Apertura riga                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione ID riga                      *
      *                  *---------------------------------------------*
           perform   exe-cph-lv1-rwi-000  thru exe-cph-lv1-rwi-999    .
      *                  *---------------------------------------------*
      *                  * Test se riga appartiene all'eventuale CTN   *
      *                  *---------------------------------------------*
           move      w-exe-num-col        to   w-det-rig-bfr-cts      .
           perform   exe-cph-lv1-ink-000  thru exe-cph-lv1-ink-999    .
           if        w-det-rig-bfr-flg    not  = spaces
                     move  "' style='background-color: lightgreen';"
                                          to   w-all-str-cat (3)
           else      move  "'"            to   w-all-str-cat (3)      .
      *                  *---------------------------------------------*
      *                  * Assemblaggio ID riga ed eventuale colore se *
      *                  * la riga contiene l'eventuale CTN            *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "<tr id='row_"       to   w-all-str-cat (1)      .
           move      w-exe-rwi-idx        to   w-all-str-cat (2)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           display   w-all-str-alf                                    .
      *                  *---------------------------------------------*
      *                  * Eventuale evidenziazione                    *
      *                  *---------------------------------------------*
           if        w-exe-rig-sel         =    "S"
                     display  " class='sel' "                         .
           display   "/>"                                             .
      *              *-------------------------------------------------*
      *              * Apertura Form                                   *
      *              *-------------------------------------------------*
           display   "<form "                                         .
           display   "action='' "                                     .
           display   "method='post'>"                                 .
      *              *-------------------------------------------------*
      *              * Campi 'hidden' per la riga                      *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-hid-000  thru exe-cph-lv1-hid-999    .
       exe-cph-lv1-rig-100.
      *              *-------------------------------------------------*
      *              * Progressivo riga                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-exe-ctr-rig        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      p-edt                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-rig-120.
      *              *-------------------------------------------------*
      *              * Progressivo collo                               *
      *              *-------------------------------------------------*
       exe-cph-lv1-rig-150.
      *              *-------------------------------------------------*
      *              * Codice prodotto                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione                                *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      srt-alf-pro          to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
      *
           if        srt-snb-pro          =    "N"
                     move  "o"            to   h-stl
           else      move  "B"            to   h-stl                  .
      *
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-rig-200.
      *              *-------------------------------------------------*
      *              * Descrizione prodotto                            *
      *              *-------------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      w-let-arc-dcp-des    to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-rig-250.
      *              *-------------------------------------------------*
      *              * Codice prodotto per il Produttore               *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-cop-000  thru exe-cph-lv1-cop-999    .
       exe-cph-lv1-rig-300.
      *              *-------------------------------------------------*
      *              * Contrassegno collo                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione contrassegno collo           *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Contrassegno collo                          *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      w-exe-num-col        to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Quantita' collo                             *
      *                  *---------------------------------------------*
       exe-cph-lv1-rig-400.
      *              *-------------------------------------------------*
      *              * Quantita' in ordine                             *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-qta-000  thru exe-cph-lv1-qta-999    .
      *              *-------------------------------------------------*
      *              * Quantita' verificata                            *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-qtv-000  thru exe-cph-lv1-qtv-999    .
       exe-cph-lv1-rig-450.
      *              *-------------------------------------------------*
      *              * Spunta                                          *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-spn-000  thru exe-cph-lv1-spn-999    .
      *              *-------------------------------------------------*
      *              * Ubicazioni                                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Apertura cella                              *
      *                  *---------------------------------------------*
           display   "<td id='lit_ubi' name ='lit_ubi'><b>"           .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           display   d-sld-ubi-lit-ubi                                .
      *                  *---------------------------------------------*
      *                  * Chiusura 'bold'                             *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "b"                  to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Chiusura cella                              *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-rig-600.
      *              *-------------------------------------------------*
      *              * Giacenza                                        *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-gia-000  thru exe-cph-lv1-gia-999    .
       exe-cph-lv1-rig-700.
      *              *-------------------------------------------------*
      *              * Non conformita'                                 *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-ncf-000  thru exe-cph-lv1-ncf-999    .
       exe-cph-lv1-rig-800.
      *              *-------------------------------------------------*
      *              * Chiusura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-rig-850.
      *              *-------------------------------------------------*
      *              * Riga di espansione per la Non conformita'       *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-rnc-000  thru exe-cph-lv1-rnc-999    .
      *              *-------------------------------------------------*
      *              * Riga di espansione per l'eventuale barcode      *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-rbc-000  thru exe-cph-lv1-rbc-999    .
      *              *-------------------------------------------------*
      *              * Chiusura Form                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "form"               to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-rig-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-rig-999.
       exe-cph-lv1-rig-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '2'                                *
      *    *                                                           *
      *    * Sub-subroutine per intestazione righe prodotto            *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-irg-000.
      *              *-------------------------------------------------*
      *              * Intestazione colonne                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Apertura tabella per le righe               *
      *                  *---------------------------------------------*
           display   "<table class='bordotab' id='rig' name='rig' width=
      -              "100%>"                                          .
      *                  *---------------------------------------------*
      *                  * Apertura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Progressivo riga                *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "NR"                 to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Progressivo collo               *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Literal per Codice                          *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Codice"             to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Descrizione                     *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Descrizione"        to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per codice Produttore               *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "C.Produttore"       to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Collo                           *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "CTN"                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Quantita' ordinata              *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Ordinato"           to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Quantita' verificata            *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Verificato"         to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Spunta                          *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "V"                  to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Ubicazione                      *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Ubicazione"         to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Giacenza                        *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Giacenza"           to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Non conformita'                 *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "NC"                 to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Chiusura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-irg-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-irg-999.
       exe-cph-lv1-irg-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Sub-subroutine di selezione riga in base al contrassegno  *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-ink-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-det-rig-bfr-flg      .
           move      zero                 to   w-det-rig-bfr-qta      .
       exe-cph-lv1-ink-050.
      *              *-------------------------------------------------*
      *              * Test preliminare                                *
      *              *-------------------------------------------------*
           if        w-det-rig-bfr-cts    =    spaces
                     go to exe-cph-lv1-ink-100.
       exe-cph-lv1-ink-100.
      *              *-------------------------------------------------*
      *              * Start su [bfk] per contrassegno                 *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "NUMPRT    "         to   f-key                  .
           move      rf-bfr-num-prt       to   rf-bfk-num-prt         .
           move      rf-bfr-num-prg       to   rf-bfk-num-prg         .
           move      zero                 to   rf-bfk-num-prc         .
           move      "pgm/bfo/fls/ioc/obj/iofbfk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfk                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : fine lettura           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  exe-cph-lv1-ink-900.
       exe-cph-lv1-ink-200.
      *              *-------------------------------------------------*
      *              * Next su [bfk]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfk                 .
      *                  *---------------------------------------------*
      *                  * Se at end : fine lettura                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  exe-cph-lv1-ink-900.
       exe-cph-lv1-ink-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
           if        rf-bfk-num-prt       not  = rf-bfr-num-prt
                     go to  exe-cph-lv1-ink-900.
           if        rf-bfk-num-prg       not  = rf-bfr-num-prg
                     go to  exe-cph-lv1-ink-900.
       exe-cph-lv1-ink-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
           if        rf-bfk-cts-prc       not  = w-det-rig-bfr-cts
                     go to  exe-cph-lv1-ink-200.
       exe-cph-lv1-ink-500.
      *              *-------------------------------------------------*
      *              * Flag di uscita                                  *
      *              *-------------------------------------------------*
           move      "#"                  to   w-det-rig-bfr-flg      .
      *              *-------------------------------------------------*
      *              * Quantita' determinata                           *
      *              *-------------------------------------------------*
           move      rf-bfk-qta-prc       to   w-det-rig-bfr-qta      .
       exe-cph-lv1-ink-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-ink-999.
       exe-cph-lv1-ink-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine di lettura [bfs]                               *
      *    *-----------------------------------------------------------*
        exe-cph-lv1-bfs-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      spaces               to   w-exe-flg-spn          .
        exe-cph-lv1-bfs-100.
      *              *-------------------------------------------------*
      *              * Lettura record [bfs]                            *
      *              *-------------------------------------------------*
           move      w-exe-rig-prt        to   w-let-rec-bfs-prt      .
           move      w-exe-rig-prg        to   w-let-rec-bfs-prg      .
           move      w-exe-rig-col        to   w-let-rec-bfs-prr      .
           perform   let-rec-bfs-000      thru let-rec-bfs-999        .
        exe-cph-lv1-bfs-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori letti                    *
      *              *-------------------------------------------------*
           move      w-let-rec-bfs-qta    to   w-exe-rig-qtv          .
           move      w-let-rec-bfs-ub1    to   w-exe-rig-ub1          .
           move      w-let-rec-bfs-ub2    to   w-exe-rig-ub2          .
           move      w-let-rec-bfs-ub3    to   w-exe-rig-ub3          .
           move      w-let-rec-bfs-ub4    to   w-exe-rig-ub4          .
           move      w-let-rec-bfs-spn    to   w-exe-flg-spn          .
           move      w-let-rec-bfs-ncf    to   w-exe-ann-ncf          .
        exe-cph-lv1-bfs-400.
      *              *-------------------------------------------------*
      *              * Eventuale segnale di operatore diverso          *
      *              *                                                 *
      *              * N.B.: attualmente non gestito                   *
      *              *-------------------------------------------------*
        exe-cph-lv1-bfs-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to      exe-cph-lv1-bfs-999.
        exe-cph-lv1-bfs-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine di visualizzazione quantita'                   *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-qta-000.
      *              *-------------------------------------------------*
      *              * Editing                                         *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<GD"                to   p-edm                  .
           move      w-exe-rig-qta        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Visualizzazione                                 *
      *              *-------------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      p-edt                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
      *
           if        w-exe-rig-qta        <    zero
                     move  "r"            to   h-stl                  .
      *
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-qta-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-qta-999.
       exe-cph-lv1-qta-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine di output                                      *
      *    *                                                           *
      *    * Codice del fornitore                                      *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-cop-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione [aaq]                           *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *              *-------------------------------------------------*
      *              * Lettura codice per il Produttore                *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      rf-bfr-tip-mag       to   rf-aaq-tip-mag         .
           move      rf-bfr-num-mag       to   rf-aaq-num-pro         .
           move      "pgm/dcf/fls/ioc/obj/iofaaq"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-aaq                 .
      *              *-------------------------------------------------*
      *              * In campo di destinazione                        *
      *              *-------------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      rf-aaq-cdp-pdt       to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-cop-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-cop-999.
       exe-cph-lv1-cop-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine di gestione Non conformita'                    *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-ncf-000.
      *              *-------------------------------------------------*
      *              * Bottone                                         *
      *              *-------------------------------------------------*
           display   "<td id='cel_ncf' name='cel_ncf' class='td_nb'>" .
           display   "<button type='button' "                         .
           display   " class='ncf' "                                  .
           display   "/>"                                             .
           display   "<img src='../icons/new.png' width='40'>"        .
           display   "</button>"                                      .
           display   "</td>"                                          .
       exe-cph-lv1-ncf-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-ncf-999.
       exe-cph-lv1-ncf-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine di emissione della riga 2 per la Non conformi- *
      *    * ta'                                                       *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-rnc-000.
      *              *-------------------------------------------------*
      *              * Eventuale parsing campo testo                   *
      *              *-------------------------------------------------*
       exe-cph-lv1-rnc-100.
      *              *-------------------------------------------------*
      *              * Apertura riga                                   *
      *              *-------------------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
      *
           if        w-exe-ann-ncf        =    spaces
                     move  "<tr class='exp_ncf' id='rw2_"
                                          to   w-all-str-cat (1)
           else      move  "<tr id='rw2_" to   w-all-str-cat (1)      .
      *
           move      w-exe-rwi-idx        to   w-all-str-cat (2)      .
           move      "' "                 to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           display   w-all-str-alf                                    .
           display   "/>"                                             .
      *              *-------------------------------------------------*
      *              * Campi 'hidden' per la riga                      *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-hid-000  thru exe-cph-lv1-hid-999    .
      *              *-------------------------------------------------*
      *              * Apertura colonna                                *
      *              *-------------------------------------------------*
           display   "<td colspan='16'>"                              .
      *              *-------------------------------------------------*
      *              * Eventuale disabilitazione                       *
      *              *-------------------------------------------------*
           if        w-exe-flg-spn        =    "S"
                     move  "disabled"     to   w-all-str-cat (1)
           else      move  spaces         to   w-all-str-cat (1)      .
      *              *-------------------------------------------------*
      *              * Accettazione campo testo                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-exe-str-dsp          .
      *
           string    "<input type='text' id='nct' name='nct' "
                                delimited by   size
                     "class='inp_ncf' "
                                delimited by   size
                     "value="""
                                delimited by   size
                     w-exe-ann-ncf
                                delimited by   size
                     """ maxlength='80' "
                                delimited by   size
                     w-all-str-cat (1)
                                delimited by   spaces
                     " >"
                                delimited by   size
                                          into w-exe-str-dsp          .
      *
           display   w-exe-str-dsp                                    .
      *              *-------------------------------------------------*
      *              * Chiusura colonna                                *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-rnc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-rnc-999.
       exe-cph-lv1-rnc-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine di emissione della riga 3 per l'accettazione   *
      *    * di un eventuale barcode                                   *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-rbc-000.
      *              *-------------------------------------------------*
      *              * Eventuale parsing campo testo                   *
      *              *-------------------------------------------------*
       exe-cph-lv1-rbc-100.
      *              *-------------------------------------------------*
      *              * Apertura riga                                   *
      *              *-------------------------------------------------*
           move      40                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
      *
           if        srt-klb-pro          not  = spaces or
                     w-exe-ann-ncf        not  = spaces
                     move  "<tr class='exp_bcd' id='rw3_"
                                          to   w-all-str-cat (1)
           else      move  "<tr id='rw3_" to   w-all-str-cat (1)      .
      *
           move      w-exe-rwi-idx        to   w-all-str-cat (2)      .
           move      "' "                 to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           display   w-all-str-alf                                    .
           display   "/>"                                             .
      *              *-------------------------------------------------*
      *              * Campi 'hidden' per la riga                      *
      *              *-------------------------------------------------*
           perform   exe-cph-lv1-hid-000  thru exe-cph-lv1-hid-999    .
      *              *-------------------------------------------------*
      *              * Apertura colonna                                *
      *              *-------------------------------------------------*
           display   "<td colspan='16'>"                              .
           display   "<b> Barcode : </b>"                             .
      *              *-------------------------------------------------*
      *              * Eventuale disabilitazione                       *
      *              *-------------------------------------------------*
______*    if        w-exe-flg-spn        =    "S"
______*              move  "disabled"     to   w-all-str-cat (1)
______*    else      move  spaces         to   w-all-str-cat (1)      .
      *              *-------------------------------------------------*
      *              * Accettazione campo testo                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-exe-str-dsp          .
      *
           string    "<input type='text' id='klb' name='klb' "
                                delimited by   size
                     "class='acc_klb' "
                                delimited by   size
                     "value='"
                                delimited by   size
                     srt-klb-pro
                                delimited by   size
                     "' maxlength='20' "
                                delimited by   size
                     w-all-str-cat (1)
                                delimited by   spaces
                     " >"
                                delimited by   size
                                          into w-exe-str-dsp          .
      *
           display   w-exe-str-dsp                                    .
      *              *-------------------------------------------------*
      *              * Chiusura colonna                                *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-rbc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-rbc-999.
       exe-cph-lv1-rbc-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine di determinazione ID della riga                *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-rwi-000.
      *              *-------------------------------------------------*
      *              * Editing del progressivo interno riga            *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-exe-ctr-rig        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-exe-rwi-idx          .
       exe-cph-lv1-rwi-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-rwi-999.
       exe-cph-lv1-rwi-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Sub-subroutine per i campi 'hidden' di testata            *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-hit-000.
      *              *-------------------------------------------------*
      *              * 'hidden' - Codice responsabile                  *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "rsp_doc"            to   h-nam                  .
           move      w-exe-cod-rsm        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * 'hidden' - Descrizione responsabile             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura descrizione responsabile            *
      *                  *---------------------------------------------*
           move      w-exe-cnv-rsm        to   w-let-arc-zrm-cod      .
           perform   let-arc-zrm-000      thru let-arc-zrm-999        .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "rsp_des"            to   h-nam                  .
           move      w-let-arc-zrm-des    to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * 'hidden' - Livello operativo                    *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "liv_ope"            to   h-nam                  .
           move      "1"                  to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * 'hidden' - protocollo                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-slc-num-bft-prt    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "prt_bfo"            to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Ubicazione virtuali, literal                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione ubicazioni virtuali          *
      *                  *---------------------------------------------*
           move      "UV"                 to   d-sld-ubi-tip-ope      .
           move      01                   to   d-sld-ubi-cod-dpz      .
           perform   det-sld-ubi-cll-000  thru det-sld-ubi-cll-999    .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "ubi_vrt"            to   h-nam                  .
           move      d-sld-ubi-lit-ubi    to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-hit-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-hit-999.
       exe-cph-lv1-hit-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Sub-subroutine per i campi 'hidden'                       *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-hid-000.
      *              *-------------------------------------------------*
      *              * Livello operativo 'hidden'                      *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "liv_ope"            to   h-nam                  .
           move      w-exe-liv-ope        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Responsabile 'hidden'                           *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "rsm"                to   h-nam                  .
           move      w-exe-cod-rsm        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-hid-050.
      *              *-------------------------------------------------*
      *              * Flag di stampa 'hidden'                         *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "flg_stp"            to   h-nam                  .
           move      w-exe-flg-stp        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-hid-075.
      *              *-------------------------------------------------*
      *              * Protocollo [bfr] 'hidden'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-slc-num-bft-prt    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "prt"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-hid-100.
      *              *-------------------------------------------------*
      *              * Progressivo riga [bfr] 'hidden'                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      rf-bfr-num-prg       to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "prg"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-hid-150.
      *              *-------------------------------------------------*
      *              * Progressivo riga interno 'hidden'               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-exe-ctr-rig        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "pri"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-hid-200.
      *              *-------------------------------------------------*
      *              * Progressivo collo 'hidden'                      *
      *              *-------------------------------------------------*
       exe-cph-lv1-hid-300.
      *              *-------------------------------------------------*
      *              * Si/no riga spuntata 'hidden'                    *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "pcr"                to   h-nam                  .
           move      srt-snx-pcr          to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-hid-400.
      *              *-------------------------------------------------*
      *              * Quantita' 'hidden'                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-exe-rig-qta        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "qta"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-hid-400.
      *              *-------------------------------------------------*
      *              * Quantita' verificata 'hidden'                   *
      *              *-------------------------------------------------*
       exe-cph-lv1-hid-500.
      *              *-------------------------------------------------*
      *              * Barcode prodotto 'hidden'                       *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "bcd"                to   h-nam                  .
           move      w-let-arc-dcp-klb    to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-hid-600.
      *              *-------------------------------------------------*
      *              * Codice alfanumerico prodotto 'hidden'           *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "alf"                to   h-nam                  .
           move      rf-bfr-alf-mag       to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-hid-700.
      *              *-------------------------------------------------*
      *              * Codice numerico prodotto 'hidden'               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      srt-num-pro          to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "pro"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-hid-700.
      *              *-------------------------------------------------*
      *              * Contatore ricorrenze prodotto 'hidden'          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-exe-sel-pro        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "spr"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-hid-750.
      *              *-------------------------------------------------*
      *              * Si/no prodotto con barcode                      *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "snb"                to   h-nam                  .
           move      srt-snb-pro          to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-hid-770.
      *              *-------------------------------------------------*
      *              * Ubicazione principale                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Determinazione ubicazione principale        *
      *                  *---------------------------------------------*
           move      "UP"                 to   d-sld-ubi-tip-ope      .
           move      01                   to   d-sld-ubi-cod-dpz      .
           move      01                   to   d-sld-ubi-tip-mag      .
           move      srt-num-pro          to   d-sld-ubi-num-mag      .
           perform   det-sld-ubi-cll-000  thru det-sld-ubi-cll-999    .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "ubp"                to   h-nam                  .
           move      d-sld-ubi-cod-ubi    to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-hid-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-hid-999.
       exe-cph-lv1-hid-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Sub-subroutine di accettazione quantita' verificata       *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-qtv-000.
      *              *-------------------------------------------------*
      *              * Apertura cella in funzione della quantita'      *
      *              *-------------------------------------------------*
           move      "<td id='cel_qtv' name ='cel_qtv'>"
                                          to   w-all-str-cat (1)      .
           move      "<td id='cel_qtv' name ='cel_qtv' class='sel'>"
                                          to   w-all-str-cat (2)      .
      *
           if        w-exe-rig-qtv        =    w-exe-rig-qta
                     move  w-all-str-cat (1)
                                          to   w-all-str-alf
           else if   w-exe-rig-qtv        >    w-exe-rig-qta
                     move  w-all-str-cat (2)
                                          to   w-all-str-alf
           else      move  w-all-str-cat (1)
                                          to   w-all-str-alf          .
           display   w-all-str-alf                                    .
      *              *-------------------------------------------------*
      *              * Editing                                         *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<D"                 to   p-edm                  .
           move      w-exe-rig-qtv        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           display   "<input type='number' "                          .
           display   "id='qtv' name ='qtv' "                          .
           display   "class='numbersOnly' "                           .
      *
           move      "style='text-align:right;font-weight:bold;' "
                                          to   w-all-str-cat (1)      .
           move      "style='text-align:right;font-weight:bold;;color : 
      -              "red;' "             to   w-all-str-cat (2)      .
      *
           if        w-exe-rig-qtv        =    w-exe-rig-qta
                     move  w-all-str-cat (1)
                                          to   w-all-str-alf
           else      move  w-all-str-cat (2)
                                          to   w-all-str-alf          .
           display   w-all-str-alf                                    .
      *
           move      spaces               to   w-exe-str-dsp          .
      *
           string    "value='"  delimited by   size
                     p-edt      delimited by   spaces
                     "' "       delimited by   size
                     "min='0' max='999999' "
                                delimited by   size
                                          into w-exe-str-dsp          .
      *
           display   w-exe-str-dsp                                    .
      *              *-------------------------------------------------*
      *              * Eventuale disabilitazione                       *
      *              *-------------------------------------------------*
           if        w-exe-flg-spn        not  = "S"
                     go to exe-cph-lv1-qtv-600.
           display   "disabled "                                      .
       exe-cph-lv1-qtv-600.
      *              *-------------------------------------------------*
      *              * Chiusura input                                  *
      *              *-------------------------------------------------*
           display   "/>"                                             .
      *              *-------------------------------------------------*
      *              * Chiusura cella                                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-qtv-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-qtv-999.
       exe-cph-lv1-qtv-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Sub-subroutine di accettazione spunta                     *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-spn-000.
      *              *-------------------------------------------------*
      *              * Editing del progressivo interno riga            *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-exe-ctr-rig        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (1)      .
      *              *-------------------------------------------------*
      *              * Editing progressivo collo                       *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-exe-rig-col        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-all-str-cat (3)      .
      *              *-------------------------------------------------*
      *              * Assemblaggio                                    *
      *              *-------------------------------------------------*
           move      30                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "_"                  to   w-all-str-cat (2)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           move      w-all-str-alf        to   w-exe-ttd-cki          .
       exe-cph-lv1-spn-200.
      *              *-------------------------------------------------*
      *              * Spunta                                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Apertura cella                              *
      *                  *---------------------------------------------*
           display   "<td id='cel_spn' name='cel_spn' align='center' cla
      -              "ss='td_nb'>"                                    .
      *                  *---------------------------------------------*
      *                  * Test se attiva o no                         *
      *                  *---------------------------------------------*
           if        w-exe-flg-spn        =    "S"
                     move  "checked"      to   w-exe-str-chd
           else      move  spaces         to   w-exe-str-chd          .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      spaces               to   w-exe-str-dsp          .
      *
           string    "<input type='checkbox' id='"
                                delimited by   size
                     w-exe-ttd-cki
                                delimited by   spaces
                     "' "       delimited by   size
                     w-exe-str-chd
                                delimited by   spaces
                     ">"        delimited by   size
                                          into w-exe-str-dsp          .
      *
           display   w-exe-str-dsp                                    .
      *                  *---------------------------------------------*
      *                  * Chiusura cella                              *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-spn-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-spn-999.
       exe-cph-lv1-spn-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Subroutine di visualizzazione giacenza                    *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-gia-000.
      *              *-------------------------------------------------*
      *              * Preparazione link-area                          *
      *              *-------------------------------------------------*
           move      "SL"                 to   d-sld-mag-tip-ope      .
           move      0000                 to   d-sld-mag-tip-sld      .
           move      w-exe-dat-exe        to   d-sld-mag-dat-sld      .
           move      "U"                  to   d-sld-mag-uot-dpz      .
           move      01                   to   d-sld-mag-cod-dpz      .
           move      01                   to   d-sld-mag-tip-mag      .
           move      rf-bfr-num-mag       to   d-sld-mag-num-mag      .
           move      "T"                  to   d-sld-mag-uot-var      .
           move      spaces               to   d-sld-mag-var-mag      .
           move      "T"                  to   d-sld-mag-uot-dsl      .
           move      spaces               to   d-sld-mag-cod-dsl      .
      *              *-------------------------------------------------*
      *              * Richiamo del sottoprogramma                     *
      *              *-------------------------------------------------*
           perform   det-sld-mag-cll-000  thru det-sld-mag-cll-999    .
      *              *-------------------------------------------------*
      *              * Editing                                         *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<GD"                to   p-edm                  .
           move      d-sld-mag-sld-mag    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Emissione                                       *
      *              *-------------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      p-edt                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
      *
           if        d-sld-mag-sld-mag    <    zero
                     move  "r"            to   h-stl                  .
      *
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv1-gia-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-gia-999.
       exe-cph-lv1-gia-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Sub-subroutine di gestione eventuali errori prodotto      *
      *    *-----------------------------------------------------------*
       exe-cph-lv1-eep-000.
      *              *-------------------------------------------------*
      *              * Test se prodotto esistente                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        w-exe-alf-pro        =    spaces
                     go to exe-cph-lv1-eep-900.
           if        w-exe-num-pro        not  = zero
                     go to exe-cph-lv1-eep-200.
      *                  *---------------------------------------------*
      *                  * Literal                                     *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "CODICE PRODOTTO '"  to   w-all-str-cat (1)      .
           move      w-exe-alf-pro        to   w-all-str-cat (2)      .
           move      "' NON ESISTENTE!"   to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *
           move      w-all-str-alf        to   w-exe-err-msg          .
           move      "msg_red"            to   w-exe-cla-msg          .
           perform   err-msg-htm-000      thru err-msg-htm-999        .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     exe-cph-lv1-eep-900.
       exe-cph-lv1-eep-200.
      *              *-------------------------------------------------*
      *              * Test se prodotto non trovato nella lista        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test                                        *
      *                  *---------------------------------------------*
           if        w-exe-ctr-pro        >    zero
                     go to exe-cph-lv1-eep-900.
      *                  *---------------------------------------------*
      *                  * Fincatura superiore                         *
      *                  *---------------------------------------------*
           move      all "*"              to   w-exe-err-msg          .
           move      "msg_big"            to   w-exe-cla-msg          .
           perform   err-msg-htm-000      thru err-msg-htm-999        .
      *                  *---------------------------------------------*
      *                  * Literal                                     *
      *                  *---------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "CODICE PRODOTTO '"  to   w-all-str-cat (1)      .
           move      w-exe-alf-pro        to   w-all-str-cat (2)      .
           move      "' NON TROVATO IN QUESTO DOCUMENTO!"
                                          to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *
           move      w-all-str-alf        to   w-exe-err-msg          .
           move      "msg_big"            to   w-exe-cla-msg          .
           perform   err-msg-htm-000      thru err-msg-htm-999        .
      *                  *---------------------------------------------*
      *                  * Fincatura inferiore                         *
      *                  *---------------------------------------------*
           move      all "*"              to   w-exe-err-msg          .
           move      "msg_big"            to   w-exe-cla-msg          .
           perform   err-msg-htm-000      thru err-msg-htm-999        .
      *                  *---------------------------------------------*
      *                  * Ad uscita                                   *
      *                  *---------------------------------------------*
           go to     exe-cph-lv1-eep-900.
       exe-cph-lv1-eep-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv1-eep-999.
       exe-cph-lv1-eep-999.
           exit.

      *    *===========================================================*
      *    * Livello 2                                                 *
      *    *===========================================================*

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '2'                                *
      *    *-----------------------------------------------------------*
       exe-cph-lv2-000.
      *              *-------------------------------------------------*
      *              * Ricerca del codice numerico prodotto            *
      *              *-------------------------------------------------*
           if        w-exe-alf-pro        =    spaces
                     go to exe-cph-lv2-100.
           move      w-exe-alf-pro        to   w-det-num-pro-alf      .
           perform   det-num-pro-000      thru det-num-pro-999        .
           move      w-det-num-pro-num    to   w-exe-num-pro          .
           move      w-det-num-pro-alf    to   w-exe-alf-pro          .
           move      w-det-num-pro-des    to   w-exe-des-pro          .
       exe-cph-lv2-100.
      *              *-------------------------------------------------*
      *              * Calcolo della quantita' prodotto globale        *
      *              *-------------------------------------------------*
           perform   exe-cph-lv2-qpg-000  thru exe-cph-lv2-qpg-999    .
      *              *-------------------------------------------------*
      *              * Test preliminare se le righe soddisfano la      *
      *              * quantita' totale prodotto                       *
      *              *-------------------------------------------------*
           perform   exe-cph-lv2-qpu-000  thru exe-cph-lv2-qpu-999    .
           if        w-exe-qta-tot        =    zero
                     go to exe-cph-lv2-800.
           if        w-exe-qta-ppu        =    zero
                     go to exe-cph-lv2-800.
      *              *-------------------------------------------------*
      *              * Update spunte                                   *
      *              *-------------------------------------------------*
           perform   exe-cph-lv2-upd-000  thru exe-cph-lv2-upd-999    .
       exe-cph-lv2-800.
      *              *-------------------------------------------------*
      *              * Visualizzazione righe quantita' per ubicazione  *
      *              *-------------------------------------------------*
           perform   exe-cph-lv2-vis-000  thru exe-cph-lv2-vis-999    .
       exe-cph-lv2-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-999.
       exe-cph-lv2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '2'                                *
      *    *                                                           *
      *    * Sub-subroutine di calcolo quantita' prodotto globale      *
      *    *-----------------------------------------------------------*
       exe-cph-lv2-qpg-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-exe-qta-tot          .
           move      zero                 to   w-exe-qta-spn          .
       exe-cph-lv2-qpg-010.
      *              *-------------------------------------------------*
      *              * Normalizzazioni tabella quantita' prodotto per  *
      *              * riga                                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizializzazione contatori                  *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-qta-pro-inx      .
           move      zero                 to   w-det-qta-pro-ctr      .
       exe-cph-lv2-qpg-020.
      *                  *---------------------------------------------*
      *                  * Incremento contatore                        *
      *                  *---------------------------------------------*
           add       1                    to   w-det-qta-pro-ctr      .
      *                  *---------------------------------------------*
      *                  * Test su contatore                           *
      *                  *---------------------------------------------*
           if        w-det-qta-pro-ctr    >    w-det-qta-pro-max
                     go to exe-cph-lv2-qpg-100.
      *                  *---------------------------------------------*
      *                  * Normalizzazione elemento                    *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-qta-pro-prg
                                              (w-det-qta-pro-ctr)     .
           move      zero                 to   w-det-qta-pro-qta
                                              (w-det-qta-pro-ctr)     .
      *                  *---------------------------------------------*
      *                  * A incremento contatore                      *
      *                  *---------------------------------------------*
           go to     exe-cph-lv2-qpg-020.
       exe-cph-lv2-qpg-100.
      *              *-------------------------------------------------*
      *              * Start su archivio [bfr]                         *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-slc-num-bft-prt    to   rf-bfr-num-prt         .
           move      zero                 to   rf-bfr-num-prg         .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : ad uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-cph-lv2-qpg-900.
       exe-cph-lv2-qpg-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio [bfr]              *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                  *---------------------------------------------*
      *                  * Se fine file : ad uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-cph-lv2-qpg-900.
       exe-cph-lv2-qpg-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su protocollo                          *
      *                  *---------------------------------------------*
           if        rf-bfr-num-prt       not  = w-slc-num-bft-prt
                     go to exe-cph-lv2-qpg-900.
       exe-cph-lv2-qpg-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su codice prodotto                     *
      *                  *---------------------------------------------*
           if        rf-bfr-num-mag       not  = w-exe-num-pro
                     go to exe-cph-lv2-qpg-200.
       exe-cph-lv2-qpg-500.
      *              *-------------------------------------------------*
      *              * Letture complementari                           *
      *              *-------------------------------------------------*
       exe-cph-lv2-qpg-600.
      *              *-------------------------------------------------*
      *              * Cumulo totale quantita'                         *
      *              *-------------------------------------------------*
           add       rf-bfr-qta-acq       to   w-exe-qta-tot          .
______*    add       rf-osr-qta-a03       to   w-exe-qta-spn          .
      *              *-------------------------------------------------*
      *              * Bufferizzazione elemento in tabella             *
      *              *-------------------------------------------------*
           add       1                    to   w-det-qta-pro-inx      .
           if        w-det-qta-pro-inx    >    w-det-qta-pro-max
                     move  w-det-qta-pro-max
                                          to   w-det-qta-pro-inx      .
           move      rf-bfr-num-prg       to   w-det-qta-pro-prg
                                              (w-det-qta-pro-inx)     .
           move      rf-bfr-qta-acq       to   w-det-qta-pro-qta
                                              (w-det-qta-pro-inx)     .
       exe-cph-lv2-qpg-800.
      *              *-------------------------------------------------*
      *              * Riciclo a record successivo                     *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-qpg-200.
       exe-cph-lv2-qpg-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-qpg-999.
       exe-cph-lv2-qpg-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '3'                                *
      *    *                                                           *
      *    * Sub-subroutine di input scansione distinta verificare le  *
      *    * quantita' di prodotto assegnate a ciascuna ubicazione     *
      *    *-----------------------------------------------------------*
       exe-cph-lv2-qpu-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-exe-qta-ppu          .
      *              *-------------------------------------------------*
      *              * Normalizzazione tabella quantita' per ubicazio- *
      *              * ne                                              *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-qta-ubi-inx      .
           move      zero                 to   w-det-qta-ubi-ctr      .
       exe-cph-lv2-qpu-020.
           add       1                    to   w-det-qta-ubi-ctr      .
           if        w-det-qta-ubi-ctr    >    w-det-qta-ubi-max
                     go to exe-cph-lv2-qpu-100.
           move      zero                 to   w-det-qta-ubi-qta
                                              (w-det-qta-ubi-ctr)     .
           move      spaces               to   w-det-qta-ubi-ubi
                                              (w-det-qta-ubi-ctr)     .
           go to     exe-cph-lv2-qpu-020.
       exe-cph-lv2-qpu-100.
      *              *-------------------------------------------------*
      *              * Start su archivio [bfu]                         *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "PRTPRO    "         to   f-key                  .
           move      w-slc-num-bft-prt    to   rf-bfu-num-prt         .
           move      w-exe-num-pro        to   rf-bfu-num-pro         .
           move      spaces               to   rf-bfu-cod-ubi         .
           move      "pgm/bfo/fls/ioc/obj/iofbfu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfu                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : ad uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-cph-lv2-qpu-900.
       exe-cph-lv2-qpu-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio [bfu]              *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfu                 .
      *                  *---------------------------------------------*
      *                  * Se fine file : ad uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-cph-lv2-qpu-900.
       exe-cph-lv2-qpu-300.
      *              *-------------------------------------------------*
      *              * Test sul massimo                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su protocollo distinta                 *
      *                  *---------------------------------------------*
           if        rf-bfu-num-prt       not  = w-slc-num-bft-prt
                     go to exe-cph-lv2-qpu-900.
       exe-cph-lv2-qpu-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su codice prodotto                     *
      *                  *---------------------------------------------*
           if        rf-bfu-num-pro       not  = w-exe-num-pro
                     go to exe-cph-lv2-qpu-200.
       exe-cph-lv2-qpu-500.
      *              *-------------------------------------------------*
      *              * Letture complementari                           *
      *              *-------------------------------------------------*
       exe-cph-lv2-qpu-600.
      *              *-------------------------------------------------*
      *              * Tabella quantita' per ubicazione                *
      *              *-------------------------------------------------*
           add       1                    to   w-det-qta-ubi-inx      .
           move      rf-bfu-qta-ubi       to   w-det-qta-ubi-qta
                                              (w-det-qta-ubi-inx)     .
           move      rf-bfu-cod-ubi       to   w-det-qta-ubi-ubi
                                              (w-det-qta-ubi-inx)     .
      *              *-------------------------------------------------*
      *              * Cumulo totale quantita'                         *
      *              *-------------------------------------------------*
           add       rf-bfu-qta-ubi       to   w-exe-qta-ppu          .
       exe-cph-lv2-qpu-800.
      *              *-------------------------------------------------*
      *              * Riciclo a record successivo                     *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-qpu-200.
       exe-cph-lv2-qpu-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-qpu-999.
       exe-cph-lv2-qpu-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '2'                                *
      *    *                                                           *
      *    * Sub-subroutine per update spunte e quantita' delle singo- *
      *    * le righe                                                  *
      *    *-----------------------------------------------------------*
       exe-cph-lv2-upd-000.
      *              *-------------------------------------------------*
      *              * Ciclo di scansione della tabella di quantita'   *
      *              * in riga per ciascun prodotto                    *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-qta-pro-ctr      .
           move      w-exe-qta-ppu        to   w-det-qta-pro-qas      .
           move      zero                 to   w-det-qta-pro-qaz      .
       exe-cph-lv2-upd-200.
      *              *-------------------------------------------------*
      *              * Incremento contatore                            *
      *              *-------------------------------------------------*
           add       1                    to   w-det-qta-pro-ctr      .
      *              *-------------------------------------------------*
      *              * Test su contatore                               *
      *              *-------------------------------------------------*
           if        w-det-qta-pro-ctr    >    w-det-qta-pro-inx
                     go to exe-cph-lv2-upd-900.
           if        w-det-qta-pro-ctr    >    w-det-qta-pro-max
                     go to exe-cph-lv2-upd-900.
      *              *-------------------------------------------------*
      *              * Se la quantita' assegnata e' a zero: ad uscita  *
      *              *-------------------------------------------------*
           if        w-det-qta-pro-qas    =    zero
                     go to exe-cph-lv2-upd-900.
       exe-cph-lv2-upd-300.
      *              *-------------------------------------------------*
      *              * Ottenimento record [bfs]                        *
      *              *-------------------------------------------------*
           move      "GK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-slc-num-bft-prt    to   rf-bfs-num-prt         .
           move      w-det-qta-pro-prg
                    (w-det-qta-pro-ctr)   to   rf-bfs-num-prg         .
           move      zero                 to   rf-bfs-num-prr         .
           move      "pgm/bfo/fls/ioc/obj/iofbfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfs                 .
      *                  *---------------------------------------------*
      *                  * Se record non trovato: a scrittura          *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to exe-cph-lv2-upd-700.
       exe-cph-lv2-upd-400.
      *              *-------------------------------------------------*
      *              * Aggiornamento                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Quantita' elemento in comodo                *
      *                  *---------------------------------------------*
           move      w-det-qta-pro-qta
                    (w-det-qta-pro-ctr)   to   w-det-qta-pro-qaz      .
      *                  *---------------------------------------------*
      *                  * Se la riga e' gia' spuntata: release        *
      *                  *---------------------------------------------*
           if        rf-bfs-flg-spn       not  = "S"
                     go to exe-cph-lv2-upd-420.
      *                  *---------------------------------------------*
      *                  * Aggiornamento quantita' assegnata           *
      *                  *---------------------------------------------*
            subtract w-det-qta-pro-qaz    from w-det-qta-pro-qas      .
      *                  *---------------------------------------------*
      *                  * Rilascio record [bfs]                       *
      *                  *---------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfs                 .
      *                  *---------------------------------------------*
      *                  * A riga successiva                           *
      *                  *---------------------------------------------*
           go to     exe-cph-lv2-upd-200.
       exe-cph-lv2-upd-420.
      *                  *---------------------------------------------*
      *                  * Data di sistema                             *
      *                  *---------------------------------------------*
           move      w-exe-dat-exe        to   rf-bfs-ide-dat         .
      *                  *---------------------------------------------*
      *                  * Deviazione in funzione della quantita'      *
      *                  * assegnata                                   *
      *                  *---------------------------------------------*
           if        w-det-qta-pro-qas    >    w-det-qta-pro-qaz
                     go to exe-cph-lv2-upd-440
           else if   w-det-qta-pro-qas    =    w-det-qta-pro-qaz
                     go to exe-cph-lv2-upd-440
           else      go to exe-cph-lv2-upd-460.
       exe-cph-lv2-upd-440.
      *              *-------------------------------------------------*
      *              * Se quantita' assegnata maggiore di quella in    *
      *              * riga o uguale                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Responsabile                                *
      *                  *---------------------------------------------*
           move      w-exe-cnv-rsm        to   rf-bfs-cod-rsm         .
      *                  *---------------------------------------------*
      *                  * Spunta totale della riga                    *
      *                  *---------------------------------------------*
            move     w-det-qta-pro-qaz    to   rf-bfs-qta-ril         .
            move     "S"                  to   rf-bfs-flg-spn         .
      *                  *---------------------------------------------*
      *                  * Aggiornamento quantita' assegnata           *
      *                  *---------------------------------------------*
            subtract w-det-qta-pro-qaz    from w-det-qta-pro-qas      .
      *                  *---------------------------------------------*
      *                  * A update                                    *
      *                  *---------------------------------------------*
            go to    exe-cph-lv2-upd-500.
       exe-cph-lv2-upd-460.
      *              *-------------------------------------------------*
      *              * Se quantita' assegnata minore di quella in riga *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Responsabile                                *
      *                  *---------------------------------------------*
           move      w-exe-cnv-rsm        to   rf-bfs-cod-rsm         .
      *                  *---------------------------------------------*
      *                  * Spunta parziale della riga                  *
      *                  *---------------------------------------------*
            move     w-det-qta-pro-qas    to   rf-bfs-qta-ril         .
            move     spaces               to   rf-bfs-flg-spn         .
      *                  *---------------------------------------------*
      *                  * Aggiornamento quantita' assegnata           *
      *                  *---------------------------------------------*
            move     zero                 to   w-det-qta-pro-qas      .
      *                  *---------------------------------------------*
      *                  * A update                                    *
      *                  *---------------------------------------------*
            go to    exe-cph-lv2-upd-500.
       exe-cph-lv2-upd-500.
      *              *-------------------------------------------------*
      *              * Aggiornamento record [bfs]                      *
      *              *-------------------------------------------------*
           perform   upd-rec-bfs-000      thru upd-rec-bfs-999        .
       exe-cph-lv2-upd-600.
      *              *-------------------------------------------------*
      *              * A riciclo su elemento tabella successivo        *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-upd-200.
       exe-cph-lv2-upd-700.
      *              *-------------------------------------------------*
      *              * Se record [bfs] non trovato                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Scrittura record [bfs] normalizzato         *
      *                  *---------------------------------------------*
           perform   nor-rec-bfs-000      thru nor-rec-bfs-999        .
      *                  *---------------------------------------------*
      *                  * Ritorno a scrittura                         *
      *                  *---------------------------------------------*
           go to     exe-cph-lv2-upd-300.
       exe-cph-lv2-upd-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-upd-999.
       exe-cph-lv2-upd-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '2'                                *
      *    *                                                           *
      *    * Sub-subroutine per visualizzazione                        *
      *    *-----------------------------------------------------------*
       exe-cph-lv2-vis-000.
      *              *-------------------------------------------------*
      *              * Emissione 'header'                              *
      *              *-------------------------------------------------*
           perform   exe-cph-hea-000      thru exe-cph-hea-999        .
       exe-cph-lv2-vis-200.
      *              *-------------------------------------------------*
      *              * Modulo                                          *
      *              *-------------------------------------------------*
           display   "<form name='bfo_002' id='bfo_002' method='post' ac
      -              "tion=''>"                                       .
       exe-cph-lv2-vis-300.
      *              *-------------------------------------------------*
      *              * Allineamento                                    *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "center"             to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Area di input chiave                            *
      *              *-------------------------------------------------*
           display   "<table class='tes' id='key_lv2' name='key_lv2'>".
      *              *-------------------------------------------------*
      *              * Apertura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-vis-400.
      *              *-------------------------------------------------*
      *              * Codice ubicazione                               *
      *              *-------------------------------------------------*
           perform   exe-cph-lv2-ubi-000  thru exe-cph-lv2-ubi-999    .
       exe-cph-lv2-vis-520.
      *              *-------------------------------------------------*
      *              * Bottone di conferma fine immissione             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Apertura cella                              *
      *                  *---------------------------------------------*
           display   "<td id='cel_fip' name='cel_fip'>"               .
      *                  *---------------------------------------------*
      *                  * Apertura bottone                            *
      *                  *---------------------------------------------*
           display   "<button type='button' "                         .
           display   "id='but_fip' name='but_fip' "                   .
           display   "/>"                                             .
           display   "<img src='../icons/stop.png' width='40'>"       .
           display   "</button>"                                      .
      *                  *---------------------------------------------*
      *                  * Chiusura cella                              *
      *                  *---------------------------------------------*
           display   "</td>"                                          .
       exe-cph-lv2-vis-550.
      *              *-------------------------------------------------*
      *              * Bottone di refresh                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Apertura cella                              *
      *                  *---------------------------------------------*
           display   "<td id='cel_ref' name='cel_ref'>"               .
      *                  *---------------------------------------------*
      *                  * Apertura bottone                            *
      *                  *---------------------------------------------*
           display   "<button type='button' "                         .
           display   "id='but_ref' name='but_ref' "                   .
           display   "/>"                                             .
           display   "<img src='../icons/refresh.png' width='40'>"    .
           display   "</button>"                                      .
      *                  *---------------------------------------------*
      *                  * Chiusura cella                              *
      *                  *---------------------------------------------*
           display   "</td>"                                          .
       exe-cph-lv2-vis-600.
      *              *-------------------------------------------------*
      *              * Chiusura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura tabella                                *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "table"              to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Box di dialogo per lista ordini                 *
      *              *-------------------------------------------------*
           display   "<div id='dialog' name='dialog' title=''>"       .                                 .
           display   "</div>"                                         .
      *              *-------------------------------------------------*
      *              * Box di dialogo per conferma spunta generale     *
      *              *-------------------------------------------------*
           display   "<div id='dialog-confirm' name='dialog-confirm' tit
      -              "le=''>"                                         .                                 .
           display   "</div>"                                         .
      *              *-------------------------------------------------*
      *              * Box di dialogo per spunta ubicazioni            *
      *              *-------------------------------------------------*
           display   "<div id='dialog-ubi' name='dialog' title=''>"   .                                 .
           display   "</div>"                                         .
      *              *-------------------------------------------------*
      *              * Chiusura allineamento centrato                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "center"             to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Responsabile 'hidden'                           *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "rsp_doc"            to   h-nam                  .
           move      w-exe-cod-rsm        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Livello operativo 'hidden'                      *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "liv_ope"            to   h-nam                  .
           move      "2"                  to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Protocollo [bfr] 'hidden'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-slc-num-bft-prt    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "num_doc"            to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Progressivo [bfr] 'hidden'                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-slc-num-bft-prg    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "prg_bfo"            to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * 'hidden' - Prodotto                             *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "alf_pro"            to   h-nam                  .
           move      w-exe-alf-pro        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * 'hidden' - Prodotto numerico                    *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "num_pro"            to   h-nam                  .
           move      w-exe-num-pro        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura 'form'                                 *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "form"               to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-vis-700.
      *              *-------------------------------------------------*
      *              * Caricamento dati                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo su tabella quantita' assegnate        *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-qta-ubi-ctr      .
       exe-cph-lv2-vis-720.
           add       1                    to   w-det-qta-ubi-ctr      .
      *                  *---------------------------------------------*
      *                  * Test su contatori                           *
      *                  *---------------------------------------------*
           if        w-det-qta-ubi-ctr    >    w-det-qta-ubi-inx
                     go to exe-cph-lv2-vis-750.
           if        w-det-qta-ubi-ctr    >    w-det-qta-ubi-max
                     go to exe-cph-lv2-vis-750.
      *                  *---------------------------------------------*
      *                  * Dati da visualizzare                        *
      *                  *---------------------------------------------*
           move      w-slc-num-bft-prg    to   w-det-vis-pro-rig      .
           move      w-exe-num-pro        to   w-det-vis-pro-num      .
           move      w-exe-alf-pro        to   w-det-vis-pro-alf      .
           move      w-exe-des-pro        to   w-det-vis-pro-des      .
           move      zero                 to   w-det-vis-pro-qds      .
           move      w-det-qta-ubi-qta
                    (w-det-qta-ubi-ctr)   to   w-det-vis-pro-qau      .
           move      w-det-qta-ubi-ubi
                    (w-det-qta-ubi-ctr)   to   w-det-vis-pro-ubi      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione riga prodotto               *
      *                  *---------------------------------------------*
           perform   exe-cph-lv2-rig-000  thru exe-cph-lv2-rig-999    .
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     exe-cph-lv2-vis-720.
       exe-cph-lv2-vis-750.
      *              *-------------------------------------------------*
      *              * Emissione eventuale riga 'vuota'                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test sui totali                             *
      *                  *---------------------------------------------*
           if        w-exe-qta-tot        >    zero and
                     w-exe-qta-tot        =    w-exe-qta-ppu
                     go to exe-cph-lv2-vis-800.
      *                  *---------------------------------------------*
      *                  * Dati da visualizzare                        *
      *                  *---------------------------------------------*
           move      w-slc-num-bft-prg    to   w-det-vis-pro-rig      .
           move      w-exe-num-pro        to   w-det-vis-pro-num      .
           move      w-exe-alf-pro        to   w-det-vis-pro-alf      .
           move      w-exe-des-pro        to   w-det-vis-pro-des      .
      *
           move      w-exe-qta-tot        to   w-det-vis-pro-qds      .
           subtract  w-exe-qta-ppu        from w-det-vis-pro-qds      .
      *
           move      zero                 to   w-det-vis-pro-qau      .
      *
           move      w-exe-cod-ubi        to   w-det-vis-pro-ubi      .
      *                  *---------------------------------------------*
      *                  * Visualizzazione riga prodotto               *
      *                  *---------------------------------------------*
           perform   exe-cph-lv2-rig-000  thru exe-cph-lv2-rig-999    .
       exe-cph-lv2-vis-800.
      *              *-------------------------------------------------*
      *              * Totali per righe                                *
      *              *-------------------------------------------------*
           perform   exe-cph-lv2-tru-000  thru exe-cph-lv2-tru-999    .
      *              *-------------------------------------------------*
      *              * Tabella giacenze per ubicazione                 *
      *              *-------------------------------------------------*
           perform   exe-cph-lv2-tgu-000  thru exe-cph-lv2-tgu-999    .
       exe-cph-lv2-vis-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-vis-999.
       exe-cph-lv2-vis-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '3'                                *
      *    *                                                           *
      *    * Sub-subroutine per tabella giacenze per ubicazione        *
      *    *-----------------------------------------------------------*
       exe-cph-lv2-tgu-000.
      *              *-------------------------------------------------*
      *              * Determinazione buffer giacenze per ubicazione   *
      *              *-------------------------------------------------*
           move      "PU"                 to   d-sld-ubi-tip-ope      .
           move      w-exe-dat-exe        to   d-sld-ubi-dat-ela      .
           move      01                   to   d-sld-ubi-cod-dpz      .
           move      01                   to   d-sld-ubi-tip-mag      .
           move      w-det-vis-pro-num    to   d-sld-ubi-num-mag      .
           move      spaces               to   d-sld-ubi-cod-ubi      .
           move      spaces               to   d-sld-ubi-lit-ubi      .
           perform   det-sld-ubi-cll-000  thru det-sld-ubi-cll-999    .
      *              *-------------------------------------------------*
      *              * Determinazione ubicazione principale            *
      *              *-------------------------------------------------*
           move      "UP"                 to   d-sld-ubi-tip-ope      .
           move      01                   to   d-sld-ubi-cod-dpz      .
           move      01                   to   d-sld-ubi-tip-mag      .
           move      w-det-vis-pro-num    to   d-sld-ubi-num-mag      .
           perform   det-sld-ubi-cll-000  thru det-sld-ubi-cll-999    .
      *              *-------------------------------------------------*
      *              * Ubicazione principale                           *
      *              *-------------------------------------------------*
           move      d-sld-ubi-cod-ubi    to   w-exe-pri-ubi          .
       exe-cph-lv2-tgu-100.
      *              *-------------------------------------------------*
      *              * Apertura tabella per le righe                   *
      *              *-------------------------------------------------*
           display   "<table class='bordotab' id='ubi' name='ubi' width=
      -              "25% align='right'>"                             .
      *              *-------------------------------------------------*
      *              * Apertura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Titolo                                          *
      *              *-------------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Giacenze per ubicazione"
                                          to   h-alf                  .
           move      "2"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-tgu-150.
      *              *-------------------------------------------------*
      *              * Ciclo di stampa in base al numero di elementi   *
      *              * determinati                                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Inizio ciclo                                *
      *                  *---------------------------------------------*
           move      zero                 to   w-det-gia-ubi-ctr      .
       exe-cph-lv2-tgu-200.
           add       1                    to   w-det-gia-ubi-ctr      .
           if        w-det-gia-ubi-ctr    >    d-sld-ubi-num-ele
                     go to exe-cph-lv2-tgu-800.
      *                  *---------------------------------------------*
      *                  * Test se ubicazione a spazi                  *
      *                  *---------------------------------------------*
           if        d-sld-ubi-ubi-gia
                    (w-det-gia-ubi-ctr)   =    spaces
                     go to exe-cph-lv2-tgu-200.
      *                  *---------------------------------------------*
      *                  * Test se giacenza ubicazione a zero          *
      *                  *---------------------------------------------*
           if        d-sld-ubi-qta-gia
                    (w-det-gia-ubi-ctr)   =    zero
                     go to exe-cph-lv2-tgu-200.
       exe-cph-lv2-tgu-300.
      *                  *---------------------------------------------*
      *                  * Apertura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Ubicazione                                  *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      d-sld-ubi-ubi-gia
                    (w-det-gia-ubi-ctr)   to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
      *
           if        d-sld-ubi-ubi-gia
                    (w-det-gia-ubi-ctr)   =    w-exe-pri-ubi
                     move  "r"            to   h-stl
           else      move  "B"            to   h-stl                  .
      *
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-tgu-400.
      *                  *---------------------------------------------*
      *                  * Editing quantita'                           *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<G"                 to   p-edm                  .
           move      d-sld-ubi-qta-gia
                    (w-det-gia-ubi-ctr)   to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      p-edt                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "b"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Chiusura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-tgu-600.
      *                  *---------------------------------------------*
      *                  * Riciclo                                     *
      *                  *---------------------------------------------*
           go to     exe-cph-lv2-tgu-200.
       exe-cph-lv2-tgu-800.
      *              *-------------------------------------------------*
      *              * Chiusura tabella                                *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "table"              to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-tgu-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-tgu-999.
       exe-cph-lv2-tgu-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '3'                                *
      *    *                                                           *
      *    * Sub-subroutine per tabella totali rihe ubicazione         *
      *    *-----------------------------------------------------------*
       exe-cph-lv2-tru-000.
      *              *-------------------------------------------------*
      *              * Test se da emettere                             *
      *              *-------------------------------------------------*
           if        w-det-qta-ubi-inx    <    2
                     go to exe-cph-lv2-tru-900.
       exe-cph-lv2-tru-100.
      *              *-------------------------------------------------*
      *              * Operazioni preliminari                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Apertura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Cella vuota                                 *
      *                  *---------------------------------------------*
           display   "<td colspan='2' class='td_nb'>"                 .
           display   "</td>"                                          .
      *              *-------------------------------------------------*
      *              * Residuo quantita' da spedire                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<BGD"               to   p-edm                  .
           move      w-exe-qta-tot        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      p-edt                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Residuo quantita' da spedire                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<BGD"               to   p-edm                  .
           move      w-exe-qta-ppu        to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      p-edt                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Chiusura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-tru-800.
      *              *-------------------------------------------------*
      *              * Chiusura tabella                                *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "table"              to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-tru-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-tru-999.
       exe-cph-lv2-tru-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '2'                                *
      *    *                                                           *
      *    * Sub-subroutine per accettazione Ubicazione                *
      *    *-----------------------------------------------------------*
       exe-cph-lv2-ubi-000.
      *              *-------------------------------------------------*
      *              * Test se campo da accettare                      *
      *              *-------------------------------------------------*
       exe-cph-lv2-ubi-100.
      *              *-------------------------------------------------*
      *              * Apertura cella                                  *
      *              *-------------------------------------------------*
           display   "<td colspan=1 id='cel_ubi' name='cel_ubi' align='c
      -              "enter'>"                                        .
      *              *-------------------------------------------------*
      *              * Prompt                                          *
      *              *-------------------------------------------------*
           display   "<h1> Ubicazione </h1>"                          .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           move      spaces               to   w-exe-str-dsp          .
           string    "<input type='text' name='cod_ubi' id='cod_ubi'"
                                delimited by   size
                     " style='text-transform: uppercase;' "
                                delimited by   size
                     " maxlength='07' "
                                delimited by   size
                     " value=''>"
                                delimited by   size
                                          into w-exe-str-dsp          .
           display   w-exe-str-dsp                                    .
      *              *-------------------------------------------------*
      *              * Chiusura cella                                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-ubi-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-ubi-999.
       exe-cph-lv2-ubi-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '2'                                *
      *    *                                                           *
      *    * Sub-subroutine di gestione riga prodotto                  *
      *    *-----------------------------------------------------------*
       exe-cph-lv2-rig-000.
      *              *-------------------------------------------------*
      *              * Letture preliminari                             *
      *              *-------------------------------------------------*
       exe-cph-lv2-rig-020.
      *              *-------------------------------------------------*
      *              * Intestazione righe                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se da effettuare                       *
      *                  *---------------------------------------------*
           if        w-det-qta-ubi-ctr    >    1
                     go to exe-cph-lv2-rig-050.
      *                  *---------------------------------------------*
      *                  * Intestazione riga                           *
      *                  *---------------------------------------------*
           perform   exe-cph-lv2-irg-000  thru exe-cph-lv2-irg-999    .
       exe-cph-lv2-rig-050.
      *              *-------------------------------------------------*
      *              * Apertura riga                                   *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing del progressivo interno riga        *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-det-qta-ubi-ctr    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   w-exe-ctr-ria          .
      *                  *---------------------------------------------*
      *                  * Assemblaggio                                *
      *                  *---------------------------------------------*
           move      20                   to   w-all-str-lun          .
           move      03                   to   w-all-str-num          .
           move      "<tr id='row_"       to   w-all-str-cat (1)      .
           move      w-exe-ctr-ria        to   w-all-str-cat (2)      .
           move      "' "                 to   w-all-str-cat (3)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
           display   w-all-str-alf                                    .
      *                  *---------------------------------------------*
      *                  * Eventuale evidenziazione                    *
      *                  *---------------------------------------------*
           display   "/>"                                             .
      *              *-------------------------------------------------*
      *              * Apertura Form                                   *
      *              *-------------------------------------------------*
           move      80                   to   w-all-str-lun          .
           move      04                   to   w-all-str-num          .
           move      "<form id='frm_"     to   w-all-str-cat (1)      .
           move      w-exe-ctr-ria        to   w-all-str-cat (2)      .
           move      "' name='frm_"       to   w-all-str-cat (3)      .
           move      w-exe-ctr-ria        to   w-all-str-cat (4)      .
           perform   all-str-cat-000      thru all-str-cat-999        .
      *
           move      02                   to   w-all-str-num          .
           move      w-all-str-alf        to   w-all-str-cat (1)      .
           move      "' action='' method='post'>"
                                          to   w-all-str-cat (2)      .
           perform   all-str-csb-000      thru all-str-csb-999        .
      *
           display   w-all-str-alf                                    .
      *              *-------------------------------------------------*
      *              * Campi 'hidden' per la riga                      *
      *              *-------------------------------------------------*
           perform   exe-cph-lv2-hid-000  thru exe-cph-lv2-hid-999    .
       exe-cph-lv2-rig-100.
      *              *-------------------------------------------------*
      *              * Codice prodotto                                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Preparazione                                *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      w-det-vis-pro-alf    to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-rig-200.
      *              *-------------------------------------------------*
      *              * Descrizione prodotto                            *
      *              *-------------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      w-det-vis-pro-des    to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "L"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-rig-300.
       exe-cph-lv2-rig-400.
      *              *-------------------------------------------------*
      *              * Residuo quantita' da spedire                    *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<BGD"               to   p-edm                  .
           move      w-det-vis-pro-qds    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Valore                                      *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "td"                 to   h-sub                  .
           move      p-edt                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "R"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-rig-425.
      *              *-------------------------------------------------*
      *              * Quantita' verificata                            *
      *              *-------------------------------------------------*
           perform   exe-cph-lv2-qtv-000  thru exe-cph-lv2-qtv-999    .
       exe-cph-lv2-rig-450.
      *              *-------------------------------------------------*
      *              * Spunta                                          *
      *              *-------------------------------------------------*
       exe-cph-lv2-rig-500.
      *              *-------------------------------------------------*
      *              * Barcode EAN                                     *
      *              *-------------------------------------------------*
       exe-cph-lv2-rig-600.
      *              *-------------------------------------------------*
      *              * Ubicazione                                      *
      *              *-------------------------------------------------*
           display   "<td class='rig_ubi'><b>"                        .
           move      w-det-vis-pro-ubi    to   w-all-str-alf          .
           display   w-all-str-alf                                    .
           display   "</b></td>"                                      .
       exe-cph-lv2-rig-700.
      *              *-------------------------------------------------*
      *              * Giacenza                                        *
      *              *-------------------------------------------------*
       exe-cph-lv2-rig-800.
      *              *-------------------------------------------------*
      *              * Chiusura riga                                   *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura Form                                   *
      *              *-------------------------------------------------*
           display   "</form>"                                        .           
       exe-cph-lv2-rig-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-rig-999.
       exe-cph-lv2-rig-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '2'                                *
      *    *                                                           *
      *    * Sub-subroutine di accettazione quantita' verificata       *
      *    *-----------------------------------------------------------*
       exe-cph-lv2-qtv-000.
      *              *-------------------------------------------------*
      *              * Operazioni preliminari                          *
      *              *-------------------------------------------------*
       exe-cph-lv2-qtv-100.
      *              *-------------------------------------------------*
      *              * Apertura cella in funzione della quantita'      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Apertura cella normale                      *
      *                  *---------------------------------------------*
           move      "<td id='cel_qtv' name ='cel_qtv'>"
                                          to   w-all-str-cat (1)      .
      *                  *---------------------------------------------*
      *                  * Apertura cella con quantita' superiore      *
      *                  *---------------------------------------------*
           move      "<td id='cel_qtv' name ='cel_qtv' class='sel'>"
                                          to   w-all-str-cat (2)      .
      *                  *---------------------------------------------*
      *                  * Apertura cella con quantita' inferiore      *
      *                  *---------------------------------------------*
           move      "<td id='cel_qtv' name ='cel_qtv' class='msg_red'>"
                                          to   w-all-str-cat (3)      .
      *                  *---------------------------------------------*
      *                  * Apertura cella riga chiusa                  *
      *                  *---------------------------------------------*
           move      "<td id='cel_qtv' name ='cel_qtv' class='td_ds'>"
                                          to   w-all-str-cat (4)      .
      *                  *---------------------------------------------*
      *                  * Test sulle quantita'                        *
      *                  *---------------------------------------------*
           if        w-det-vis-pro-qds    =    zero
                     move  w-all-str-cat (1)
                                          to   w-all-str-alf
           else if   w-det-vis-pro-qds    =    w-det-vis-pro-qau
                     move  w-all-str-cat (1)
                                          to   w-all-str-alf
           else if   w-det-vis-pro-qau    >    w-det-vis-pro-qds
                     move  w-all-str-cat (2)
                                          to   w-all-str-alf
           else      move  w-all-str-cat (3)
                                          to   w-all-str-alf          .
      *                  *---------------------------------------------*
      *                  * Apertura cella                              *
      *                  *---------------------------------------------*
           display   w-all-str-alf                                    .
       exe-cph-lv2-qtv-200.
      *              *-------------------------------------------------*
      *              * Editing                                         *
      *              *-------------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      02                   to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<D"                 to   p-edm                  .
           move      w-det-vis-pro-qau    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *              *-------------------------------------------------*
      *              * Accettazione                                    *
      *              *-------------------------------------------------*
           display   "<input type='number' "                          .
           display   "id='qtv' name ='qtv' "                          .
           display   "class='numbersOnly' "                           .
      *
           move      "style='text-align:right;font-weight:bold;' "
                                          to   w-all-str-cat (1)      .
           move      "style='text-align:right;font-weight:bold;;color : 
      -              "red;' "             to   w-all-str-cat (2)      .
      *              *-------------------------------------------------*
      *              * Eventuale colore e stile                        *
      *              *-------------------------------------------------*
           if        w-exe-rig-qtv        =    w-exe-rig-qta
                     move  w-all-str-cat (1)
                                          to   w-all-str-alf
           else      move  w-all-str-cat (2)
                                          to   w-all-str-alf          .
           display   w-all-str-alf                                    .
      *
           move      spaces               to   w-exe-str-dsp          .
      *
           string    "value='"  delimited by   size
                     p-edt      delimited by   spaces
                     "' "       delimited by   size
                     "min='0' max='999999' "
                                delimited by   size
                                          into w-exe-str-dsp          .
      *
           display   w-exe-str-dsp                                    .
       exe-cph-lv2-qtv-600.
      *              *-------------------------------------------------*
      *              * Eventuale disabilitazione                       *
      *              *-------------------------------------------------*
       exe-cph-lv2-qtv-700.
      *              *-------------------------------------------------*
      *              * Chiusura input                                  *
      *              *-------------------------------------------------*
           display   "/>"                                             .
      *              *-------------------------------------------------*
      *              * Chiusura cella                                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "td"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-qtv-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-qtv-999.
       exe-cph-lv2-qtv-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '2'                                *
      *    *                                                           *
      *    * Sub-subroutine per intestazione righe prodotto            *
      *    *-----------------------------------------------------------*
       exe-cph-lv2-irg-000.
       exe-cph-lv2-irg-100.
      *              *-------------------------------------------------*
      *              * Intestazione colonne                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Apertura tabella per le righe               *
      *                  *---------------------------------------------*
           display   "<table class='bordotab' id='rig' name='rig' width=
      -              "100%>"                                          .
      *                  *---------------------------------------------*
      *                  * Apertura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Progressivo riga                *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Literal per Codice                          *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Codice"             to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Descrizione                     *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Descrizione"        to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per codice Produttore               *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Literal per Contrassegno collo              *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "CTN"                to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal 'in ordine'                         *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "In ordine"          to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Quantita' verificata            *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Verificato"         to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Spunta                          *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Literal per Ubicazione                      *
      *                  *---------------------------------------------*
           move      "TD"                 to   h-ope                  .
           move      "th"                 to   h-sub                  .
           move      "Ubicazione"         to   h-alf                  .
           move      "1"                  to   h-col                  .
           move      "C"                  to   h-all                  .
           move      "S"                  to   h-wdt                  .
           move      "B"                  to   h-stl                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *                  *---------------------------------------------*
      *                  * Literal per Giacenza                        *
      *                  *---------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Chiusura riga                               *
      *                  *---------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "tr"                 to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-irg-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-irg-999.
       exe-cph-lv2-irg-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '2'                                *
      *    *                                                           *
      *    * Sub-subroutine per i campi 'hidden'                       *
      *    *-----------------------------------------------------------*
       exe-cph-lv2-hid-000.
      *              *-------------------------------------------------*
      *              * Responsabile 'hidden'                           *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "rsm"                to   h-nam                  .
           move      w-exe-cod-rsm        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-hid-100.
      *              *-------------------------------------------------*
      *              * Progressivo riga [bfr] 'hidden'                 *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-slc-num-bft-prg    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "prg"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-hid-150.
      *              *-------------------------------------------------*
      *              * Progressivo riga interno 'hidden'               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      03                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-det-qta-ubi-ctr    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "pri"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-hid-200.
      *              *-------------------------------------------------*
      *              * Quantita' 'hidden'                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      08                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      "S"                  to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-det-vis-pro-qds    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "qta"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-hid-400.
      *              *-------------------------------------------------*
      *              * 'hidden' - Codice ubicazione                    *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "ubi"                to   h-nam                  .
           move      w-det-vis-pro-ubi    to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-hid-500.
      *              *-------------------------------------------------*
      *              * Ubicazioni 'hidden'                             *
      *              *-------------------------------------------------*
       exe-cph-lv2-hid-600.
      *              *-------------------------------------------------*
      *              * Codice alfanumerico prodotto 'hidden'           *
      *              *-------------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "alf"                to   h-nam                  .
           move      w-det-num-pro-alf    to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-hid-700.
      *              *-------------------------------------------------*
      *              * Codice numerico prodotto 'hidden'               *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      07                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-det-num-pro-num    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "pro"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-hid-800.
      *              *-------------------------------------------------*
      *              * Protocollo [bfr] 'hidden'                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Editing                                     *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      11                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "9"                  to   p-edm                  .
           move      w-slc-num-bft-prt    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Emissione                                   *
      *                  *---------------------------------------------*
           move      "IH"                 to   h-ope                  .
           move      "prt"                to   h-nam                  .
           move      p-edt                to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-lv2-hid-750.
      *              *-------------------------------------------------*
      *              * Si/no prodotto con barcode                      *
      *              *-------------------------------------------------*
       exe-cph-lv2-hid-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-lv2-hid-999.
       exe-cph-lv2-hid-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di lettura e preparazione html                      *
      *    *                                                           *
      *    * Subroutine per livello '1'                                *
      *    *                                                           *
      *    * Sub-subroutine di scrittura movimenti di magazzino        *
      *    *-----------------------------------------------------------*
       exe-cph-agg-mag-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-exe-ctr-mag          .
      *              *-------------------------------------------------*
      *              * Test preliminari                                *
      *              *-------------------------------------------------*
           if        w-slc-num-bft-prt    =    zero
                     go to exe-cph-agg-mag-990.
           if        w-exe-flg-stp        not  = "#"
                     go to exe-cph-agg-mag-990.
       exe-cph-agg-mag-050.
      *              *-------------------------------------------------*
      *              * Lettura record 'zero' per verifica se presente  *
      *              * il protocollo di magazzino                      *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione [bfu]                       *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfu                 .
      *                  *---------------------------------------------*
      *                  * Lettura per protocollo                      *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "PRTPRO    "         to   f-key                  .
           move      w-slc-num-bft-prt    to   rf-bfu-num-prt         .
           move      zero                 to   rf-bfu-num-pro         .
           move      spaces               to   rf-bfu-cod-ubi         .
           move      "pgm/bfo/fls/ioc/obj/iofbfu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfu                 .
      *                  *---------------------------------------------*
      *                  * Se protocollo di magazzino gia' assegnato   *
      *                  * uscita                                      *
      *                  *---------------------------------------------*
           if        rf-bfu-prt-mag       not  = zero
                     go to exe-cph-agg-mag-990.
       exe-cph-agg-mag-100.
      *              *-------------------------------------------------*
      *              * Start su [bfu]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "PRTPRO    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-slc-num-bft-prt    to   rf-bfu-num-prt         .
           move      zero                 to   rf-bfu-num-pro         .
           move      spaces               to   rf-bfu-cod-ubi         .
           move      "pgm/bfo/fls/ioc/obj/iofbfu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfu                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : fine lettura           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  exe-cph-agg-mag-900.
       exe-cph-agg-mag-200.
      *              *-------------------------------------------------*
      *              * Next su [bfu]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfu                 .
      *                  *---------------------------------------------*
      *                  * Se at end : fine lettura                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  exe-cph-agg-mag-900.
       exe-cph-agg-mag-300.
      *              *-------------------------------------------------*
      *              * Se oltre il massimo : fine lettura              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su protocollo distinta                 *
      *                  *---------------------------------------------*
           if        rf-bfu-num-prt       not  = w-slc-num-bft-prt
                     go to  exe-cph-agg-mag-900.
       exe-cph-agg-mag-400.
      *              *-------------------------------------------------*
      *              * Selezioni su [bfu]                              *
      *              *-------------------------------------------------*
       exe-cph-agg-mag-500.
      *              *-------------------------------------------------*
      *              * Incremento contatore                            *
      *              *-------------------------------------------------*
           add       1                    to   w-exe-ctr-mag          .
       exe-cph-agg-mag-550.
      *              *-------------------------------------------------*
      *              * Test se prima riga                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su contatore                           *
      *                  *---------------------------------------------*
           if        w-exe-ctr-mag        >    1
                     go to exe-cph-agg-mag-600.
      *                  *---------------------------------------------*
      *                  * Protocollo di magazzino da testata docu-    *
      *                  * mento                                       *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Normalizzazione [bft]                   *
      *                      *-----------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *                      *-----------------------------------------*
      *                      * Lettura [bft]                           *
      *                      *-----------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-slc-num-bft-prt    to   rf-bft-num-prt         .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
      *                      *-----------------------------------------*
      *                      * Se protocollo trovato                   *
      *                      *-----------------------------------------*
           if        rf-bft-pr2-mag       not  = zero
                     move  rf-bft-pr2-mag to   w-exe-prt-mag
                     move  rf-bft-dat-reg to   w-exe-drg-mag
                     go to exe-cph-agg-mag-560.
      *                      *-----------------------------------------*
      *                      * Se protocollo non trovato               *
      *                      *                                         *
      *                      * Attualmente si esce                     *
      *                      *-----------------------------------------*
           go to     exe-cph-agg-mag-990.
       exe-cph-agg-mag-555.
      *                      *-----------------------------------------*
      *                      * Test se la testata e' gia' stata inse-  *
      *                      * rita: in tal caso si esce per evitare   *
      *                      * una doppia registrazione                *
      *                      *-----------------------------------------*
           move      "TE"                 to   l-mag-300-tip-ope      .
           move      w-exe-dat-exe        to   l-mag-300-dat-reg      .
           move      w-slc-num-bft-prt    to   l-mag-300-num-prt      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
           if        l-mag-300-exi-sts    =    spaces
                     go to exe-cph-agg-mag-990.
      *                      *-----------------------------------------*
      *                      * Attribuzione nuovo protocollo           *
      *                      *-----------------------------------------*
           move      "NP"                 to   l-mag-300-tip-ope      .
           move      w-exe-dat-exe        to   l-mag-300-dat-reg      .
           move      01                   to   l-mag-300-cod-dpz      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
           move      l-mag-300-num-prt    to   w-exe-prt-mag          .
           move      w-exe-dat-exe        to   w-exe-drg-mag          .
       exe-cph-agg-mag-560.
      *                  *---------------------------------------------*
      *                  * Scrittura testata movimento di magazzino    *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Lettura tipo movimento [ybf]            *
      *                      *-----------------------------------------*
           move      rf-bft-cod-tmb       to   w-let-arc-ybf-cod      .
           move      zero                 to   w-let-arc-ybf-dpz      .
           perform   let-arc-ybf-000      thru let-arc-ybf-999        .
           move      w-let-arc-ybf-dsl    to   w-exe-dsl-mag          .
           if        w-exe-dsl-mag        =    spaces
                     move  "LRIC"         to   w-exe-dsl-mag          .
      *                      *-----------------------------------------*
      *                      * Normalizzazione testata                 *
      *                      *-----------------------------------------*
           move      "NT"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                      *-----------------------------------------*
      *                      * Scrittura testata                       *
      *                      *-----------------------------------------*
           move      "WT"                 to   l-mag-300-tip-ope      .
           move      w-exe-drg-mag        to   l-mag-300-dat-reg      .
           move      w-exe-prt-mag        to   l-mag-300-num-prt      .
           move      01                   to   l-mag-300-cod-dpz      .
      *                      *-----------------------------------------*
      *                      * Causale cambio dislocazione uscite      *
      *                      *-----------------------------------------*
           move      00055                to   l-mag-300-cod-cau      .
           move      spaces               to   l-mag-300-cod-ctm      .
           move      w-exe-dat-exe        to   l-mag-300-dat-doc      .
      *                      *-----------------------------------------*
      *                      * Editing protocollo distinta             *
      *                      *-----------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      06                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<B"                 to   p-edm                  .
           move      w-slc-num-bft-prt
                    (06 : 06)             to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-edt                to   l-mag-300-num-doc      .
      *                      *-----------------------------------------*
      *                      * Altri dati normalizzati                 *
      *                      *-----------------------------------------*
           move      spaces               to   l-mag-300-cod-dsl      .
           move      spaces               to   l-mag-300-cod-dsd      .
           move      "N"                  to   l-mag-300-tip-arc      .
           move      zero                 to   l-mag-300-cod-arc      .
           move      spaces               to   l-mag-300-dpz-arc      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
       exe-cph-agg-mag-600.
      *              *-------------------------------------------------*
      *              * Scrittura riga movimento di magazzino           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su elementi riga                       *
      *                  *---------------------------------------------*
           if        rf-bfu-num-pro       =    zero
                     go to exe-cph-agg-mag-700.      
           if        rf-bfu-qta-ubi       =    zero
                     go to exe-cph-agg-mag-700.      
           if        rf-bfu-cod-ubi       =    spaces
                     go to exe-cph-agg-mag-700.      
      *                  *---------------------------------------------*
      *                  * Normalizzazione [dcp]                       *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Lettura per codice                          *
      *                  *---------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO"             to   f-key                  .
           move      rf-bfu-num-pro       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Normalizzazione riga movimento di magazzino *
      *                  *---------------------------------------------*
           move      "NR"                 to   l-mag-300-tip-ope      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
      *                  *---------------------------------------------*
      *                  * Scrittura riga                              *
      *                  *---------------------------------------------*
           move      "WR"                 to   l-mag-300-tip-ope      .
           move      01                   to   l-mag-300-tip-mag      .
           move      rf-bfu-num-pro       to   l-mag-300-num-mag      .
           move      rf-dcp-alf-pro       to   l-mag-300-alf-mag      .
           move      spaces               to   l-mag-300-var-mag      .
           move      rf-dcp-umi-ven       to   l-mag-300-udm-ana      .
           move      rf-dcp-umi-ven       to   l-mag-300-udm-mov      .
           move      zero                 to   l-mag-300-num-pmg      .
           move      zero                 to   l-mag-300-ddo-rif      .
           move      spaces               to   l-mag-300-ndo-rif      .
           move      rf-bfu-qta-ubi       to   l-mag-300-qta-mov      .
           move      w-exe-dsl-mag        to   l-mag-300-cod-dsl      .
           move      rf-bfu-cod-ubi       to   l-mag-300-cod-dsd      .
           perform   mdl-agg-mag-cll-000  thru mdl-agg-mag-cll-999    .
       exe-cph-agg-mag-700.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     exe-cph-agg-mag-200.
       exe-cph-agg-mag-900.
      *              *-------------------------------------------------*
      *              * Operazioni in uscita                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Normalizzazione record [bfu]                *
      *                  *---------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfu                 .
      *                  *---------------------------------------------*
      *                  * Campi chiave                                *
      *                  *---------------------------------------------*
           move      w-slc-num-bft-prt    to   rf-bfu-num-prt         .
           move      zero                 to   rf-bfu-num-pro         .
           move      spaces               to   rf-bfu-cod-ubi         .
      *                  *---------------------------------------------*
      *                  * Protocollo di magazzino                     *
      *                  *---------------------------------------------*
           move      w-exe-prt-mag        to   rf-bfu-prt-mag         .
           move      w-exe-drg-mag        to   rf-bfu-drg-mag         .
      *                  *---------------------------------------------*
      *                  * Put record                                  *
      *                  *---------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfu"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfu                 .
       exe-cph-agg-mag-990.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-agg-mag-999.
       exe-cph-agg-mag-999.
           exit.

      *    *===========================================================*
      *    * Intestazione                                              *
      *    *                                                           *
      *    * Subroutine per 'header'                                   *
      *    *-----------------------------------------------------------*
       exe-cph-hea-000.
      *              *-------------------------------------------------*
      *              * Emissione testata documento                     *
      *              *-------------------------------------------------*
           move      "HH"                 to   h-ope                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Emissione icona                                 *
      *              *-------------------------------------------------*
           move      "HF"                 to   h-ope                  .
           move      "../icons/"          to   h-prm                  .
           move      "favicon.ico"        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Commento di apertura                            *
      *              *-------------------------------------------------*
           move      "EC"                 to   h-ope                  .
           move      "* wip - Tutti i diritti riservati *"
                                          to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Commento di aggiornamento                       *
      *              *-------------------------------------------------*
           move      "EC"                 to   h-ope                  .
           move      "* .....Aggiornamento : 07/01/2024 *"
                                          to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Titolo documento                                *
      *              *-------------------------------------------------*
           move      "HT"                 to   h-ope                  .
           move      "Entrata merce ABB"  to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Jquery UI CSS                                   *
      *              *-------------------------------------------------*
           move      "HC"                 to   h-ope                  .
           move      "../css_ele/"        to   h-prm                  .
           move      "jquery-ui.min.css"  to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Css per il documento                            *
      *              *-------------------------------------------------*
           move      "HC"                 to   h-ope                  .
           move      "../css_ele/"        to   h-prm                  .
           move      "ele.css"            to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Jquery min                                      *
      *              *-------------------------------------------------*
           move      "HJ"                 to   h-ope                  .
           move      "../jsc_ele/"        to   h-prm                  .
           move      "jquery.min.js"      to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Jquery UI min                                   *
      *              *-------------------------------------------------*
           move      "HJ"                 to   h-ope                  .
           move      "../jsc_ele/"        to   h-prm                  .
           move      "jquery-ui.min.js"   to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Jquery redirect                                 *
      *              *-------------------------------------------------*
           move      "HJ"                 to   h-ope                  .
           move      "../jsc_ele/"        to   h-prm                  .
           move      "jquery.redirect.js" to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Javascript per il documento                     *
      *              *-------------------------------------------------*
           move      "HJ"                 to   h-ope                  .
           move      "../jsc_ele/"        to   h-prm                  .
           move      "elebfoB2.js"        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Javascript accessoria per il documento          *
      *              *-------------------------------------------------*
           move      "HJ"                 to   h-ope                  .
           move      "../jsc_ele/"        to   h-prm                  .
           move      "eleipx02.js"        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Javascript accessoria per il documento          *
      *              *-------------------------------------------------*
           move      "HJ"                 to   h-ope                  .
           move      "../jsc_ele/"        to   h-prm                  .
           move      "eleubiJ0.js"        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Head - fine                                     *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "head"               to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Corpo                                           *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "body"               to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       exe-cph-hea-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     exe-cph-hea-999.
       exe-cph-hea-999.
           exit.

      *    *===========================================================*
      *    * Emissione chiusura HTML                                   *
      *    *-----------------------------------------------------------*
       emi-htm-cls-000.
      *              *-------------------------------------------------*
      *              * Linea di fondo                                  *
      *              *-------------------------------------------------*
           display   "<hr style='width:100%'>"                        .
      *              *-------------------------------------------------*
      *              * Allineamento centrato                           *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "center"             to   h-tag                  .
           move      "O"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Box per bottone di ritorno a menu               *
      *              *-------------------------------------------------*
           perform   emi-htm-bck-000      thru emi-htm-bck-999        .
      *              *-------------------------------------------------*
      *              * Copyright                                       *
      *              *-------------------------------------------------*
           move      "CY"                 to   h-ope                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura allineamento centrato                  *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "center"             to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura 'body'                                 *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "body"               to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura 'html'                                 *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "html"               to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       emi-htm-cls-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     emi-htm-cls-999.
       emi-htm-cls-999.
           exit.

      *    *===========================================================*
      *    * Emissione rientro a menu'                                 *
      *    *-----------------------------------------------------------*
       emi-htm-bck-000.
      *              *-------------------------------------------------*
      *              * Box per bottone di ritorno a menu               *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "div"                to   h-tag                  .
           move      "I"                  to   h-sub                  .
           move      "back"               to   h-idx                  .
           move      "back"               to   h-nam                  .
           move      spaces               to   h-cla                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Tag 'a' per link                                *
      *              *-------------------------------------------------*
           move      "EA"                 to   h-ope                  .
           move      "../ele.html"        to   h-hrf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Immagine                                        *
      *              *-------------------------------------------------*
           move      "IM"                 to   h-ope                  .
           move      "../icons/next-blue-1.png"
                                          to   h-src                  .
           move      "50"                 to   h-wdt                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura 'a'                                    *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "a"                  to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *              *-------------------------------------------------*
      *              * Chiusura Box per rientro a menu                 *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "div"                to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       emi-htm-bck-999.
           exit.

      *    *===========================================================*
      *    * Determinazione del codice numerico prodotto               *
      *    *-----------------------------------------------------------*
       det-num-pro-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valori di uscita                *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-num-pro-num      .
           move      zero                 to   w-det-num-pro-des      .
       det-num-pro-100.
      *              *-------------------------------------------------*
      *              * Start su archivio [dcp] per codice alfanumerico *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "ALFPRO    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-det-num-pro-alf    to   rf-dcp-alf-pro         .
           move      zero                 to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata: a ricerca per barcode      *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-num-pro-600.
       det-num-pro-200.
      *              *-------------------------------------------------*
      *              * Read-next su archivio [dcp]                     *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Test se fine file                           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-num-pro-600.
       det-num-pro-300.
      *              *-------------------------------------------------*
      *              * Test max su archivio [dcp]                      *
      *              *-------------------------------------------------*
           if        rf-dcp-alf-pro       not  = w-det-num-pro-alf
                     go to det-num-pro-600.
       det-num-pro-400.
      *              *-------------------------------------------------*
      *              * Bufferizzazioni                                 *
      *              *-------------------------------------------------*
           move      rf-dcp-num-pro       to   w-det-num-pro-num      .
           move      rf-dcp-des-pro       to   w-det-num-pro-des      .
       det-num-pro-500.
      *              *-------------------------------------------------*
      *              * Ad uscita                                       *
      *              *-------------------------------------------------*
           go to     det-num-pro-900.
       det-num-pro-600.
      *              *-------------------------------------------------*
      *              * Eventuale scansione barcode                     *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine                                  *
      *                  *---------------------------------------------*
           perform   det-num-pro-klb-000  thru det-num-pro-klb-999    .
      *                  *---------------------------------------------*
      *                  * Test se codice prodotto determinato         *
      *                  *---------------------------------------------*
           if        w-det-num-pro-num    not  = zero
                     go to det-num-pro-900.
       det-num-pro-700.
      *              *-------------------------------------------------*
      *              * Eventuale scansione barcode confezione          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine                                  *
      *                  *---------------------------------------------*
           perform   det-num-pro-cfz-000  thru det-num-pro-cfz-999    .
      *                  *---------------------------------------------*
      *                  * Test se codice prodotto determinato         *
      *                  *---------------------------------------------*
           if        w-det-num-pro-num    not  = zero
                     go to det-num-pro-900.
       det-num-pro-800.
      *              *-------------------------------------------------*
      *              * Eventuale scansione barcode imballo             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Subroutine                                  *
      *                  *---------------------------------------------*
           perform   det-num-pro-imb-000  thru det-num-pro-imb-999    .
       det-num-pro-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-num-pro-999.
       det-num-pro-999.
           exit.

      *    *===========================================================*
      *    * Determinazione del codice numerico prodotto               *
      *    *                                                           *
      *    * Subroutine per barcode [dcp]                              *
      *    *-----------------------------------------------------------*
       det-num-pro-klb-000.
      *              *-------------------------------------------------*
      *              * Start su archivio [dcp] per barcode             *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "KLBPRO    "         to   f-key                  .
           move      w-det-num-pro-alf    to   rf-dcp-klb-pro         .
           move      zero                 to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata: ad uscita                  *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-num-pro-klb-900.
       det-num-pro-klb-200.
      *              *-------------------------------------------------*
      *              * Next su [dcp]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *                  *---------------------------------------------*
      *                  * Se Next errata : ad uscita                  *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-num-pro-klb-900.
       det-num-pro-klb-300.
      *              *-------------------------------------------------*
      *              * Max su [dcp]                                    *
      *              *-------------------------------------------------*
           if        rf-dcp-klb-pro       not  = w-det-num-pro-alf
                     go to det-num-pro-klb-900.
       det-num-pro-klb-400.
      *              *-------------------------------------------------*
      *              * Bufferizzazioni                                 *
      *              *-------------------------------------------------*
           move      rf-dcp-num-pro       to   w-det-num-pro-num      .
           move      rf-dcp-alf-pro       to   w-det-num-pro-alf      .
       det-num-pro-klb-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-num-pro-klb-999.
       det-num-pro-klb-999.
           exit.

      *    *===========================================================*
      *    * Determinazione del codice numerico prodotto               *
      *    *                                                           *
      *    * Subroutine per barcode della confezione                   *
      *    *-----------------------------------------------------------*
       det-num-pro-cfz-000.
      *              *-------------------------------------------------*
      *              * Start su archivio [pdk] per barcode confezione  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "ALFPRO    "         to   f-key                  .
           move      w-det-num-pro-alf    to   rf-pdk-alf-pro         .
           move      "B"                  to   rf-pdk-tip-rec         .
           move      zero                 to   rf-pdk-num-pro         .
           move      zero                 to   rf-pdk-cod-arc         .
           move      "pgm/dcp/fls/ioc/obj/iofpdk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdk                 .
      *                  *---------------------------------------------*
      *                  * Se errata : ad uscita                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-num-pro-cfz-900.
       det-num-pro-cfz-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [pdk]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdk                 .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : ad uscita                     *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-num-pro-cfz-900.
       det-num-pro-cfz-300.
      *              *-------------------------------------------------*
      *              * Test max su [pdk]                               *
      *              *-------------------------------------------------*
           if        rf-pdk-alf-pro       not  = w-det-num-pro-alf
                     go to det-num-pro-cfz-900.
           if        rf-pdk-tip-rec       not  = "B"
                     go to det-num-pro-cfz-900.
       det-num-pro-cfz-400.
      *              *-------------------------------------------------*
      *              * Codice alfanumerico individuato                 *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      rf-pdk-num-pro       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * Bufferizzazioni                                 *
      *              *-------------------------------------------------*
           move      rf-dcp-num-pro       to   w-det-num-pro-num      .
           move      rf-dcp-alf-pro       to   w-det-num-pro-alf      .
       det-num-pro-cfz-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-num-pro-cfz-999.
       det-num-pro-cfz-999.
           exit.

      *    *===========================================================*
      *    * Determinazione del codice numerico prodotto               *
      *    *                                                           *
      *    * Subroutine per barcode dell'imballo                       *
      *    *-----------------------------------------------------------*
       det-num-pro-imb-000.
      *              *-------------------------------------------------*
      *              * Start su archivio [pdk] per barcode confezione  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "ALFPRO    "         to   f-key                  .
           move      w-det-num-pro-alf    to   rf-pdk-alf-pro         .
           move      "D"                  to   rf-pdk-tip-rec         .
           move      zero                 to   rf-pdk-num-pro         .
           move      zero                 to   rf-pdk-cod-arc         .
           move      "pgm/dcp/fls/ioc/obj/iofpdk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdk                 .
      *                  *---------------------------------------------*
      *                  * Se errata : ad uscita                       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-num-pro-imb-900.
       det-num-pro-imb-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [pdk]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcp/fls/ioc/obj/iofpdk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-pdk                 .
      *                  *---------------------------------------------*
      *                  * Se 'at end' : ad uscita                     *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-num-pro-imb-900.
       det-num-pro-imb-300.
      *              *-------------------------------------------------*
      *              * Test max su [pdk]                               *
      *              *-------------------------------------------------*
           if        rf-pdk-alf-pro       not  = w-det-num-pro-alf
                     go to det-num-pro-imb-900.
           if        rf-pdk-tip-rec       not  = "D"
                     go to det-num-pro-imb-900.
       det-num-pro-imb-400.
      *              *-------------------------------------------------*
      *              * Codice alfanumerico individuato                 *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      rf-pdk-num-pro       to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
      *              *-------------------------------------------------*
      *              * Bufferizzazioni                                 *
      *              *-------------------------------------------------*
           move      rf-dcp-num-pro       to   w-det-num-pro-num      .
           move      rf-dcp-alf-pro       to   w-det-num-pro-alf      .
       det-num-pro-imb-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-num-pro-imb-999.
       det-num-pro-imb-999.
           exit.

      *    *===========================================================*
      *    * Determinazione della componente numerica contrassegno     *
      *    *-----------------------------------------------------------*
       det-cmp-num-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valori di uscita                *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-cmp-num-num      .
       det-cmp-num-100.
      *              *-------------------------------------------------*
      *              * Conversione da alfanumerico a numerico          *
      *              *-------------------------------------------------*
           move      "CV"                 to   p-ope                  .
           move      15                   to   p-car                  .
           move      w-det-cmp-num-alf    to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           move      p-num                to   w-det-cmp-num-num      .
       det-cmp-num-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-cmp-num-999.
       det-cmp-num-999.
           exit.

      *    *===========================================================*
      *    * Routine lettura archivio [dcp]                            *
      *    *-----------------------------------------------------------*
       let-arc-dcp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice Prodotto di vendita a zero       *
      *              *-------------------------------------------------*
           if        w-let-arc-dcp-num    =    zero
                     go to let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRO    "         to   f-key                  .
           move      w-let-arc-dcp-num    to   rf-dcp-num-pro         .
           move      "pgm/dcp/fls/ioc/obj/iofdcp"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcp                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-dcp-400.
       let-arc-dcp-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-dcp-alf-pro       to   w-let-arc-dcp-alf      .
           move      rf-dcp-des-pro       to   w-let-arc-dcp-des      .
           move      rf-dcp-umi-ven       to   w-let-arc-dcp-umi      .
           move      rf-dcp-dec-qta       to   w-let-arc-dcp-ndq      .
           move      rf-dcp-tip-pro       to   w-let-arc-dcp-tip      .
           move      rf-dcp-klb-pro       to   w-let-arc-dcp-klb      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-dcp-999.
       let-arc-dcp-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-dcp-flg      .
           move      all   "."            to   w-let-arc-dcp-des      .
           go to     let-arc-dcp-600.
       let-arc-dcp-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-dcp-des      .
       let-arc-dcp-600.
           move      spaces               to   w-let-arc-dcp-alf      .
           move      spaces               to   w-let-arc-dcp-umi      .
           move      zero                 to   w-let-arc-dcp-ndq      .
           move      zero                 to   w-let-arc-dcp-tip      .
           move      spaces               to   w-let-arc-dcp-klb      .
       let-arc-dcp-999.
           exit.

      *    *===========================================================*
      *    * Stampa corpo documento                                    *
      *    *                                                           *
      *    * Subroutine di lettura eventuale riga di spunta            *
      *    *-----------------------------------------------------------*
       let-rec-bfs-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-rec-bfs-flg      .
      *              *-------------------------------------------------*
      *              * Normalizzazione valori di uscita                *
      *              *-------------------------------------------------*
           move      zero                 to   w-let-rec-bfs-qta      .
           move      spaces               to   w-let-rec-bfs-spn      .
           move      spaces               to   w-let-rec-bfs-odm      .
           move      spaces               to   w-let-rec-bfs-ub1      .
           move      spaces               to   w-let-rec-bfs-ub2      .
           move      spaces               to   w-let-rec-bfs-ub3      .
           move      spaces               to   w-let-rec-bfs-ub4      .
           move      spaces               to   w-let-rec-bfs-ncf      .
       let-rec-bfs-100.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfs                 .
      *              *-------------------------------------------------*
      *              * Lettura record [bfs]                            *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-let-rec-bfs-prt    to   rf-bfs-num-prt         .
           move      w-let-rec-bfs-prg    to   rf-bfs-num-prg         .
           move      w-let-rec-bfs-prr    to   rf-bfs-num-prr         .
           move      "pgm/bfo/fls/ioc/obj/iofbfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfs                 .
      *                  *---------------------------------------------*
      *                  * Se record non trovato: flag di uscita       *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     move  "#"            to   w-let-rec-bfs-flg   
                     go to let-rec-bfs-900.
       let-rec-bfs-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-bfs-qta-ril       to   w-let-rec-bfs-qta      .
           move      rf-bfs-flg-spn       to   w-let-rec-bfs-spn      .
           move      rf-bfs-cod-ub1       to   w-let-rec-bfs-ub1      .
           move      rf-bfs-cod-ub2       to   w-let-rec-bfs-ub2      .
           move      rf-bfs-cod-ub3       to   w-let-rec-bfs-ub3      .
           move      rf-bfs-cod-ub4       to   w-let-rec-bfs-ub4      .
           move      rf-bfs-ann-spn       to   w-let-rec-bfs-ncf      .
       let-rec-bfs-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-rec-bfs-999.
       let-rec-bfs-999.
           exit.

      *    *===========================================================*
      *    * Determinazione tabella responsabili                       *
      *    *-----------------------------------------------------------*
       det-tbl-rsm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni iniziali                        *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-tbl-rsm-ctr      .
       det-tbl-rsm-050.
      *              *-------------------------------------------------*
      *              * [zrm]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
       det-tbl-rsm-100.
      *              *-------------------------------------------------*
      *              * Start su archivio [zrm]                         *
      *              *-------------------------------------------------*
           move      "ST"                 to   f-ope                  .
           move      "CODRSP    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      zero                 to   rf-zrm-cod-rsp         .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata: a close                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-tbl-rsm-900.
       det-tbl-rsm-200.
      *              *-------------------------------------------------*
      *              * Read-next su archivio [zrm]                     *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
      *                  *---------------------------------------------*
      *                  * Test se fine file                           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to det-tbl-rsm-900.
       det-tbl-rsm-300.
      *              *-------------------------------------------------*
      *              * Test max su archivio [zrm]                      *
      *              *-------------------------------------------------*
       det-tbl-rsm-400.
      *              *-------------------------------------------------*
      *              * Selezioni                                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su Codice ambito di responsabilita'    *
      *                  *---------------------------------------------*
______*    if        rf-zrm-cod-adr       not  = 02
______*              go to det-tbl-rsm-200.
       det-tbl-rsm-500.
      *              *-------------------------------------------------*
      *              * Incremento tabella                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Incremento tabella                          *
      *                  *---------------------------------------------*
           add       1                    to   w-det-tbl-rsm-ctr      .
           move      rf-zrm-cod-rsp       to   w-det-tbl-cod-rsp
                                              (w-det-tbl-rsm-ctr)     .
           move      rf-zrm-des-rsp       to   w-det-tbl-des-rsp
                                              (w-det-tbl-rsm-ctr)     .
       det-tbl-rsm-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     det-tbl-rsm-200.
       det-tbl-rsm-900.
      *              *-------------------------------------------------*
      *              * [zrm]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-tbl-rsm-999.
       det-tbl-rsm-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [zrm]                         *
      *    *-----------------------------------------------------------*
       let-arc-zrm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zrm-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a zero                           *
      *              *-------------------------------------------------*
           if        w-let-arc-zrm-cod    =    zero
                     go to let-arc-zrm-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODRSP"             to   f-key                  .
           move      w-let-arc-zrm-cod    to   rf-zrm-cod-rsp         .
           move      "pgm/mag/fls/ioc/obj/iofzrm"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-zrm                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-zrm-400.
       let-arc-zrm-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-zrm-des-rsp       to   w-let-arc-zrm-des      .
           move      rf-zrm-flg-spn       to   w-let-arc-zrm-fds      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-zrm-999.
       let-arc-zrm-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-zrm-flg      .
           move      all   "."            to   w-let-arc-zrm-des      .
           move      "?"                  to   w-let-arc-zrm-fds      .
           go to     let-arc-zrm-600.
       let-arc-zrm-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-zrm-des      .
           move      spaces               to   w-let-arc-zrm-fds      .
       let-arc-zrm-600.
       let-arc-zrm-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [ybf]                         *
      *    *-----------------------------------------------------------*
       let-arc-ybf-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione marker di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-ybf-flg      .
      *              *-------------------------------------------------*
      *              * Test se codice a spazi                          *
      *              *-------------------------------------------------*
           if        w-let-arc-ybf-cod    =    spaces
                     go to let-arc-ybf-500.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODTMB"             to   f-key                  .
           move      w-let-arc-ybf-cod    to   rf-ybf-cod-tmb         .
           move      w-let-arc-ybf-dpz    to   rf-ybf-cod-dpz         .
           move      "pgm/bfo/fls/ioc/obj/iofybf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-ybf                 .
           if        f-sts                not  = e-not-err
                     go to let-arc-ybf-400.
       let-arc-ybf-200.
      *              *-------------------------------------------------*
      *              * Bufferizzazione valori                          *
      *              *-------------------------------------------------*
           move      rf-ybf-des-tmb       to   w-let-arc-ybf-des      .
           move      rf-ybf-cod-dsl       to   w-let-arc-ybf-dsl      .
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     let-arc-ybf-999.
       let-arc-ybf-400.
      *              *-------------------------------------------------*
      *              * Azioni per record non trovato                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-let-arc-ybf-flg      .
           move      all   "."            to   w-let-arc-ybf-des      .
           go to     let-arc-ybf-600.
       let-arc-ybf-500.
      *              *-------------------------------------------------*
      *              * Normalizzazione work area                       *
      *              *-------------------------------------------------*
           move      spaces               to   w-let-arc-ybf-des      .
       let-arc-ybf-600.
           move      spaces               to   w-let-arc-ybf-dsl      .
       let-arc-ybf-999.
           exit.

      *    *===========================================================*
      *    * Emissione messaggio                                       *
      *    *-----------------------------------------------------------*
       err-msg-htm-000.
      *              *-------------------------------------------------*
      *              * Emissione messaggio                             *
      *              *-------------------------------------------------*
           move      "ET"                 to   h-ope                  .
           move      "div"                to   h-tag                  .
           move      "I"                  to   h-sub                  .
           move      "msg"                to   h-idx                  .
           move      "msg"                to   h-nam                  .
           move      w-exe-cla-msg        to   h-cla                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *
           move      "ET"                 to   h-ope                  .
           move      "h1"                 to   h-tag                  .
           move      "V"                  to   h-sub                  .
           move      w-exe-err-msg        to   h-alf                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
      *
           move      "ET"                 to   h-ope                  .
           move      "div"                to   h-tag                  .
           move      "C"                  to   h-sub                  .
           call      "swd/mod/prg/obj/mhtml0"
                                         using h                      .
       err-msg-htm-999.
           exit.

      *    *===========================================================*
      *    * Controllo preliminare se documento stampabile [bfr]       *
      *    *-----------------------------------------------------------*
       ctl-prl-spn-bfr-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cix-ctr-rig-das      .
           move      zero                 to   w-cix-ctr-rig-spu      .
       ctl-prl-spn-bfr-050.
      *              *-------------------------------------------------*
      *              * Lettura iniziale [bft]                          *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      w-slc-num-bft-prt    to   rf-bft-num-prt         .
           move      "pgm/bfo/fls/ioc/obj/iofbft"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bft                 .
       ctl-prl-spn-bfr-100.
      *              *-------------------------------------------------*
      *              * Start su [bfr]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-slc-num-bft-prt    to   rf-bfr-num-prt         .
           move      zero                 to   rf-bfr-num-prg         .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : fine lettura           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  ctl-prl-spn-bfr-900.
       ctl-prl-spn-bfr-200.
      *              *-------------------------------------------------*
      *              * Next su [bfr]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfr"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfr                 .
      *                  *---------------------------------------------*
      *                  * Se at end : fine lettura                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  ctl-prl-spn-bfr-900.
       ctl-prl-spn-bfr-300.
      *              *-------------------------------------------------*
      *              * Se oltre il massimo : fine lettura              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su protocollo                          *
      *                  *---------------------------------------------*
           if        rf-bfr-num-prt       not  = w-slc-num-bft-prt
                     go to  ctl-prl-spn-bfr-900.
       ctl-prl-spn-bfr-400.
      *              *-------------------------------------------------*
      *              * Selezioni su [bfr]                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su tipo riga                           *
      *                  *---------------------------------------------*
           if        rf-bfr-tip-rig       not  = "P    "
                     go to  ctl-prl-spn-bfr-200.
       ctl-prl-spn-bfr-600.
      *              *-------------------------------------------------*
      *              * Scansione righe collo                           *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Scansione                                   *
      *                  *---------------------------------------------*
           perform   ctl-prl-spn-bfk-000  thru ctl-prl-spn-bfk-999    .
      *                  *---------------------------------------------*
      *                  * Test su numero colli per la riga            *
      *                  *---------------------------------------------*
           if        w-cix-ctr-rig-cpr    =    zero
                     add  1               to   w-cix-ctr-rig-das      .
       ctl-prl-spn-bfr-700.
      *              *-------------------------------------------------*
      *              * Eventuale verifica spunta                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Solo se riga non suddivisa in colli         *
      *                  *---------------------------------------------*
           if        w-cix-ctr-rig-cpr    not  = zero
                     go to ctl-prl-spn-bfr-800.
      *                  *---------------------------------------------*
      *                  * Lettura                                     *
      *                  *---------------------------------------------*
           move      rf-bfr-num-prt       to   w-let-rec-bfs-prt      .
           move      rf-bfr-num-prg       to   w-let-rec-bfs-prg      .
           move      zero                 to   w-let-rec-bfs-prr      .
           perform   let-rec-bfs-000      thru let-rec-bfs-999        .
      *                  *---------------------------------------------*
      *                  * Test su flag di spunta                      *
      *                  *---------------------------------------------*
           if        w-let-rec-bfs-spn    =    "S"
                     add  1               to   w-cix-ctr-rig-spu      .
       ctl-prl-spn-bfr-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     ctl-prl-spn-bfr-200.
       ctl-prl-spn-bfr-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ctl-prl-spn-bfr-999.
       ctl-prl-spn-bfr-999.
           exit.

      *    *===========================================================*
      *    * Controllo preliminare se documento stampabile [bfk]       *
      *    *-----------------------------------------------------------*
       ctl-prl-spn-bfk-000.
      *              *-------------------------------------------------*
      *              * Normalizzazioni preliminari                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cix-ctr-rig-cpr      .
       ctl-prl-spn-bfk-100.
      *              *-------------------------------------------------*
      *              * Start su [bfk]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-slc-num-bft-prt    to   rf-bfk-num-prt         .
           move      rf-bfr-num-prg       to   rf-bfk-num-prg         .
           move      zero                 to   rf-bfk-num-prc         .
           move      "pgm/bfo/fls/ioc/obj/iofbfk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfk                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : fine lettura           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  ctl-prl-spn-bfk-900.
       ctl-prl-spn-bfk-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale file [bfk]                  *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfk"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfk                 .
      *                  *---------------------------------------------*
      *                  * Se at end : fine lettura                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  ctl-prl-spn-bfk-900.
       ctl-prl-spn-bfk-300.
      *              *-------------------------------------------------*
      *              * Se oltre il massimo : fine lettura              *
      *              *-------------------------------------------------*
           if        rf-bfk-num-prt       not  = w-slc-num-bft-prt
                     go to  ctl-prl-spn-bfk-900.
           if        rf-bfk-num-prg       not  = rf-bfr-num-prg
                     go to  ctl-prl-spn-bfk-900.
       ctl-prl-spn-bfk-400.
      *              *-------------------------------------------------*
      *              * Selezioni su [bfk]                              *
      *              *-------------------------------------------------*
       ctl-prl-spn-bfk-500.
      *              *-------------------------------------------------*
      *              * Incremento contatore                            *
      *              *-------------------------------------------------*
           add       1                    to   w-cix-ctr-rig-cpr      .
           add       1                    to   w-cix-ctr-rig-das      .
       ctl-prl-spn-bfk-600.
      *              *-------------------------------------------------*
      *              * Lettura riga di spunta                          *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Lettura                                     *
      *                  *---------------------------------------------*
           move      rf-bfk-num-prt       to   w-let-rec-bfs-prt      .
           move      rf-bfk-num-prg       to   w-let-rec-bfs-prg      .
______*    move      rf-bfk-num-prc       to   w-let-rec-bfs-prr      .
           move      zero                 to   w-let-rec-bfs-prr      .
           perform   let-rec-bfs-000      thru let-rec-bfs-999        .
      *                  *---------------------------------------------*
      *                  * Test su flag di spunta                      *
      *                  *---------------------------------------------*
           if        w-let-rec-bfs-spn    =    "S"
                     add  1               to   w-cix-ctr-rig-spu      .
       ctl-prl-spn-bfk-800.
      *              *-------------------------------------------------*
      *              * Riciclo                                         *
      *              *-------------------------------------------------*
           go to     ctl-prl-spn-bfk-200.
       ctl-prl-spn-bfk-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     ctl-prl-spn-bfk-999.
       ctl-prl-spn-bfk-999.
           exit.

      *    *===========================================================*
      *    * Routine di scrittura record [bfs] normalizzato            *
      *    *-----------------------------------------------------------*
       nor-rec-bfs-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione record                          *
      *              *-------------------------------------------------*
           move      "NO"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfs                 .
      *              *-------------------------------------------------*
      *              * Campi chiave                                    *
      *              *-------------------------------------------------*
           move      w-slc-num-bft-prt    to   rf-bfs-num-prt         .
           move      w-det-qta-pro-prg
                    (w-det-qta-pro-ctr)   to   rf-bfs-num-prg         .
           move      zero                 to   rf-bfs-num-prr         .
      *              *-------------------------------------------------*
      *              * Put record                                      *
      *              *-------------------------------------------------*
           move      "PT"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfs                 .
       nor-rec-bfs-999.
           exit.

      *    *===========================================================*
      *    * Routine di update record [bfs]                            *
      *    *-----------------------------------------------------------*
       upd-rec-bfs-000.
      *              *-------------------------------------------------*
      *              * Update record                                   *
      *              *-------------------------------------------------*
           move      "UP"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfs                 .
      *              *-------------------------------------------------*
      *              * Rilascio record [bfs]                           *
      *              *-------------------------------------------------*
           move      "RL"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfs                 .
       upd-rec-bfs-999.
           exit.

      *    *===========================================================*
      *    * Determinazione responsabile spunte documento              *
      *    *-----------------------------------------------------------*
       det-rsm-doc-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione valori di uscita                *
      *              *-------------------------------------------------*
           move      zero                 to   w-det-rsm-doc-rsm      .
       det-rsm-doc-100.
      *              *-------------------------------------------------*
      *              * Start su [bfs]                                  *
      *              *-------------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NUMPRT    "         to   f-key                  .
           move      "NL"                 to   f-cfr                  .
           move      w-det-rsm-doc-prt    to   rf-bfs-num-prt         .
           move      zero                 to   rf-bfs-num-prg         .
           move      "pgm/bfo/fls/ioc/obj/iofbfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfs                 .
      *                  *---------------------------------------------*
      *                  * Se errore di start : fine lettura           *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  det-rsm-doc-900.
       det-rsm-doc-200.
      *              *-------------------------------------------------*
      *              * Next su [bfs]                                   *
      *              *-------------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/bfo/fls/ioc/obj/iofbfs"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-bfs                 .
      *                  *---------------------------------------------*
      *                  * Se at end : fine lettura                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to  det-rsm-doc-900.
       det-rsm-doc-300.
      *              *-------------------------------------------------*
      *              * Se oltre il massimo : fine lettura              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su protocollo                          *
      *                  *---------------------------------------------*
           if        rf-bfs-num-prt       not  = w-slc-num-bft-prt
                     go to  det-rsm-doc-900.
       det-rsm-doc-400.
      *              *-------------------------------------------------*
      *              * Selezioni su [bfs]                              *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test su codice responsabile                 *
      *                  *---------------------------------------------*
           if        rf-bfs-cod-rsm       =    zero
                     go to  det-rsm-doc-200.
       det-rsm-doc-600.
      *              *-------------------------------------------------*
      *              * Bufferizzazione codice responsabile             *
      *              *-------------------------------------------------*
           move      rf-bfs-cod-rsm       to   w-det-rsm-doc-rsm      .
       det-rsm-doc-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     det-rsm-doc-999.
       det-rsm-doc-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per determinazione saldo di magazzino         *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldmag0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per determinazione saldo di magazzino per     *
      *    * ubicazione                                                *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/dsldubi0.dts"                   .

      *    *===========================================================*
      *    * Subroutines per modulo di aggiornamento del magazzino     *
      *    *-----------------------------------------------------------*
           copy      "pgm/mag/prg/cpy/pmag300z.pgs"                   .

      *    *===========================================================*
      *    * Subroutines di trattamento variabile POST                 *
      *    *                                                           *
      *    * ELETTRA                                                   *
      *    *-----------------------------------------------------------*
           copy      "ele/cgi/prg/cpy/elecgi00.cps"                   .

      *    *===========================================================*
      *    * Subroutines per allineamenti a destra o a sinistra oppure *
      *    * al centro di campi alfanumerici di varia lunghezza, fi-   *
      *    * no ad un massimo di 240 caratteri, oppure per il conca-   *
      *    * tenamento, con o senza separazione, di max 10 substrin-   *
      *    * ghe in una unica substringa                               *
      *    *-----------------------------------------------------------*
           copy      "swd/std/prg/cpy/wallstr0.cps"                   .
