       Identification Division.
       Program-Id.                                 pdcf4101           .
      *================================================================*
      *                                                                *
      * Catalogo:          Sistema applicativo:    pgm                 *
      *                        Area gestionale:    dcf                 *
      *                                Settore:    com                 *
      *                                   Fase:    dcf410              *
      *                    ------------------------------------------- *
      *                     Versione originale:    001 del 15/03/95    *
      *                       Ultima revisione:    NdK del 07/06/22    *
      *                    ------------------------------------------- *
      *                                 Autore:    Nicola de Kunovich  *
      *================================================================*
      *                                                                *
      * Descrizione pgm:   Esecuzione per il programma pdcf4100:       *
      *                                                                *
      *                    Stampa etichette da anagrafiche commercia-  *
      *                    li fornitori.                               *
      *                                                                *
      *================================================================*

      ******************************************************************
       Environment Division.
      ******************************************************************

      *================================================================*
       Configuration Section.
      *================================================================*

       Source-Computer.     w-i-p-NdK-PD .
       Object-Computer.     w-i-p-NdK-PD .

       Special-Names.       Decimal-Point is comma .

      *================================================================*
       Input-Output Section.
      *================================================================*

       File-Control.

      *    *===========================================================*
      *    * File Control [srt]                                        *
      *    *-----------------------------------------------------------*
           select  srt       assign       to sort                     .

      ******************************************************************
       Data Division.
      ******************************************************************

      *================================================================*
       File Section.
      *================================================================*

      *    *===========================================================*
      *    * File Description [srt]                                    *
      *    *-----------------------------------------------------------*
       sd  srt.
      *    *-----------------------------------------------------------*
      *    * Sort record                                               *
      *    *-----------------------------------------------------------*
       01  srt-rec.
      *        *-------------------------------------------------------*
      *        * Chiave di ordinamento                                 *
      *        *-------------------------------------------------------*
           05  srt-key.
      *            *---------------------------------------------------*
      *            * Codice di ordinamento                             *
      *            * - Se ordinamento 01 : Zero                        *
      *            * - Se ordinamento 03 : Codice zona                 *
      *            * - Se ordinamento 04 : Codice categoria            *
      *            * - Se ordinamento 05 : Codice statistico           *
      *            *---------------------------------------------------*
               10  srt-cod-ord            pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Tipo record                                       *
      *            * - 01 : Inizio zona                                *
      *            *        Inizio categoria                           *
      *            *        Inizio codice statistico                   *
      *            * - 02 : Record relativo al fornitore               *
      *            *---------------------------------------------------*
               10  srt-tip-rec            pic  9(02)                  .
      *            *---------------------------------------------------*
      *            * Ragione sociale in uppercase                      *
      *            * - Se tipo record 01 : spaces                      *
      *            * - Se tipo record 02 : Ragione sociale uppercase   *
      *            *---------------------------------------------------*
               10  srt-rag-key            pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Dati                                                  *
      *        *-------------------------------------------------------*
           05  srt-dat.
      *            *---------------------------------------------------*
      *            * Se tipo record 01 : Spaces                        *
      *            * Se tipo record 02 : Dicitura per l'interlocutore  *
      *            *---------------------------------------------------*
               10  srt-dic-int            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Se tipo record 01 : Asterischi                    *
      *            * Se tipo record 02 : Ragione sociale fornitore     *
      *            *---------------------------------------------------*
               10  srt-rag-soc            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Se tipo record 01 : Descrizione per il codice     *
      *            * Se tipo record 02 : Indirizzo fornitore           *
      *            *---------------------------------------------------*
               10  srt-via-fnt            pic  x(40)                  .
      *            *---------------------------------------------------*
      *            * Se tipo record 01 : Asterischi                    *
      *            * Se tipo record 02 : Localita' fornitore           *
      *            *---------------------------------------------------*
               10  srt-loc-fnt            pic  x(40)                  .

      *================================================================*
       Working-Storage Section.
      *================================================================*

      *    *===========================================================*
      *    * Area di identificazione                                   *
      *    *-----------------------------------------------------------*
       01  i-ide.
      *        *-------------------------------------------------------*
      *        * Sistema applicativo                                   *
      *        *-------------------------------------------------------*
           05  i-ide-sap                  pic  x(03) value
                     "pgm"                                            .
      *        *-------------------------------------------------------*
      *        * Area gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-arg                  pic  x(03) value
                     "dcf"                                            .
      *        *-------------------------------------------------------*
      *        * Settore gestionale                                    *
      *        *-------------------------------------------------------*
           05  i-ide-set                  pic  x(03) value
                     "com"                                            .
      *        *-------------------------------------------------------*
      *        * Fase gestionale                                       *
      *        *-------------------------------------------------------*
           05  i-ide-fas                  pic  x(06) value
                     "dcf410"                                         .
      *        *-------------------------------------------------------*
      *        * Sigla interna del programma                           *
      *        *-------------------------------------------------------*
           05  i-ide-pro                  pic  x(10) value
                     "pdcf4101"                                       .
      *        *-------------------------------------------------------*
      *        * Descrizione del programma                             *
      *        *-------------------------------------------------------*
           05  i-ide-des                  pic  x(40) value
                     "       STAMPA ETICHETTE FORNITORI       "       .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "msegrt"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/s"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli                "mbckgx"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/b"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mprint"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/p"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per modulo                "mmessg"  *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/m"                                  .

      *    *===========================================================*
      *    * Area per definizione codici di errore di i-o              *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/e"                                  .

      *    *===========================================================*
      *    * Area di comunicazione per moduli di input-output          *
      *    *-----------------------------------------------------------*
           copy      "swd/mod/int/f"                                  .

      *    *===========================================================*
      *    * Work-area di controllo                                    *
      *    *-----------------------------------------------------------*
       01  w-cnt.
      *        *-------------------------------------------------------*
      *        * Flags di controllo uscita da routines fondamentali    *
      *        *-------------------------------------------------------*
           05  w-cnt-flg.
      *            *---------------------------------------------------*
      *            * Per routine dic-ini-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-dic-ini-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine pre-exe-pgm-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-pre-exe-pgm      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-rec-ric-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-rec-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine let-sel-stp-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-let-sel-stp      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Per routine exe-rou-srt-000                       *
      *            *---------------------------------------------------*
               10  w-cnt-exe-rou-srt      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Flags di controllo per tipo funzionamento             *
      *        *-------------------------------------------------------*
           05  w-cnt-fun.
      *            *---------------------------------------------------*
      *            * Si/No record richieste                            *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-ric      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Si/No stampa                                      *
      *            *---------------------------------------------------*
               10  w-cnt-fun-snx-stp      pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Area di controllo per funzionamento print-routine     *
      *        *-------------------------------------------------------*
           05  w-cnt-prn.
      *            *---------------------------------------------------*
      *            * Flag di primo giro                                *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-uno      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Segnale di 'begin' eseguito                       *
      *            *---------------------------------------------------*
               10  w-cnt-prn-mrk-beg      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di interruzione forzata                      *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-int      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Flag di uscita da subroutines principali          *
      *            *---------------------------------------------------*
               10  w-cnt-prn-flg-sub      pic  x(01)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio parametri rottura livello    *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-liv.
                   15  w-cnt-prn-sav-l05  pic  x(64)                  .
                   15  w-cnt-prn-sav-l04  pic  x(64)                  .
                   15  w-cnt-prn-sav-l03  pic  x(64)                  .
                   15  w-cnt-prn-sav-l02  pic  x(64)                  .
                   15  w-cnt-prn-sav-l01  pic  x(64)                  .
      *            *---------------------------------------------------*
      *            * Area per salvataggio area di rottura              *
      *            *---------------------------------------------------*
               10  w-cnt-prn-sav-rot.
                   15  filler occurs 320  pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per manipolazione titolo stampato                *
      *        *-------------------------------------------------------*
           05  w-cnt-tit.
               10  w-cnt-tit-des-tit.
                   15  w-cnt-tit-chr-tit  occurs 80
                                          pic  x(01)                  .
               10  w-cnt-tit-num-pag      pic  9(05)                  .
               10  w-cnt-tit-dat-stp      pic  9(07)                  .
               10  w-cnt-tit-des-azi.
                   15  w-cnt-tit-chr-azi  occurs 40
                                          pic  x(01)                  .
               10  w-cnt-tit-ctr-wrk      pic  9(02)                  .
               10  w-cnt-tit-ctr-azi      pic  9(02)                  .
               10  w-cnt-tit-ctr-tit      pic  9(02)                  .
               10  w-cnt-tit-pos-tit      pic  9(03)                  .
               10  w-cnt-tit-ctr-dep      pic  9(02)                  .
               10  w-cnt-tit-ctr-cif      pic  9(02)                  .
               10  w-cnt-tit-pos-dep      pic  9(03)                  .
               10  w-cnt-tit-num-lin      pic  9(01)                  .
      *        *-------------------------------------------------------*
      *        * Work per string-unstring                              *
      *        *-------------------------------------------------------*
           05  w-cnt-stu.
               10  w-cnt-stu-num-seg      pic  9(05)                  .
               10  w-cnt-stu-pnt-stu      pic  9(05)                  .
               10  w-cnt-stu-255-byt.
                   15  filler occurs 255  pic  x(01)                  .
               10  w-cnt-stu-sav-pnt      pic  9(05)                  .

      *    *===========================================================*
      *    * Records logici                                            *
      *    *-----------------------------------------------------------*
      *        *-------------------------------------------------------*
      *        * [dcf]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfdcf"                          .
      *        *-------------------------------------------------------*
      *        * [fnt]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/cge/fls/rec/rffnt"                          .
      *        *-------------------------------------------------------*
      *        * [yst]                                                 *
      *        *-------------------------------------------------------*
           copy      "pgm/dcf/fls/rec/rfyst"                          .

      *    *===========================================================*
      *    * Work-area richieste                                       *
      *    *-----------------------------------------------------------*
       01  rr.
      *        *-------------------------------------------------------*
      *        * Tipo ordinamento stampa                               *
      *        *  - 01 : Per fornitore                                 *
      *        *  - 02 : Per zona                                      *
      *        *  - 03 : Per categoria                                 *
      *        *  - 04 : Per codice statistico                         *
      *        *-------------------------------------------------------*
           05  rr-tip-ord                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Tipo etichette                                        *
      *        *  - 01 : Modulo cont. 12''   - 1 c. x 8 etichette      *
      *        *  - 02 : Modulo cont. 12''   - 3 c. x 8 etichette      *
      *        *-------------------------------------------------------*
           05  rr-tip-eti                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Tipo anagrafica da stampare                           *
      *        *  - 01 : Anagrafica commerciale fornitore              *
      *        *  - 02 : Anagrafica contabile fornitore                *
      *        *-------------------------------------------------------*
           05  rr-tip-ana                 pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Ragione sociale iniziale                              *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 01                    *
      *        *-------------------------------------------------------*
           05  rr-rag-min                 pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Ragione sociale finale                                *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 01                    *
      *        *-------------------------------------------------------*
           05  rr-rag-max                 pic  x(40)                  .
      *        *-------------------------------------------------------*
      *        * Codice zona iniziale                                  *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 03                    *
      *        *-------------------------------------------------------*
           05  rr-zon-min                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice zona iniziale, descrizione                     *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 03                    *
      *        *-------------------------------------------------------*
           05  rr-zon-min-des             pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Codice zona finale                                    *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 03                    *
      *        *-------------------------------------------------------*
           05  rr-zon-max                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice zona finale, descrizione                       *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 03                    *
      *        *-------------------------------------------------------*
           05  rr-zon-max-des             pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Codice categoria iniziale                             *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 04                    *
      *        *-------------------------------------------------------*
           05  rr-cat-min                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice categoria iniziale, descrizione                *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 04                    *
      *        *-------------------------------------------------------*
           05  rr-cat-min-des             pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Codice categoria finale                               *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 04                    *
      *        *-------------------------------------------------------*
           05  rr-cat-max                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice categoria finale, descrizione                  *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 04                    *
      *        *-------------------------------------------------------*
           05  rr-cat-max-des             pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Codice statistico iniziale                            *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 05                    *
      *        *-------------------------------------------------------*
           05  rr-stt-min                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice statistico iniziale, descrizione               *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 05                    *
      *        *-------------------------------------------------------*
           05  rr-stt-min-des             pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Codice statistico finale                              *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 05                    *
      *        *-------------------------------------------------------*
           05  rr-stt-max                 pic  9(07)                  .
      *        *-------------------------------------------------------*
      *        * Codice statistico finale, descrizione                 *
      *        *                                                       *
      *        * Solo se tipo ordinamento stampa 05                    *
      *        *-------------------------------------------------------*
           05  rr-stt-max-des             pic  x(20)                  .
      *        *-------------------------------------------------------*
      *        * Si/No stampa nome interlocutore                       *
      *        *  - 01 : Si                                            *
      *        *  - 02 : No                                            *
      *        *-------------------------------------------------------*
           05  rr-snx-int                 pic  9(02)                  .

      *    *===========================================================*
      *    * Area per controllo sort                                   *
      *    *-----------------------------------------------------------*
       01  w-srt.
      *        *-------------------------------------------------------*
      *        * Buffer records di testa                               *
      *        *-------------------------------------------------------*
           05  w-srt-buf-tst.
      *            *---------------------------------------------------*
      *            * Numero records di testa                           *
      *            *---------------------------------------------------*
               10  w-srt-buf-tst-num      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Indice di scansione                               *
      *            *---------------------------------------------------*
               10  w-srt-buf-tst-inx      pic  9(07)                  .
      *            *---------------------------------------------------*
      *            * Codici per records di testa                       *
      *            *---------------------------------------------------*
               10  w-srt-buf-tst-cod
                             occurs 8192  pic  9(07)       comp-3     .

      *    *===========================================================*
      *    * Area per controllo su singole etichette                   *
      *    *-----------------------------------------------------------*
       01  w-cnt-eti.
      *        *-------------------------------------------------------*
      *        * Numero etichette stampate nella pagina in corso       *
      *        *-------------------------------------------------------*
           05  w-cnt-eti-num-epc          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Numero colonna in corso di stampa                     *
      *        *-------------------------------------------------------*
           05  w-cnt-eti-num-ccs          pic  9(02)                  .
      *        *-------------------------------------------------------*
      *        * Correttivo per la posizione di stampa                 *
      *        *-------------------------------------------------------*
           05  w-cnt-eti-num-cps          pic  9(03)                  .

      *    *===========================================================*
      *    * Work per subroutines di Let                               *
      *    *-----------------------------------------------------------*
       01  w-let.
      *        *-------------------------------------------------------*
      *        * Work per Let su archivio [yst]                        *
      *        *-------------------------------------------------------*
           05  w-let-arc-yst.
               10  w-let-arc-yst-tip      pic  9(02)                  .
               10  w-let-arc-yst-cod      pic  9(05)                  .
               10  w-let-arc-yst-des      pic  x(20)                  .
              
      *    *===========================================================*
      *    * Area di comunicazione per determinazione contatti         *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/dconarc0.dtl"                   .

      *    *===========================================================*
      *    * Work area per controllo rotture di livello                *
      *    *-----------------------------------------------------------*
       01  w-rot.
      *        *-------------------------------------------------------*
      *        * 5. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l05.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 4. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l04.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 3. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l03.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 2. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l02.
               10  filler                 pic  x(01)                  .
      *        *-------------------------------------------------------*
      *        * 1. livello di rottura                                 *
      *        *-------------------------------------------------------*
           05  w-rot-l01.
               10  filler                 pic  x(01)                  .

      ******************************************************************
       Procedure Division.
      ******************************************************************

      *================================================================*
      *       Main                                                     *
      *================================================================*
       main-000.
      *              *-------------------------------------------------*
      *              * Dichiarazione di inizio programma               *
      *              *-------------------------------------------------*
           perform   dic-ini-pgm-000      thru dic-ini-pgm-999        .
           if        w-cnt-dic-ini-pgm    not  = spaces
                     go to main-999.
      *              *-------------------------------------------------*
      *              * Esecuzione routine pre-esecuzione programma     *
      *              *-------------------------------------------------*
           perform   pre-exe-pgm-000      thru pre-exe-pgm-999        .
           if        w-cnt-pre-exe-pgm    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Preparazione tipo funzionamento                 *
      *              *-------------------------------------------------*
           perform   pre-tip-fun-000      thru pre-tip-fun-999        .
      *              *-------------------------------------------------*
      *              * Lettura record richieste                        *
      *              *-------------------------------------------------*
           perform   let-rec-ric-000      thru let-rec-ric-999        .
           if        w-cnt-let-rec-ric    not  = spaces
                     go to main-900.
      *              *-------------------------------------------------*
      *              * Lettura parametri di selezione stampa           *
      *              *-------------------------------------------------*
           perform   let-sel-stp-000      thru let-sel-stp-999        .
           if        w-cnt-let-sel-stp    not  = spaces
                     go to main-900.
       main-300.
      *              *-------------------------------------------------*
      *              * Open files per routine di stampa                *
      *              *-------------------------------------------------*
           perform   prn-opn-fls-000      thru prn-opn-fls-999        .
      *              *-------------------------------------------------*
      *              * Esecuzione eventuale sort preliminare           *
      *              *-------------------------------------------------*
           perform   exe-rou-srt-000      thru exe-rou-srt-999        .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda se sort eseguito oppure no *
      *              *-------------------------------------------------*
           if        w-cnt-exe-rou-srt    =    spaces
                     go to main-400
           else      go to main-500.
       main-400.
      *              *-------------------------------------------------*
      *              * Se sort non eseguito                            *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ciclo di report-program                     *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-000      thru prn-rou-pri-999        .
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-500.
      *              *-------------------------------------------------*
      *              * Se sort eseguito                                *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Continuazione                               *
      *                  *---------------------------------------------*
           go to     main-600.
       main-600.
      *              *-------------------------------------------------*
      *              * Close files per routine di stampa               *
      *              *-------------------------------------------------*
           perform   prn-cls-fls-000      thru prn-cls-fls-999        .
      *              *-------------------------------------------------*
      *              * Cancellazione modulo stampa                     *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mprint"                         .
       main-900.
      *              *-------------------------------------------------*
      *              * Dichiarazione di fine programma                 *
      *              *-------------------------------------------------*
           perform   dic-fin-pgm-000      thru dic-fin-pgm-999        .
       main-999.
           exit      program                                          .

      *================================================================*
      *       Routines                                                 *
      *================================================================*

      *    *===========================================================*
      *    * Dichiarazione di inizio programma                         *
      *    *-----------------------------------------------------------*
       dic-ini-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P+"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sistema applicativo                             *
      *              *-------------------------------------------------*
           move      i-ide-sap            to   s-sap                  .
      *              *-------------------------------------------------*
      *              * Area gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-arg            to   s-arg                  .
      *              *-------------------------------------------------*
      *              * Settore gestionale                              *
      *              *-------------------------------------------------*
           move      i-ide-set            to   s-set                  .
      *              *-------------------------------------------------*
      *              * Fase gestionale                                 *
      *              *-------------------------------------------------*
           move      i-ide-fas            to   s-fas                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Flag di save video                              *
      *              *-------------------------------------------------*
           move      "N"                  to   s-svv                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Controllo esito richiamo modulo                 *
      *              *-------------------------------------------------*
           if        s-liv                =    zero
                     move  "#"            to   w-cnt-dic-ini-pgm
           else      move  spaces         to   w-cnt-dic-ini-pgm      .
       dic-ini-pgm-999.
           exit.

      *    *===========================================================*
      *    * Dichiarazione di fine programma                           *
      *    *-----------------------------------------------------------*
       dic-fin-pgm-000.
      *              *-------------------------------------------------*
      *              * Sigla funzione                                  *
      *              *-------------------------------------------------*
           move      "P-"                 to   s-ope                  .
      *              *-------------------------------------------------*
      *              * Sigla interna del programma                     *
      *              *-------------------------------------------------*
           move      i-ide-pro            to   s-pro                  .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria               *
      *              *-------------------------------------------------*
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
       dic-fin-pgm-999.
           exit.

      *    *===========================================================*
      *    * Lettura record richieste                                  *
      *    *-----------------------------------------------------------*
       let-rec-ric-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-rec-ric      .
      *              *-------------------------------------------------*
      *              * Test se programma senza richieste               *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-ric    not  = "S"
                     go to let-rec-ric-999.
      *              *-------------------------------------------------*
      *              * Richiesta tipo funzionamento a segreteria       *
      *              *-------------------------------------------------*
           move      "IG"                 to   s-ope                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Inizio lettura record richieste                 *
      *              *-------------------------------------------------*
           move      "OI"                 to   b-ope                  .
           move      s-fun                to   b-tfe                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric
                     go to let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Estrazione segmenti da 255  bytes da record ri- *
      *              * chieste                                         *
      *              *-------------------------------------------------*
           move      1                    to   w-cnt-stu-pnt-stu      .
       let-rec-ric-100.
           move      "GT"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
           if        b-rsc                not  = spaces
                     go to let-rec-ric-200.
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    b-chr
                     delimited by size    into rr
                                  with pointer w-cnt-stu-pnt-stu      .
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-rec-ric-100.
       let-rec-ric-200.
      *              *-------------------------------------------------*
      *              * Fine lettura record richieste                   *
      *              *-------------------------------------------------*
           move      "CL"                 to   b-ope                  .
           call      "swd/mod/prg/obj/mbckgr"
                                         using b                      .
      *                  *---------------------------------------------*
      *                  * Se errori : uscita                          *
      *                  *---------------------------------------------*
           if        b-rsc                not  = spaces
                     move  "#"            to   w-cnt-let-rec-ric      .
       let-rec-ric-900.
      *              *-------------------------------------------------*
      *              * Cancel modulo trattamento richieste             *
      *              *-------------------------------------------------*
           cancel    "swd/mod/prg/obj/mbckgr"                         .
       let-rec-ric-999.
           exit.

      *    *===========================================================*
      *    * Lettura parametri di selezione stampa da segreteria       *
      *    *-----------------------------------------------------------*
       let-sel-stp-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-let-sel-stp      .
      *              *-------------------------------------------------*
      *              * Test se programma senza stampa                  *
      *              *-------------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to let-sel-stp-999.
      *              *-------------------------------------------------*
      *              * Inizializzazione area parametri stampa          *
      *              *-------------------------------------------------*
           move      spaces               to   p-sel                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione numero progressivo segmento    *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-stu-num-seg      .
       let-sel-stp-100.
      *              *-------------------------------------------------*
      *              * Incremento numero progressivo segmento          *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-stu-num-seg      .
      *              *-------------------------------------------------*
      *              * Richiamo del modulo di segreteria per l'estra-  *
      *              * zione del segmento di parametri stampa          *
      *              *-------------------------------------------------*
           move      "S<"                 to   s-ope                  .
           move      w-cnt-stu-num-seg    to   s-num                  .
           call      "swd/mod/prg/obj/msegrt"
                                         using s                      .
      *              *-------------------------------------------------*
      *              * Concatenazione del segmento in area parametri   *
      *              * di stampa selezionati                           *
      *              *-------------------------------------------------*
           move      w-cnt-stu-num-seg    to   w-cnt-stu-pnt-stu      .
           multiply  80                   by   w-cnt-stu-pnt-stu      .
           subtract  79                   from w-cnt-stu-pnt-stu      .
           move      w-cnt-stu-pnt-stu    to   w-cnt-stu-sav-pnt      .
           string    s-alf
                     delimited by size    into p-sel
                                  with pointer w-cnt-stu-pnt-stu      .
      *              *-------------------------------------------------*
      *              * Se non si e' alla fine del record si ricicla    *
      *              *-------------------------------------------------*
           if        w-cnt-stu-pnt-stu    not  = w-cnt-stu-sav-pnt
                     go to let-sel-stp-100.
       let-sel-stp-999.
           exit.

      *    *===========================================================*
      *    * Ciclo di report-program                                   *
      *    *-----------------------------------------------------------*
       prn-rou-pri-000.
      *              *-------------------------------------------------*
      *              * Inizializzazione markers                        *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-mrk-uno      .
           move      spaces               to   w-cnt-prn-mrk-beg      .
      *              *-------------------------------------------------*
      *              * Inizializzazione area per rotture di livello    *
      *              *-------------------------------------------------*
           move      spaces               to   w-rot                  .
      *              *-------------------------------------------------*
      *              * Inizializzazione flag di interruzione forzata   *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Start iniziale                                  *
      *              *-------------------------------------------------*
           perform   prn-str-ini-000      thru prn-str-ini-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-600.
       prn-rou-pri-100.
      *              *-------------------------------------------------*
      *              * Salvataggio area rottura in area precedente     *
      *              *-------------------------------------------------*
           move      w-rot-l05            to   w-cnt-prn-sav-l05      .
           move      w-rot-l04            to   w-cnt-prn-sav-l04      .
           move      w-rot-l03            to   w-cnt-prn-sav-l03      .
           move      w-rot-l02            to   w-cnt-prn-sav-l02      .
           move      w-rot-l01            to   w-cnt-prn-sav-l01      .
       prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Lettura sequenziale                             *
      *              *-------------------------------------------------*
           perform   prn-let-seq-000      thru prn-let-seq-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se superamento limiti massimi              *
      *              *-------------------------------------------------*
           perform   prn-tst-max-000      thru prn-tst-max-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Selezione su record letto                       *
      *              *-------------------------------------------------*
           perform   prn-sel-rec-000      thru prn-sel-rec-999        .
           if        w-cnt-prn-flg-sub    not  = spaces
                     move   spaces        to   w-cnt-prn-flg-sub
                     go to  prn-rou-pri-200.
      *              *-------------------------------------------------*
      *              * Composizione area per tests di rottura          *
      *              *-------------------------------------------------*
           perform   prn-cmp-rot-000      thru prn-cmp-rot-999        .
      *              *-------------------------------------------------*
      *              * Test se primo passaggio                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    not  = spaces
                     go to prn-rou-pri-300.
      *                  *---------------------------------------------*
      *                  * Test se programma senza stampa              *
      *                  *---------------------------------------------*
           if        w-cnt-fun-snx-stp    not  = "S"
                     go to prn-rou-pri-250.
      *                      *-----------------------------------------*
      *                      * Begin                                   *
      *                      *-----------------------------------------*
           move      "BE"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                          *-------------------------------------*
      *                          * Se errori                           *
      *                          *-------------------------------------*
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-900.
      *                      *-----------------------------------------*
      *                      * Marker di Begin eseguito                *
      *                      *-----------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-beg      .
       prn-rou-pri-250.
      *                  *---------------------------------------------*
      *                  * Inizio di tutti i livelli                   *
      *                  *---------------------------------------------*
           perform   prn-rou-pri-790      thru prn-rou-pri-791        .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-300.
      *              *-------------------------------------------------*
      *              * Se rottura del 5. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l05            =    w-cnt-prn-sav-l05
                     go to prn-rou-pri-310.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l05    to   w-rot-l05              .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-750      thru prn-rou-pri-751        .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-310.
      *              *-------------------------------------------------*
      *              * Se rottura del 4. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l04            =    w-cnt-prn-sav-l04
                     go to prn-rou-pri-320.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l04    to   w-rot-l04              .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-740      thru prn-rou-pri-741        .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-320.
      *              *-------------------------------------------------*
      *              * Se rottura del 3. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l03            =    w-cnt-prn-sav-l03
                     go to prn-rou-pri-330.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l03    to   w-rot-l03              .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-730      thru prn-rou-pri-731        .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-330.
      *              *-------------------------------------------------*
      *              * Se rottura del 2. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l02            =    w-cnt-prn-sav-l02
                     go to prn-rou-pri-340.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l02    to   w-rot-l02              .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-720      thru prn-rou-pri-721        .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-340.
      *              *-------------------------------------------------*
      *              * Se rottura del 1. livello                       *
      *              *-------------------------------------------------*
           if        w-rot-l01            =    w-cnt-prn-sav-l01
                     go to prn-rou-pri-400.
           move      w-rot                to   w-cnt-prn-sav-rot      .
           move      w-cnt-prn-sav-l01    to   w-rot-l01              .
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           move      w-cnt-prn-sav-rot    to   w-rot                  .
           perform   prn-rou-pri-710      thru prn-rou-pri-711        .
           go to     prn-rou-pri-400.
       prn-rou-pri-400.
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Esecuzione per il livello di dettaglio          *
      *              *-------------------------------------------------*
           perform   prn-liv-det-000      thru prn-liv-det-999        .
      *              *-------------------------------------------------*
      *              * Se segnale di interruzione attivo : fine ciclo  *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * Segnale di passaggio successivo al primo        *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-prn-mrk-uno      .
      *              *-------------------------------------------------*
      *              * Riciclo a lettura sequenziale file principale   *
      *              *-------------------------------------------------*
           go to     prn-rou-pri-100.
       prn-rou-pri-500.
      *              *-------------------------------------------------*
      *              * Test se almeno un passaggio                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-mrk-uno    =    spaces
                     go to prn-rou-pri-600.
           perform   prn-rou-pri-810      thru prn-rou-pri-811        .
           perform   prn-rou-pri-820      thru prn-rou-pri-821        .
           perform   prn-rou-pri-830      thru prn-rou-pri-831        .
           perform   prn-rou-pri-840      thru prn-rou-pri-841        .
           perform   prn-rou-pri-850      thru prn-rou-pri-851        .
           perform   prn-rou-pri-890      thru prn-rou-pri-891        .
           go to     prn-rou-pri-900.
       prn-rou-pri-600.
      *              *-------------------------------------------------*
      *              * Esecuzione per nessuna registrazione da elab.   *
      *              *-------------------------------------------------*
           perform   prn-nes-ela-000      thru prn-nes-ela-999        .
           go to     prn-rou-pri-900.
       prn-rou-pri-710.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 1. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-711.
           perform   prn-ini-lr1-000      thru prn-ini-lr1-999        .
       prn-rou-pri-711.
           exit.
       prn-rou-pri-720.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 2. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-721.
           perform   prn-ini-lr2-000      thru prn-ini-lr2-999        .
       prn-rou-pri-721.
           exit.
       prn-rou-pri-730.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 3. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-731.
           perform   prn-ini-lr3-000      thru prn-ini-lr3-999        .
       prn-rou-pri-731.
           exit.
       prn-rou-pri-740.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 4. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-741.
           perform   prn-ini-lr4-000      thru prn-ini-lr4-999        .
       prn-rou-pri-741.
           exit.
       prn-rou-pri-750.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio 5. livello di rottura     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-751.
           perform   prn-ini-lr5-000      thru prn-ini-lr5-999        .
       prn-rou-pri-751.
           exit.
       prn-rou-pri-790.
      *              *-------------------------------------------------*
      *              * Esecuzione per inizio ciclo                     *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-791.
           perform   prn-ini-cic-000      thru prn-ini-cic-999        .
       prn-rou-pri-791.
           exit.
       prn-rou-pri-810.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 1. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-811.
           perform   prn-fin-lr1-000      thru prn-fin-lr1-999        .
       prn-rou-pri-811.
           exit.
       prn-rou-pri-820.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 2. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-821.
           perform   prn-fin-lr2-000      thru prn-fin-lr2-999        .
       prn-rou-pri-821.
           exit.
       prn-rou-pri-830.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 3. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-831.
           perform   prn-fin-lr3-000      thru prn-fin-lr3-999        .
       prn-rou-pri-831.
           exit.
       prn-rou-pri-840.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 4. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-841.
           perform   prn-fin-lr4-000      thru prn-fin-lr4-999        .
       prn-rou-pri-841.
           exit.
       prn-rou-pri-850.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine 5. livello di rottura       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-851.
           perform   prn-fin-lr5-000      thru prn-fin-lr5-999        .
       prn-rou-pri-851.
           exit.
       prn-rou-pri-890.
      *              *-------------------------------------------------*
      *              * Esecuzione per fine ciclo                       *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-rou-pri-891.
           perform   prn-fin-cic-000      thru prn-fin-cic-999        .
       prn-rou-pri-891.
           exit.
       prn-rou-pri-900.
      *              *-------------------------------------------------*
      *              * End                                             *
      *              *-------------------------------------------------*
           move      "EN"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
           if        p-rsc                not  = spaces
                     go to prn-rou-pri-999.
       prn-rou-pri-999.
           exit.

      *    *===========================================================*
      *    * Intestazione pagina standard                              *
      *    *-----------------------------------------------------------*
       int-pag-std-000.
      *              *-------------------------------------------------*
      *              * Avanzamento pagina                              *
      *              *-------------------------------------------------*
           move      "PA"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Se errore grave di i-o su stampa si esce    *
      *                  * con status di errore                        *
      *                  *---------------------------------------------*
           if        p-rsc                not  = spaces
                     move   "#"           to   w-cnt-prn-flg-int
                     go to  int-pag-std-999.
       int-pag-std-999.
           exit.

      *    *===========================================================*
      *    * Routine pre-esecuzione programma                          *
      *    *-----------------------------------------------------------*
       pre-exe-pgm-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione status di uscita                *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-pre-exe-pgm      .
       pre-exe-pgm-999.
           exit.

      *    *===========================================================*
      *    * Preparazione tipo funzionamento programma                 *
      *    *-----------------------------------------------------------*
       pre-tip-fun-000.
      *              *-------------------------------------------------*
      *              * Si/No record richieste                          *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-ric      .
      *              *-------------------------------------------------*
      *              * Si/No stampa                                    *
      *              *-------------------------------------------------*
           move      "S"                  to   w-cnt-fun-snx-stp      .
       pre-tip-fun-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Open files                         *
      *    *-----------------------------------------------------------*
       prn-opn-fls-000.
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [yst]                                           *
      *              *-------------------------------------------------*
           move      "OP"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yst                 .
      *              *-------------------------------------------------*
      *              * Open modulo di determinazione contatti          *
      *              *-------------------------------------------------*
           perform   con-arc-tip-opn-000  thru con-arc-tip-opn-999    .
       prn-opn-fls-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Close files                        *
      *    *-----------------------------------------------------------*
       prn-cls-fls-000.
      *              *-------------------------------------------------*
      *              * [dcf]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *              *-------------------------------------------------*
      *              * [fnt]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *              *-------------------------------------------------*
      *              * [yst]                                           *
      *              *-------------------------------------------------*
           move      "CL"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofyst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yst                 .
      *              *-------------------------------------------------*
      *              * Close modulo di determinazione contatti         *
      *              *-------------------------------------------------*
           perform   con-arc-tip-cls-000  thru con-arc-tip-cls-999    .
       prn-cls-fls-999.
           exit.

      *    *===========================================================*
      *    * Routine di sort preliminare                               *
      *    *-----------------------------------------------------------*
       exe-rou-srt-000.
      *              *-------------------------------------------------*
      *              * Flag di sort eseguito a : Si'                   *
      *              *-------------------------------------------------*
           move      "#"                  to   w-cnt-exe-rou-srt      .
      *              *-------------------------------------------------*
      *              * Esecuzione sort                                 *
      *              *-------------------------------------------------*
           sort      srt                  on   ascending srt-key
                     input  procedure     is   stp-srt-inp-000
                                          thru stp-srt-inp-999
                     output procedure     is   prn-rou-pri-000
                                          thru prn-rou-pri-999        .
       exe-rou-srt-999.
           exit.

      *    *===========================================================*
      *    * Input procedure per sort                                  *
      *    *-----------------------------------------------------------*
       stp-srt-inp-000.
      *              *-------------------------------------------------*
      *              * Numero testatine emesse : a zero                *
      *              *-------------------------------------------------*
           move      zero                 to   w-srt-buf-tst-num      .
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo di anagrafica da  *
      *              * cui prendere i dati per le etichette            *
      *              *-------------------------------------------------*
           if        rr-tip-ana           =    01
                     go to stp-srt-inp-100
           else if   rr-tip-ana           =    02
                     go to stp-srt-inp-500.
       stp-srt-inp-100.
      *              *-------------------------------------------------*
      *              * Se anagrafica commerciale fornitore             *
      *              *-------------------------------------------------*
       stp-srt-inp-125.
      *                  *---------------------------------------------*
      *                  * Start su [dcf]                              *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "RAGKEY    "         to   f-key                  .
           if        rr-tip-ord           =    01
                     move  rr-rag-min     to   rf-dcf-rag-key
           else      move  spaces         to   rf-dcf-rag-key         .
           move      zero                 to   rf-dcf-cod-fnt         .
           move      spaces               to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : ad uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-900.
       stp-srt-inp-150.
      *                  *---------------------------------------------*
      *                  * Read next da [dcf]                          *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
      *                  *---------------------------------------------*
      *                  * Se fine file : ad uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-900.
       stp-srt-inp-175.
      *                  *---------------------------------------------*
      *                  * Test max su [dcf]                           *
      *                  *---------------------------------------------*
           if        rr-tip-ord           not  = 01
                     go to stp-srt-inp-200.
           if        rf-dcf-rag-key       >    rr-rag-max
                     go to stp-srt-inp-900.
       stp-srt-inp-200.
      *                  *---------------------------------------------*
      *                  * Selezione su [dcf]                          *
      *                  *---------------------------------------------*
       stp-srt-inp-202.
      *                      *-----------------------------------------*
      *                      * Se anagrafica di una dipendenza : sele- *
      *                      * zione non superata                      *
      *                      *-----------------------------------------*
           if        rf-dcf-dpz-fnt       not  = spaces
                     go to stp-srt-inp-150.
       stp-srt-inp-204.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda del tipo di ordi-  *
      *                      * namento stampa                          *
      *                      *-----------------------------------------*
           if        rr-tip-ord           =    01
                     go to stp-srt-inp-206
           else if   rr-tip-ord           =    02
                     go to stp-srt-inp-208
           else if   rr-tip-ord           =    03
                     go to stp-srt-inp-210
           else if   rr-tip-ord           =    04
                     go to stp-srt-inp-212.
       stp-srt-inp-206.
      *                      *-----------------------------------------*
      *                      * Tipo di ordinamento stampa : 01         *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-225.
       stp-srt-inp-208.
      *                      *-----------------------------------------*
      *                      * Tipo di ordinamento stampa : 02         *
      *                      *-----------------------------------------*
           if        rf-dcf-cod-zon       =    zero
                     go to stp-srt-inp-150.
           if        rf-dcf-cod-zon       <    rr-zon-min or
                     rf-dcf-cod-zon       >    rr-zon-max
                     go to stp-srt-inp-150.
           go to     stp-srt-inp-225.
       stp-srt-inp-210.
      *                      *-----------------------------------------*
      *                      * Tipo di ordinamento stampa : 03         *
      *                      *-----------------------------------------*
           if        rf-dcf-cod-cat       =    zero
                     go to stp-srt-inp-150.
           if        rf-dcf-cod-cat       <    rr-cat-min or
                     rf-dcf-cod-cat       >    rr-cat-max
                     go to stp-srt-inp-150.
           go to     stp-srt-inp-225.
       stp-srt-inp-212.
      *                      *-----------------------------------------*
      *                      * Tipo di ordinamento stampa : 04         *
      *                      *-----------------------------------------*
           if        rf-dcf-cod-stt       =    zero
                     go to stp-srt-inp-150.
           if        rf-dcf-cod-stt       <    rr-stt-min or
                     rf-dcf-cod-stt       >    rr-stt-max
                     go to stp-srt-inp-150.
           go to     stp-srt-inp-225.
       stp-srt-inp-225.
      *                  *---------------------------------------------*
      *                  * Rilascio del record di testa                *
      *                  *---------------------------------------------*
           perform   ril-rec-tst-000      thru ril-rec-tst-999        .
       stp-srt-inp-250.
      *                  *---------------------------------------------*
      *                  * Rilascio del record fornitore               *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
           if        rr-tip-ord           =    02
                     move  rf-dcf-cod-zon to   srt-cod-ord
           else if   rr-tip-ord           =    03
                     move  rf-dcf-cod-cat to   srt-cod-ord
           else if   rr-tip-ord           =    04
                     move  rf-dcf-cod-stt to   srt-cod-ord
           else      move  zero           to   srt-cod-ord            .
           move      02                   to   srt-tip-rec            .
           move      rf-dcf-rag-key       to   srt-rag-key            .
      *                      *-----------------------------------------*
      *                      * Determinazione interlocutore            *
      *                      *-----------------------------------------*
           move      "DT"                 to   d-con-arc-tip-ope      .
           move      12                   to   d-con-arc-tip-arc      .
           move      rf-dcf-cod-fnt       to   d-con-arc-cod-arc      .
           move      rf-dcf-dpz-fnt       to   d-con-arc-dpz-arc      .
           move      spaces               to   d-con-arc-tip-sel      .
           perform   con-arc-tip-cll-000  thru con-arc-tip-cll-999    .
      *                      *-----------------------------------------*
      *                      * Nome interlocutore                      *
      *                      *-----------------------------------------*
           if        rr-snx-int           not  = 02
                     move   "Spettabile"
                                          to   srt-dic-int
           else if   d-con-arc-int-con (1)
                                          =    spaces
                     move   "Spettabile"  to   srt-dic-int
           else      move   spaces        to   srt-dic-int
                     string "C.att.: "
                                delimited by   size
                            d-con-arc-int-con (1)
                                delimited by   size
                                          into srt-dic-int            .
      *
           move      rf-dcf-rag-soc       to   srt-rag-soc            .
           move      rf-dcf-via-dcf       to   srt-via-fnt            .
           move      rf-dcf-loc-dcf       to   srt-loc-fnt            .
      *                      *-----------------------------------------*
      *                      * Rilascio                                *
      *                      *-----------------------------------------*
           release   srt-rec                                          .
       stp-srt-inp-275.
      *                  *---------------------------------------------*
      *                  * riciclo a lettura sequenziale               *
      *                  *---------------------------------------------*
           go to     stp-srt-inp-150.
       stp-srt-inp-500.
      *              *-------------------------------------------------*
      *              * Se anagrafica contabile fornitore               *
      *              *-------------------------------------------------*
       stp-srt-inp-525.
      *                  *---------------------------------------------*
      *                  * Start su [fnt]                              *
      *                  *---------------------------------------------*
           move      "SK"                 to   f-ope                  .
           move      "NL"                 to   f-cfr                  .
           move      "RAGKEY    "         to   f-key                  .
           if        rr-tip-ord           =    01
                     move  rr-rag-min     to   rf-fnt-rag-key
           else      move  spaces         to   rf-fnt-rag-key         .
           move      zero                 to   rf-fnt-cod-fnt         .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *                  *---------------------------------------------*
      *                  * Se Start errata : ad uscita                 *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-900.
       stp-srt-inp-550.
      *                  *---------------------------------------------*
      *                  * Read next da [fnt]                          *
      *                  *---------------------------------------------*
           move      "RN"                 to   f-ope                  .
           move      "pgm/cge/fls/ioc/obj/ioffnt"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-fnt                 .
      *                  *---------------------------------------------*
      *                  * Se fine file : ad uscita                    *
      *                  *---------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-900.
       stp-srt-inp-575.
      *                  *---------------------------------------------*
      *                  * Test max su [fnt]                           *
      *                  *---------------------------------------------*
           if        rr-tip-ord           not  = 01
                     go to stp-srt-inp-600.
           if        rf-fnt-rag-key       >    rr-rag-max
                     go to stp-srt-inp-900.
       stp-srt-inp-600.
      *                  *---------------------------------------------*
      *                  * Selezione su [fnt]                          *
      *                  *---------------------------------------------*
       stp-srt-inp-602.
      *                      *-----------------------------------------*
      *                      * Lettura [dcf] se necessario             *
      *                      *-----------------------------------------*
           if        rr-tip-ord           not  = 02 and
                     rr-tip-ord           not  = 03 and
                     rr-tip-ord           not  = 04
                     go to stp-srt-inp-604.
           move      "RK"                 to   f-ope                  .
           move      "CODFNT"             to   f-key                  .
           move      rf-fnt-cod-fnt       to   rf-dcf-cod-fnt         .
           move      spaces               to   rf-dcf-dpz-fnt         .
           move      "pgm/dcf/fls/ioc/obj/iofdcf"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-dcf                 .
           if        f-sts                not  = e-not-err
                     go to stp-srt-inp-550.
       stp-srt-inp-604.
      *                      *-----------------------------------------*
      *                      * Deviazione a seconda del tipo di ordi-  *
      *                      * namento stampa                          *
      *                      *-----------------------------------------*
           if        rr-tip-ord           =    01
                     go to stp-srt-inp-606
           else if   rr-tip-ord           =    02
                     go to stp-srt-inp-608
           else if   rr-tip-ord           =    03
                     go to stp-srt-inp-610
           else if   rr-tip-ord           =    04
                     go to stp-srt-inp-612.
       stp-srt-inp-606.
      *                      *-----------------------------------------*
      *                      * Tipo di ordinamento stampa : 01         *
      *                      *-----------------------------------------*
           go to     stp-srt-inp-625.
       stp-srt-inp-608.
      *                      *-----------------------------------------*
      *                      * Tipo di ordinamento stampa : 02         *
      *                      *-----------------------------------------*
           if        rf-dcf-cod-zon       =    zero
                     go to stp-srt-inp-550.
           if        rf-dcf-cod-zon       <    rr-zon-min or
                     rf-dcf-cod-zon       >    rr-zon-max
                     go to stp-srt-inp-550.
           go to     stp-srt-inp-625.
       stp-srt-inp-610.
      *                      *-----------------------------------------*
      *                      * Tipo di ordinamento stampa : 03         *
      *                      *-----------------------------------------*
           if        rf-dcf-cod-cat       =    zero
                     go to stp-srt-inp-550.
           if        rf-dcf-cod-cat       <    rr-cat-min or
                     rf-dcf-cod-cat       >    rr-cat-max
                     go to stp-srt-inp-550.
           go to     stp-srt-inp-625.
       stp-srt-inp-612.
      *                      *-----------------------------------------*
      *                      * Tipo di ordinamento stampa : 04         *
      *                      *-----------------------------------------*
           if        rf-dcf-cod-stt       =    zero
                     go to stp-srt-inp-550.
           if        rf-dcf-cod-stt       <    rr-stt-min or
                     rf-dcf-cod-stt       >    rr-stt-max
                     go to stp-srt-inp-550.
           go to     stp-srt-inp-625.
       stp-srt-inp-625.
      *                  *---------------------------------------------*
      *                  * Rilascio del record di testa                *
      *                  *---------------------------------------------*
           perform   ril-rec-tst-000      thru ril-rec-tst-999        .
       stp-srt-inp-650.
      *                  *---------------------------------------------*
      *                  * Rilascio del record fornitore               *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
           if        rr-tip-ord           =    02
                     move  rf-dcf-cod-zon to   srt-cod-ord
           else if   rr-tip-ord           =    03
                     move  rf-dcf-cod-cat to   srt-cod-ord
           else if   rr-tip-ord           =    04
                     move  rf-dcf-cod-stt to   srt-cod-ord
           else      move  zero           to   srt-cod-ord            .
           move      02                   to   srt-tip-rec            .
           move      rf-fnt-rag-key       to   srt-rag-key            .
      *                      *-----------------------------------------*
      *                      * Nome interlocutore                      *
      *                      *-----------------------------------------*
           if        rr-snx-int           not  = 02
                     move   spaces        to   srt-dic-int
           else if   rf-fnt-nom-int       =    spaces
                     move  "Spettabile"   to   srt-dic-int
           else      move   spaces        to   srt-dic-int
                     string "C.att.: "
                                delimited by   size
                            rf-fnt-nom-int
                                delimited by   size
                                          into srt-dic-int            .
           move      rf-fnt-rag-soc       to   srt-rag-soc            .
           move      rf-fnt-via-fnt       to   srt-via-fnt            .
           move      rf-fnt-loc-fnt       to   srt-loc-fnt            .
      *
           release   srt-rec                                          .
       stp-srt-inp-675.
      *                  *---------------------------------------------*
      *                  * riciclo a lettura sequenziale               *
      *                  *---------------------------------------------*
           go to     stp-srt-inp-550.
       stp-srt-inp-900.
      *              *-------------------------------------------------*
      *              * Uscita                                          *
      *              *-------------------------------------------------*
           go to     stp-srt-inp-999.
       stp-srt-inp-999.
           exit.

      *    *===========================================================*
      *    * Rilascio testatine di inizio codice                       *
      *    *-----------------------------------------------------------*
       ril-rec-tst-000.
      *              *-------------------------------------------------*
      *              * Deviazione a seconda del tipo di ordinamento di *
      *              * stampa                                          *
      *              *-------------------------------------------------*
           if        rr-tip-ord           =    01
                     go to ril-rec-tst-100
           else if   rr-tip-ord           =    02
                     go to ril-rec-tst-300
           else if   rr-tip-ord           =    03
                     go to ril-rec-tst-400
           else if   rr-tip-ord           =    04
                     go to ril-rec-tst-500.
       ril-rec-tst-100.
      *              *-------------------------------------------------*
      *              * Se tipo di ordinamento di stampa 01             *
      *              *-------------------------------------------------*
       ril-rec-tst-110.
      *                  *---------------------------------------------*
      *                  * Uscita senza alcuna azione                  *
      *                  *---------------------------------------------*
           go to     ril-rec-tst-999.
       ril-rec-tst-300.
      *              *-------------------------------------------------*
      *              * Se tipo di ordinamento di stampa 03             *
      *              *-------------------------------------------------*
       ril-rec-tst-310.
      *                  *---------------------------------------------*
      *                  * Se richiesta per un solo codice : uscita    *
      *                  * senza alcuna azione                         *
      *                  *---------------------------------------------*
           if        rr-zon-min           =    rr-zon-max
                     go to ril-rec-tst-999.
       ril-rec-tst-320.
      *                  *---------------------------------------------*
      *                  * Se testatina gia' rilasciata : uscita senza *
      *                  * alcuna azione                               *
      *                  *---------------------------------------------*
           move      zero                 to   w-srt-buf-tst-inx      .
       ril-rec-tst-321.
           add       1                    to   w-srt-buf-tst-inx      .
           if        w-srt-buf-tst-inx    >    8192
                     go to ril-rec-tst-999.
           if        w-srt-buf-tst-inx    >    w-srt-buf-tst-num
                     go to ril-rec-tst-330.
           if        w-srt-buf-tst-cod
                    (w-srt-buf-tst-inx)   =    rf-dcf-cod-zon
                     go to ril-rec-tst-999.
           go to     ril-rec-tst-321.
       ril-rec-tst-330.
      *                  *---------------------------------------------*
      *                  * Memorizzazione codice zona                  *
      *                  *---------------------------------------------*
           add       1                    to   w-srt-buf-tst-num      .
           move      rf-dcf-cod-zon       to   w-srt-buf-tst-cod
                                              (w-srt-buf-tst-num)     .
      *                  *---------------------------------------------*
      *                  * Lettura codice zona                         *
      *                  *---------------------------------------------*
           move      01                   to   w-let-arc-yst-tip      .
           move      rf-dcf-cod-zon       to   w-let-arc-yst-cod      .
           perform   let-arc-yst-000      thru let-arc-yst-999        .
       ril-rec-tst-340.
      *                  *---------------------------------------------*
      *                  * Composizione record testatina               *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
           move      rf-dcf-cod-zon       to   srt-cod-ord            .
           move      01                   to   srt-tip-rec            .
           move      spaces               to   srt-rag-key            .
           move      spaces               to   srt-dic-int            .
           move      all   "*"            to   srt-rag-soc            .
           move      w-let-arc-yst-des    to   srt-via-fnt            .
           move      all   "*"            to   srt-loc-fnt            .
       ril-rec-tst-350.
      *                  *---------------------------------------------*
      *                  * Rilascio record testatina                   *
      *                  *---------------------------------------------*
           release   srt-rec                                          .
       ril-rec-tst-350.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ril-rec-tst-999.
       ril-rec-tst-400.
      *              *-------------------------------------------------*
      *              * Se tipo di ordinamento di stampa 04             *
      *              *-------------------------------------------------*
       ril-rec-tst-410.
      *                  *---------------------------------------------*
      *                  * Se richiesta per un solo codice : uscita    *
      *                  * senza alcuna azione                         *
      *                  *---------------------------------------------*
           if        rr-cat-min           =    rr-cat-max
                     go to ril-rec-tst-999.
       ril-rec-tst-420.
      *                  *---------------------------------------------*
      *                  * Se testatina gia' rilasciata : uscita senza *
      *                  * alcuna azione                               *
      *                  *---------------------------------------------*
           move      zero                 to   w-srt-buf-tst-inx      .
       ril-rec-tst-421.
           add       1                    to   w-srt-buf-tst-inx      .
           if        w-srt-buf-tst-inx    >    8192
                     go to ril-rec-tst-999.
           if        w-srt-buf-tst-inx    >    w-srt-buf-tst-num
                     go to ril-rec-tst-430.
           if        w-srt-buf-tst-cod
                    (w-srt-buf-tst-inx)   =    rf-dcf-cod-cat
                     go to ril-rec-tst-999.
           go to     ril-rec-tst-421.
       ril-rec-tst-430.
      *                  *---------------------------------------------*
      *                  * Memorizzazione codice categoria             *
      *                  *---------------------------------------------*
           add       1                    to   w-srt-buf-tst-num      .
           move      rf-dcf-cod-cat       to   w-srt-buf-tst-cod
                                              (w-srt-buf-tst-num)     .
      *                  *---------------------------------------------*
      *                  * Lettura codice categoria                    *
      *                  *---------------------------------------------*
           move      02                   to   w-let-arc-yst-tip      .
           move      rf-dcf-cod-cat       to   w-let-arc-yst-cod      .
           perform   let-arc-yst-000      thru let-arc-yst-999        .
       ril-rec-tst-440.
      *                  *---------------------------------------------*
      *                  * Composizione record testatina               *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
           move      rf-dcf-cod-cat       to   srt-cod-ord            .
           move      01                   to   srt-tip-rec            .
           move      spaces               to   srt-rag-key            .
           move      spaces               to   srt-dic-int            .
           move      all   "*"            to   srt-rag-soc            .
           move      w-let-arc-yst-des    to   srt-via-fnt            .
           move      all   "*"            to   srt-loc-fnt            .
       ril-rec-tst-450.
      *                  *---------------------------------------------*
      *                  * Rilascio record testatina                   *
      *                  *---------------------------------------------*
           release   srt-rec                                          .
       ril-rec-tst-450.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ril-rec-tst-999.
       ril-rec-tst-500.
      *              *-------------------------------------------------*
      *              * Se tipo di ordinamento di stampa 05             *
      *              *-------------------------------------------------*
       ril-rec-tst-510.
      *                  *---------------------------------------------*
      *                  * Se richiesta per un solo codice : uscita    *
      *                  * senza alcuna azione                         *
      *                  *---------------------------------------------*
           if        rr-stt-min           =    rr-stt-max
                     go to ril-rec-tst-999.
       ril-rec-tst-520.
      *                  *---------------------------------------------*
      *                  * Se testatina gia' rilasciata : uscita senza *
      *                  * alcuna azione                               *
      *                  *---------------------------------------------*
           move      zero                 to   w-srt-buf-tst-inx      .
       ril-rec-tst-521.
           add       1                    to   w-srt-buf-tst-inx      .
           if        w-srt-buf-tst-inx    >    8192
                     go to ril-rec-tst-999.
           if        w-srt-buf-tst-inx    >    w-srt-buf-tst-num
                     go to ril-rec-tst-530.
           if        w-srt-buf-tst-cod
                    (w-srt-buf-tst-inx)   =    rf-dcf-cod-stt
                     go to ril-rec-tst-999.
           go to     ril-rec-tst-521.
       ril-rec-tst-530.
      *                  *---------------------------------------------*
      *                  * Memorizzazione codice ststistico            *
      *                  *---------------------------------------------*
           add       1                    to   w-srt-buf-tst-num      .
           move      rf-dcf-cod-stt       to   w-srt-buf-tst-cod
                                              (w-srt-buf-tst-num)     .
      *                  *---------------------------------------------*
      *                  * Lettura codice statistico                   *
      *                  *---------------------------------------------*
           move      03                   to   w-let-arc-yst-tip      .
           move      rf-dcf-cod-stt       to   w-let-arc-yst-cod      .
           perform   let-arc-yst-000      thru let-arc-yst-999        .
       ril-rec-tst-540.
      *                  *---------------------------------------------*
      *                  * Composizione record testatina               *
      *                  *---------------------------------------------*
           move      spaces               to   srt-rec                .
           move      rf-dcf-cod-stt       to   srt-cod-ord            .
           move      01                   to   srt-tip-rec            .
           move      spaces               to   srt-rag-key            .
           move      spaces               to   srt-dic-int            .
           move      all   "*"            to   srt-rag-soc            .
           move      w-let-arc-yst-des    to   srt-via-fnt            .
           move      all   "*"            to   srt-loc-fnt            .
       ril-rec-tst-550.
      *                  *---------------------------------------------*
      *                  * Rilascio record testatina                   *
      *                  *---------------------------------------------*
           release   srt-rec                                          .
       ril-rec-tst-550.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     ril-rec-tst-999.
       ril-rec-tst-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Start iniziale                     *
      *    *-----------------------------------------------------------*
       prn-str-ini-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-str-ini-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Messaggio per nessuna registraz.   *
      *    *-----------------------------------------------------------*
       prn-nes-ela-000.
           move      "WR"                 to   m-ope                  .
           move      "Nessuna etichetta da stampare entro i limiti asseg
      -              "nati !"             to   m-msg                  .
           call      "swd/mod/prg/obj/mmessg"
                                         using m                      .
       prn-nes-ela-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Lettura sequenziale                *
      *    *-----------------------------------------------------------*
       prn-let-seq-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
      *              *-------------------------------------------------*
      *              * Lettura sequenziale archivio sortato [srt]      *
      *              *-------------------------------------------------*
           return    srt    at end
                            move  "#"     to   w-cnt-prn-flg-sub
                            go to prn-let-seq-999.
       prn-let-seq-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Test se superamento limiti massimi *
      *    *-----------------------------------------------------------*
       prn-tst-max-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-tst-max-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Selezione su record letto          *
      *    *-----------------------------------------------------------*
       prn-sel-rec-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di uscita                  *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-sub      .
       prn-sel-rec-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Composizione area per rotture      *
      *    *-----------------------------------------------------------*
       prn-cmp-rot-000.
       prn-cmp-rot-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per inizio ciclo        *
      *    *-----------------------------------------------------------*
       prn-ini-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
      *              *-------------------------------------------------*
      *              * Normalizzazione numero colonna in corso di      *
      *              * trattamento                                     *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-eti-num-ccs      .
       prn-ini-cic-200.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di etichette    *
      *              *-------------------------------------------------*
           if        rr-tip-eti           =    01
                     perform  int-pag-001-000
                                          thru int-pag-001-999
           else if   rr-tip-eti           =    02
                     perform  int-pag-002-000
                                          thru int-pag-002-999
           else      perform  int-pag-001-000
                                          thru int-pag-001-999        .
       prn-ini-cic-300.
      *              *-------------------------------------------------*
      *              * Test sul flag di uscita                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-ini-cic-999.
       prn-ini-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Esecuzione per fine ciclo          *
      *    *-----------------------------------------------------------*
       prn-fin-cic-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-cic-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 5. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 5. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr5-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr5-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 4. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 4. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr4-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr4-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 3. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 3. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr3-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr3-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 2. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 2. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr2-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr2-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Inizio 1. livello di rottura       *
      *    *-----------------------------------------------------------*
       prn-ini-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-ini-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Fine 1. livello di rottura         *
      *    *-----------------------------------------------------------*
       prn-fin-lr1-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-fin-lr1-999.
           exit.

      *    *===========================================================*
      *    * Ciclo Report Program : Livello di dettaglio               *
      *    *-----------------------------------------------------------*
       prn-liv-det-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-liv-det-200.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione del tipo di etichette    *
      *              *-------------------------------------------------*
           if        rr-tip-eti           =    01
                     perform  prn-eti-001-000
                                          thru prn-eti-001-999
           else if   rr-tip-eti           =    02
                     perform  prn-eti-002-000
                                          thru prn-eti-002-999
           else      perform  prn-eti-001-000
                                          thru prn-eti-001-999        .
       prn-liv-det-300.
      *              *-------------------------------------------------*
      *              * Test sul flag di uscita                         *
      *              *-------------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-liv-det-999.
       prn-liv-det-999.
           exit.

      *    *===========================================================*
      *    * Stampa etichette di tipo 01                               *
      *    *-----------------------------------------------------------*
       prn-eti-001-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-eti-001-050.
      *              *-------------------------------------------------*
      *              * Stampa riga di dettaglio                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    9
                     go to prn-eti-001-100.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-001-000      thru int-pag-001-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-eti-001-999.
       prn-eti-001-100.
      *                  *---------------------------------------------*
      *                  * Numero etichette stampate nella pagina : +1 *
      *                  *---------------------------------------------*
           add       1                    to   w-cnt-eti-num-epc      .
      *                  *---------------------------------------------*
      *                  * Posizionamento fisso                        *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-cnt-eti-num-epc    to   p-lin                  .
           subtract  1                    from p-lin                  .
           multiply  9                    by   p-lin                  .
           add       3                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
      *                          *-------------------------------------*
      *                          * Nominativo interlocutore            *
      *                          *-------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      003                  to   p-pos                  .
           move      srt-dic-int          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Interlinea multipla                     *
      *                      *-----------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      2                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Ragione sociale                         *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      003                  to   p-pos                  .
           move      srt-rag-soc          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * 1 interlinea                            *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Indirizzo                               *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      003                  to   p-pos                  .
           move      srt-via-fnt          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * 1 interlinea                            *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Localita'                               *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      003                  to   p-pos                  .
           move      srt-loc-fnt          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-eti-001-800.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-eti-001-999.
       prn-eti-001-999.
           exit.

      *    *===========================================================*
      *    * Stampa etichette di tipo 53                               *
      *    *-----------------------------------------------------------*
       prn-eti-002-000.
      *              *-------------------------------------------------*
      *              * Normalizzazione flag di interruzione forzata    *
      *              *-------------------------------------------------*
           move      spaces               to   w-cnt-prn-flg-int      .
       prn-eti-002-050.
      *              *-------------------------------------------------*
      *              * Stampa riga di dettaglio                        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Test se righe residue sufficienti           *
      *                  *---------------------------------------------*
           if        p-res                >    9
                     go to prn-eti-002-100.
      *                  *---------------------------------------------*
      *                  * Reintestazione                              *
      *                  *---------------------------------------------*
           perform   int-pag-002-000      thru int-pag-002-999        .
           if        w-cnt-prn-flg-int    not  = spaces
                     go to prn-eti-002-999.
       prn-eti-002-100.
      *                  *---------------------------------------------*
      *                  * Numero etichette stampate nella pagina : +1 *
      *                  *---------------------------------------------*
           add       1                    to   w-cnt-eti-num-epc      .
      *                  *---------------------------------------------*
      *                  * Posizionamento fisso                        *
      *                  *---------------------------------------------*
           move      "VP"                 to   p-ope                  .
           move      w-cnt-eti-num-epc    to   p-lin                  .
           subtract  1                    from p-lin                  .
           multiply  9                    by   p-lin                  .
           add       3                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Determinazione del correttivo per la posi-  *
      *                  * zione di stampa                             *
      *                  *---------------------------------------------*
           if        w-cnt-eti-num-ccs    =    01
                     move  zero           to   w-cnt-eti-num-cps
           else if   w-cnt-eti-num-ccs    =    02
                     move  44             to   w-cnt-eti-num-cps
           else if   w-cnt-eti-num-ccs    =    03
                     move  88             to   w-cnt-eti-num-cps
           else      move  zero           to   w-cnt-eti-num-cps      .
      *                  *---------------------------------------------*
      *                  * Stampa                                      *
      *                  *---------------------------------------------*
      *                      *-----------------------------------------*
      *                      * Nominativo interlocutore                *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      003                  to   p-pos                  .
           add       w-cnt-eti-num-cps    to   p-pos                  .
           move      srt-dic-int          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Interlinea multipla                     *
      *                      *-----------------------------------------*
           move      "L+"                 to   p-ope                  .
           move      2                    to   p-lin                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Ragione sociale                         *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      003                  to   p-pos                  .
           add       w-cnt-eti-num-cps    to   p-pos                  .
           move      srt-rag-soc          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * 1 interlinea                            *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Indirizzo                               *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      003                  to   p-pos                  .
           add       w-cnt-eti-num-cps    to   p-pos                  .
           move      srt-via-fnt          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * 1 interlinea                            *
      *                      *-----------------------------------------*
           move      "LF"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                      *-----------------------------------------*
      *                      * Localita'                               *
      *                      *-----------------------------------------*
           move      "PF"                 to   p-ope                  .
           move      "A"                  to   p-tip                  .
           move      40                   to   p-car                  .
           move      p-lnr                to   p-lin                  .
           move      003                  to   p-pos                  .
           add       w-cnt-eti-num-cps    to   p-pos                  .
           move      srt-loc-fnt          to   p-alf                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       prn-eti-002-800.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     prn-eti-002-999.
       prn-eti-002-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio per etichette di tipo 01              *
      *    *-----------------------------------------------------------*
       int-pag-001-000.
      *              *-------------------------------------------------*
      *              * Intestazione standard                           *
      *              *-------------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                  *---------------------------------------------*
      *                  * Se uscita per interruzione forzata          *
      *                  *---------------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  int-pag-001-999.
      *              *-------------------------------------------------*
      *              * Numero etichette stampate nella pagina : zero   *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-eti-num-epc      .
      *              *-------------------------------------------------*
      *              * Numero colonna in corso di stampa : zero        *
      *              *-------------------------------------------------*
           move      zero                 to   w-cnt-eti-num-ccs      .
       int-pag-001-999.
           exit.

      *    *===========================================================*
      *    * Intestazione foglio per etichette di tipo 53              *
      *    *-----------------------------------------------------------*
       int-pag-002-000.
      *              *-------------------------------------------------*
      *              * Deviazione in funzione della colonna in corso   *
      *              * trattamento                                     *
      *              *-------------------------------------------------*
           add       1                    to   w-cnt-eti-num-ccs      .
           if        w-cnt-eti-num-ccs    >    3
                     move  zero           to   w-cnt-eti-num-ccs
                     go to int-pag-002-000.
           if        w-cnt-eti-num-ccs    =    1
                     go to int-pag-002-100
           else      go to int-pag-002-200.
       int-pag-002-100.
      *              *-------------------------------------------------*
      *              * Se prima colonna in corso di trattamento        *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Intestazione standard                       *
      *                  *---------------------------------------------*
           perform   int-pag-std-000      thru int-pag-std-999        .
      *                      *-----------------------------------------*
      *                      * Se uscita per interruzione forzata      *
      *                      *-----------------------------------------*
           if        w-cnt-prn-flg-int    not  = spaces
                     go to  int-pag-002-999.
      *                  *---------------------------------------------*
      *                  * Normalizzazione numero etichette stampate   *
      *                  * pagina                                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-cnt-eti-num-epc      .
      *                  *---------------------------------------------*
      *                  * Salvataggio di questa linea di stampa       *
      *                  *---------------------------------------------*
           move      "LS"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     int-pag-002-999.
       int-pag-002-200.
      *              *-------------------------------------------------*
      *              * Se colonne oltre la prima                       *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Ripristino linea salvata                    *
      *                  *---------------------------------------------*
           move      "LR"                 to   p-ope                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
      *                  *---------------------------------------------*
      *                  * Normalizzazione numero etichette stampate   *
      *                  * pagina                                      *
      *                  *---------------------------------------------*
           move      zero                 to   w-cnt-eti-num-epc      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     int-pag-002-999.
       int-pag-002-999.
           exit.

      *    *===========================================================*
      *    * Routine di lettura archivio [yst]                         *
      *    *-----------------------------------------------------------*
       let-arc-yst-000.
      *              *-------------------------------------------------*
      *              * Lettura per codice                              *
      *              *-------------------------------------------------*
           move      "RK"                 to   f-ope                  .
           move      "CODCLS    "         to   f-key                  .
           move      w-let-arc-yst-tip    to   rf-yst-tip-cls         .
           move      w-let-arc-yst-cod    to   rf-yst-cod-cls         .
           move      "pgm/dcf/fls/ioc/obj/iofyst"
                                          to   s-pat                  .
           call      "swd/mod/prg/obj/mfiltp"
                                         using s                      .
           call      s-pat               using f
                                               rf-yst                 .
      *              *-------------------------------------------------*
      *              * Deviazione secondo l'esito della lettura        *
      *              *-------------------------------------------------*
           if        f-sts                not  = e-not-err
                     go to let-arc-yst-400.
       let-arc-yst-200.
      *              *-------------------------------------------------*
      *              * Se record esistente                             *
      *              *-------------------------------------------------*
      *                  *---------------------------------------------*
      *                  * Memorizzazione descrizione                  *
      *                  *---------------------------------------------*
           move      rf-yst-des-cls       to   w-let-arc-yst-des      .
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-yst-999.
       let-arc-yst-400.
      *              *-------------------------------------------------*
      *              * Se record non esistente                         *
      *              *-------------------------------------------------*
       let-arc-yst-410.
      *                  *---------------------------------------------*
      *                  * Editing codice                              *
      *                  *---------------------------------------------*
           move      "ED"                 to   p-ope                  .
           move      "N"                  to   p-tip                  .
           move      05                   to   p-car                  .
           move      zero                 to   p-dec                  .
           move      spaces               to   p-sgn                  .
           move      "<"                  to   p-edm                  .
           move      w-let-arc-yst-cod    to   p-num                  .
           call      "swd/mod/prg/obj/mprint"
                                         using p                      .
       let-arc-yst-420.
      *                  *---------------------------------------------*
      *                  * Composizione stringa per ,non esistente     *
      *                  *---------------------------------------------*
           move      spaces               to   w-let-arc-yst-des      .
           if        w-let-arc-yst-tip    =    01
                     go to let-arc-yst-421
           else if   w-let-arc-yst-tip    =    02
                     go to let-arc-yst-422
           else if   w-let-arc-yst-tip    =    03
                     go to let-arc-yst-423.
       let-arc-yst-421.
           string    "ZONA "    delimited by   size
                     p-edt      delimited by   spaces
                                          into w-let-arc-yst-des      .
           go to     let-arc-yst-430.
       let-arc-yst-422.
           string    "CATEGORIA "
                                delimited by   size
                     p-edt      delimited by   spaces
                                          into w-let-arc-yst-des      .
           go to     let-arc-yst-430.
       let-arc-yst-423.
           string    "CODICE STAT. "
                                delimited by   size
                     p-edt      delimited by   spaces
                                          into w-let-arc-yst-des      .
           go to     let-arc-yst-430.
       let-arc-yst-430.
      *                  *---------------------------------------------*
      *                  * Uscita                                      *
      *                  *---------------------------------------------*
           go to     let-arc-yst-999.
       let-arc-yst-999.
           exit.

      *    *===========================================================*
      *    * Subroutines per determinazione contatti                   *
      *    *-----------------------------------------------------------*
           copy      "pgm/azi/prg/cpy/dconarc0.dts"                   .

